[{"Id":"2433","PostTypeId":"1","AcceptedAnswerId":"2434","CreationDate":"2015-04-07T15:11:43.260","Score":"4","ViewCount":"40","Body":"<p>I recently flagged 19 comments as too chatty or obsolete and have had all of them declined.</p>\n\n<p>The comments were of the following nature:</p>\n\n<ul>\n<li><blockquote>+1 for the explanation.</blockquote></li>\n<li><blockquote>I guess you mean the shift key? Also, link-only answers are not very helpful if the link ever stops working!<br>\n@LarsEbert OMG what a spell error :)<br>\nMuch better now +1</blockquote></li>\n<li><blockquote>Thank you, finally the problem is solved.<br>\n+1. Excellent answer!</blockquote></li>\n</ul>\n\n<p>Why were these comment flags declined? The comments are completely superfluous and as comments are ephemeral why should these comments not be removed?</p>\n\n<p>My post flag accuracy is over 98% with almost 1500 flags, but my comment flag accuracy is only 35% with only 80 flags.</p>\n\n<p>Why are my comment flags declined? At one point, I had a few flags declined for comments on the same post, which were then removed anyway later.</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2015-04-07T15:16:58.863","LastActivityDate":"2015-04-07T15:35:17.043","Title":"Why are my comment flags declined?","Tags":"<discussion><flagging><comments>","AnswerCount":"1","CommentCount":"0"},{"Id":"2434","PostTypeId":"2","ParentId":"2433","CreationDate":"2015-04-07T15:35:17.043","Score":"2","Body":"<p>Primarily because I didn't pay attention and hit the \"dismiss\" link instead of the \"delete\" link. Sorry about that.</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-04-07T15:35:17.043","CommentCount":"2"},{"Id":"2435","PostTypeId":"1","AcceptedAnswerId":"2437","CreationDate":"2015-04-08T07:25:04.717","Score":"11","ViewCount":"118","Body":"<p>There seems to be a lot of these around at the moment; questions on cheats/hacks for Clash of Clans, but without ever mentioning that name directly.</p>\n\n<p>I'm seeing them across all the SE sites I visit.</p>\n\n<p>It's kind of spam with no visible purpose. It contains no link, just some vague waffle requesting how to cheat in some way or other</p>\n\n<p>e.g.  <a href=\"https://apple.stackexchange.com/questions/179988/clash-of-stone-cheat\">https://apple.stackexchange.com/questions/179988/clash-of-stone-cheat</a></p>\n\n<p>They are usually tagged with something irrelevant too.</p>\n\n<p>Do we flag as Spam or just vote to close as off-topic?<br>\nI understand being flagged as spam affects the poster in some greater way than just having their question closed as off-topic, so I wanted some kind of quorum on how to treat these.</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-04-08T15:31:51.560","Title":"Flag these as Spam?","Tags":"<discussion><flagging><spam>","AnswerCount":"1","CommentCount":"1"},{"Id":"2436","PostTypeId":"2","ParentId":"2426","CreationDate":"2015-04-08T15:27:20.403","Score":"3","Body":"<p>I've added a close reason and linked it to the \"How to ask a good question\" article in the help center. It needs a second moderator to review the wording and approve the change.</p>\n\n<p>The intention is not to broadly rule all hardware recommendations off topic. They are valuable when they are phrased to include:</p>\n\n<ul>\n<li>research shown</li>\n<li>intent to learn how to shop or measure or decide or understand</li>\n<li>not simply looking for someone to do the work for the OP</li>\n<li>broadly applicable (if possible)</li>\n</ul>\n\n<p>If there is confusion how to use this, I'll gladly respond to a meta post with example questions that are bad and should be closed for this reason as well as example questions of good examples that should not be closed. I think the close voters are already voting this way and the link to the FAQ will help people with legitimate but lazily worded questions get their intent edited into the post so we can reopen them with a minimum discussion, delay and fuss.</p>\n\n<p>I specifically like <a href=\"https://meta.stackoverflow.com/questions/254393/\">these descriptions from the main meta</a>:</p>\n\n<ul>\n<li><p>\"Recommendation question\" is shorthand for \"you didn't describe a problem, you just asked for a list of things.\"</p></li>\n<li><p>First, let's be clear: all questions are recommendation questions. You describe a problem, folks recommend solutions: potential fixes for a bug, possible algorithms, libraries, work-arounds, etc. - So when folks talk about \"recommendation questions\", they're actually talking about <strong>questions where it's difficult or impossible to know</strong> - as the answerer or a reader - <strong>whether one answer provides a better solution than another</strong></p></li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-17T10:37:54.523","LastActivityDate":"2015-04-08T15:33:43.473","CommentCount":"2"},{"Id":"2437","PostTypeId":"2","ParentId":"2435","CreationDate":"2015-04-08T15:31:38.833","Score":"12","Body":"<p>It's still spam and should be flagged as spam.</p>\n\n<p>I've seen this occur before elsewhere in Stack Exchange. They're testing the system of sorts, by posting content that is spam and contains SEO text but without links to the spam, either to later answer with spam that contains spam links, or to test if their spam ‘gets past’ without any links such that links could be added later either through answers or editing.</p>\n","OwnerUserId":"37797","LastActivityDate":"2015-04-08T15:31:38.833","CommentCount":"0"},{"Id":"2438","PostTypeId":"2","ParentId":"2374","CreationDate":"2015-04-09T20:34:18.657","Score":"2","Body":"<p>Jin - please see if the line spacing can be harmonized on this post (and those like it). I think the edit icon introduced a gap in the last line.</p>\n\n<p><a href=\"https://apple.stackexchange.com/a/180232/5472\">https://apple.stackexchange.com/a/180232/5472</a></p>\n\n<p><img src=\"https://i.stack.imgur.com/ddnZM.png\" alt=\"enter image description here\"></p>\n\n<p>Safari Version 8.0.5 (10600.5.17) - Retina MBP in closed clamshell mode to cinema display (non retina / non big-k)</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-04-09T20:34:18.657","CommentCount":"3"},{"Id":"2439","PostTypeId":"1","CreationDate":"2015-04-10T15:19:23.247","Score":"0","ViewCount":"27","Body":"<p>For those of you who are able to reply, thank you for your help. I can't vote you up on here for some reason but I appreciate you.</p>\n","OwnerUserId":"105227","OwnerDisplayName":"Judy Kay Crihfield Wilson","LastEditorUserId":"5472","LastEditDate":"2015-04-10T15:27:34.203","LastActivityDate":"2015-04-10T15:27:34.203","Title":"Answered Questions that help Instructors","Tags":"<discussion><support>","AnswerCount":"1","CommentCount":"1"},{"Id":"2440","PostTypeId":"2","ParentId":"2439","CreationDate":"2015-04-10T15:27:23.217","Score":"3","Body":"<p>You can't comment or vote in a way that grants reputation since your account doesn't have that privilege yet.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/help/whats-reputation\">https://apple.stackexchange.com/help/whats-reputation</a></li>\n<li><a href=\"https://apple.stackexchange.com/tour\">https://apple.stackexchange.com/tour</a></li>\n</ul>\n\n<p>Why not look over the help section and tour. Also, your votes still help the site, so be sure to vote up good posts - it doesn't give reputation directly but the system does promote posts with high anonymous positive votes when it decides how to render pages.</p>\n\n<p>Welcome to the site and I hope you can find things to answer / ask and do real voting and building of knowledge for all about Apple products.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-04-10T15:27:23.217","CommentCount":"0"},{"Id":"2442","PostTypeId":"2","ParentId":"963","CreationDate":"2015-04-21T22:41:01.863","Score":"2","Body":"<p>So... nothing quite like a site design refresh 3+ years later to fix outstanding issues... :)</p>\n\n<p><img src=\"https://i.stack.imgur.com/B1Uzv.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"17358","LastActivityDate":"2015-04-21T22:41:01.863","CommentCount":"0"},{"Id":"2443","PostTypeId":"1","AcceptedAnswerId":"2444","CreationDate":"2015-04-24T10:30:52.697","Score":"8","ViewCount":"40","Body":"<p>Recently, I found a user that had a reputation under 50, so he couldn't comment. Instead, he put the comment into an answer, which people shouldn't do. I flagged the answer. After I rechecked, one of the admins or moderators deleted the \"answer\" and put it into a comment which had the author as the person under 50 reputation. Did a moderator do that? Can moderators do it? Or was it some community admin?</p>\n","OwnerUserId":"121023","LastEditorUserId":"37797","LastEditDate":"2015-04-24T16:52:07.413","LastActivityDate":"2015-04-24T16:52:07.413","Title":"Was a user who posted a comment as answer assisted in commenting by a moderator?","Tags":"<support><comments><moderation>","AnswerCount":"1","CommentCount":"4"},{"Id":"2444","PostTypeId":"2","ParentId":"2443","CreationDate":"2015-04-24T10:34:29.107","Score":"6","Body":"<p>Yes, moderators can change an answer into a comment and attach it to the question (or any other answer) within the same question thread. Usually we use this exactly in the situation you mention (low rep user asking a clarification question).</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-04-24T10:34:29.107","CommentCount":"1"},{"Id":"2445","PostTypeId":"1","AcceptedAnswerId":"2482","CreationDate":"2015-04-26T17:34:59.660","Score":"0","ViewCount":"28","Body":"<p>Can someone explain to me the discrepancy of the displayed number to be reviewed in the top bar and the sum of the actual review tasks to be completed?</p>\n\n<p><img src=\"https://i.stack.imgur.com/F8tp4.jpg\" alt=\"/review\"></p>\n\n<p>The top bar icon shows 4 but when I go to /review, I only find 1.</p>\n","OwnerUserId":"46541","LastEditorUserId":"37797","LastEditDate":"2015-04-26T20:57:51.507","LastActivityDate":"2015-05-13T18:00:26.180","Title":"Top bar shows more review tasks to be completed than the sum of tasks at /review","Tags":"<support><review-page>","AnswerCount":"2","CommentCount":"0"},{"Id":"2446","PostTypeId":"2","ParentId":"2445","CreationDate":"2015-04-26T20:56:48.987","Score":"1","Body":"<p>There are many reasons why this may occur.</p>\n\n<ul>\n<li>If you've handled a post outside of a queue yourself, then you won't be able to handle it inside a queue.</li>\n<li>If you've handled a post in a queue that requires someone else (or multiple other people) to handle it too, then you won't see the review task any more but it'll be shown in the count in the top bar, for other users.</li>\n<li>For users with &lt;5k, tag wiki suggested edits count towards the number in the top bar but won't be shown to you.</li>\n</ul>\n","OwnerUserId":"37797","LastActivityDate":"2015-04-26T20:56:48.987","CommentCount":"4"},{"Id":"2447","PostTypeId":"1","AcceptedAnswerId":"2448","CreationDate":"2015-04-26T21:45:37.953","Score":"9","ViewCount":"74","Body":"<p>Every once in a while I see a question along the lines of:</p>\n\n<blockquote>\n  <p>My iPhone got run over by a train, then my friend threw the pieces in a thermite fire, and the ashes were accidentally encased in concrete then shot directly into the sun. What do I do?? Help!!!</p>\n</blockquote>\n\n<p>Where the immediately obvious only answer is \"So... go buy a new one\" or (not in the case of the above example, of course) \"Well I guess you better take it to a repair center\". I can't imagine what kind of results an asker would expect by asking such a question online, other than sympathy.</p>\n\n<p>What is the standard practice around here for questions like this? Ignore them? Down vote? Flag / close (what reason)? Comment? Answer? I don't spend a lot of time on this site and I'm not sure how you guys like to treat these types of questions, or if they're even a problem. To me, it doesn't seem like they belong.</p>\n","OwnerUserId":"99938","LastEditorUserId":"5472","LastEditDate":"2015-05-07T14:56:48.983","LastActivityDate":"2015-05-07T14:56:48.983","Title":"What to do with questions where repair/replacement is obviously the only answer?","Tags":"<discussion><questions><close-reasons>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"0"},{"Id":"2448","PostTypeId":"2","ParentId":"2447","CreationDate":"2015-04-26T22:14:54.680","Score":"6","Body":"<p>Flag to close would be my preference for dealing with these types of questions. For a reason you can say, \"Unclear what you're asking\" because, really, what <em>are</em> they asking for here? A repair center? Condolences? A mocking?</p>\n","OwnerUserId":"292","LastActivityDate":"2015-04-26T22:14:54.680","CommentCount":"4"},{"Id":"2449","PostTypeId":"1","AcceptedAnswerId":"2450","CreationDate":"2015-04-27T08:45:42.687","Score":"4","ViewCount":"29","Body":"<p>Let's say that for instance I have a series of very short questions with an average of 5-10 words each. Do I normally ask a question for every? Or can I ask small questions in one question? Or should I perhaps ask little questions in comments on a question with relevance to the short question I ask in the comments?</p>\n","OwnerUserId":"121023","LastEditorUserId":"37797","LastEditDate":"2015-04-27T15:00:48.520","LastActivityDate":"2015-04-27T15:51:16.557","Title":"What do I do if I have a series of smaller questions?","Tags":"<support><questions><asking-questions>","AnswerCount":"2","CommentCount":"0"},{"Id":"2450","PostTypeId":"2","ParentId":"2449","CreationDate":"2015-04-27T15:00:09.463","Score":"2","Body":"<p>I doubt very much that an entire question can be sufficiently detailed in 5 to 10 words. Make sure you describe the question fully and accurately, describing exactly what the problem is and what you wish the intended outcome to be. Feel free to ask for help with describing a specific problem on meta or in chat before asking the question.</p>\n\n<p>Speaking of chat, if your question is informal and brief, and an answer would also be so, it might be good to ask in chat.</p>\n\n<p>Questions which ask too many questions in a single question will be closed as too broad or edited to remove extra questions. You should always have one question per each question as this allows for searching and comprehension whereby each answer answers the entire question fully, rather than one answer answering half of a question and another answering the other half.</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2015-04-27T15:44:07.667","LastActivityDate":"2015-04-27T15:44:07.667","CommentCount":"0"},{"Id":"2451","PostTypeId":"2","ParentId":"2449","CreationDate":"2015-04-27T15:51:16.557","Score":"3","Body":"<p>Great question - Lets pick apart just one of the short questions. Some short questions are so clear and so useful that they work excellently. Could you ask a second question here on meta with the exact wording of one of these \"short questions\" if my general help below isn't useful to your needs.</p>\n\n<p>Most often, questions that short need to be put on hold for details to be added.  Look at the [help] center and specifically <a href=\"https://apple.stackexchange.com/help/how-to-ask\">How to ask</a> for detailed guidance on what makes a good question and why 5 word ones usually fail to show enough research and detail to be good as a class.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-04-27T15:51:16.557","CommentCount":"1"},{"Id":"2452","PostTypeId":"1","CreationDate":"2015-04-28T13:42:25.237","Score":"1","ViewCount":"41","Body":"<p>I found a solution to <a href=\"https://apple.stackexchange.com/questions/55243/the-headphone-jack-on-my-macbook-pro-just-stopped-working-how-do-i-fix-it\">a question on this site</a> that no one had provided my answer for and I wanted to share it with the world.  I cannot figure out how to answer a question.  Commenting takes \"Reputation\".  How do I do this?  I love this site idea but I am very frustrated right now.</p>\n","OwnerUserId":"123843","OwnerDisplayName":"Aaron Trimble","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-04-28T14:36:26.077","Title":"How do I answer questions on this site?","Tags":"<discussion><support>","AnswerCount":"2","CommentCount":"1"},{"Id":"2453","PostTypeId":"2","ParentId":"2452","CreationDate":"2015-04-28T13:50:55.220","Score":"-1","Body":"<p>You can answer the vast majority of site questions without earning 10 reputation on a specific site. An association bonus of 100 doesn't count in the few questions that are \"protected\".</p>\n\n<p>Anyone with 10 rep (association or earned otherwise can comment on anyone's questions or answers. </p>\n\n<p>See the <a href=\"https://apple.stackexchange.com/help/\">help</a> and especially the <a href=\"https://apple.stackexchange.com/help/answering\">section on how to answer</a> for more guidance.</p>\n","OwnerUserId":"33140","OwnerDisplayName":"Jozef Legény","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-04-28T14:35:38.533","CommentCount":"3"},{"Id":"2454","PostTypeId":"2","ParentId":"2452","CreationDate":"2015-04-28T14:26:35.800","Score":"4","Body":"<p>The question you've mentioned (<a href=\"https://apple.stackexchange.com/questions/55243/the-headphone-jack-on-my-macbook-pro-just-stopped-working-how-do-i-fix-it\">The headphone jack on my MacBook Pro just stopped working. How do I fix it?</a>) got protected automatically by the system because it attracted a lot of off-topic answers in the past (which got deleted so you can't see them). I've removed the protection and am looking forward to see your answer.</p>\n\n<ul>\n<li>To get some details about protected questions, see <a href=\"https://apple.stackexchange.com/help/privileges/protect-questions\">https://apple.stackexchange.com/help/privileges/protect-questions</a>.</li>\n<li>To learn about reputation (points), see <a href=\"https://apple.stackexchange.com/help/whats-reputation\">https://apple.stackexchange.com/help/whats-reputation</a></li>\n<li>To learn more about how this (and all other StackExchange) sites work, see <a href=\"https://apple.stackexchange.com/help\">https://apple.stackexchange.com/help</a></li>\n</ul>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-04-28T14:26:35.800","CommentCount":"0"},{"Id":"2455","PostTypeId":"1","CreationDate":"2015-04-29T15:45:31.783","Score":"-3","ViewCount":"32","Body":"<p>All of the newest questions in the <a href=\"https://apple.stackexchange.com/questions/tagged/photos\" class=\"post-tag\" title=\"show questions tagged &#39;photos&#39;\" rel=\"tag\">photos</a> tag refer to the new Apple Photos application. <a href=\"https://apple.stackexchange.com/questions/tagged/photos.app\" class=\"post-tag\" title=\"show questions tagged &#39;photos.app&#39;\" rel=\"tag\">photos.app</a> refers to the same thing. Could someone with enough reputation please make <a href=\"https://apple.stackexchange.com/questions/tagged/photos.app\" class=\"post-tag\" title=\"show questions tagged &#39;photos.app&#39;\" rel=\"tag\">photos.app</a> be a synonym of <a href=\"https://apple.stackexchange.com/questions/tagged/photos\" class=\"post-tag\" title=\"show questions tagged &#39;photos&#39;\" rel=\"tag\">photos</a> to group these together?</p>\n\n<p>Admittedly, some older <a href=\"https://apple.stackexchange.com/questions/tagged/photos\" class=\"post-tag\" title=\"show questions tagged &#39;photos&#39;\" rel=\"tag\">photos</a> threads are about Aperture or iPhoto, but Apple is the one to have introduced the confusing naming, and Apple Photos does represent the successor application.</p>\n","OwnerUserId":"72357","LastEditorUserId":"37797","LastEditDate":"2015-04-29T19:26:07.800","LastActivityDate":"2015-04-29T19:26:51.247","Title":"Synonym for photos.app to photos","Tags":"<feature-request><tags>","AnswerCount":"2","CommentCount":"0"},{"Id":"2456","PostTypeId":"2","ParentId":"2455","CreationDate":"2015-04-29T16:02:51.323","Score":"3","Body":"<p>From the <a href=\"https://apple.stackexchange.com/tags\">tags page</a>:</p>\n\n<blockquote>\n  <p><strong>photos</strong> x 590</p>\n  \n  <p>Photographs and photography</p>\n</blockquote>\n\n<p>And:</p>\n\n<blockquote>\n  <p><strong>photos.app</strong> x 81</p>\n  \n  <p>The Apple photo manager and editor and successor to iPhoto and Aperture. Introduced in 2015.</p>\n</blockquote>\n\n<p>Making <strong>photos</strong> a synonym of <strong>photos.app</strong> has the potential to mis-tag 590 questions now. Questions that pre-date the existence of the Photos app from Apple and have nothing to do with the tool.</p>\n\n<p>Our convention has been to use <code>.app</code> on tags to denote the Apple product with the noun.</p>\n\n<p>Violating this convention in this particular case does not, in my opinion, sound like a good idea.</p>\n","OwnerUserId":"292","LastActivityDate":"2015-04-29T16:02:51.323","CommentCount":"5"},{"Id":"2457","PostTypeId":"2","ParentId":"2455","CreationDate":"2015-04-29T18:06:54.540","Score":"1","Body":"<p>Based on Ian C.'s response:</p>\n\n<p>Would it be possible to rename <a href=\"https://apple.stackexchange.com/questions/tagged/photos\" class=\"post-tag\" title=\"show questions tagged &#39;photos&#39;\" rel=\"tag\">photos</a> to <a href=\"https://apple.stackexchange.com/questions/tagged/photography\" class=\"post-tag\" title=\"show questions tagged &#39;photography&#39;\" rel=\"tag\">photography</a> and then create a new <a href=\"https://apple.stackexchange.com/questions/tagged/photos\" class=\"post-tag\" title=\"show questions tagged &#39;photos&#39;\" rel=\"tag\">photos</a> tag that was a synonym to <a href=\"https://apple.stackexchange.com/questions/tagged/photos.app\" class=\"post-tag\" title=\"show questions tagged &#39;photos.app&#39;\" rel=\"tag\">photos.app</a>? That would:</p>\n\n<ol>\n<li>Continue the convention of using '.app' for Apple products.</li>\n<li>Maintain existing and future photography-related questions with their own tag, that does not conflict with the name of a (new) Apple product.</li>\n<li>Enable most new contributors who are likely to just enter <a href=\"https://apple.stackexchange.com/questions/tagged/photos\" class=\"post-tag\" title=\"show questions tagged &#39;photos&#39;\" rel=\"tag\">photos</a> to (via a synonym) get their questions tagged correctly.</li>\n</ol>\n","OwnerUserId":"72357","LastEditorUserId":"37797","LastEditDate":"2015-04-29T19:26:51.247","LastActivityDate":"2015-04-29T19:26:51.247","CommentCount":"1"},{"Id":"2458","PostTypeId":"1","CreationDate":"2015-04-30T09:56:16.607","Score":"2","ViewCount":"20","Body":"<p>Should we make this <a href=\"https://apple.stackexchange.com/questions/24145/is-there-any-free-paid-windows-emulator-for-mac-os-x\">question</a> into a canonical Windows question.</p>\n\n<p>Either by putting each piece of software into an answer </p>\n\n<p>or at least splitting the emulators (Virtual Box, Parallels and Fusion) native (Bootcamp) and Wine(Wine, Crossover, Wineskin etc) into separate answers with a more detailed explanation </p>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-04-30T09:56:16.607","Title":"Canonical Windows emulation question","Tags":"<discussion><canonical-questions>","AnswerCount":"0","CommentCount":"0"},{"Id":"2459","PostTypeId":"1","CreationDate":"2015-05-02T09:51:55.233","Score":"-6","ViewCount":"45","Body":"<p>It kind of unfair to HAVE to require 125 rep to vote down. </p>\n\n<p>Can this be 10 to vote up and vote down?</p>\n","OwnerUserId":"124002","LastEditorUserId":"5472","LastEditDate":"2015-05-02T18:39:21.260","LastActivityDate":"2015-05-02T18:39:21.260","Title":"Can the privilege of down voting be reduced from 125 to 10?","Tags":"<discussion><feature-request>","AnswerCount":"1","CommentCount":"2","FavoriteCount":"1"},{"Id":"2460","PostTypeId":"2","ParentId":"2459","CreationDate":"2015-05-02T11:32:40.867","Score":"4","Body":"<p>I wouldn't call it unfair, it's just one of the rules valid on all StackExchange sites. One of the reasons that users are required to have at least some reputation before voting is to actually increase the quality of the votes (and to prevent spammers from creating a bunch of accounts and voting each other up).</p>\n\n<p>If you look at <a href=\"https://apple.stackexchange.com/help/whats-reputation\">https://apple.stackexchange.com/help/whats-reputation</a>, getting to 15 reputation isn't all that hard (either post a good answer to one of the questions or invest some time to improve 8 posts by editing them). </p>\n\n<hr>\n\n<p>For much more information on the topic, see <a href=\"https://meta.stackexchange.com/questions/188611/how-does-a-new-user-begin-using-stack-overflow-stack-exchange\">this post</a> on meta.stackexchange.com.</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-05-02T15:53:41.220","CommentCount":"2"},{"Id":"2461","PostTypeId":"1","AcceptedAnswerId":"2462","CreationDate":"2015-05-07T09:54:38.083","Score":"1","ViewCount":"26","Body":"<p>I recently accidentally down-voted an answer without realising (think it was because of a miss click when scrolling on the iOS app). The only issue is I cannot remove that down-vote now because of this error.</p>\n\n<p><img src=\"https://i.stack.imgur.com/JDmME.png\" alt=\"enter image description here\"></p>\n\n<p>Would any mod/admin be kind enough to remove it (and give my back my 1 reputation) please?</p>\n\n<p>Thanks for your help and any inconvenience I have caused.</p>\n\n<p>The link to the post I down-voted is here: <a href=\"https://apple.stackexchange.com/questions/102271/cannot-access-vital-boot-options-on-mac-pro-with-os-x-lion/127955#127955\">Cannot access vital boot options on Mac Pro with OS X Lion</a> (it scrolls to the answer)</p>\n","OwnerUserId":"112840","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-05-07T10:21:33.580","Title":"How can I remove my down-vote I made by mistake","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2462","PostTypeId":"2","ParentId":"2461","CreationDate":"2015-05-07T10:21:33.580","Score":"3","Body":"<p>I've edited the question slighly, you should be able to undo your vote now.</p>\n\n<p>OTOH, down voting that answer isn't totally unjustified...</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-05-07T10:21:33.580","CommentCount":"3"},{"Id":"2463","PostTypeId":"2","ParentId":"2447","CreationDate":"2015-05-07T14:55:32.707","Score":"3","Body":"<p>I'm with Ian - down vote and then vote to close questions that are looking for an off-site resource without documenting the proper research the site asks for:</p>\n\n<ul>\n<li><p>Consider helping us help you. Take a pass at editing this after you've read the <a href=\"https://apple.stackexchange.com/help/how-to-ask\">help guide</a> on how to be specific and show how your research didn't help you solve this dilemma. </p></li>\n<li><p>\"Questions asking to <a href=\"https://meta.stackoverflow.com/questions/254393/\">recommend or find a Mac, book, tool, tutorial or other off-site resource</a> are off-topic for Ask Different as they tend to attract opinionated answers and spam. Instead, edit this question to <a href=\"https://apple.stackexchange.com/help/how-to-ask\">describe the problem and what research has been done</a> so far to solve it.\" – bmike</p></li>\n</ul>\n\n<p>Also - keep in mind that <strong>\"they don't belong\"</strong> should always be enforced ruthlessly only on questions that don't clearly demonstrate some effort to be useful. We want to <strong>include everyone</strong>, even if they are struggling to learn the ropes - so <strong><em>be gracious and helpful to people, critical and clear about specific posts</em></strong> when you can call out specifically what's wrong with them and link to resources anyone can use to fix the poor posts.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-05-07T14:55:32.707","CommentCount":"0"},{"Id":"2464","PostTypeId":"1","CreationDate":"2015-05-08T15:35:42.983","Score":"5","ViewCount":"22","Body":"<p>I've closed a few questions as dupes to link questions about:</p>\n\n<ul>\n<li>Transferring iTunes store credit between accounts in general</li>\n<li>Disposing of iTunes store credit to allow region / currency changes</li>\n</ul>\n\n<p><a href=\"https://apple.stackexchange.com/questions/9317/\">Can I transfer iTunes credit between accounts?</a><br>\n<a href=\"https://apple.stackexchange.com/questions/44794/\">Changing my iTunes account details</a><br>\n<a href=\"https://apple.stackexchange.com/questions/79461/\">Does iTunes balance transfers when you change country?</a><br>\n<a href=\"https://apple.stackexchange.com/questions/79539/\">How can I change iTunes country of region when having some credit in my account?</a><br>\n<a href=\"https://apple.stackexchange.com/questions/101511/\">Use of iTunes gift card credit</a><br>\n<a href=\"https://apple.stackexchange.com/questions/110590/\">How to solve international credit card issues?</a><br>\n<a href=\"https://apple.stackexchange.com/questions/161754/\">https://apple.stackexchange.com/questions/161754/</a><br>\n<a href=\"https://apple.stackexchange.com/questions/164411/\">Transfering between itunes accounts, different geographical locations</a><br>\n<a href=\"https://apple.stackexchange.com/questions/176681/\">How do I change iTunes country with family sharing and child accounts?</a><br>\n<a href=\"https://apple.stackexchange.com/questions/186272/\">Use up the store credit</a>  </p>\n\n<p>There's a lot of good information and legitimate criticism of Apple for making this hard/unclear and lacking a support mechanism other than filling out a web form. On the flip side, it's hard to understand how this happens if you didn't sign up for the wrong region intentionally and/or falsify your account details at some point. Also, walking away from less than $1 is hard to complain about - even privately - when you can find some game to zero out your store credit in the majority of the cases.</p>\n\n<p>I'd like some extra eyes and criticism if my closes need to be adjusted and/or some questions really merged to get all the correct answers easily searchable. Since merging questions is something moderators cannot undo, I'd rather be sure we have good chains of close before taking that step.</p>\n\n<p>Once this is sorted, we can enter the remaining questions as <a href=\"https://apple.meta.stackexchange.com/questions/2418/where-is-the-list-of-canonical-questions-stored-for-ask-different\">canonical ones for the site</a>.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-05-08T18:00:50.337","Title":"Can someone help with sorting / merging questions about transferring iTunes store balances?","Tags":"<discussion><closed-questions><canonical-questions>","AnswerCount":"0","CommentCount":"1"},{"Id":"2465","PostTypeId":"1","CreationDate":"2015-05-08T18:27:17.510","Score":"0","ViewCount":"11","Body":"<p>Appropriate to ask for advice on upgrading on this site?</p>\n\n<p>For instance, if a user says \"I have this computer was set up a, and $500 to spend, what are the best upgrades to spend my money on?\", will this be allowed?</p>\n","OwnerUserId":"125714","LastActivityDate":"2015-05-08T20:04:19.947","Title":"Upgrade related questions appropriate?","Tags":"<discussion><questions><asking-questions>","AnswerCount":"1","CommentCount":"1"},{"Id":"2466","PostTypeId":"2","ParentId":"2465","CreationDate":"2015-05-08T20:04:19.947","Score":"1","Body":"<p>I'm going to go with \"no\" here -- it's a shopping question as you phrased it. Any recommendations that involve spending money are highly time-limited.</p>\n\n<p>If you remove the dollars and simply ask:</p>\n\n<blockquote>\n  <p>If I was going to upgrade my computer, in what order should I upgrade components to get the most performance for my money?</p>\n</blockquote>\n\n<p>That would be slightly less contentious question and probably one I wouldn't vote to close as it will stay true much longer than a I-have-dollars-to-spend question.</p>\n","OwnerUserId":"292","LastActivityDate":"2015-05-08T20:04:19.947","CommentCount":"2"},{"Id":"2467","PostTypeId":"1","AcceptedAnswerId":"2468","CreationDate":"2015-05-08T21:50:20.683","Score":"1","ViewCount":"18","Body":"<p>Case in point…<br>\n[even if I was looking at a Super User question &amp; the terms I was starting from are very generic, it felt best to ask in Ask Different, as my 'home' community]  </p>\n\n<p><a href=\"https://superuser.com/questions/912499/why-does-my-screensaver-say-mynames-macbook-pro-4\">Why does my screensaver say [myname]'s Macbook Pro (4)</a> </p>\n\n<p>I was trying to start with a broad search for issues where the Mac name increments by number…</p>\n\n<p>Not being sure where to start I went for <code>(2)</code> as a start point, hoping to hone it later…<br>\nUnfortunately, results coming in were 'anything including a <code>2</code>'</p>\n\n<p>I'm no expert in grep or anything like that, but I'm not bad at honing down Google searches, by keyword, site: etc.</p>\n\n<p>Does SE have any 'honing tools' for this type of broad start point?<br>\nThings like AND, OR, \"full-string\" etc?</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:04:26.767","LastActivityDate":"2015-05-09T16:44:02.487","Title":"Can SE Search be 'honed'?","Tags":"<discussion><support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2468","PostTypeId":"2","ParentId":"2467","CreationDate":"2015-05-09T16:44:02.487","Score":"1","Body":"<p>There's a full guide to searching at <a href=\"https://apple.stackexchange.com/help/searching\">/help/searching</a>.</p>\n\n<p>Exact match searches are accomplished by enclosing the string in <code>\"</code>. Punctuation is excluded from search strings, even when using exact match.</p>\n\n<p>If all else fails, you can always search using Google with the <code>site:apple.stackexchange.com</code> parameter.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-05-09T16:44:02.487","CommentCount":"1"},{"Id":"2469","PostTypeId":"1","CreationDate":"2015-05-10T18:46:11.170","Score":"3","ViewCount":"71","Body":"<p>Questions that highlight shortcomings or flaws in Apple's products, especially recently as the usability and performance of Apple's software has declined, are often down-voted or voted closed, suggesting that Ask Different is not the place to ask such questions.</p>\n\n<p>Is there an appropriate place to ask them?</p>\n","OwnerUserId":"4395","LastActivityDate":"2015-05-13T01:19:30.447","Title":"Where should questions that point out flaws of shortcomings of Apple products be posted?","Tags":"<discussion><support>","AnswerCount":"2","CommentCount":"6"},{"Id":"2470","PostTypeId":"2","ParentId":"2469","CreationDate":"2015-05-10T19:25:58.570","Score":"5","Body":"<p>I feel Ask Different is an excellent place to criticize Apple (or any other company) as long as you follow the rules for asking a good question. The <a href=\"https://apple.stackexchange.com/help/how-to-ask\">How to Ask portion of the help guide</a> explains how to research your issue, document that research and relate it to a practical problem you face.</p>\n\n<p>For example, if your post asks basically for opinions why Apple did X - it should be closed.</p>\n\n<p>If your post asks \"How do I do X given that here is how things work and this is the documentation on how it works and it's preventing me from doing Y\" then it belongs and also deserves lots of votes up.</p>\n\n<p>Also, keep in mind that <a href=\"https://apple.stackexchange.com/help/on-topic\">things like hardware shopping, code level programming and general whining are off topic</a>. Specific whining is on-topic as long as the rest of the quality guidelines for the question are met successfully and it's <a href=\"https://apple.stackexchange.com/help/be-nice\">polite and not rude, abusive, or otherwise inappropriate</a> </p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-05-10T19:32:13.330","CommentCount":"11"},{"Id":"2471","PostTypeId":"1","AcceptedAnswerId":"2472","CreationDate":"2015-05-11T07:20:56.583","Score":"1","ViewCount":"35","Body":"<p>I have read about the community user. It is a bot that pulls old questions out, does site chores, owns unregistered users questions, protects when questions attract \"me too!\" answers.</p>\n\n<p>But the profile page doesn't mention anything about approving and rejecting edits. How does that work? Does a bot do that, or is it a person? How does it know if it is a good edit or not?</p>\n\n<p><a href=\"https://apple.meta.stackexchange.com/questions/1611/community-accepted-crappy-suggested-edit\">Here</a> is a similar question, though the answer is not really what I wanted. </p>\n","OwnerUserId":"121023","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-05-14T19:08:14.587","Title":"How does the Community bot work when it approves or rejects my edits?","Tags":"<discussion><moderation>","AnswerCount":"2","CommentCount":"6"},{"Id":"2472","PostTypeId":"2","ParentId":"2471","CreationDate":"2015-05-11T08:53:56.760","Score":"1","Body":"<p>The Community User always is a bot. See <a href=\"https://meta.stackexchange.com/questions/19738/who-is-the-community-user\">this post on Meta SE</a> for some more details.</p>\n\n<p>Also, the profile page for that user is quite descriptive:</p>\n\n<p><a href=\"https://apple.stackexchange.com/users/-1/community?tab=profile\">https://apple.stackexchange.com/users/-1/community?tab=profile</a></p>\n\n<p>If you find something that isn't documented there, we can open a new question to have that addressed.</p>\n\n<p>As for <a href=\"https://apple.stackexchange.com/review/suggested-edits/109411\">this edit</a>, the user approving it has >2000 reputation, so he can approve edits directly (see apple.stackexchange.com/help/privileges/edit). The community user in this case merely takes note of this fact and removes the edit from the queue (which is logged/registered as another approving edit).</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-05-11T15:57:12.783","CommentCount":"2"},{"Id":"2473","PostTypeId":"1","CreationDate":"2015-05-11T08:54:52.103","Score":"3","ViewCount":"31","Body":"<p>What happens if I reach 200 reputation gained in a day. Does it prevent me from getting reputation from accepted answers, votes, bounties etc. or does it move to another day and then I get the reputation delayed on a different day? I would not like to lose unnecessarily from reaching the daily limit. What exactly happens then?</p>\n","OwnerUserId":"121023","LastEditorUserId":"5472","LastEditDate":"2015-05-11T15:52:33.873","LastActivityDate":"2015-05-11T15:52:33.873","Title":"What happens when I reach the daily reputation limit?","Tags":"<support><reputation>","AnswerCount":"1","CommentCount":"0"},{"Id":"2474","PostTypeId":"1","CreationDate":"2015-05-11T10:34:56.860","Score":"0","ViewCount":"23","Body":"<p>I did see a bunch of questions on this topic. And I saw an answer saying that it is fine if they say the source is from AD. Though <a href=\"http://osquestions.com/osx-ios/151586/how-do-i-hide-the-spotlight-icon-on-yosemite-but-keep-the-spotlight-functionali\" rel=\"nofollow\">here</a> it look just as if the AD question was native to the site OSquestions. The whole thread is copied with the questions and answers. Though there are no authors listed. Does anyone know about this? Is it even <strong>Legal</strong> to do that without saying that it is from AD? What should I (or someone) do with this?</p>\n\n<p>Within browsing around, alot of questions are copied from AD. There is also a Unix and Linux tab that could copy.</p>\n","OwnerUserId":"121023","LastEditorUserId":"22824","LastEditDate":"2015-05-14T19:05:34.027","LastActivityDate":"2015-05-14T19:06:28.250","Title":"OSquestions copying Ask Different","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2475","PostTypeId":"2","ParentId":"2474","CreationDate":"2015-05-11T15:28:24.447","Score":"1","Body":"<p>The detailed process is give in this <a href=\"https://meta.stackexchange.com/questions/200177/updated-procedure-for-reporting-scrapers\">Meta Stack Exchange question</a> </p>\n\n<p>The license for all contributions we make allows copying anywhere as long as it is clear it originates from Stack Exchange.</p>\n\n<p>If you think the copy is not correct then the answer is:</p>\n\n<blockquote>\n  <p>tl;dr: Send all reports of SCRAPERs to us via the form on the contact us page, linked at the bottom of every page.</p>\n</blockquote>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-05-14T19:06:28.250","CommentCount":"0"},{"Id":"2476","PostTypeId":"2","ParentId":"2471","CreationDate":"2015-05-11T15:34:12.997","Score":"0","Body":"<p>From <a href=\"https://meta.stackexchange.com/a/184993/136010\">Meta Stack Exchange</a></p>\n\n<blockquote>\n  <ul>\n  <li>A user improves your edit from the review queue</li>\n  <li>A user with full edit privileges saves an edit over yours</li>\n  </ul>\n</blockquote>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-05-11T15:34:12.997","CommentCount":"0"},{"Id":"2477","PostTypeId":"2","ParentId":"2473","CreationDate":"2015-05-11T15:36:44.490","Score":"4","Body":"<p>From <a href=\"https://meta.stackexchange.com/questions/32160/what-is-the-daily-reputation-cap-and-how-can-i-hit-it\">What is the daily reputation cap and how can I hit it?</a></p>\n\n<blockquote>\n  <p>The maximum amount of reputation you can earn in one day from up-votes and approved suggested edits is 200. Any reputation you receive beyond that no longer awards any points [for that day, nor are those points deferred to another day].</p>\n  \n  <p>You can still earn rep by winning a bounty, accepting an answer, or having one of your answers accepted, and downvotes will still count against you.</p>\n</blockquote>\n","OwnerUserId":"3","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-05-11T15:36:44.490","CommentCount":"0"},{"Id":"2478","PostTypeId":"2","ParentId":"2469","CreationDate":"2015-05-13T01:11:41.607","Score":"2","Body":"<p>A question shouldn't be critical of anything. If a question sounds like a rant, it doesn't belong here.</p>\n\n<p>If you are having a problem with a product, a question about how to solve the problem is certainly in order. Complaining about the product is not.</p>\n\n<p>The <a href=\"https://apple.stackexchange.com/q/186511/4395\">first example you linked</a> is currently open and has a positive score; it seems to be well received. You are trying to solve a problem of making your apps launch faster. The question could be a hidden rant (\"This is too slow! Apple Watch suxx!\"), but if you are actually interested in answers, this is totally a legit and on-topic question here.</p>\n\n<p>In <a href=\"https://apple.stackexchange.com/q/186694/4395\">this example</a>, it is unclear whether the intent of the post is to determine whether user identity detection is a feature of Apple Watch (and the consensus among the answers is that it is not), or to complain that the language of the ad is misleading. If the first is the purpose of the post, the post isn't \"critical of an Apple product\"; it's just trying to find information.</p>\n\n<p>If the purpose of the post is really to complain that the ad uses imprecise language, no one here comes to the site to hear people whine. If users think that's what a question is for, they will often vote against it.</p>\n\n<p>The fact that you categorize the aforelinked post as \"critical of an Apple product\" (or actually of the ad for an Apple product) tells me that you might have the intent to rant here.</p>\n\n<p>There's no problem with not liking Apple products (or Microsoft products, or Google products, or…), but this site isn't the place to complain or praise; it's a place to look for solutions.</p>\n","OwnerUserId":"9388","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-05-13T01:19:30.447","CommentCount":"4"},{"Id":"2479","PostTypeId":"1","CreationDate":"2015-05-13T08:09:45.950","Score":"0","ViewCount":"26","Body":"<p>If my comment “adds something useful to [a] post”, I’d simply like to know so - I’d like to be notified. I think that such a feature would, in the long run, improve the quality of comments. Thoughts?</p>\n","OwnerUserId":"62132","LastActivityDate":"2015-05-13T17:47:38.877","Title":"Should I receive a notification for my “upvoted\" comments?","Tags":"<feature-request>","AnswerCount":"2","CommentCount":"0"},{"Id":"2480","PostTypeId":"2","ParentId":"2479","CreationDate":"2015-05-13T08:20:19.010","Score":"3","Body":"<p>Votes on comments are more similar to favs on Twitter/likes on FB in a way. The only functionality behind comment votes actually is that in case there are a lot of comments on a post, the ones with higher upvotes get displayed by default, not the chronologically oldest.</p>\n\n<p>Question is slightly different than <a href=\"https://apple.meta.stackexchange.com/questions/2429\">What happens with deleted comments</a>, but the answers given there apply to comment \"votes\" as well. Comments aren't guarateed to persist, so voting on them doesn't impact your reputations etc. </p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-05-13T08:20:19.010","CommentCount":"1"},{"Id":"2481","PostTypeId":"2","ParentId":"2479","CreationDate":"2015-05-13T17:47:38.877","Score":"1","Body":"<p>tbh, I'd like a downvote option on comments too; for the truly idiotic, yet not actually offensive ones - to quickly push them out of contention. </p>\n\n<p>Theoretical wild example:-<br>\nOP wants to expand a drive partition.<br>\nFirst comment is 'Wipe your drive, reinstall your OS'</p>\n\n<p>It's not offensive; it's not 'strictly wrong', you <em>could</em> do it that way if you were so inclined; but it would be a whole lot more work than a smarter answer.</p>\n\n<p>As an answer it would quickly get down voted, &amp; commented on itself, hopefully before the OP had chance to take up the idea.  </p>\n\n<p>As a comment, there's no 'defence mechanism' for it.</p>\n","OwnerUserId":"85275","LastActivityDate":"2015-05-13T17:47:38.877","CommentCount":"3"},{"Id":"2482","PostTypeId":"2","ParentId":"2445","CreationDate":"2015-05-13T18:00:26.180","Score":"1","Body":"<p>[I know this isn't an answer, but just to keep it in one thread - not worth a separate question, I didn't think]</p>\n\n<p>Since I hit my 10k rep, this has become a constant source of irritation to my usually well-under-control OCD.</p>\n\n<p>More than half the times I refresh the main questions page, I see a number of flags.<br>\nThe number of times this matches the number of issues I can actually see in Review is negligible.</p>\n\n<p>It used to match, before I hit 10k. This was literally an overnight change in behaviour.</p>\n","OwnerUserId":"85275","LastActivityDate":"2015-05-13T18:00:26.180","CommentCount":"1"},{"Id":"2483","PostTypeId":"1","AcceptedAnswerId":"2489","CreationDate":"2015-05-14T16:46:15.080","Score":"3","ViewCount":"68","Body":"<p>Recently, I found this when I was editing:\n<img src=\"https://i.stack.imgur.com/FEPAt.jpg\" alt=\"marked as duplicate by grgarside\">\nWhat does the gold circle in the shape of a badge mean? Gold Badges don't appear on all marked as duplicate post notices.</p>\n","OwnerUserId":"121023","LastEditorUserId":"37797","LastEditDate":"2015-05-15T15:01:26.793","LastActivityDate":"2015-05-15T15:01:26.793","Title":"What does the Gold Badge next to a name on a duplicate post notice mean?","Tags":"<support><closed-questions><moderation>","AnswerCount":"2","CommentCount":"0"},{"Id":"2484","PostTypeId":"2","ParentId":"2483","CreationDate":"2015-05-14T16:46:15.080","Score":"2","Body":"<p>It is a tag badge. There is a silver, gold and bronze tag badge. You get one for each tag depending on the score you earn on each. For example. a gold osx badge shows this gold badge symbol when marking as duplicate. It gives the user elevated privileges to better handle tag moderation.</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/254765/add-gold-tag-badge-privileges-to-a-users-privileges-page\">Add gold tag badge privileges to a user&#39;s Privileges page</a></li>\n</ul>\n","OwnerUserId":"121023","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-05-14T16:50:29.013","CommentCount":"0"},{"Id":"2485","PostTypeId":"1","CreationDate":"2015-05-14T17:05:58.907","Score":"1","ViewCount":"26","Body":"<p>For a few days now this has been a problem for me. I can no longer vote posts up or down on any meta channel from Chrome (Version 42.0.2311.152 (64-bit)) on OS X. Looking at the JavaScript console while trying to vote, it appears that Chrome is blocking a URI call because it's being made over a non-SSL end point:</p>\n\n<p><img src=\"https://i.stack.imgur.com/uJD5D.png\" alt=\"enter image description here\"></p>\n\n<p>The blocked calls occurred when I pressed the up-vote button. I get similar blocked calls in Chrome when I try to add an image to a question or answer on a meta channel.</p>\n\n<p>It's only a problem on the meta channel. The main sites are fine.</p>\n\n<p>I had to post this from...<em>shudder</em>...Safari to attach the image to the post. :)</p>\n\n<p>Edit: this is possibly a problem for me because I visit all Stack Exchange sites via their https URLs and the meta sites have invalid certificates. This is what I get trying to use <a href=\"https://apple.meta.stackexchange.com/\">https://apple.meta.stackexchange.com/</a> from Chrome:</p>\n\n<p><img src=\"https://i.stack.imgur.com/du3Xk.png\" alt=\"enter image description here\"></p>\n\n<p>If I come to the site via the non-encrypted endpoint it works fine in Chrome. Chrome really doesn't like when your site mixes https and http requests to its own domain (and rightly so).</p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:23.443","LastActivityDate":"2015-05-26T19:29:56.050","Title":"Meta is using non-SSL endpoints for some resources and it breaks the site in Chrome","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2486","PostTypeId":"2","ParentId":"2485","CreationDate":"2015-05-14T17:13:51.493","Score":"2","Body":"<p>Figured it out.</p>\n\n<p>First: the certificate for meta.apple.stackexchange.com is definitely invalid. That is, ultimately, at the heart of my problem.</p>\n\n<p>But the problem for me, in Chrome, was caused by my use of the <a href=\"https://chrome.google.com/webstore/detail/https-everywhere/gcbommkclmclpchllfjekcdonpmejbdp?hl=en\" rel=\"nofollow\">HTTPS Everywhere</a> Chrome extension. It was responsible for blocking the http calls to meta endpoints that were being made from an https meta page. Once I disable the extension for meta I could vote again.</p>\n\n<p>This all, however, is just pointing a serious flaw in the use of https on the meta sites that needs to be fixed. I'll argue this stands as a bug.</p>\n","OwnerUserId":"292","LastActivityDate":"2015-05-14T17:13:51.493","CommentCount":"1"},{"Id":"2487","PostTypeId":"1","AcceptedAnswerId":"2488","CreationDate":"2015-05-14T18:22:49.167","Score":"0","ViewCount":"33","Body":"<p>In the effort to clean after my self !</p>\n\n<p>Sometimes I find my answer given long time ago, to have been down voted (for a good reason). So I delete it.</p>\n\n<p>My problem is how to be notified of such event, without having to monitor or remember the current points, or go back in history and review all answers. </p>\n\n<p>Another problem is for answers without Votes, when someone has gotten a Accepted answer, I would like to know that as well and delete my answer.</p>\n","OwnerUserId":"46541","LastActivityDate":"2015-05-14T19:13:25.167","Title":"Is there a automated system to be informed on down vote","Tags":"<discussion><voting><moderation>","AnswerCount":"1","CommentCount":"0"},{"Id":"2488","PostTypeId":"2","ParentId":"2487","CreationDate":"2015-05-14T19:13:25.167","Score":"1","Body":"<p>I wouldn't delete a post based on a -1 personally. Maybe if you're at -5 and you find the answer is totally not helpful / even when you misunderstand a question and make an attempt to answer, hundreds of people will likely make the same error and having that up can help the site. It also can help someone with a similar problem but they find your answer.</p>\n\n<p>Keep in mind - 4 down votes means that somewhere in the entire internet, 4 accounts at one point in time were cranky and didn't find that post helpful or clear or useful.</p>\n\n<p>I'd focus on making new answers clear, relevant and think if you need to comment for clarification or post an answer that will be of use even if it's not what the OP wants to hear.</p>\n\n<p>Lastly, there is the Stack Exchange Data Explorer where you can craft about any query you can think of to see posts by date, relative date, votes, etc...</p>\n\n<ul>\n<li><a href=\"http://data.stackexchange.com/apple/queries\" rel=\"nofollow\">http://data.stackexchange.com/apple/queries</a></li>\n</ul>\n\n<p>It's not automated, but it's a system.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-05-14T19:13:25.167","CommentCount":"1"},{"Id":"2489","PostTypeId":"2","ParentId":"2483","CreationDate":"2015-05-15T15:00:18.383","Score":"1","Body":"<p>                                      <img src=\"https://i.stack.imgur.com/g6FKg.png\" width=\"334\"></p>\n","OwnerUserId":"37797","LastActivityDate":"2015-05-15T15:00:18.383","CommentCount":"0"},{"Id":"2490","PostTypeId":"2","ParentId":"2429","CreationDate":"2015-05-17T19:32:29.497","Score":"0","Body":"<p>So this topic kept nagging me, and I found a solution to have some control over my comments.</p>\n\n<p>->As I was told, they can be deleted by the mods (without clear reasoning).</p>\n\n<p>->As I was told, they can be delete by Flags ? I agree if the comments are worth flagging.</p>\n\n<p>To quote: Comments are temporary. They frequently get deleted, and are designed to not endure.</p>\n\n<p>I found and installed the \"Self-destructing comments\" made by the creative fellow users ᔕᖺᘎᕊ.</p>\n\n<p>What a relief, now I feel like I have some control over how long my comments stay alive, and will help me keeping it clean.</p>\n\n<p>Here is a example how it looks now (note the self destruct)</p>\n\n<p><img src=\"https://i.stack.imgur.com/68qxZ.jpg\" alt=\"sd\"></p>\n","OwnerUserId":"46541","LastEditorUserId":"46541","LastEditDate":"2015-05-18T01:24:27.440","LastActivityDate":"2015-05-18T01:24:27.440","CommentCount":"0"},{"Id":"2491","PostTypeId":"1","CreationDate":"2015-05-20T00:29:20.547","Score":"1","ViewCount":"26","Body":"<p>This is what I'm seeing on people's profile pages (profile tab):</p>\n\n<p><img src=\"https://i.stack.imgur.com/BA3X8.png\" alt=\"enter image description here\"></p>\n\n<p>I can't tell what tab I'm on. Clicking one switched the view, but doesn't highlight the tab. Can we have tab highlighting back?</p>\n","OwnerUserId":"44427","LastActivityDate":"2015-05-20T05:50:03.003","Title":"Can't tell what tab I'm on in the profile page","Tags":"<bug><design><profile-page>","AnswerCount":"1","CommentCount":"3"},{"Id":"2492","PostTypeId":"2","ParentId":"2491","CreationDate":"2015-05-20T05:50:03.003","Score":"2","Body":"<p>It's the same on Safari (OS X), you need to look at the title of the list (to the left) to see the selection. I've considered this to be a feature until now :-)</p>\n\n<h3>\"All\"</h3>\n\n<p><img src=\"https://i.stack.imgur.com/x7mqe.jpg\" alt=\"enter image description here\"></p>\n\n<h3>\"Questions\"</h3>\n\n<p><img src=\"https://i.stack.imgur.com/WtgxY.jpg\" alt=\"enter image description here\"></p>\n","OwnerUserId":"9058","LastActivityDate":"2015-05-20T05:50:03.003","CommentCount":"0"},{"Id":"2493","PostTypeId":"1","CreationDate":"2015-05-21T01:14:45.327","Score":"4","ViewCount":"36","Body":"<p>I've seen many questions from several years ago get bumped because someone posts a new \"answer,\" either a spam post or an \"I have this issue too\" post. Often we'll flag those \"answers\" into oblivion, but the question still stays bumped, drowning out newer questions that actually need some attention.</p>\n\n<p>I'd like to request a feature in which questions that get bumps from these not-answers get sent back into the Ask Different archives where they belong. Thank you!</p>\n","OwnerUserId":"85884","LastActivityDate":"2015-05-21T01:43:58.680","Title":"Can we un-bump the old questions that get dug up by a \"me too!\" answer?","Tags":"<feature-request><flagging><answers>","AnswerCount":"1","CommentCount":"0"},{"Id":"2494","PostTypeId":"2","ParentId":"2493","CreationDate":"2015-05-21T01:43:58.680","Score":"2","Body":"<p>Nope. It's like a scab, picking at it again starts the oozing and we have to be patient for it to crust over again. I totally get the sentiment that we could have a band-aid to patch it over whilst it heals.</p>\n\n<p>As far as the feature request - how would that work in practice? I'd consider a solution that was less harm than the bump and in this case, the bump got the correct reaction of negative votes to the poster. In effect, the system is working when people get direct feedback not to post dubious answers to old posts.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-05-21T01:43:58.680","CommentCount":"5"},{"Id":"2495","PostTypeId":"1","AcceptedAnswerId":"2496","CreationDate":"2015-05-23T10:56:27.257","Score":"3","ViewCount":"30","Body":"<p>I have been asking a few questions lately about rEFInd and have had to use the tag <a href=\"https://apple.stackexchange.com/questions/tagged/refit\" class=\"post-tag\" title=\"show questions tagged &#39;refit&#39;\" rel=\"tag\">refit</a>.</p>\n\n<p>Should we make an updated tag for rEFInd since rEFIt is outdated now? If we shouldn't then why?</p>\n\n<p>This will also help to distinguish between the old rEFIt and the new rEFInd.</p>\n\n<p>Here are the links to the questions:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/188190/uninstall-refind-0-8-3-7-on-yosemite\">Uninstall rEFInd 0.8-3.7 on Yosemite</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/188401/install-refind-on-another-partition\">Install rEFInd on another partition</a></li>\n</ul>\n","OwnerUserId":"112840","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-05-23T19:16:47.737","Title":"Should we make a new tag called 'rEFInd' in replacement of 'rEFIt'?","Tags":"<feature-request><tags>","AnswerCount":"1","CommentCount":"2"},{"Id":"2496","PostTypeId":"2","ParentId":"2495","CreationDate":"2015-05-23T12:48:37.803","Score":"5","Body":"<p>My vote would be to merge both to <a href=\"https://apple.stackexchange.com/questions/tagged/efi\" class=\"post-tag\" title=\"show questions tagged &#39;efi&#39;\" rel=\"tag\">efi</a> or some other tag further up the hardware chain.</p>\n\n<p>What are your thoughts of tagging these utilities more on what they do (replace/interface with EFI) than what the program du jour is called?</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-05-23T12:48:37.803","CommentCount":"1"},{"Id":"2497","PostTypeId":"1","AcceptedAnswerId":"2498","CreationDate":"2015-05-26T09:53:23.583","Score":"3","ViewCount":"30","Body":"<p>When I edit a question and change a link from <a href=\"http://www.example.com\" rel=\"nofollow\">http://www.example.com</a> to <code>[this](http://www.example.com)</code>, does it count as 8 characters edited, or as deleting the whole link and retyping (so 30 characters)? When I look at my edit again and see an an edited link I made, all of it is striked through and new text next to it written in green. Does this mean that I edited more characters?</p>\n\n<p>The same with code blocks and blockquotes. How exactly does the character edit counting system work?</p>\n","OwnerUserId":"121023","LastEditorUserId":"37797","LastEditDate":"2015-05-26T14:31:33.713","LastActivityDate":"2015-05-26T14:31:33.713","Title":"How are edited characters counted?","Tags":"<support><editing><suggested-edits>","AnswerCount":"1","CommentCount":"4","FavoriteCount":"1"},{"Id":"2498","PostTypeId":"2","ParentId":"2497","CreationDate":"2015-05-26T14:30:59.633","Score":"2","Body":"<p>The edited characters count for the purposes of the minimum edit count is based on the number of non-whitespace characters that are edited in a post.</p>\n\n<p>This means that:</p>\n\n<ul>\n<li><code>example</code> to <code>**example**</code> is an edit of four characters, not 11 (or 7).</li>\n<li>Prepending four spaces to a line for a code block is an edit of zero characters, as all the characters are whitespace.</li>\n<li>Prepending a <code>&gt;</code> for a quote block is an edit of one character, regardless of how many characters are in the quote block itself.</li>\n</ul>\n\n<p>The edited characters count for the automatic edit summary (available >2k) includes whitespace character changes, therefore showing 4 characters when adding a code block.</p>\n","OwnerUserId":"37797","LastActivityDate":"2015-05-26T14:30:59.633","CommentCount":"0"},{"Id":"2499","PostTypeId":"1","CreationDate":"2015-05-27T16:36:55.467","Score":"1","ViewCount":"22","Body":"<p>I have just looked at the <a href=\"https://apple.stackexchange.com/questions/tagged/path\" class=\"post-tag\" title=\"show questions tagged &#39;path&#39;\" rel=\"tag\">path</a> wiki. It covers the meaning of path as the shell environment variables used to find things e.g. executables in $PATH man pages in $MANPATH</p>\n\n<p>However path is also the name used to define the location of a file in the role system e.g. it is the team used in <a href=\"https://developer.apple.com/library/ios/documentation/FileManagement/Conceptual/FileSystemProgrammingGuide/AccessingFilesandDirectories/AccessingFilesandDirectories.html#//apple_ref/doc/uid/TP40010672-CH3-SW6\" rel=\"nofollow noreferrer\">Apple's Filesystem programming guide</a></p>\n\n<p>I have edited the wiki to add that definition as a note. </p>\n\n<p>Should we</p>\n\n<p>1) Restrict the tag to the PATH environment variable as per the wiki and edit the questions to remove tags</p>\n\n<p>2) Edit the wiki to make the file name more prominent? </p>\n\n<p>And while on $PATH we need a canonical answer as how to set it. This <a href=\"https://apple.stackexchange.com/a/121021/237\">answer</a> seems a base is there a better start elsewhere (possibly also on a SuperUser question)</p>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-05-27T19:02:50.403","Title":"Definition of PATH","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2500","PostTypeId":"2","ParentId":"2499","CreationDate":"2015-05-27T19:02:50.403","Score":"1","Body":"<p>I'm of a mind to make it a synonym to <a href=\"https://apple.stackexchange.com/questions/tagged/command-line\" class=\"post-tag\" title=\"show questions tagged &#39;command-line&#39;\" rel=\"tag\">command-line</a> when would anyone have experience in one, they have to have experience in the other. By lumping things together tag clouds and rep and badged make the site better.</p>\n\n<p>Having a tag for any little aspect of command line programming / environment seems counter productive since the search tool can expose path questions extremely well with or without that tag.</p>\n\n<p>Big thanks for the edit to the tag wiki and the attention here.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-05-27T19:02:50.403","CommentCount":"1"},{"Id":"2501","PostTypeId":"1","CreationDate":"2015-05-28T01:48:29.377","Score":"5","ViewCount":"31","Body":"<p>I was about to ask a question today and a message appeared at the top of the page.</p>\n\n<p><img src=\"https://i.stack.imgur.com/QiXva.png\" alt=\"enter image description here\"></p>\n\n<p>My profile only shows that I've asked two questions, and one of them had at least one downvote (I don't know why), but why does one or two downvotes constitute a warning?</p>\n","OwnerUserId":"67206","LastEditorUserId":"67206","LastEditDate":"2015-05-28T02:05:51.827","LastActivityDate":"2015-05-28T02:05:51.827","Title":"Question ban warning","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2502","PostTypeId":"2","ParentId":"2501","CreationDate":"2015-05-28T01:54:00.597","Score":"5","Body":"<p>I've had a look and don't see any indication you should be under any quality throttles on Ask Different. If you're asking on another site, we can migrate this there.</p>\n\n<p>Good news is you're not banned, but there's always a chance the code has some problem to give you that error. </p>\n\n<p>If not, spend some time reading this link and the notice to be sure you understand the basics covered in those posts.</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/234042/what-should-i-do-when-i-see-a-question-ban-warning\">What should I do when I see a &quot;question ban warning&quot;?</a></li>\n</ul>\n\n<p>The message could be more of an effort to make sure you're aware of the disagreement on what a good question is - and there is some evidence of questions without documented research by you recently:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/187560/is-there-a-peak-ram-age\">Is there a peak RAM age?</a></li>\n</ul>\n\n<p>Could you try to post your question again and then upload a screen picture or exact copy of the text?</p>\n\n<p>Also, if you need help with english, be sure to comment and do extra work on linking to supporting documentation (like what RAM age would be and what specifically would peak, for example)</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-05-28T02:01:02.663","CommentCount":"2"},{"Id":"2503","PostTypeId":"1","CreationDate":"2015-05-28T16:08:46.693","Score":"3","ViewCount":"12","Body":"<p>When a <a href=\"https://stackoverflow.com/questions/30510932/jquery-renders-on-safari-but-not-mobile-safari\">question is migrated away from Ask Different</a>, the following slug is attached to the post in question.</p>\n\n<blockquote>\n  <p>This question came from our site for power users of Apple hardware and software</p>\n</blockquote>\n\n<p>Could this be updated to match the highest upvoted answer here which will presumably be the community consensus? (Or have it come from an editable section of the main site help so moderators of the site can maintain the slugs just like other customizable site verbiage) </p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-05-23T12:40:12.040","LastActivityDate":"2015-05-28T16:14:31.850","Title":"Can the slug for migrated questions be updated to match the current FAQ?","Tags":"<support><feature-request>","AnswerCount":"1","CommentCount":"0"},{"Id":"2504","PostTypeId":"2","ParentId":"2503","CreationDate":"2015-05-28T16:14:31.850","Score":"1","Body":"<p>I propose the following wording to match the main help slug:</p>\n\n<blockquote>\n  <p>Ask Different is for users of Apple products</p>\n</blockquote>\n\n<p>If hardware is going to be enumerated, please have it include <strong>hardware, services and software</strong> since services is a bigger part of the apple ecosystem than software is at present with both still being dwarfed by hardware.</p>\n\n<p>Basically, remove power since we're here for all users of Apple products and \"power users\" contains negative connotation as it diminishes some vague subset of users implicitly.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-05-28T16:14:31.850","CommentCount":"0"},{"Id":"2505","PostTypeId":"1","AcceptedAnswerId":"2507","CreationDate":"2015-05-29T19:43:09.990","Score":"0","ViewCount":"40","Body":"<p>I already have a similar question on Ask Ubuntu for installing Ubuntu  on a mac, but I want to post a question here. Is that okay?</p>\n","OwnerUserId":"84680","LastActivityDate":"2015-05-30T12:35:50.077","Title":"Can I ask about installing Ubuntu on a Mac?","Tags":"<support><questions>","AnswerCount":"2","CommentCount":"0"},{"Id":"2506","PostTypeId":"2","ParentId":"2505","CreationDate":"2015-05-30T11:11:29.037","Score":"0","Body":"<p>In general yes as it is about Apple hardware and Apple's boot mechanism does differ from other hardware.</p>\n\n<p>However you should not ask the same question in two places on stack exchange although there is no way of managing duplicates across sites.</p>\n","OwnerUserId":"237","LastActivityDate":"2015-05-30T11:11:29.037","CommentCount":"0"},{"Id":"2507","PostTypeId":"2","ParentId":"2505","CreationDate":"2015-05-30T12:35:50.077","Score":"1","Body":"<p>Questions about installing any operating system on Mac hardware is on-topic here, so feel free to ask related questions here. For a full list of topics that you can ask questions about here, see:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/help/on-topic\">https://apple.stackexchange.com/help/on-topic</a></li>\n</ul>\n\n<p>However, keep in mind that cross-posting is prohibited and that you shouldn't <a href=\"https://askubuntu.com/questions/625686/trying-to-install-ubuntu-15-04-on-imac-not-working\">re-ask your question from Ask Ubuntu</a> here. If you feel that your question would be better suited here, flag for moderator attention on that question and ask that a moderator migrate it.</p>\n\n<p>With regard to that specific question, whilst it's on topic here, I doubt you'll get any better attention here as IMO it's more to do with Ubuntu than the Mac hardware?</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-05-30T12:35:50.077","CommentCount":"1"},{"Id":"2508","PostTypeId":"1","AcceptedAnswerId":"2509","CreationDate":"2015-05-30T15:25:38.440","Score":"19","ViewCount":"1437","Body":"<p>Why do many questions asking for customer support get closed on Ask Different:</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/890/help-my-computer-doesnt-work\">Help! My computer doesn&#39;t work</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/276062/how-long-to-recover-an-apple-account\">https://apple.stackexchange.com/questions/276062/how-long-to-recover-an-apple-account</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/112033/\">How do I do X to my clash of clans village?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/151177/\">I forgot my password for my Apple ID?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/114567/\">Help me unlock this iPhone I just \"happened to find\"?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/191179/\">My iPad does not work when it's camera time!</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/191872/\">I can't create a specific Apple ID</a></li>\n</ul>\n\n<p>Similar questions to mine are open or answered but mine got closed!  </p>\n\n<p><em>Why?</em></p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-03-12T15:04:04.317","Title":"Why we're not customer support for [company X or product Y]","Tags":"<discussion><faq><closed-questions>","AnswerCount":"1","CommentCount":"3","FavoriteCount":"2"},{"Id":"2509","PostTypeId":"2","ParentId":"2508","CreationDate":"2015-05-30T15:25:38.440","Score":"28","Body":"<p>Several sites in the Stack Exchange network have <a href=\"https://meta.stackoverflow.com/questions/255745/\">an out-right prohibition of customer support questions</a>.</p>\n\n<p>Ask Different can be quite choosy about ensuring a \"CS\" question that gets closed is of high quality <a href=\"https://apple.stackexchange.com/help/editing\">by getting edited while it is closed</a> and <a href=\"https://apple.stackexchange.com/help/closed-questions\">then reopened for answers</a>.</p>\n\n<p>The <strong>why not</strong> reasons are typically:</p>\n\n<p><strong>We're not here to act as customer support on any company's behalf.</strong></p>\n\n<p>That's not our mission. We're here to help you learn how to interpret vague or conflicting behaviors once you've <strong>exhausted the normal support channels</strong> and <strong><em>documented that effort in your question</em></strong>. Your post here will live here for years - useful posts will drown amongst thousands of \"help me please\" posts with no detail and no effort to troubleshoot documented in them.</p>\n\n<p>Furthermore, we don't set policy, we don't have telephone lines, confirmation code generators, internal knowledge base articles and status pages or any authority to make decisions on your behalf. </p>\n\n<p>We can't track changes to policy except by anecdote and hearsay, so the answers we give you today are likely going to be wrong tomorrow, if not already wrong today. If the company documents service status and policy publicly on the web, then your web search engine of choice is a far better resource than a carefully curated and updated post here can ever be.</p>\n\n<p><strong>Closed customer support questions are often vague.</strong></p>\n\n<p>Good customer support involves some form of 20 questions. Most simple requests need 15 minutes of back and forth to be sure everyone is on the same page. Spreading that discovery process across hours or days with multiple people on the internet is an unsound option at best. If your question shows that you've already put that amount of thought into isolating your problem, it's less likely to be closed. </p>\n\n<p><strong>But question X is just like mine and it's not closed.</strong></p>\n\n<p>That's the nature of a community moderated resource. Please edit other bad questions and/or vote to close or link duplicate questions. We strive to concentrate knowledge and learning and not host the same tired question 15 times. Even though we often fail to clean things up when a question is initially asked, we hope for the majority of posts, this happens bit by bit for all bad questions.</p>\n\n<p><strong>But <a href=\"https://www.youtube.com/watch?v=xIFJLMyUwrg\" rel=\"nofollow noreferrer\">I REALLY NEED HELP NOW!!!</a></strong> </p>\n\n<p>That's fine and most of us really do empathize with your plight. Help us help you by getting <strong>a friend to copy edit your post</strong> and <em>ask you some obvious questions</em> like:</p>\n\n<ul>\n<li>What company supports this product?</li>\n<li>Do they have phone support for urgent needs?</li>\n<li>Is your frustration or urgency clouding the issue?</li>\n<li>Does company X have articles that explain how to troubleshoot this or set it up?</li>\n<li>Are there similar questions on this site or the vendor forums that will help narrow the scope of the issue?</li>\n</ul>\n\n<p>Then, you can take concrete steps to improve your question by <a href=\"https://apple.stackexchange.com/help/editing\">editing out any venting/frustration/extraneous data and editing in specific details and research</a> to show what sort of knowledge you need to solve the problem. </p>\n\n<p>The <a href=\"https://apple.stackexchange.com/help/how-to-ask\">help guide</a> has great advice on how to post specific, well researched text to allow us to help you solve your urgent dilemma once it is detailed enough to then help many others because it is clear, well researched, and complete.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-01-08T16:39:46.127","CommentCount":"4"},{"Id":"2510","PostTypeId":"1","CreationDate":"2015-06-02T19:48:27.627","Score":"-1","ViewCount":"50","Body":"<p>I am trying to do some cleaning.</p>\n\n<p>Is there a way to find out in my answers' history (1500), if there is a another answer to the same post that has been accepted?</p>\n\n<p>Here is example of why:</p>\n\n<p><img src=\"https://i.stack.imgur.com/C6rjM.jpg\" alt=\"stats\"></p>\n","OwnerUserId":"46541","LastEditorUserId":"37797","LastEditDate":"2015-06-05T14:22:58.457","LastActivityDate":"2015-06-05T14:22:58.457","Title":"How to find my answers where another answer has been accepted?","Tags":"<support><answers><accepted-answer>","AnswerCount":"1","CommentCount":"4","FavoriteCount":"0"},{"Id":"2511","PostTypeId":"2","ParentId":"2510","CreationDate":"2015-06-02T21:59:45.383","Score":"8","Body":"<p>Mass deletion of posts is something that will generally get you suspended.</p>\n\n<p>That being said, the SEDE (Stack Exchange Data Explorer) is the place to go if you want assistance in crafting such a query so you can study your acceptance rate and your scoring / ability to get the \"check\" which are all excellent and fine goals to have.</p>\n\n<ul>\n<li><a href=\"http://data.stackexchange.com\" rel=\"nofollow noreferrer\">http://data.stackexchange.com</a></li>\n</ul>\n\n<p>See <a href=\"https://meta.stackexchange.com/questions/49424/stack-exchange-data-explorer\">Stack Exchange Data Explorer</a> and consider asking on <a href=\"http://meta.stackexchange.com\">http://meta.stackexchange.com</a> for usage and support of that tool.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-06-02T21:59:45.383","CommentCount":"0"},{"Id":"2512","PostTypeId":"1","AcceptedAnswerId":"2513","CreationDate":"2015-06-09T13:47:37.890","Score":"6","ViewCount":"89","Body":"<p>...or do you have any suggestion, where I could ask such?</p>\n\n<p>I would like to build an iOS application, for which I nead a real OS X-based machine or a service like Macincloud. However, <a href=\"https://stackoverflow.com/a/23682404/1469208\">this answer</a> suggested, that I can just purchase an OS X and install it on my own PC, either as dual-boot secondary system or as virtual machine.</p>\n\n<p>However, I'm such newbie (ignorant) to OS X and Apple topics, that until reaching out that answer, I even wasn't aware, that it is possible to purchase OS X without purchasing a hardware along with it. And the idea of installing it on PC sounds like a nightmare for me. And that is why I wanted to ask for a possible quick step-by-step guide or a link to an external source, where these matters are covered.</p>\n\n<p>But... I think, that this could be an off-topic question and would like to confirm this before.</p>\n","OwnerUserId":"46952","LastEditorUserId":"-1","LastEditDate":"2017-05-23T12:40:12.040","LastActivityDate":"2015-06-09T18:14:00.250","Title":"Are questions about installing OS X on PC on-topic","Tags":"<discussion><questions><site-scope>","AnswerCount":"1","CommentCount":"2"},{"Id":"2513","PostTypeId":"2","ParentId":"2512","CreationDate":"2015-06-09T16:55:07.410","Score":"5","Body":"<p>Running OS X, even virtualized, on non-Apple hardware is a violation of the EULA for the software and, as such, is off topic here on Ask Different.</p>\n\n<p>Your best bet is asking on Stack Overflow since they specialize on tools used primarily by developers. You might link here or ask on meta there to check if they care about bypassing EULA as a general or specific rule.</p>\n\n<p>Second, when asking for off site resources, you would need to pass a high standard of documenting your situation and research and explaining precisely how it doesn't solve your issue.</p>\n\n<p>Lastly, the premise of the OS X on non Mac hardware question begs the question \"Why not buy a used Mac?\". You could ask what are the minimum hardware requirements to run Xcode version x.y and we would help you identify the pool of used computers to lease or buy to meet your budget needs.</p>\n","OwnerUserId":"292","LastEditorUserId":"5472","LastEditDate":"2015-06-09T18:14:00.250","LastActivityDate":"2015-06-09T18:14:00.250","CommentCount":"3"},{"Id":"2516","PostTypeId":"1","AcceptedAnswerId":"2517","CreationDate":"2015-06-13T09:06:04.333","Score":"5","ViewCount":"43","Body":"<p>Mostly, I can edit questions, place them in queue and wait for them to be reviewed. However, I haven't seen a question on the meta that does have the edit button not grayed out. I found one question that had the edit button grayed out on the main page. Why is this?</p>\n\n<p><img src=\"https://i.stack.imgur.com/O3YtM.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"121023","LastEditorUserId":"37797","LastEditDate":"2015-06-13T11:07:06.037","LastActivityDate":"2015-08-10T09:11:49.417","Title":"Grayed out edit on some questions and most meta questions","Tags":"<support><editing><suggested-edits>","AnswerCount":"1","CommentCount":"0"},{"Id":"2517","PostTypeId":"2","ParentId":"2516","CreationDate":"2015-06-13T11:03:28.937","Score":"4","Body":"<p><img src=\"https://i.stack.imgur.com/qG8cV.png\" width=\"331\">\n<img src=\"https://i.stack.imgur.com/E29bC.png\" width=\"318\"></p>\n\n<p>Two suggested edits can't be submitted on the same post at the same time. The first suggested edit must be approved or rejected before another suggested edit can be submitted. If the user can approve or reject the suggested edit, either because they have the privilege to do so or the suggested edit was on their own post, they see <sub><img src=\"https://i.stack.imgur.com/figGs.png\" width=\"42\" title=\"edit (1)\"></sub> and can approve/reject the edit.</p>\n\n<p>You can't submit suggested edits on non-tag-wiki posts on child meta sites. On meta without the edit privilege, you can edit community wiki posts (if you have the necessary privilege), tag wikis (with the suggested edit system in place) and your own posts. Once you have the necessary privilege to edit without suggested edits on the main site, you can edit any post on the child meta.</p>\n\n<p>There are other cases where the edit button would be greyed out and suggested edits not allowed:</p>\n\n<ul>\n<li>Too many of your suggested edits were rejected and you are suspended from suggesting edits for one week.</li>\n<li>There are currently 200 suggested edits waiting to be reviewed and therefore no more can be suggested.</li>\n<li>The post is locked by a moderator or by 'migration limbo'.</li>\n<li>You are suspended.</li>\n</ul>\n\n<p>In all of these cases, the tooltip will explain.</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2015-08-10T09:11:49.417","LastActivityDate":"2015-08-10T09:11:49.417","CommentCount":"2"},{"Id":"2518","PostTypeId":"5","CreationDate":"2015-06-13T11:17:53.800","Score":"0","Body":"<p>Suggested edits are edits on posts for which you do not have the ability to edit directly and must go through the review system to have your edits approved.</p>\n\n<p>For questions about editing in general, use <a href=\"http://apple.stackexchange.com/questions/tagged/editing\" class=\"post-tag\" title=\"show questions tagged &#39;editing&#39;\" rel=\"tag\">editing</a>.</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2015-06-13T11:17:53.800","LastActivityDate":"2015-06-13T11:17:53.800","CommentCount":"0"},{"Id":"2519","PostTypeId":"4","CreationDate":"2015-06-13T11:17:53.800","Score":"0","Body":"For questions about the process of suggesting edits on posts for which you do not have the ability to edit directly and must go through the review system to have your edits approved.","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2015-06-13T11:17:53.800","LastActivityDate":"2015-06-13T11:17:53.800","CommentCount":"0"},{"Id":"2520","PostTypeId":"5","CreationDate":"2015-06-13T11:49:42.153","Score":"0","Body":"","OwnerUserId":"-1","LastEditorUserId":"-1","LastEditDate":"2015-06-13T11:49:42.153","LastActivityDate":"2015-06-13T11:49:42.153","CommentCount":"0"},{"Id":"2521","PostTypeId":"4","CreationDate":"2015-06-13T11:49:42.153","Score":"0","Body":"The chat is a place where you can actively discuss a problem or just talk in some rooms made for it. You need at least 20 reputation to talk in chat, unless a moderator grants you access when you have <20","OwnerUserId":"121023","LastEditorUserId":"9058","LastEditDate":"2015-06-15T11:53:14.483","LastActivityDate":"2015-06-15T11:53:14.483","CommentCount":"0"},{"Id":"2522","PostTypeId":"1","AcceptedAnswerId":"2530","CreationDate":"2015-06-14T17:36:48.673","Score":"1","ViewCount":"38","Body":"<p>Why is there no filter for off-topic posts? I mean, it would have to be actively maintained (or automatic), but for months leading up to the release of a product, you can expect wave after wave of off-topic posts. It just seems that if you were to prevent anything related to \"El Capitan\" or \"iOS 9\" from being posted, much of the off-topic posts could be taken care of. Perhaps with a built-in timer that deactivates the filter when the product is expected to be released. Seems like it would improve things around here.</p>\n","OwnerUserId":"119675","LastEditorUserId":"37797","LastEditDate":"2015-06-15T09:20:42.407","LastActivityDate":"2015-06-15T15:16:34.647","Title":"Off-topic post filter","Tags":"<feature-request><questions><site-scope>","AnswerCount":"3","CommentCount":"0"},{"Id":"2523","PostTypeId":"1","AcceptedAnswerId":"2524","CreationDate":"2015-06-15T08:53:38.893","Score":"4","ViewCount":"35","Body":"<p>Is there any more convenient way to write code? When I have a longer log, I dont want to space every line because it would take very long. I thought that using the <code>&lt;code&gt;</code> tag would help. But that results in:</p>\n\n<p><code>\nLorem ipsum dolor sit amet, consectetur adipiscing elit. Aliquam sollicitudin tortor nec dignissim maximus. Maecenas imperdiet auctor dapibus. Duis efficitur elit et arcu pulvinar placerat. Vivamus sed fringilla sapien. Aenean laoreet lacus ut nulla eleifend lacinia. Mauris laoreet luctus luctus. Nam ullamcorper tellus non magna eleifend, id scelerisque lorem consequat. Duis a libero a urna aliquam sagittis. Vestibulum id orci eu ex consectetur auctor. Phasellus facilisis interdum fermentum.\n</code></p>\n\n<p>I would like something not this thin like the usual space:</p>\n\n<pre><code>example\n</code></pre>\n","OwnerUserId":"121023","LastEditorUserId":"37797","LastEditDate":"2015-06-15T09:15:07.630","LastActivityDate":"2015-06-15T11:52:05.313","Title":"More convenient way to make code blocks","Tags":"<support><formatting><editor>","AnswerCount":"1","CommentCount":"0"},{"Id":"2524","PostTypeId":"2","ParentId":"2523","CreationDate":"2015-06-15T09:03:05.170","Score":"4","Body":"<p>There's no other way to create block code formatting other than to prepend each line with four spaces. The easiest way to do this is to highlight all the lines, then press command-K.</p>\n\n<p>There are numerous feature requests on Meta.SE to support <code>```</code>, however this has not been implemented yet. CommonMark support appears to be coming in the near future which would support this.</p>\n","OwnerUserId":"37797","LastActivityDate":"2015-06-15T09:03:05.170","CommentCount":"2"},{"Id":"2525","PostTypeId":"2","ParentId":"2522","CreationDate":"2015-06-15T09:19:54.903","Score":"3","Body":"<p>You seem to be presuming that every question that mentions El Capitan (before release) is off-topic. This isn't the case.</p>\n\n<p>Questions about rolling back a system from El Capitan to Yosemite are on-topic. Questions about publicly available information on Apple's non-NDA site are on-topic. Questions about features shown by Apple can be on-topic.</p>\n\n<p>How would your question filter know?</p>\n","OwnerUserId":"37797","LastActivityDate":"2015-06-15T09:19:54.903","CommentCount":"0"},{"Id":"2526","PostTypeId":"2","ParentId":"2522","CreationDate":"2015-06-15T10:08:46.670","Score":"1","Body":"<p><a href=\"https://apple.meta.stackexchange.com/a/2525/237\">grgarside</a> puts the reason not to filter on a tag as it removes too much</p>\n\n<p>There is also the issue that if the filter removes all references to  El Capitan  or iOS9 then people will notice this and start asking questions that don't meet the filter criteria but still are about El Capitan etc. Consider spam filters etc, StackExchange's programmers spend a lot of time changing this filters (see Meta StackExchnage for details)</p>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-06-15T10:08:46.670","CommentCount":"0"},{"Id":"2527","PostTypeId":"2","ParentId":"2234","CreationDate":"2015-06-15T10:25:27.183","Score":"0","Body":"<p>It doesn't seem like it, but it is easy to get 50 reputation to comment. All you have to do is make good quality answers that get upvotes and accepts. For example: Today I answered a question simply but surely, and I got 2 upvotes (20 reputation). When it gets accepted, I get additional 15 reputation. </p>\n\n<p>Also, ask well. You can get upvotes worth 5 on your questions. Be specific, on-topic and try not to make duplicates. Also, throw in a bunch of edits for grammar, spelling, formatting. 1 edit gives you 2 reputation.</p>\n\n<p>You can stay tuned at Questions > Newest to find new questions and be the first to answer</p>\n","OwnerUserId":"121023","LastActivityDate":"2015-06-15T10:25:27.183","CommentCount":"0"},{"Id":"2528","PostTypeId":"1","AcceptedAnswerId":"2529","CreationDate":"2015-06-15T13:19:55.273","Score":"3","ViewCount":"48","Body":"<p>As far as I know, you need a certain number of close votes to close a question. I have seen some high reputation users closing questions for several reasons. I also saw a moderator closing the question instantly, as only 1 name (the moderator's) was listed. If I had high reputation and I voted to close, is it still OK to call a moderator to finish the vote off?</p>\n","OwnerUserId":"121023","LastActivityDate":"2015-06-15T15:16:41.760","Title":"Once I have sufficient reputation and I vote to close, can I still flag for a moderator to finish the vote?","Tags":"<support><closed-questions><moderators>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"1"},{"Id":"2529","PostTypeId":"2","ParentId":"2528","CreationDate":"2015-06-15T13:42:01.503","Score":"4","Body":"<p>See <a href=\"https://apple.stackexchange.com/help/privileges/close-questions\">https://apple.stackexchange.com/help/privileges/close-questions</a> for some more insights in this area. Basically</p>\n\n<blockquote>\n  <p>Note that once you gain the reputation to vote to close, you should no longer flag for moderator attention to have questions closed or migrated. It is your responsibility to vote now.</p>\n</blockquote>\n\n<p>and</p>\n\n<blockquote>\n  <p>It takes 5 close votes to reach the closing threshold (except for duplicate questions, which can be marked as duplicate with a single vote from a user who has earned a gold tag badge in one of that question's original tags).</p>\n</blockquote>\n\n<p>So even after you've reached the \"vote to close\" threshold, it still needs five votes to close a question (except if you earned so much reputation from one of tags that the system considers you to be an expert and capable of detecting duplicates on your own :-)).</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-06-15T13:42:01.503","CommentCount":"1"},{"Id":"2530","PostTypeId":"2","ParentId":"2522","CreationDate":"2015-06-15T15:16:34.647","Score":"2","Body":"<p>I like and agree with the answers from <a href=\"https://apple.meta.stackexchange.com/users/37797/grgarside\">George</a> and <a href=\"https://apple.meta.stackexchange.com/users/237/mark\">Mark</a> have offered. I would also add that the stack exchange model is to allow anyone to post a question so that it can be put on hold if it's not clear it's on-topic on the site they chose.</p>\n\n<p>From there, it can get deleted (if it's garbage entirely and forever) or migrated (if it's a great question but on the wrong site) or put on hold or even closed indefinitely to allow others to edit and improve or the site to change and allow that question when at the moment it was asked it wasn't appropriate.</p>\n\n<p>My feeling as a moderator that works to keep the site orderly, we spend less time moderating these questions than average and the benefit to the site is far greater than the increase in load for people to vote to close and moderate posts about new OS. </p>\n\n<p>I'm also questioning whether we want to keep all beta questions off topic at all - so look for a meta post and weigh in if you have thoughts.</p>\n\n<hr>\n\n<p>As to adding a new hard coded feature, I think the site has a great variety of automated filters already and am not sure adding another would improve anything. I worry that blacklisting some legitimate tags would cause far more harm than benefit.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-06-15T15:16:34.647","CommentCount":"0"},{"Id":"2531","PostTypeId":"2","ParentId":"2528","CreationDate":"2015-06-15T15:16:41.760","Score":"3","Body":"<p>The main point is that flagging to close doesn't actually flag for a moderator. It simply puts the post into the same review queue as voting to close just without a vote.</p>\n\n<p>It's never acceptable to flag for a moderator to close a question regardless of reputation.</p>\n","OwnerUserId":"37797","LastActivityDate":"2015-06-15T15:16:41.760","CommentCount":"4"},{"Id":"2532","PostTypeId":"1","AcceptedAnswerId":"2533","CreationDate":"2015-06-17T00:26:17.127","Score":"5","ViewCount":"62","Body":"<p>Recently, a <a href=\"https://apple.stackexchange.com/questions/191869/bulk-download-pictures-from-messages\">question</a> was marked as a duplicate since there was a <a href=\"https://apple.stackexchange.com/questions/88023/how-to-transfer-entire-imessage-conversations-to-computer\">similar</a>, but not an actual duplicate, of the question already existing.</p>\n\n<p>In short, the situation was this:</p>\n\n<ul>\n<li>Original question was \"How to move an entire <strong>iMessage</strong> conversation to a computer\"</li>\n<li>New question was \"How to bulk-download photos out of <strong>Messages</strong> (could be iMessage or SMS) on a phone\"</li>\n</ul>\n\n<p>Note that while tangentially connected, and similar, the questions ask two different things. In addition, the answer provided in the original question was not marked as an accepted answer, and also promoted a premium product - not necessarily an available solution to all users. This is not necessarily the first time I have come across a duplicate like this.</p>\n\n<p>Also, the new question does not specifically state that they want the solution to bulk-download items to the computer - it just happens to be one of the provided solutions, but might involve phone, computer, another device, etc.</p>\n\n<p>For full disclosure: I did provide an answer to the newer question. However, I feel that a user might not read the additional content on the new thread (which provides a free, easy answer) instead of the original question (which provides a premium answer to a question they might not find relevant) since it was flagged as a duplicate, making a link to the first question appear at the top. This is not an exploration of how to get my answer accepted and rep boosted, but rather an attempt to provide a quality answer that I think might be lost.</p>\n\n<p>Given the above scenario, my question is this:</p>\n\n<ul>\n<li>Are users besides the OP allowed to challenge question statuses?</li>\n<li>What would a user have to do to modify their question <em>enough</em> that it would no longer be marked as duplicate?</li>\n<li>Is it possible to have an additional status, something like <em>Similar</em>, which could be used in these situations? (Benefit would be that a user could stumble onto either question, both open, yet have a thread linking them to the other in case one was more relevant to their needs. We all know how changing one or two words in Google can bring significantly different results on most topics)</li>\n</ul>\n","OwnerUserId":"119461","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-06-17T10:03:10.227","Title":"Challenging status of a question marked as duplicate","Tags":"<discussion><closed-questions><exact-duplicates>","AnswerCount":"1","CommentCount":"3","FavoriteCount":"1"},{"Id":"2533","PostTypeId":"2","ParentId":"2532","CreationDate":"2015-06-17T06:09:24.163","Score":"8","Body":"<p>This is a community-moderated site, so anybody can/should/is allowed to point out if he/she doesn't agree with a close reason. In a nutshell, you can always flag a closed question and give an explanation as a flag comment to have one of the moderators look at it.</p>\n\n<p>To improve the chances that the question gets reopened it might also help to edit the question text first to make it more obvious what the problem at hand is and how it differs from the potential duplicate. Such an edit also automatically places the question in the reopen queue where not only the elected moderators but all high-reputation users will participate in a voting process to reopen (or not) the question.</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-06-17T06:09:24.163","CommentCount":"0"},{"Id":"2534","PostTypeId":"1","AcceptedAnswerId":"2535","CreationDate":"2015-06-18T12:20:23.110","Score":"7","ViewCount":"93","Body":"<p>To illustrate my question or my answer I usually add a screen shot (like the one below) containing parts of the iOS or OS X operating system.</p>\n\n<ul>\n<li><p>Do I violate Apple's copyrights when doing so?</p></li>\n<li><p>And if I do violate Apple's copyrights, what is Stack Exchange's policy on this?</p></li>\n</ul>\n\n<p><img src=\"https://i.stack.imgur.com/7P3rQ.png\" alt=\"screenshot\"></p>\n","OwnerUserId":"55028","LastEditorUserId":"37797","LastEditDate":"2015-06-20T10:24:12.893","LastActivityDate":"2015-06-20T10:24:12.893","Title":"Are iOS and OS X screen shots violating copyrights and therefor allowed on SE?","Tags":"<discussion><policy>","AnswerCount":"2","CommentCount":"2"},{"Id":"2535","PostTypeId":"2","ParentId":"2534","CreationDate":"2015-06-18T14:45:21.760","Score":"8","Body":"<p>Copyright depends on many elements - some contradictory.</p>\n\n<p>The content policy is linked from the image uploader window:</p>\n\n<ul>\n<li><a href=\"http://stackexchange.com/legal/content-policy/\">http://stackexchange.com/legal/content-policy/</a></li>\n</ul>\n\n<p>The policy clearly anticipates accepting users posting material encumbered with copyright:</p>\n\n<blockquote>\n  <p>Using copyrighted material does not constitute infringement in all cases. In general, however, users should be careful when using copyrighted content without the permission of those who created it.</p>\n</blockquote>\n\n<p>The first is jurisdiction. Where are you subject to laws and where was the agreement (if any) established between you and Apple. A general statement is as pointless to make as <a href=\"http://blog.stackoverflow.com/2011/08/gorilla-vs-shark/\">\"Who would win in a fight between a Gorilla and a Shark?\"</a></p>\n\n<p>As to policy, you can find Stack Exchange's submissions licensing requirements at the <a href=\"http://stackexchange.com/legal\">legal link</a> towards the bottom of any page here.</p>\n\n<p>When you upload an image, you are posting a link to that image - which to the best of my knowledge is <a href=\"http://blog.stackoverflow.com/2010/08/new-image-upload-support/\">stored, hosted and otherwise located at imgur.com</a> and not actually <a href=\"https://meta.stackexchange.com/questions/90342/any-details-about-stack-imgur-com\">on the Stack Exchange servers</a>.</p>\n\n<p>If you wanted to narrow down say existing copyright case law and decisions in the USA between US companies and US citizens - there might be some interesting interplay between <a href=\"https://www.apple.com/legal/sla/\" rel=\"nofollow noreferrer\">Apple's EULA for a specific OS version</a> and settled cases.</p>\n\n<p>That question would be better on the main site as we already have some people asking if you can use photographs of Apple Products in your movies and in this sense - you are making original art by deciding how to arrange, crop, present and add narrative to what Apple's software can make on your screen. It would be odd for someone to be prevented from making art with a musical instrument or computer and software that they purchased for that express purpose. The musical instrument is created to make noise just as computers are created to make noise, pictures and heat.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/64409/\">What license is needed to use Apple hardware in a movie?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/104493/\">Is it legal to use content from Apple developer site for internal training documents?</a></li>\n</ul>\n\n<p>Since you are not passing off Apple's design elements as yours, you are not competing with them or using their work in your product, it's hard to see how <a href=\"http://copyright.gov/title17/circ92.pdf\" rel=\"nofollow noreferrer\">US copyright protections</a> that Apple has rights to are infringed by licensed users of OS X posting screen shots of what they are seeing on their computer screens.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-06-19T14:41:12.693","CommentCount":"0"},{"Id":"2536","PostTypeId":"2","ParentId":"2534","CreationDate":"2015-06-18T17:05:53.667","Score":"9","Body":"<p>To add to bmike's execellent post:</p>\n\n<p><a href=\"http://copyright.gov/fair-use/\" rel=\"nofollow\">Fair Use</a> provides most of the exemption coverage for screenshots on the SE network. Because this is a Q&amp;A site, academic in its very nature, use of copyrighted material is generally fine.</p>\n","OwnerUserId":"292","LastActivityDate":"2015-06-18T17:05:53.667","CommentCount":"0"},{"Id":"2537","PostTypeId":"1","CreationDate":"2015-06-25T08:15:29.573","Score":"18","ViewCount":"1173","Body":"<p>Questions that relate to Apple beta software (for example <a href=\"https://apple.stackexchange.com/questions/192902/restoring-a-backup-to-an-ios-9-device\">https://apple.stackexchange.com/questions/192902/restoring-a-backup-to-an-ios-9-device</a>) are generally not allowed. </p>\n\n<p>My understanding is that the NDA now allows more discussion than things it restricts - <a href=\"http://oleb.net/blog/2014/06/apple-lifted-beta-nda/\" rel=\"nofollow noreferrer\">http://oleb.net/blog/2014/06/apple-lifted-beta-nda/</a></p>\n\n<p>Basically, as long as Apple publicly explains it, discussion is allowed. Screen shots and reverse engineering and discussing things not announced by Apple (whatever a lawyer would assume that means) are still prohibited by the current NDA.</p>\n\n<p>It seems to me that Stack Exchange is the perfect place to discuss working with new Apple tools, and finding work arounds to problems in addition to going elsewhere or to the Apple forums.</p>\n\n<p><strong>Is there some other reason that I'm not aware of that these kind of questions are considered bad form?</strong></p>\n\n<p>NOTE: This relates to <a href=\"https://apple.meta.stackexchange.com/questions/1712/are-ios-9-and-os-x-el-capitan-questions-ok\">Are iOS 10, macOS 10.12, watchOS 3 or tvOS 10 (beta) questions OK?</a>, but it seemed worth raising as a separate question.</p>\n","OwnerUserId":"75790","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-08-13T15:56:05.463","Title":"Should beta OS questions be on-topic due to NDA changes + widening distribution by Apple","Tags":"<discussion><faq><site-scope>","AnswerCount":"6","CommentCount":"5","FavoriteCount":"1"},{"Id":"2538","PostTypeId":"2","ParentId":"2537","CreationDate":"2015-06-25T09:01:19.087","Score":"10","Body":"<p>NDA is just one of several reasons why questions about non-public beta software don't work well on Ask Different, <a href=\"https://apple.meta.stackexchange.com/questions/1331/can-i-ask-about-not-yet-publicly-released-os\">Can I ask about not-yet-publicly released OS?</a> lists the others. So even with the NDA partially lifted, I still think that questions about iOS 9/OS X El Capitan need to wait until at least public betas are available.</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-06-25T12:01:40.030","CommentCount":"3"},{"Id":"2539","PostTypeId":"1","AcceptedAnswerId":"2552","CreationDate":"2015-06-25T10:42:14.153","Score":"13","ViewCount":"152","Body":"<p>I flagged <a href=\"https://apple.stackexchange.com/a/157881/24130\">this answer</a> - it doesn't really answer the question, but talks about a conspiracy theory (\"fascist police state, media lockdown, etc.\"):</p>\n\n<p><img src=\"https://i.stack.imgur.com/L8f1M.png\" alt=\"answer\"></p>\n\n<p>My flag as \"Very low quality\" was disputed earlier today. I still don't feel that the above answer is relevant to the question, and the conspiracy theory content is questionable.</p>\n\n<p>Was it wrong to flag the answer?</p>\n","OwnerUserId":"24130","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-07-05T10:15:42.937","Title":"Conspiracy theory answer flagged, disputed","Tags":"<discussion><flagging>","AnswerCount":"3","CommentCount":"0"},{"Id":"2540","PostTypeId":"2","ParentId":"2539","CreationDate":"2015-06-25T11:50:21.277","Score":"-2","Body":"<p>I declined the flag earlier today, specifically because wrong answers are not a reason for flagging (simply downvote on such cases) and in general because on a user-moderated site like Ask Different (and all the other Stack Exchange sites) quality issues can usually be resolved by higher-rep users directly (in this case probably by removing the conspiracy theory at the end). </p>\n\n<p>See also</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/1629/why-was-my-flag-for-not-an-answer-declined?rq=1\">Why was my flag for &quot;not an answer&quot; declined?</a></li>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/2258/technically-inaccurate-or-altogether-wrong-answers?rq=1\">Technically Inaccurate or Altogether Wrong Answers</a></li>\n</ul>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-06-25T12:04:44.637","CommentCount":"6"},{"Id":"2541","PostTypeId":"2","ParentId":"2537","CreationDate":"2015-06-25T13:37:37.360","Score":"12","Body":"<p>In a nutshell - here are some statements that I hope are fact based and hard to dispute for anyone:</p>\n\n<ul>\n<li>We <em>don't police</em> agreements/NDA - we <strong>do strive to produce great answers</strong> to specific questions. The \"NDA situation\" is complicated (and there are 4 different versions of the NDA that I've seen or believe to exist). We will lose some people and we won't get all the questions we might if there were no NDA, but there still are formal NDAs covering the beta software that Apple is providing. We should acknowledge that clearly since some questions will inevitably breach someone's NDA.</li>\n<li>The history of Ask Different comes from the Trilogy (<a href=\"https://stackoverflow.com\">SO</a>/<a href=\"https://superuser.com\">SU</a>/<a href=\"https://serverfault.com\">SF</a>) and inherited specific close reasons designed for those sites and those times - <a href=\"https://meta.stackexchange.com/questions/4818/what-questions-should-be-closed-with-reason-too-localized\">closing questions solely because they are too narrow</a> is <a href=\"https://meta.stackexchange.com/questions/184154/closing-changes-on-hold-unclear-too-broad-opinion-based-off-topic-reasons\">no longer appropriate here (or there)</a></li>\n<li>Apple is certainly changing quite rapidly in therms of enrolling thousands and millions of people in their beta programs - this mitigates the main complaint I see against beta questions which is not having enough expertise to get useful or constructive answers. Yes, some people are signing NDA - but all of those NDA are time limited and covering less and less of the product as Apple publicly hours and hours of detailed video as well as <a href=\"https://forums.developer.apple.com/thread/6876#16139\" rel=\"nofollow noreferrer\">publicly opened their extensive developer discussions</a> to the public at large.</li>\n<li>Apple forums don't exist for all beta users (just for invited seed participants and paid developers), and we don't close shop on Q/A just because <a href=\"https://discussions.apple.com/welcome\" rel=\"nofollow noreferrer\">Apple Discussions</a> also exists for user questions and answers. </li>\n<li>Apple Developer forums are now publicly readable just like the WWDC videos and developer documentation, so in effect, anything posted on these sites is \"published\" directly by Apple and that could weaken NDA claims on content hosted there in the open.</li>\n</ul>\n\n<p>Specifically, Ask Different's active users have had two years of experience with letting extremely narrow, unlikely to be widely applicable questions be asked and I feel the site is better for them. </p>\n\n<hr>\n\n<p>Now for <em>my opinions about the above facts</em> in relation to how I see the site growing and adapting to Apple and to the users of this site's needs today and going forward.</p>\n\n<p>I don't see any harm if people ask a question like <strong>In beta build 15A204h of 10.11 I can't log into FaceTime and don't know which error log to look</strong> or <strong>Is there a way to figure out why this specific app won't run under gatekeeper on beta build 15A204h?</strong></p>\n\n<p>I would like to be able to keep questions like the following open as Apple has thoroughly documented how the beta software works and/or intends to work which makes it concrete, shipping (for some) and answerable without regard to violating an NDA should one even exist between Apple and the OP/Answerers.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/193368/\">What is the &quot;rootless&quot; feature in El Capitan, really?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/191421/\">Can I make my own kernel extensions on El Capitan?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/190855/\">OS X El Capitan find mouse dosen&#39;t work with external mouse</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/190826/\">How do I use Split View in OS X 10.11 El Capitan?</a></li>\n</ul>\n\n<p>All of the above are answerable, clear, useful IMO.</p>\n\n<p>We have all the close reasons to handle vague questions, too broad questions, and basic customer support questions for beta builds as well as we do for normal builds. Adding beta to a bad question still means we will close it with prejudice. However, I believe the quality of questions on the site will rise if we make this change since we are selecting for the most active users of Apple products. I welcome people asking about OS 9 and older technology and want to also welcome people that have legitimate questions about using any Apple product or service. Full stop.</p>\n\n<p>There clearly will be people uncomfortable with potentially violating their NDA and we will probably lose their input, but Apple is clearly putting their beta software in very wide audience. To wit, <a href=\"https://www.apple.com/iwork-for-icloud/\" rel=\"nofollow noreferrer\">Apple's iWork for iCloud</a> is in beta and has been so since June 2013. <strong>We should allow questions on software that people use, and people are using Apple's beta software widely.</strong> No NDA or paid developer account is needed to download Xcode 7, iWork in iCloud, or view any of the WWDC videos from this year. Yes, some people will participate in the <a href=\"https://appleseed.apple.com/sp/welcome\" rel=\"nofollow noreferrer\">iOS and OS X AppleSeed customer seeding</a> or the <a href=\"https://beta.apple.com/sp/betaprogram/welcome\" rel=\"nofollow noreferrer\">Apple Beta Software Program</a> beta seeding program or the <a href=\"https://developer.apple.com/programs/\" rel=\"nofollow noreferrer\">Apple Developer Program</a> and be encumbered with those agreements between them and Apple.</p>\n\n<blockquote>\n  <p><strong>Is the public beta software confidential?</strong> Yes, the public beta software is Apple confidential information. Don’t install the public\n  beta software on any systems you don't directly control or that you\n  share with others. Don’t blog, post screen shots, tweet, or publicly\n  post information about the public beta software, and don't discuss the\n  public beta software with or demonstrate it to others who are not in\n  the Apple Beta Software Program. If Apple has publicly disclosed\n  technical information about the public beta software, it is no longer\n  considered confidential.</p>\n</blockquote>\n\n<p>So, participants should be totally in the clear if they are only discussing what Apple has publicly disclosed. Yes, people may find it harder to keep track of what is confidential and not - so each person will have to make a choice if they can keep track of things or just want to walk out of the room if they are uncomfortable with the topics being discussed like any adult should always feel empowered to do.</p>\n\n<p>Also, since we have tags and search terms to help us find beta software and flags for people to alert moderators - we can use the typical post notices to ask people to document their words with a public link or face removal.</p>\n\n<p>Also, I'm still going to be voting to close questions about \"future\" betas, or \"future OS\" as described well in these two answers</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/a/1115/\">Questions about OS X before it is released to the general public?</a></li>\n<li><a href=\"https://apple.meta.stackexchange.com/a/1332/\">Can I ask about not-yet-publicly released OS?</a></li>\n</ul>\n\n<p>Note that the problems with speculative questions (Will the final version do X, When will Apple do Y, Will this bug get fixed) are not unique to betas therefore allowing good beta questions will not allow bad questions (beta or not) in on this specific coat tail.</p>\n\n<p>I look forward to hearing from any community organizers, interested parties, or past/present moderators if they see any issues with my listing of \"facts\" as well as my opinions expressed here in favor of \"lifting the ban\" on beta posts pretty much immediately. I would expect us to all monitor things until later this fall fall to see whether we were too hasty or if this change fits in with both Apple in 2015 and our community of users in 2015.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-07-13T20:06:11.720","CommentCount":"5"},{"Id":"2542","PostTypeId":"1","CreationDate":"2015-06-26T23:17:29.717","Score":"3","ViewCount":"67","Body":"<p>I was thinking how it would be nice if syntax highlighting for AppleScript used in code blocks was a little more appropriate. AppleScript is the primary language posted on this site, and so, by default, it would make sense to have its highlighting a little more tailored to the language. Probably taking cues from Script Editor would make sense.</p>\n","OwnerUserId":"119675","LastEditorUserId":"37797","LastEditDate":"2015-06-27T20:53:41.307","LastActivityDate":"2015-06-27T20:53:41.307","Title":"Better Syntax Highlighting for AppleScript","Tags":"<feature-request><formatting>","AnswerCount":"0","CommentCount":"0"},{"Id":"2543","PostTypeId":"1","CreationDate":"2015-06-27T11:49:58.140","Score":"5","ViewCount":"30","Body":"<p>Upon reaching this new question, <a href=\"https://apple.stackexchange.com/questions/193199/what-actions-can-be-taken-with-lost-and-locked-phone\">\"What actions can be taken with lost and locked phone?\"</a> I followed the duplicate question link to <a href=\"https://apple.stackexchange.com/questions/7837/lost-iphone-what-action-to-take\">\"Lost iPhone, what action to take?\"</a> and read the answer and followed the links.</p>\n\n<p>What? Really?  the answer is 4 years old, uses out of date terminology, has a broken apple link, and mobileMe links (that do forward to iCloud.com at least).</p>\n","OwnerUserId":"86317","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-06-27T11:49:58.140","Title":"There must be a better old question for \"I lost my iPhone, now what do I do?\"","Tags":"<discussion>","AnswerCount":"0","CommentCount":"1"},{"Id":"2544","PostTypeId":"1","AcceptedAnswerId":"2545","CreationDate":"2015-06-27T16:49:29.913","Score":"4","ViewCount":"89","Body":"<p>Question pretty much says it all - I was sure there used to be a close reason of 'not about Apple hardware or software'</p>\n\n<p>Am I going completely barmy, or did it vanish in the recent rejig, same time as 'Basic Support' was added to the list?</p>\n","OwnerUserId":"85275","LastActivityDate":"2015-06-28T20:03:58.850","Title":"What happened to '…not about Apple hardware or software' as a Close reason?","Tags":"<discussion><close-reasons>","AnswerCount":"2","CommentCount":"0"},{"Id":"2545","PostTypeId":"2","ParentId":"2544","CreationDate":"2015-06-27T16:55:10.527","Score":"6","Body":"<p>We can only have 4 close reason choices and we opted to drop that one in favour the new customer support reason. You can still use \"Other...\" I believe and enter the text there.</p>\n","OwnerUserId":"292","LastActivityDate":"2015-06-27T16:55:10.527","CommentCount":"7"},{"Id":"2546","PostTypeId":"1","AcceptedAnswerId":"2548","CreationDate":"2015-06-27T19:12:24.517","Score":"3","ViewCount":"41","Body":"<p>I know this might seem like a dumb question, but how should we handle users asking for more detail (e.g. run this command and tell me the output)? Putting it as an answer doesn't really count as an answer. For instance, on Apple Support Communities, there is no real \"answer\" and \"comment\" format, there's just text bubbles, like in <a href=\"https://discussions.apple.com/message/25180415#25180415\" rel=\"nofollow\">this thread</a>. How should we at Stack Exchange handle this with the format of \"question\", \"answer\", and \"comment\"?</p>\n","OwnerUserId":"67206","LastActivityDate":"2015-06-27T20:46:07.577","Title":"Asking for more detail","Tags":"<discussion>","AnswerCount":"2","CommentCount":"0"},{"Id":"2547","PostTypeId":"2","ParentId":"2546","CreationDate":"2015-06-27T20:35:58.337","Score":"5","Body":"<p>Answers always need to provide an answer to the problem stated in the question, everything else carries a high risk of getting flagged and deleted. </p>\n\n<p>Follow-ups and clarifications should be asked in comments to the respective post.</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-06-27T20:35:58.337","CommentCount":"0"},{"Id":"2548","PostTypeId":"2","ParentId":"2546","CreationDate":"2015-06-27T20:46:07.577","Score":"7","Body":"<p>Anything which requires a follow-up from the original poster of the question almost certainly isn't an answer. For example, asking the user to run a command to provide further information such as <code>diskutil list</code> and post the output shouldn't be an answer as this is a troubleshooting step which would help understand and isolate the problem in the question. This kind of request should be a comment and the result of the command should be edited in to the original question.</p>\n\n<p>Answers which ask for clarification from the original poster of the question through adding an answer should be down voted, flagged as 'not an answer' using the flag link below the post (and a vote to delete cast once you have that privilege).</p>\n\n<p><strong>Stack Exchange is not a forum</strong> and discussion is limited (outside of chat). Questions should be self-contained posts which contain sufficient information to be able to answer without much speculation (or should be closed as too broad). Brief requests for clarification should be made using the comments system, and further collaboration in chat. Apple Support Discussions is, by definition, a discussions forum and allows discussions. This is contrary to Stack Exchange and not something that is attempted to be emulated with Stack Exchange.</p>\n","OwnerUserId":"37797","LastActivityDate":"2015-06-27T20:46:07.577","CommentCount":"0"},{"Id":"2549","PostTypeId":"2","ParentId":"2544","CreationDate":"2015-06-28T20:03:58.850","Score":"2","Body":"<p>Also. Too broad or unclear often apply when someone asks what seems to be a PC or android question. Once you close it as unclear, it can quickly be deleted or edited if there is some relation to Apple products. </p>\n","OwnerUserId":"5472","LastActivityDate":"2015-06-28T20:03:58.850","CommentCount":"0"},{"Id":"2550","PostTypeId":"1","AcceptedAnswerId":"2551","CreationDate":"2015-06-30T21:21:06.600","Score":"8","ViewCount":"78","Body":"<p>I've seen this comment by <a href=\"https://apple.stackexchange.com/users/85275/tetsujin\">Tetsujin</a> on non-answers and rants:</p>\n\n<blockquote>\n  <p>Welcome to Ask Different! This does not provide an answer to the\n  question. To critique or request clarification from an author, leave a\n  comment below their post once you have sufficient <a href=\"https://apple.stackexchange.com/help/whats-reputation\">reputation</a>. If you\n  have a new question, please ask it by clicking the <a href=\"https://apple.stackexchange.com/questions/ask\">Ask Question</a>\n  button. Include a link to this question if it helps provide context.</p>\n</blockquote>\n\n<p>and I thought it was great and copied it to some first posts I was reviewing –I even added markdown links for them to work when pasted to the comment box. </p>\n\n<p>Is that ok? Should I credit <a href=\"https://apple.stackexchange.com/users/85275/tetsujin\">Tetsujin</a>? Are there canned responses available to higher rep users that are not available to me (~750)?</p>\n","OwnerUserId":"38539","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-06-30T21:29:27.727","Title":"Is it ok to \"reuse\" or plagiarize comments when reviewing first questions?","Tags":"<discussion><comments><review-page>","AnswerCount":"1","CommentCount":"8","FavoriteCount":"1"},{"Id":"2551","PostTypeId":"2","ParentId":"2550","CreationDate":"2015-06-30T21:29:27.727","Score":"6","Body":"<p>You can always ask the author in [chat] or officially here on meta like you did. I can't see anyone getting too worked up if you are using a comment for kind, critical feedback to a poster.</p>\n\n<p>The text you selected is a canned response in the <a href=\"https://apple.stackexchange.com/review\">/review queue</a> that you'll earn once you reach that <a href=\"https://apple.stackexchange.com/help/privileges\">reputation milestone</a>.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-06-30T21:29:27.727","CommentCount":"1"},{"Id":"2552","PostTypeId":"2","ParentId":"2539","CreationDate":"2015-07-03T01:42:53.053","Score":"7","Body":"<p>TL;DR: In my opinion, you were not wrong to flag the comment.</p>\n\n<hr>\n\n<p>I hear and sympathize with what the moderators are saying, but I want to share a slightly different perspective.</p>\n\n<p>The party line is that it's not ♦-moderators' job to verify the correctness of an answer.  I find that entirely valid.</p>\n\n<p>However, I think there's another reason why flagging these kinds of answers as VLQ can be useful.  Flagging as VLQ has another purpose that ♦-moderators might not be familiar with: it puts it in a low-quality review queue, which 10K users can view.  Thus, flagging as VLQ is one way to bring the answer to the attention of other 10K users, who can then downvote it and vote to delete.  Recall that deleting an answer requires multiple \"delete\" votes from 10K users.</p>\n\n<p>Thus, if we want ordinary users to clean up the site, the challenge with doing that is coordination: we need a way to notify multiple 10K users about the answer, so they can take a look, see if they agree, and if they do, vote to delete.  Right now, flagging as VLQ or NAA is one of the few ways to do that, and arguably the best way to do so.</p>\n\n<p>So, flagging as VLQ serves two purposes: (1) to notify ♦-moderators, and (2) to notify 10K users.  I can sympathize with ♦-moderators who don't want to be put in a position of being asked to judge the technical accuracy of answers and who feel this is best left up to the community.  However, I think there's a case to be made for encouraging \"flag-as-VLQ\" in this kind of case, because it allows 10K users (regular users) to police the site -- flag-as-VLQ + the VLQ review queue is one of the best tools the community has to police this on their own, without bringing in ♦-moderators.</p>\n\n<p>Therefore, in this kind of situation, there might be a case for having ♦-moderators leave the VLQ flag live and letting 10K users handle it as they see fit.</p>\n\n<hr>\n\n<p>I'll also point out that the text under the VLQ flag says:</p>\n\n<blockquote>\n  <p>This answer has severe formatting or content problems. This answer is unlikely to be salvageable through editing, and might need to be removed. </p>\n</blockquote>\n\n<p>I think that does accurately characterize this answer: the answer is unlikely to be salvageable through editing, and probably needs to be removed.  Therefore, I think the VLQ flag was appropriate, and I'm not sure it should have been declined.</p>\n\n<hr>\n\n<p>In your specific case, I think it would also have been reasonable to flag the answer as NAA (not an answer).  The \"answer\" doesn't even attempt to answer the question -- it consists of disjointed statements, none of which answer the question (as <a href=\"https://apple.meta.stackexchange.com/questions/2539/conspiracy-theory-answer-flagged-disputed#comment5740_2540\">you've already accurately analyzed</a>).  As an aside: Ideally, when you flag as NAA, it's helpful to leave a comment explaining why, so that when moderators or 10K users see the flag, they have some justification for why it was flagged, and also so that the user has a chance to understand why their answer was unsuitable and either edit it or do things differently in the future.</p>\n\n<p>So, in this case, I personally feel like both a NAA flag and a VLQ flag are justified.  To me, it feels like there are multiple reasons why this answer should be deleted: both because it doesn't attempt to answer the question, and because it has severe content problems and probably can't be salvaged through editing.</p>\n\n<p>So, ultimately, I'm very sympathetic to you: I don't think you were wrong to flag the comment, and I probably would have flagged it, too, if I'd come across it.</p>\n","OwnerUserId":"24154","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.967","LastActivityDate":"2015-07-03T01:49:00.053","CommentCount":"1"},{"Id":"2553","PostTypeId":"1","AcceptedAnswerId":"2554","CreationDate":"2015-07-04T09:41:03.017","Score":"5","ViewCount":"54","Body":"<p>I'm a reasonably seasoned user over on on Stack Overflow, so I know a single downvote is no big deal, and people can vote however they like and have no obligation to explain why; that's fine. But I'm a relative novice on Ask Different.</p>\n\n<p>With that in mind, having put quite a lot of effort into a question here, I was quite surprised to see it downvoted, and so I wonder if I'm missing something about what's on-topic/expected here.</p>\n\n<p>Am I? Could I improve the question to make it more appropriate? Or should I remove it as off-topic?</p>\n\n<p>The question: <a href=\"https://apple.stackexchange.com/questions/194347\">When I click and delete a message, how does Mail.app decide which to select next?</a></p>\n","OwnerUserId":"51900","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-07-04T17:17:43.440","Title":"Why was this question downvoted?","Tags":"<support><questions><site-scope>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"2554","PostTypeId":"2","ParentId":"2553","CreationDate":"2015-07-04T11:47:22.387","Score":"6","Body":"<p>It's a perfectly fine question in my opinion. It's definitely on-topic and you've covered all the points necessary for a question, even including screenshots to help understand what you're explaining.</p>\n\n<p>The only reason I can think for an explanation for the downvote is that some users regard questions asking why Apple has done what they have done can only be answered by Apple themselves, and therefore is not appropriate for a site for Apple users.</p>\n\n<p>That's of course presuming that the downvote was of 'good intention'. Other causes vary in possibility, from a downvote in 'spite' from the user who's answer you stated didn't answer the question, to someone mis-clicking. Not to mention the random <a href=\"http://chat.stackexchange.com/transcript/message/22549890#22549890\">downvote sprees</a>.</p>\n\n<p>Don't worry about a single random downvote—the net score is still positive.</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2015-07-04T12:02:11.103","LastActivityDate":"2015-07-04T12:02:11.103","CommentCount":"4"},{"Id":"2556","PostTypeId":"2","ParentId":"2539","CreationDate":"2015-07-05T10:15:42.937","Score":"1","Body":"<p><strong>TL:DR - this is actually Not an Answer…</strong></p>\n\n<p>I only learned today from the other answers &amp; comments how part of the review queue system works, so this is based on that revelation.</p>\n\n<p>I often find the NAA flag 'difficult'. I see a new post, it's clearly not an answer, but it's not in the VLQ queue, so there's no vote to close option.</p>\n\n<p>So, I stick a canned response on it &amp; hit NAA… which means a mod has to deal with it.  </p>\n\n<p>Kind of unfair on the mods, really. Even a truly obvious one takes some time &amp; attention to process.</p>\n\n<p>Based on other answers, it would seem that flagging it as VLQ would allow the 10k users to handle it &amp; leave the mods to deal with more serious issues.</p>\n\n<p>So - &amp; this is the part where it really becomes a new question, but it does feel relevant as part of this thread - would it be better policy for Reviewers to aim more frequently at VLQ than NAA, freeing up Mods' time to do other things?</p>\n\n<p>Case in point - <a href=\"https://apple.stackexchange.com/questions/193816/why-is-an-album-in-apple-music-marked-with-an-e-and-grayed-out/194519#194519\">Why is an album in Apple Music marked with an &quot;E&quot; and grayed out?</a> which I flagged as NAA.<br>\nWhat's the consensus on flagging these as VLQ &amp; letting the 10k deal with them instead?</p>\n\n<p>Let me know if you feel I should move this to a new Question.</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-07-05T10:15:42.937","CommentCount":"1"},{"Id":"2557","PostTypeId":"1","CreationDate":"2015-07-08T20:08:18.883","Score":"5","ViewCount":"33","Body":"<p>Once in a blue moon there is a good question in the Low Quality Posts moderation queue. Why can't I upvote them without opening the question in a new tab? Am I just missing something? It seems like on this site especially we need to be encouraging MORE upvotes, not making them difficult.</p>\n","OwnerUserId":"70930","LastEditorUserId":"9058","LastEditDate":"2015-07-08T20:20:07.823","LastActivityDate":"2015-07-09T10:19:40.457","Title":"Why can't I upvote a post from the Low Quality Posts moderation queue?","Tags":"<discussion><feature-request>","AnswerCount":"1","CommentCount":"2"},{"Id":"2558","PostTypeId":"2","ParentId":"2557","CreationDate":"2015-07-09T10:19:40.457","Score":"3","Body":"<p>This gives preferential treatment to good, short posts by giving them more exposure, which would introduce extra voting on shorter posts, encouraging users to post shorter posts so that they are upvoted in the queue.</p>\n\n<p>I don't think this is something that should be implemented.</p>\n","OwnerUserId":"37797","LastActivityDate":"2015-07-09T10:19:40.457","CommentCount":"0"},{"Id":"2559","PostTypeId":"1","CreationDate":"2015-07-09T11:06:21.417","Score":"-1","ViewCount":"261","Body":"<p>My question to improve: <a href=\"https://apple.stackexchange.com/questions/194934/how-to-check-if-the-screen-replacement-part-for-iphone-5s-is-an-original-one\">How to check if the screen replacement part for iPhone 5s is an original one?</a></p>\n\n<hr>\n\n<p>Some clarifications on questions from bmike:</p>\n\n<blockquote>\n  <p>Are you looking for knowledge? If so, remove price</p>\n</blockquote>\n\n<p>What's wrong with the price? It gives background for my question: official services can only help with providing a complete replacement for x3-x4 of display replacement by an unofficial repair service. That's why I can only consider unofficial repair shops.</p>\n\n<blockquote>\n  <p>remove the part about how you want to be sure that one specific repair shop uses parts that you feel are \"genuine\".</p>\n</blockquote>\n\n<p>Again, it's only here for providing a context. I don't mind removing it entirely, but why it improves the question?</p>\n\n<blockquote>\n  <p>It seems you need to: a) write a written contract requiring the vendor to use \"official\" parts b) demand documentation of that before paying</p>\n</blockquote>\n\n<p>We need to assume that contract just won't solve my problem, for whatever reasons. How can we limit the scope of question to \"how can I check whether the display is genuine\", no matter how I get that display into my iPhone?</p>\n\n<blockquote>\n  <p>What does <a href=\"https://locate.apple.com\" rel=\"nofollow noreferrer\">https://locate.apple.com</a> list for options?</p>\n</blockquote>\n\n<p>It lists only authorized services which don't help, as I specified in the very beginning of the post: they can only replace the entire device. </p>\n\n<blockquote>\n  <p>How much is a repair part? You can get quotes for parts to be mailed to you for Apple parts. If you did that work, please document it in the question as it removes the \"opinion\" of too costly</p>\n</blockquote>\n\n<p>I don't understand this piece. First, I'm not buying a part, I need a repair to be done--which includes that the repair shop provides the display part. Then, Apple doesn't sell its genuine parts to end-users, nor officialy does any third party AFAIK.</p>\n\n<blockquote>\n  <p>Off site resources is \"locating repair parts\".</p>\n</blockquote>\n\n<p>I'm not about to buy a replacement part, see above.</p>\n\n<blockquote>\n  <p>justify what you feel is \"genuine\" in the post.\n  I already detailed that: \"made by Apple (no matter new or extracted from a used phone) rather than a third-party replica\" (removed \"as\" which could be a reason for confusion)</p>\n  \n  <p>Show your research. Can you buy parts from Apple Authorized Service providers?</p>\n</blockquote>\n\n<p>What should I do to satisfy this?</p>\n\n<blockquote>\n  <p>Are you willing / able to open and measure the device?\n  State that explicitly in the question.</p>\n</blockquote>\n\n<p>Should I state every possible check as \"allowed\"? If not, why specifically \"open and measure\"?</p>\n\n<blockquote>\n  <p>you say \"as official ones don't provide screen replacement in my region\"\n  document that</p>\n</blockquote>\n\n<p>What should I do to satisfy this?</p>\n\n<blockquote>\n  <p>When you go to locate.apple.com - list the cost and options you are presented.</p>\n</blockquote>\n\n<p>There's no cost and options, only a list of authorized services. Each of those tells the same story: \"only replacement of entire device\". Are you asking for proof-links to non-English web sites for that? (as I live in Russia)</p>\n\n<blockquote>\n  <p>You instead voice an opinion \"don't provide\" - my guess is they do provide parts and there is a specific cost for them</p>\n</blockquote>\n\n<p>See above.</p>\n\n<blockquote>\n  <p>What does the last sentence and the two youtube videos mean?\n  And does criteria for iPhone 5 fully apply to 5S (eg. 1, 2)?\n  That's far too broad IMO.</p>\n</blockquote>\n\n<p>I provide two examples (youtube links) of genuiness check for iPhone 5. If (for example) 5 and 5S have completely identical genuine parts, tips for 5 work for 5S. If not, they don't--that easy.</p>\n","OwnerUserId":"54644","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-08-09T02:27:51.720","Title":"How can I make my question comply to all Ask Different guidelines?","Tags":"<discussion><support><site-scope><guideline>","AnswerCount":"2","CommentCount":"21"},{"Id":"2560","PostTypeId":"2","ParentId":"2559","CreationDate":"2015-07-09T13:12:17.687","Score":"0","Body":"<p>It looks good to me now. It is asking how you can check that a replicament part is genuine.</p>\n\n<p>I can see not way in that this is for Customer support. Actually having seen a few closed under that I wonder if the wording of the close reason is wrong. Asking for off site resources should be off topic - why is Customer support even asked for?</p>\n","OwnerUserId":"237","LastActivityDate":"2015-07-09T13:12:17.687","CommentCount":"2"},{"Id":"2561","PostTypeId":"2","ParentId":"2559","CreationDate":"2015-07-09T15:48:13.817","Score":"2","Body":"<p>The reopening process is covered in detail at: </p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/help/reopen-questions\">https://apple.stackexchange.com/help/reopen-questions</a></li>\n</ul>\n\n<p>You will need to edit the question for me to cast a reopen vote.</p>\n\n<p>My suggestion is to think about these issues:</p>\n\n<ol>\n<li><p>Are you looking for knowledge? If so, remove price and the part about how you want to be sure that one specific repair shop uses parts that you feel are \"genuine\".</p></li>\n<li><p>Are you asking to learn how Apple sources repair parts?</p></li>\n</ol>\n\n<p>As it stands, it's about you interacting with an un-named repair shop that isn't authorized by Apple.  </p>\n\n<p>It seems you need to:</p>\n\n<p>a) write a written contract requiring the vendor to use \"official\" parts\nb) demand documentation of that before paying</p>\n\n<p>It's not clear if you've done any research. What does <a href=\"https://locate.apple.com\" rel=\"nofollow noreferrer\">https://locate.apple.com</a> list for options? How much is a repair part? You can get quotes for parts to be mailed to you for Apple parts. If you did that work, please document it in the question as it removes the \"opinion\" of too costly. Facts can't be mis-interpreted but without documenting what you are really trying to do - this question, <em>in my opinion</em> will get all sorts of bad answers. The answerer can't guess from all the options you might need help. Lastly, you have an answer, so the need to open it for more answers is less dire IMO. Anyone that knows more than the answerer can edit to improve the post.</p>\n\n<p>As it stands, the question has several issues:</p>\n\n<ol>\n<li>Too broad - iPhone 5 and iPhone 5s are lumped together.</li>\n<li>Too vague - you don't show your research and instead ask for opinion. (linking to two youtube videos isn't the sort of research that works here - you should summarize the key facts you wish to discuss from a video and keep the link for background).</li>\n</ol>\n\n<p>TL;DR - put some effort into editing it or at least cut it down to one specific model. 5s or 5</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-07-10T02:06:24.017","CommentCount":"2"},{"Id":"2562","PostTypeId":"2","ParentId":"1712","CreationDate":"2015-07-13T07:08:14.060","Score":"4","Body":"<p>To complement answers <a href=\"https://apple.meta.stackexchange.com/a/1713/8546\">1</a> and <a href=\"https://apple.meta.stackexchange.com/a/1714/8546\">2</a> …</p>\n\n<h2>Apple Developer Forums</h2>\n\n<p>In the pre-release area, at least some of Apple's spaces are <strong>visible to the public</strong>. At the time of writing, three:</p>\n\n<ul>\n<li><a href=\"https://forums.developer.apple.com/community/pre-release/ios-9-beta\" rel=\"nofollow noreferrer\">iOS 9 beta</a></li>\n<li><a href=\"https://forums.developer.apple.com/community/pre-release/os-x-1011-beta\" rel=\"nofollow noreferrer\">OS X 10.11 beta</a></li>\n<li><a href=\"https://forums.developer.apple.com/community/pre-release/watchos-2-beta\" rel=\"nofollow noreferrer\">watchOS 2 beta</a>.</li>\n</ul>\n\n<h3>Side notes</h3>\n\n<p>This is <strong>not</strong> an encouragement to have Apple Developer Forums misused for discussions that are not developer-oriented. Neither is this an attempt to alter opinions on what's acceptable within Stack Exchange. </p>\n\n<p>This observational answer is, essentially, a hint that <strong>answers to some questions may be already public within the apple.com domain</strong>. This aspect of Apple's recent shift towards openness may seem inconsistent with <a href=\"http://web.archive.org/web/20150713063727/https://developer.apple.com/support/forums/\" rel=\"nofollow noreferrer\">Apple's guidelines for Apple Developer Forums</a>, in particular –</p>\n\n<ul>\n<li><em>only discuss seeds in the confidential forums</em></li>\n</ul>\n\n<p>– however I'm reasonably certain that public discussion of seeds is no mistake. <a href=\"https://forums.developer.apple.com/message/10442#10442\" rel=\"nofollow noreferrer\">https://forums.developer.apple.com/message/10442#10442</a> from me was approved by moderators, and draws attention to Google indexing what's published. Also I received a next-day response, from Apple, to the contact that I made on 2015-06-10:  </p>\n\n<p><img src=\"https://i.stack.imgur.com/ia51y.png\" alt=\"screen shot of the access issue that I reported to Apple on 10th June 2015\"></p>\n\n<p>Also, in MacRumors Forums: <a href=\"http://forums.macrumors.com/threads/1891443/\" rel=\"nofollow noreferrer\">Membership-free, limited public access to Apple Developer Forums content</a> (<a href=\"http://web.archive.org/web/20150713063608/http://forums.macrumors.com/threads/membership-free-limited-public-access-to-apple-developer-forums-content.1891443/\" rel=\"nofollow noreferrer\">captured</a>).</p>\n","OwnerUserId":"8546","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-07-13T07:08:14.060","CommentCount":"1","CommunityOwnedDate":"2015-07-13T07:08:14.060"},{"Id":"2563","PostTypeId":"1","CreationDate":"2015-07-13T08:38:17.803","Score":"5","ViewCount":"48","Body":"<p>Regarding <a href=\"https://apple.meta.stackexchange.com/questions/90/list-of-x-poll-style-questions-what-to-do?lq=1\">List of X/Poll Style Questions - What to do?</a> and <a href=\"https://apple.meta.stackexchange.com/questions/1555/re-evaluating-list-of-tips-type-questions\">Re-evaluating &quot;list of tips&quot; type questions</a> </p>\n\n<p>I occasionally find some of these old list questions, as new answers lift them into the Review queue. There's nothing wrong with them inherently, &amp; the 'list' aspect is well dealt with in the two links, above.</p>\n\n<p>This one cropped up today - <a href=\"https://apple.stackexchange.com/questions/30868/best-webcam-to-use-with-skype-and-a-mac-mini\">Best webcam to use with Skype and a Mac mini?</a><br>\nThe new answer was OK-ish, so I let it ride, but it raised the question…</p>\n\n<p>Should we flag these for Protection if the mere fact of them bumping to the top of the Active list is likely to attract a flurry of similar answers?<br>\nOr should we wait for the potential flurry to start, then retrospectively trim?</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-07-13T17:25:57.153","Title":"Old List questions, rediscovered","Tags":"<discussion><policy>","AnswerCount":"2","CommentCount":"0"},{"Id":"2564","PostTypeId":"2","ParentId":"2563","CreationDate":"2015-07-13T09:36:23.207","Score":"3","Body":"<p>Vote to close as primarily opinion based. The questions are no longer on-topic and within the scope of the site, and therefore should be closed.</p>\n\n<p>If an answer causes an immediate increase in frequency of lower-quality answers and/or spam, protect it once you gain the privilege, but a VTC should be enough for most questions.</p>\n","OwnerUserId":"37797","LastActivityDate":"2015-07-13T09:36:23.207","CommentCount":"0"},{"Id":"2565","PostTypeId":"2","ParentId":"2563","CreationDate":"2015-07-13T17:25:57.153","Score":"2","Body":"<p>I feel we should treat each question that gets bumped as if it were asked today.</p>\n\n<ul>\n<li>Closing prevents more new answers and can be easily overturned. Flagging might help if there's something bad, but the normal close review process should handle these.</li>\n<li>Flag closed questions for protection if you see one instance of bad things happening recently. (or if the item bumping it is flag worthy)</li>\n</ul>\n\n<p>Delete might be strong, but leaving old crusty questions open doesn't help the site move forward IMO. I don't seek them out to close, but when they are presented to me in review or seeing them on the hot lists or the active lists, I generally move them one step closer to the grave if they are not awesome or in need of new answers.</p>\n\n<p>Basically, if you can't edit it into shape or feel that it needs a bounty to attract attention - close it if it's not on topic or violates any of the current close reasons:</p>\n\n<ul>\n<li>Basic Customer Support</li>\n<li>Basic Troubleshooting</li>\n<li>Asking for Off-Site resource</li>\n<li>Too Broad</li>\n<li>Too Unclear</li>\n</ul>\n","OwnerUserId":"5472","LastActivityDate":"2015-07-13T17:25:57.153","CommentCount":"0"},{"Id":"2566","PostTypeId":"2","ParentId":"2537","CreationDate":"2015-07-13T17:32:15.167","Score":"2","Body":"<h1>No - we should not change the site scope.</h1>\n\n<p>iOS 9 and 10.11 should be off-topic as we have done in the past until they are fully released to the public.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-07-13T17:32:15.167","CommentCount":"4"},{"Id":"2567","PostTypeId":"2","ParentId":"2537","CreationDate":"2015-07-13T17:34:05.947","Score":"4","Body":"<h1>Yes - change site scope to allow iOS 9 and 10.11 El Capitan questions during their beta release cycle.</h1>\n\n<p>Since this is a change from the past, this is a temporary change and we will gather on meta after both ship (or sooner if bad things happen) to revisit this change.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-07-13T17:34:05.947","CommentCount":"0"},{"Id":"2568","PostTypeId":"1","CreationDate":"2015-07-14T00:32:43.413","Score":"3","ViewCount":"85","Body":"<p>I know, I know... This probably looks like another idiot complaining that the <em>beta</em> of all things is buggy. I know right? <em>ZOMG WHATS THE POINT OF A BUGGY BETA??!?!?</em> </p>\n\n<p>(╯°□°）╯︵ ┻━┻</p>\n\n<p>(╯°□°）╯︵ ┻━┻</p>\n\n<p>(╯°□°）╯︵ ┻━┻</p>\n\n<p>But, I think this is a worthy question. And besides, I am pretty convinced it's not a bug. No, I am positive. I use an iPod Touch fifth generation, and am painfully aware of how ancient the processor is. I downloaded the iOS 9 public beta the other day, because after all, I had nothing to lose if the iPod 6 is coming tomorrow And it has gone surprisingly well! But I noticed that some of the features they advertise for iOS 9 are not there. Like the Smart Search thingy when you swipe right on the first page of the home screen. And also, I don't know if this is supposed to be a iPhone 6 only feature, but I am missing the Low Power Mode switch in settings. </p>\n\n<p>I don't know if these features are supposed to be released later in a future beta release, if it's a problem with my A5 processor, or if I missed the memo on some information that would be fun to have at the moment. But I've held of from providing Apple with feedback yet, because I am pretty sure it's my fault somewhere or another... Anyway, if you are having a similar experience or have some blindingly obvious information that I overlooked, let me know. Thanks!</p>\n\n<hr>\n\n<p><strong>Ok, hold the iPhone!</strong></p>\n\n<p>Now, I understand why(maybe) my question has received down votes. Because I am discussing software that \"hasn't been released to the public\". However, I disagree. It is, in fact, and say it with me: a <em>public</em> beta. The key word there is <em>public</em>. In case you didn't notice the italic font I used there. Now,  technically, and this article proves it: <a href=\"https://apple.meta.stackexchange.com/questions/1712/are-ios-9-and-os-x-el-capitan-questions-ok?cb=1\">Are iOS 10, macOS 10.12, watchOS 3 or tvOS 10 (beta) questions OK?</a></p>\n\n<p>Look at the excepted answer. What happens next will shock and amaze you. </p>\n\n<blockquote>\n  <p>We do have precedent for allowing questions on software that is released in a beta status so if/when these OS versions get a wider release (perhaps as part of the OS X Beta seed program), we may have to revisit whether to\n  have the policy relaxed with respect to software that is pre-release.</p>\n</blockquote>\n\n<p>That when, Ladies and gentlemen, is NOW. Like it or not.</p>\n","OwnerUserId":"135704","OwnerDisplayName":"oboy","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-07-14T02:12:07.070","Title":"iOS 9 beta: Why are some promised features not in the beta? And: Time to update NDA!","Tags":"<discussion><ios>","AnswerCount":"1","CommentCount":"2","ClosedDate":"2015-07-15T11:49:02.890"},{"Id":"2569","PostTypeId":"2","ParentId":"2568","CreationDate":"2015-07-14T02:12:07.070","Score":"2","Body":"<p>A couple of things </p>\n\n<ul>\n<li>welcome to Ask Different.</li>\n<li>Generally, discussion is OK on meta only - so if you post questions on the main site, don't ask for opinions or experience - narrow down the issue and just assume people with opinions or experience will answer.</li>\n<li>The community will need to have significantly more votes for the \"yes\" answer than the \"no\" answer in <a href=\"https://apple.meta.stackexchange.com/questions/2537/\">Should beta OS questions be on-topic due to NDA changes + widening distribution by Apple</a></li>\n<li>Unless there is a groundswell of yes sentiment, then the status quo of \"close them as they are off-topic\" will continue (see <a href=\"https://apple.meta.stackexchange.com/questions/1712/are-ios-9-and-os-x-el-capitan-questions-ok\">Are iOS 10, macOS 10.12, watchOS 3 or tvOS 10 (beta) questions OK?</a>)</li>\n</ul>\n\n<p>I personally answered the \"yes\" and \"no\" responses, so voting on them is out of my hands. Should I be a tie breaker, I'm likely to fall on \"yes - let's try opening beta software for a trial\" but ideally, the community will vote overwhelmingly for one answer to not need one moderator's tie breaker at all.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-07-14T02:12:07.070","CommentCount":"1"},{"Id":"2570","PostTypeId":"1","CreationDate":"2015-07-15T13:18:37.430","Score":"7","ViewCount":"53","Body":"<p>I was looking at new tags and noticed these ones <a href=\"https://apple.stackexchange.com/questions/tagged/watchos\" class=\"post-tag\" title=\"show questions tagged &#39;watchos&#39;\" rel=\"tag\">watchos</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/watch\" class=\"post-tag\" title=\"show questions tagged &#39;watch&#39;\" rel=\"tag\">watch</a>. I thought there must be one already there and the main entry seems to be <a href=\"https://apple.stackexchange.com/questions/tagged/apple-watch\" class=\"post-tag\" title=\"show questions tagged &#39;apple-watch&#39;\" rel=\"tag\">apple-watch</a> with synonyms including <a href=\"https://apple.stackexchange.com/questions/tagged/watch-os\" class=\"post-tag\" title=\"show questions tagged &#39;watch-os&#39;\" rel=\"tag\">watch-os</a>.</p>\n\n<p>This seems reasonable except for two issues</p>\n\n<ol>\n<li><p>Shouldn't there be a difference tag for the hardware and the OS? I suspect this has been discussed so point me to where.</p></li>\n<li><p>The main point of this post. If you create or edit an entry and start typing a tag watch  ... then  you get no completion and so we will get many new tags here i.e. the  <a href=\"https://apple.stackexchange.com/questions/tagged/watchos\" class=\"post-tag\" title=\"show questions tagged &#39;watchos&#39;\" rel=\"tag\">watchos</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/watch\" class=\"post-tag\" title=\"show questions tagged &#39;watch&#39;\" rel=\"tag\">watch</a> Given the synonyms already here we want <a href=\"https://apple.stackexchange.com/questions/tagged/watch-os\" class=\"post-tag\" title=\"show questions tagged &#39;watch-os&#39;\" rel=\"tag\">watch-os</a> to show in the completions. Why does it not show. If we can't get this bug fixed and we have <a href=\"https://apple.stackexchange.com/questions/tagged/watchos\" class=\"post-tag\" title=\"show questions tagged &#39;watchos&#39;\" rel=\"tag\">watchos</a> added to the synonyms</p></li>\n</ol>\n","OwnerUserId":"237","LastActivityDate":"2015-10-22T18:21:46.127","Title":"Watch OS tags - synonyms and completion","Tags":"<discussion><bug><synonym>","AnswerCount":"1","CommentCount":"0"},{"Id":"2572","PostTypeId":"2","ParentId":"2537","CreationDate":"2015-07-18T15:30:26.760","Score":"3","Body":"<p><H2>Yes - Only if it's a public beta version</H2></p>\n\n<p>We should allow OS X and iOS public beta questions only. This is because ANYONE can install public beta OSes but only developers can install the developer preview.</p>\n","OwnerUserId":"112840","LastActivityDate":"2015-07-18T15:30:26.760","CommentCount":"6"},{"Id":"2573","PostTypeId":"1","AcceptedAnswerId":"2574","CreationDate":"2015-07-20T01:50:36.327","Score":"4","ViewCount":"43","Body":"<p>I have over 22k rep on various SE sites (mainly EE.SE) and received the 100 rep bonus when I came here for the first time and signed in.</p>\n\n<p><img src=\"https://i.stack.imgur.com/aYY8l.png\" alt=\"enter image description here\"></p>\n\n<p>However, I was prevented from answering a <a href=\"https://apple.stackexchange.com/questions/151480/music-files-dont-copy-from-itunes-to-iphone-appear-grey-with-a-dotted-circle?s=2%7C0.9009\">protected question</a> because of insufficient reputation.</p>\n\n<p><img src=\"https://i.stack.imgur.com/aeUOz.png\" alt=\"enter image description here\"></p>\n\n<p>What gives? Since when is 101 less than 10? Is this a bug or by design? If it <em>is</em> by design, admins should update the protection note to clearly say that rep earned elsewhere doesn't count against the restriction.</p>\n\n<p>Tried with two different browsers - same deal.</p>\n","OwnerUserId":"136995","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-07-20T15:01:47.980","Title":"Protected questions not considering +100 bonus rep for linking profile","Tags":"<support><bug><status-bydesign><reputation><protected-questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"2574","PostTypeId":"2","ParentId":"2573","CreationDate":"2015-07-20T07:18:55.227","Score":"5","Body":"<p>This is <a href=\"/questions/tagged/status-bydesign\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;status-bydesign&#39;\" rel=\"tag\">status-bydesign</a>.<br>\nThe association bonus is purposefully removed from the calculation used to determine if you have sufficient reputation to answer a protected question.</p>\n\n<p>To answer a protected question, you must earn 10 reputation specifically on this site, regardless of your reputation elsewhere on Stack Exchange.</p>\n\n<p>There's already a feature request on Meta.SE to <a href=\"https://meta.stackexchange.com/questions/210481/improve-protected-question-message-with-regard-to-rep-gained-through-associati\">change the phrasing of the protected question post notice</a>.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-07-20T07:18:55.227","CommentCount":"1"},{"Id":"2575","PostTypeId":"2","ParentId":"2537","CreationDate":"2015-07-21T15:32:41.607","Score":"-1","Body":"<p>I'm on the Appleseed Beta program, and my Beta software seems to differ from genuine paid developer program software.  So there can easily be questions relating to things like \"Where's the new iCloud Drive app in the Beta?\" by people like me who don't have it, with people answering \"Er, on your home screen\" by people who do etc.  There's precious little parity for many things, so even is we started using a Beta specific tag that we would then use to locate and destroy upon release, it could still cause some wild confusion and speculation.  So I say NO, let's just not cover it.  The Dev program has a free tier with their own discussion boards, and that is the appropriate place.</p>\n\n<p>However, there are time when you can <em>reference</em> a beta, without having is as the primary point of the question.  As an example, a while ago someone asked how to get a WIFI password that had been forgotten from an iPhone.  At the time, the answer was \"You can't\", but a valid answer was also \"You will be able to after the next release of iOS when Keychain will sync to a Mac if you have one and allow you to read it from there\".</p>\n","OwnerUserId":"9495","LastActivityDate":"2015-07-21T15:32:41.607","CommentCount":"1"},{"Id":"2576","PostTypeId":"1","CreationDate":"2015-07-24T15:00:10.003","Score":"7","ViewCount":"185","Body":"<p>I asked this question recently:</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/194038/music-collection-is-not-sorted-by-album-on-ios-8-4\">Music collection is not sorted by Album on iOS 8.4</a></p>\n\n<p>And I noticed that an edit was approved to remove <a href=\"https://apple.stackexchange.com/questions/tagged/music.app\" class=\"post-tag\" title=\"show questions tagged &#39;music.app&#39;\" rel=\"tag\">music.app</a> tag and add <a href=\"https://apple.stackexchange.com/questions/tagged/apple-music\" class=\"post-tag\" title=\"show questions tagged &#39;apple-music&#39;\" rel=\"tag\">apple-music</a> tag.</p>\n\n<p>My question has nothing to do with Apple Music.  Apple Music is a streaming service, where the Music App is what comes pre-installed on Apple Devices.  I was having a playlist issue and that is specific to the Music App.</p>\n\n<p>I don't have enough rep to reject the edit, but I also don't want to just edit again and change the tag, which will prompt the original editors to just retag, etc. etc…</p>\n\n<p>Is Apple Music the new Music App?</p>\n","OwnerUserId":"4535","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-07-24T20:27:06.410","Title":"apple-music tag != music.app tag","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"1"},{"Id":"2577","PostTypeId":"2","ParentId":"2576","CreationDate":"2015-07-24T20:25:07.870","Score":"7","Body":"<p>That edit should have been rejected. <a href=\"https://apple.stackexchange.com/questions/tagged/apple-music\" class=\"post-tag\" title=\"show questions tagged &#39;apple-music&#39;\" rel=\"tag\">apple-music</a> is not an appropriate tag here as this is nothing to do with Apple Music, the music streaming service. Unfortunately, no-one reads the tag wiki excerpts, let alone tag wikis, and <a href=\"https://apple.meta.stackexchange.com/questions/2238/new-users-dont-tag-questions-correctly\">I've been there</a>. <a href=\"https://apple.stackexchange.com/questions/tagged/music.app\" class=\"post-tag\" title=\"show questions tagged &#39;music.app&#39;\" rel=\"tag\">music.app</a> tag is the appropriate tag here and I've edited the question to use that tag.</p>\n\n<p>By the way, you don't need more reputation to review suggested edits to your own posts. Opening the suggested edit from the inbox notification will allow you to approve/reject the suggested edit should it have not already been approved/rejected.</p>\n\n<p>I've left a note in the revision history pointing to this meta post and commented to ping the editor.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-07-24T20:25:07.870","CommentCount":"0"},{"Id":"2578","PostTypeId":"1","CreationDate":"2015-07-27T11:58:24.760","Score":"4","ViewCount":"59","Body":"<p>I provided and answer to <a href=\"https://apple.stackexchange.com/questions/197514/how-many-partitions-should-i-make-and-what-formatting-schemes-should-be-used-on/197526#197526\">this question</a> on the main site, and subsequent to that answer, I had an exchange with the OP in the comments section where I provided additional advice on how I personally handled a similar situation, and the solutions I used. </p>\n\n<p>I think that those answers are more <strong>opinion-based</strong> than the original answer, and don't necessarily answer the original question directly, but more address the OP's follow-up, so I am not sure whether or not they should be incorporated into the Q &amp; A as an update to the originals. </p>\n\n<p><em>So should the Q &amp; A's be updated or is that additional information more correctly left in the comments?</em></p>\n\n<p>I would appreciate any feedback you can give on this situation, so that I know how to handle not only this, but similar situations going forward.</p>\n","OwnerUserId":"135441","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-07-28T12:14:26.910","Title":"Should follow-up advice given in comments be added as an update to an answer?","Tags":"<discussion><questions><editing><comments><answers>","AnswerCount":"1","CommentCount":"0"},{"Id":"2579","PostTypeId":"2","ParentId":"2578","CreationDate":"2015-07-27T19:51:31.170","Score":"5","Body":"<p>So long as your answer contains a real and genuine answer, then provided the more fluffy bits round the edges are just extra information, and do not form the primary answer, then they will read better and your post will seem more complete than if you include bits in the answer and bits in comments.  Plus, comments invite further comments, which soon clutter things up diluting the message. In your particular example, then worded correctly I would be happy to see it in the answer, not only does it remove your own comment, but it could remove the previous comments too as their queries are now included in an answer.</p>\n","OwnerUserId":"9495","LastActivityDate":"2015-07-27T19:51:31.170","CommentCount":"0"},{"Id":"2580","PostTypeId":"1","CreationDate":"2015-07-28T05:59:38.447","Score":"7","ViewCount":"51","Body":"<p>I fielded a question this evening regarding an issue with Apple's Handoff functionality, which was introduced in iOS 8 and OS X Yosemite. The tag <a href=\"https://apple.stackexchange.com/questions/tagged/handoff\" class=\"post-tag\" title=\"show questions tagged &#39;handoff&#39;\" rel=\"tag\">handoff</a> is only shown as a synonym of <a href=\"https://apple.stackexchange.com/questions/tagged/continuity\" class=\"post-tag\" title=\"show questions tagged &#39;continuity&#39;\" rel=\"tag\">continuity</a>.</p>\n\n<p>While 'Continuity' describes what Handoff does, it introduces a tag which does not represent the official term for the feature as named by Apple.</p>\n\n<p>As I have insufficient reputation to raise a tag edit, I am posing it here. The main tag for the functionality should be renamed <a href=\"https://apple.stackexchange.com/questions/tagged/handoff\" class=\"post-tag\" title=\"show questions tagged &#39;handoff&#39;\" rel=\"tag\">handoff</a> with the synonym referenced as <a href=\"https://apple.stackexchange.com/questions/tagged/continuity\" class=\"post-tag\" title=\"show questions tagged &#39;continuity&#39;\" rel=\"tag\">continuity</a>. This change will reflect Apple's branding of the feature.</p>\n","OwnerUserId":"135441","LastEditorUserId":"37797","LastEditDate":"2015-07-28T12:16:11.483","LastActivityDate":"2015-07-28T12:16:11.483","Title":"Reverse [handoff] and [continuity] tag synonyms","Tags":"<discussion><tags>","AnswerCount":"0","CommentCount":"7"},{"Id":"2581","PostTypeId":"1","AcceptedAnswerId":"2582","CreationDate":"2015-07-31T18:50:20.030","Score":"3","ViewCount":"38","Body":"<p>Just wondering if you can have an answer removed here without any indication that it has been removed? No admin comments, no downvotes, nothing. Just an answer disappear?</p>\n\n<p>I answered a couple of my own questions and saw that one got downvoted, so I'm assuming this is a community no-no simply answering your own question?</p>\n\n<p>Another I answered (submitted some time ago), with what I thought to be a concise, useful answer that did not exist anywhere on the site, and it is just gone, with nothing indicating why.</p>\n\n<p>I'm not one to care much about Karma or reputation. I'm more concerned about getting banned or not being able to post for a while.</p>\n\n<p>Thanks,</p>\n\n<p>Chris</p>\n","OwnerUserId":"135672","LastActivityDate":"2015-07-31T20:58:51.020","Title":"Self answer was removed","Tags":"<discussion>","AnswerCount":"2","CommentCount":"2"},{"Id":"2582","PostTypeId":"2","ParentId":"2581","CreationDate":"2015-07-31T19:35:45.207","Score":"2","Body":"<p>Yes. Posts can simply be deleted. </p>\n","OwnerUserId":"5472","LastActivityDate":"2015-07-31T19:35:45.207","CommentCount":"0"},{"Id":"2583","PostTypeId":"2","ParentId":"2581","CreationDate":"2015-07-31T20:58:51.020","Score":"4","Body":"<p>Posts, both questions and answers, can be deleted by elected moderators (denoted by the diamond) and those who have the necessary reputation to cast delete votes on posts.</p>\n\n<p>However, these posts aren't actually deleted. The original poster of the question or answer can always view their own deleted posts, even if the post was deleted by a moderator rather than themselves. Furthermore, deleted questions and answers are visible to those who have sufficient reputation and a link to the post.</p>\n\n<p>The posts are hidden from the user profile (except to elected moderators) but you can see your own recently deleted posts by clicking the button at the bottom of the questions/answers tab on your profile activity.</p>\n","OwnerUserId":"37797","LastActivityDate":"2015-07-31T20:58:51.020","CommentCount":"1"},{"Id":"2584","PostTypeId":"2","ParentId":"1676","CreationDate":"2015-08-01T00:08:10.460","Score":"3","Body":"<p>I would tend to agree that you are entering into two issues allowing this question:</p>\n\n<ol>\n<li>Very broad. There are over a dozen (I think?) apps in Creative Cloud.</li>\n<li>Opinion based. Let's not start a flame war reminiscent of the EMACS wars of the 90's on Usenet.</li>\n</ol>\n\n<p>I can certainly see a place for recommendations for alternatives. Especially for people who have used both and can say what one does that the other does not.</p>\n\n<p>But again you run the risk of having moderators spend a lot of time either editing responses to take out the opinion or just killing answers left and right.</p>\n\n<p>It's a slippery slope and not one I feel comfortable saying <em>\"This is how it should be.\"</em></p>\n","OwnerUserId":"33273","LastActivityDate":"2015-08-01T00:08:10.460","CommentCount":"0"},{"Id":"2585","PostTypeId":"1","AcceptedAnswerId":"2586","CreationDate":"2015-08-02T00:38:58.047","Score":"7","ViewCount":"153","Body":"<p>I was wondering if humorous questions are possible. Is it forbidden by site policy or anything else?</p>\n\n<hr>\n\n<p>I would also like to know if the least bit if sense of humor would be good to header the question.</p>\n\n<p>Here's an example:</p>\n\n<h3>Original</h3>\n\n<pre><code>MacBook Air 2012 USB Port change or repair\n</code></pre>\n\n<h3>Humorous</h3>\n\n<pre><code>MacBook Air 2012 USB Port make happy and delighted\n</code></pre>\n\n<hr>\n\n<p>Please, note that I did everything I could to make this question as neutral as it was possible.</p>\n","OwnerUserId":"131037","LastEditorUserId":"5472","LastEditDate":"2015-08-02T01:12:20.100","LastActivityDate":"2015-08-02T11:55:27.697","Title":"Is it possible to be asking humorous questions?","Tags":"<discussion><policy><fun>","AnswerCount":"1","CommentCount":"6"},{"Id":"2586","PostTypeId":"2","ParentId":"2585","CreationDate":"2015-08-02T01:12:01.507","Score":"10","Body":"<p>If you are here to joke, that won't go over well.</p>\n\n<p>However if you have a real problem to solve, please enjoy puns every once in a while if you wish. Language can have wonderful shades of meaning and expression, but the site also requires you to be open to:</p>\n\n<p>a) someone perhaps editing it (and we can help resolve things if there's an honest disagreement on what belongs and what doesn't)</p>\n\n<p>b) making sure the intent and details are still clear</p>\n\n<p>I think you have no worries on either case based on the example you provided. Feel free to ask your question on the main site and link here / comment if anything comes up or someone doesn't get the humor. Also, don't be too attached to the humor part in case it gets edited out to make the question more useful or clear if needed.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2015-08-02T11:55:27.697","LastActivityDate":"2015-08-02T11:55:27.697","CommentCount":"6"},{"Id":"2587","PostTypeId":"1","AcceptedAnswerId":"2589","CreationDate":"2015-08-02T21:47:24.353","Score":"5","ViewCount":"76","Body":"<p>As someone who has quickly adopted JavaScript for Automation, I was wondering whether questions about the language (both broad and technical) are better suited to Stack Overflow or Ask Different. Instinctively, I assumed Stack Overflow would be a better choice, as it is more geared toward more intensive programming questions. However, the Ask Different FAQ states the following: </p>\n\n<blockquote>\n  <p>We do encourage AppleScript, Automator, and UNIX shell scripting questions</p>\n</blockquote>\n\n<p>I would take this to mean that JavaScript for Automation is \"encouraged\" as well, seeing as it is a part of the OS X Automation suite. However, would it be more practical to post such a question on Stack Overflow (i.e., would it be more on topic and receive higher-quality answers)?</p>\n","OwnerUserId":"78586","LastEditorUserId":"37797","LastEditDate":"2015-08-03T08:33:57.060","LastActivityDate":"2015-08-03T15:52:20.667","Title":"Are JavaScript for Automation questions better suited to Stack Overflow?","Tags":"<discussion><questions><site-scope>","AnswerCount":"2","CommentCount":"0"},{"Id":"2588","PostTypeId":"2","ParentId":"2587","CreationDate":"2015-08-03T10:32:48.553","Score":"0","Body":"<p>This is all opinion - the main question I think is where you will get a better/ or quicker answer (as you say practical)</p>\n\n<p>If the question is about the Apple Scripting API or starting a javascript and thus close to Applescript then I think this site might give useful answers. However if the main issue is Javascript syntax or libraries there are many more users on SO.</p>\n\n<p>This does not give a nice clean answer. This is partially historical as Applescript never had many questions on SO, Unix shell scripting tended to be seen more as a SuperUser type of question and automator is mainly a user tool not a development language. So at the time these were all not really covered by SO. However the scripting API and use of Javascript and others e.g. python does blur the issue</p>\n","OwnerUserId":"237","LastActivityDate":"2015-08-03T10:32:48.553","CommentCount":"0"},{"Id":"2589","PostTypeId":"2","ParentId":"2587","CreationDate":"2015-08-03T15:52:20.667","Score":"5","Body":"<p>You are correct - they are intentionally on-topic here.</p>\n\n<p>As a matter of personal opinion, I would like to think that here is the best place to ask if the focus on the OS X / API / SDK side of things. I don't think the pure JS knowledge base here approaches 1/100 of what's on Stack Overflow, so I would steer anyone that just needs help with JavaScript, the dialect / language to ask elsewhere. I think this would be similar to someone asking a Python / pyobjc question. It would work in both places.</p>\n\n<p>It's totally on-topic to ask Apple scripting using javascript here - even if it's pure JS.</p>\n\n<p>It should be totally on-topic to ask the same sort of question at Stack Overflow.</p>\n\n<p>So, like other split situations (here vs Super User) - it really ends up being the preference of the asker as to where they want to receive an answer. As long as questions aren't identically cross-posted, placing one here or elsewhere would be no issue at all.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-08-03T15:52:20.667","CommentCount":"0"},{"Id":"2590","PostTypeId":"1","AcceptedAnswerId":"2591","CreationDate":"2015-08-07T13:59:28.237","Score":"5","ViewCount":"34","Body":"<p>I like to vote on questions, and answers.  I also like to review, but because of the 40 per day vote limit I like to keep a couple of votes just in case there is something brilliant that I want to upvote while reviewing, also without votes left one cannot review.</p>\n\n<p>It seems that with the new interface the vote count in my profile does not update as quickly as it used to and it is hard to keep track of my vote numbers during the day.  Is this just my perception?</p>\n\n<p>Is there an easy way to track how many votes I have cast?</p>\n","OwnerUserId":"10733","LastActivityDate":"2015-08-07T15:28:02.600","Title":"How often are the vote statistics updated in my profile","Tags":"<support><voting>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"2591","PostTypeId":"2","ParentId":"2590","CreationDate":"2015-08-07T15:28:02.600","Score":"4","Body":"<ul>\n<li><p>The total votes cast count shown on your profile's activity page takes a good few minutes to update with votes cast.</p>\n\n<p><img src=\"https://i.stack.imgur.com/LSYlf.png\" width=\"117\"></p></li>\n<li><p>The votes tab on the activity page is updated almost instantly upon voting as this page is private to you and therefore has much less traffic.</p>\n\n<p><img src=\"https://i.stack.imgur.com/rfloi.png\" width=\"97\"></p></li>\n</ul>\n\n<p>If you want an accurate, immediately-updated count of your votes cast today, like the old top bar dropdown, you can use <a href=\"http://normalhuman.github.io/stackmarklets/\" rel=\"nofollow noreferrer\">the Votes bookmarklet from Normal Human</a>:</p>\n\n<pre><code>javascript:(function()%7Bs%3D%7B'upvote'%3A0%2C'downvote'%3A0%2C'deletion'%3A0%2C'undeletion'%3A0%2C'closure'%3A0%2C'reopen'%3A0%7D%3Bm%3Dtrue%3Bd%3Dnew%20Date().getUTCDate()%3Bp%3Dnew%20DOMParser()%3Bw%3Ddocument.querySelector('.profile-me').href.split('%3F')%5B0%5D%2B'%3Ftab%3Dvotes%26sort%3Dall%26page%3D'%3Bj%3D1%3Bwhile%20(m)%20%7Bu%3Dw%2Bj%2B%2B%3Br%3Dnew%20XMLHttpRequest()%3Br.onload%3Df%3Br.open('get'%2Cu%2Cfalse)%3Br.send()%3B%7Da%3D%5B'up%2Fdown%3A%20'%2Cs.upvote%2Bs.downvote%2C'%5Cr%5Cnup%3A%20'%2Cs.upvote%2C'%5Cr%5Cndown%3A%20'%2Cs.downvote%2C'%5Cr%5Cnclose%3A%20'%2Cs.closure%2C'%5Cr%5Cndelete%3A%20'%2Cs.deletion%2C'%5Cr%5Cnreopen%3A%20'%2Cs.reopen%2C'%5Cr%5Cnundelete%3A%20'%2Cs.undeletion%5D%3Bwindow.alert(a.join(''))%3Bfunction%20f(e)%20%7Bx%3Dp.parseFromString(e.currentTarget.responseText%2C'text%2Fhtml')%3Bv%3Dx.querySelector('.history-table').firstElementChild.children%3Bfor%20(i%3D0%3Bi%3Cv.length%3Bi%2B%2B)%20%7Bif%20(v%5Bi%5D.querySelector('.date').title.substring(8%2C10)%3D%3Dd)%20%7Bs%5Bv%5Bi%5D.children%5B1%5D.textContent.split('(')%5B0%5D.trim()%5D%2B%2B%3B%7Delse%20%7Bm%3Dfalse%3B%7D%7D%7D%7D)()\n</code></pre>\n\n<p>Un-minified source code:</p>\n\n<pre><code>s={'upvote':0,'downvote':0,'deletion':0,'undeletion':0,'closure':0,'reopen':0};\nm=true;\nd=new Date().getUTCDate();\np=new DOMParser();\nw=document.querySelector('.profile-me').href.split('?')[0]+'?tab=votes&amp;sort=all&amp;page=';\nj=1;\nwhile (m) {\n  u=w+j++;\n  r=new XMLHttpRequest();\n  r.onload=f;\n  r.open('get',u,false);\n  r.send();\n}\na=['up/down: ',s.upvote+s.downvote,'\\r\\nup: ',s.upvote,'\\r\\ndown: ',s.downvote,'\\r\\nclose: ',s.closure,'\\r\\ndelete: ',s.deletion,'\\r\\nreopen: ',s.reopen,'\\r\\nundelete: ',s.undeletion];\nwindow.alert(a.join(''));\nfunction f(e) {\n  x=p.parseFromString(e.currentTarget.responseText,'text/html');\n  v=x.querySelector('.history-table').firstElementChild.children;\n  for (i=0;i&lt;v.length;i++) {\n    if (v[i].querySelector('.date').title.substring(8,10)==d) {\n      s[v[i].children[1].textContent.split('(')[0].trim()]++;\n    }\n    else {\n      m=false;\n    }\n  }\n}\n</code></pre>\n","OwnerUserId":"37797","LastActivityDate":"2015-08-07T15:28:02.600","CommentCount":"0"},{"Id":"2593","PostTypeId":"1","AcceptedAnswerId":"2594","CreationDate":"2015-08-13T15:55:31.210","Score":"4","ViewCount":"62","Body":"<p>I have posted a short blog entry about a change to the site scope to announce the allowing of beta questions.</p>\n\n<ul>\n<li><a href=\"http://apple.blogoverflow.com/2015/08/beta-ios-9-and-el-capitan-questions-allowed/\" rel=\"nofollow noreferrer\">http://apple.blogoverflow.com/2015/08/beta-ios-9-and-el-capitan-questions-allowed/</a></li>\n</ul>\n\n<p>In the past, it would show up promptly in the sidebar / community bulletin area. So far, it's a no show. </p>\n\n<p><a href=\"https://i.stack.imgur.com/BxcKj.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/BxcKj.png\" alt=\"screen capture showing SE blog post, but not AD blog post\"></a></p>\n\n<p>Do I need to do something specific to allow that or has that been changed intentionally over time?</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2015-08-13T19:16:54.333","LastActivityDate":"2015-08-16T20:22:12.403","Title":"How do I get a blog post to show up in the site sidebar?","Tags":"<support><bug><blog>","AnswerCount":"1","CommentCount":"1"},{"Id":"2594","PostTypeId":"2","ParentId":"2593","CreationDate":"2015-08-13T19:15:27.347","Score":"0","Body":"<p>I ended up \"abusing\" the \"community event\" tool to promote the blog post for one week.</p>\n\n<p><a href=\"https://i.stack.imgur.com/Etijy.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/Etijy.png\" alt=\"enter image description here\"></a></p>\n\n<p>Other than the pedantic argument that it's not an event, it seems to be working well.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2015-08-16T20:22:12.403","LastActivityDate":"2015-08-16T20:22:12.403","CommentCount":"0"},{"Id":"2595","PostTypeId":"1","CreationDate":"2015-08-17T19:51:43.433","Score":"1","ViewCount":"28","Body":"<p>The code that processes site links is skipping the ask different blog to grab a title in a similar manner to how site questions get rendered from the raw links</p>\n\n<p>See:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/132382/where-can-i-discuss-apples-beta-seed-program\">Where can I discuss Apple&#39;s Beta Seed program?</a></li>\n<li><p><a href=\"http://apple.blogoverflow.com/2015/08/beta-ios-9-and-el-capitan-questions-allowed/\" rel=\"nofollow noreferrer\">http://apple.blogoverflow.com/2015/08/beta-ios-9-and-el-capitan-questions-allowed/</a></p>\n\n<p>It would be nice if the blog posts were prettied up auto magically. </p></li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-08-17T21:04:33.307","Title":"Please markdown process blog post links from the stack exchange blogs","Tags":"<feature-request>","AnswerCount":"0","CommentCount":"2"},{"Id":"2596","PostTypeId":"1","CreationDate":"2015-08-24T06:36:38.753","Score":"0","ViewCount":"68","Body":"<p>I don't know whether it is the start of the school year, but I feel like I am seeing more and more questions that could very easily be answered by the OP with a simple Google search. </p>\n\n<p>An example was an OP that experienced \"Error Code -36\" when attempting to move a directory from one drive to another. </p>\n\n<p>I did the Google search <strong>error code 36 finder</strong> and the first article returned had a solution for the problem from OS X Daily.</p>\n\n<p>In a way I almost feel like we are doing a disservice to the OPs with providing them an answer that is more detailed than:</p>\n\n<p><strong>The answer to this can be found by performing the Google search ______</strong></p>\n\n<p>While this may be a bit snarky, it also may get them in the habit of going to Google and typing in what we have written, sort of in the spirit of Zed Shaw's \"Learn The Hard Way\" series. I don't even think that we should provide a hyperlink. If this gets them into the mindset of \"I'll do a few Google searches on my own before I ask,\" it may help them not only by making them more autonomous users but may also help to improve the quality of the questions that are actually asked and reduce the moderation effort to keep the site properly curated.</p>\n\n<p>I am less inclined to ignore the questions as there are people who genuinely don't know what is going on or that their problem isn't unique and there are resources that can be found with one or two well thought out search terms. It is also easy to panic when you encounter an error and that tends to reduce some people's ability to problem solve. The problem becomes that it is difficult to determine those from the people who just rush here to ask everything while putting no thought into it.</p>\n\n<p>I would be interested in hearing what other's thoughts are, as it starts becoming discouraging rather quickly when you try to provide helpful answers, but realize the same answer could have just as easily been found by the OP with a simple search engine query in far less time.</p>\n\n<p>And if I need to make a proposal, it would be that when a question is posed that only requires a simple search that we resolve to answer, in the comments, with something similar to  what I highlighted above.</p>\n","OwnerUserId":"135441","LastActivityDate":"2015-08-27T08:52:10.447","Title":"Discussion Topic: Increase In Questions That Are Simply Solved With Google Search","Tags":"<discussion><questions><answers><etiquette>","AnswerCount":"3","CommentCount":"5"},{"Id":"2597","PostTypeId":"2","ParentId":"2596","CreationDate":"2015-08-24T09:17:27.750","Score":"6","Body":"<p>I see several reasons why people come to Ask Different instead of searching via Google/Bing/Duckduckgo></p>\n\n<ul>\n<li>not everybody is very used to doing Google searches, especially for more complex topics. Searching for \"OS X error code -36\" will not give you anything useful because the - omits the 36 from the search</li>\n<li>people do get overwhelmed by the various search results which may point to old and slightly outdated discussions of the topic or to sites with a less than helpful representation of the topic (discussions.apple.com for instance)</li>\n<li>AskDifferent has a good signal/noise ratio and shows up in search results a lot, so it's only natural that people also use the site for apparenatly simple questions</li>\n</ul>\n\n<p>I know that the FAQ expects people to do some basic research themselves, and we tend to close questions if they don't show any such effort at all (and/or the OP doesn't come back to clarify the question based on feedback received in the comments). OTOH nothing is lost if you answer such questions with an answer in the like of</p>\n\n<blockquote>\n  <p>A simple Google query brought me to this page (link) which recommends\n  to <em>include enough information to make your answer stay on its own</em>.</p>\n</blockquote>\n\n<p>This way you indicate in a rather nice fashion that googling might have helped as well, while still providing a useful answer, gather some reputation and increase the value of the site.</p>\n\n<p>PS: Depending on the question, a search for an already existing answer on AD (and subsequently a flag for closing as duplicate) might be helpful as well.</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-08-24T09:17:27.750","CommentCount":"0"},{"Id":"2598","PostTypeId":"2","ParentId":"2596","CreationDate":"2015-08-24T12:14:27.137","Score":"9","Body":"<p>I'm a strong believer in asking simple questions simply. Even if your question can be found by a google search, I feel it's totally on topic here.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/126916/what-versions-of-os-x-are-affected-by-heartbleed\">What versions of OS X are affected by Heartbleed?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/67031/isnt-inactive-memory-a-waste-of-resources/67048#67048\">Isn&#39;t Inactive memory a waste of resources?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/24066/how-to-simulate-slow-internet-connections-on-the-mac/24078#24078\">How to simulate slow internet connections on the mac</a></li>\n</ul>\n\n<p>The links above are gold-standard simple questions. Short, clear and they really don't need a whole litany of <em>What version?</em>, <em>What did you try?</em> to be effective. Heck - even grammar doesn't really matter. Mac vs mac in the title - <strong>who cares, let's get on with the learning</strong> :-)</p>\n\n<p>If the person asking (the OP) can't make a clear case for the issue or they can't distinguish between asking for help troubleshooting vs asking others to do all the work to solve the OP's vaguely composed problem - there's the line I use to identify a question that needs to be put on hold to meet the documented quality standards we expect.</p>\n\n<p>The immense value I see in Stack Exchange is three fold with respect to simple questions:</p>\n\n<ol>\n<li>Searchability - google indexes us and we have an excellent tag system to get the correct keywords exposed to people, internal search and external search.</li>\n<li>Reputation - people can quickly see a number and know if the poster has been given/earned rep or not</li>\n<li>Curation - the SE tools for editing, voting, cleaning up, deleting bad posts is second to none in my opinion.</li>\n</ol>\n\n<h1><em>The <strong>curation aspect</strong> is why I volunteer so much time here.</em></h1>\n\n<p>Apple Discussions, vendor forums, about.com and others when faced with a  \"simple google it question\" are, pardon my bluntness, a total shit show.</p>\n\n<p>I'm not saying everything they do is crappy, but that in the case where you mention \"a simple search\" + \"adequate knowledge\" = easy answer, they really fall short and don't measure up to my expectations.</p>\n\n<p>People can be angry, irritated, lazy, unfocused, and downright mean. I know of no other on-line system that is capable of meaningfully removing that noise and let the signal of a great question and more importantly a great answer rise above the muck.</p>\n\n<p>So - even though I quite often personally don't choose to answer simple \"just google it\" questions, that doesn't mean I don't encourage and approve of them. Heck, sometimes I even down vote them with what I hope is received as constructive criticism in the comments pointing out how I'd like to see the question improved if I feel there is value in getting a clearer question. Other times, I'll use a soft question as a place to put a heavily researched, hopefully useful summation of knowledge based on years of experience in hopes that it reaches hundreds of people as well as helping the person that came here to ask instead of just googling it.</p>\n\n<p>As long as a question has enough context to let someone take a good stab at helping, I feel it belongs here.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-08-24T12:21:01.573","CommentCount":"2"},{"Id":"2599","PostTypeId":"2","ParentId":"2596","CreationDate":"2015-08-27T08:52:10.447","Score":"1","Body":"<p>I'm not expecting much in the way of upvotes for this simple, all-encompassing statement,<br>\nbut here goes...</p>\n\n<p><strong>Some people's Google-Fu just isn't that good, &amp; nothing we do or say will ever improve that.</strong></p>\n\n<p>So we do the Googling for them &amp; by honing sharp, crisp, accurate answers to their vague questions can actually improve the chances that others with only a white belt in Google-Fu can find that answer for themselves; because Stack Exchange answers are frequently near the top of some quite vague Google searches.</p>\n","OwnerUserId":"85275","LastActivityDate":"2015-08-27T08:52:10.447","CommentCount":"1"},{"Id":"2600","PostTypeId":"1","AcceptedAnswerId":"2601","CreationDate":"2015-08-27T09:03:11.380","Score":"4","ViewCount":"54","Body":"<p>Let's assume a very simple edit for this example.</p>\n\n<p>An OP uses ALL CAPS for their question title.<br>\nI go to edit that out, just to make it less shouty.<br>\nAnother user has already made a similar edit, but doesn't have the rep for it to simply be accepted, it needs review.<br>\nI review it &amp; accept.<br>\nIt still requires one more vote before the shouting is toned down.</p>\n\n<p>I could have done that myself, without it needing approval.</p>\n\n<p>Just to get the simple 'first fix' done quickly, should I have just rejected &amp;/or improved the original edit, even though there was nothing inherently wrong with it?<br>\nThis, though, assumes I'm expecting that the edit will need a second vote.</p>\n\n<p>... or should I just get over my OCD &amp; learn to live with it?  ;-)</p>\n\n<p>Ref: <a href=\"https://apple.meta.stackexchange.com/questions/1489/suggested-edits-now-take-more-than-one-review\">Suggested Edits now take more than one review?</a></p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-08-27T14:09:53.807","Title":"Edit Privileges, approve vs self-edit","Tags":"<discussion><editing>","AnswerCount":"1","CommentCount":"0"},{"Id":"2601","PostTypeId":"2","ParentId":"2600","CreationDate":"2015-08-27T14:09:53.807","Score":"2","Body":"<p>Great points - I think we are quite fortunate to have general high quality questions here and it's really hard to ignore a post that hits my buttons - so I will assume I'm in somewhat the same boat as you with SOME POSTS THAT ARE ALL CAPITALS.</p>\n\n<p>Let's split things apart. Editing privilege: the site bumps questions that get edited, so the intent behind the two person is that a question has to be good enough for 2 different people to care about it for an edit to change. This minimizes the trivial edits and maximizes eyes on one person's attempt to change things. Editing comes lower than review - so change there can be malicious, with good intent but bad effect, with bad intent but good result and a genuinely positive change. The second editor then needs to uphold the change the first did.</p>\n\n<p>Review is a bit higher in rep so you have more latitude to choose what to approve and step in to change things.</p>\n\n<p>Lastly, at 2k reputation you can edit a post yourself.</p>\n\n<p>The help page for this is: <a href=\"https://apple.stackexchange.com/help/privileges/edit\">https://apple.stackexchange.com/help/privileges/edit</a></p>\n\n<p>So - you are allowed to edit a post for grammar and clarity, so fixing all caps is clearly encouraged and allowed. However, I have generally declined to edit a question that is so poorly presented. If the OP cares so little about learning and adhering to the way people have chosen to compose thoughts here that their post is ALL CAPS, I find that generally the question isn't good enough quality for my time to edit it. I'd rather focus my volunteer time on posts that need less caring and attention to be useful to the site.</p>\n\n<p>Basically, the main question is do you see enough promise in that post to wade in and do the work needed to make it look good. The phrases \"polishing a turd\" or \"putting lipstick on a chicken\" come to mind. After thousands of edits, I'm not so concerned with fixing all the things but instead fixing things I feel need a better presentation since they are of a higher value to be answered or presented properly.</p>\n\n<p>There's no one right philosophy though - the site depends on hundreds of editors, each with their preferences about what makes them happy to keep the place running smoothly. If your OCD results in these posts being cleaned up, I'm a big fan of your efforts. If not, I'll probably be a fan of what other things you choose to do.</p>\n\n<p>HTH - TLDR - <em>if you are allowed to edit and care to edit</em>, <strong>go ahead and do it</strong>. Ping someone in chat to get eyes on a couple of edits you're not sure are the best if you want feedback but it's not worth a second meta post.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-08-27T14:09:53.807","CommentCount":"0"},{"Id":"2602","PostTypeId":"1","AcceptedAnswerId":"2603","CreationDate":"2015-08-30T17:37:15.747","Score":"4","ViewCount":"35","Body":"<p>If someone asked a question that was grammatically incorrect or had poor formatting, and someone edited the question to improve it, what would the editor do if the OP would keep re-editing or rolling-back to the first version?</p>\n\n<p>Would the question get deleted, or is there any function to prevent the OP from editing his question? If I had 2k reputation and this would happen, what should I do in that case? </p>\n","OwnerUserId":"121023","LastEditorUserId":"37797","LastEditDate":"2015-08-31T09:46:06.970","LastActivityDate":"2015-08-31T09:46:06.970","Title":"What would happen if a high-rep user or moderator edited a question, and the OP rolled back constantly?","Tags":"<discussion><editing>","AnswerCount":"1","CommentCount":"1","FavoriteCount":"1"},{"Id":"2603","PostTypeId":"2","ParentId":"2602","CreationDate":"2015-08-30T18:06:33.053","Score":"6","Body":"<p>Edit wars can lead to moderators locking posts from further edits. We'll usually ask warring factions to take it to a chat room to work out their differences and if that can't be facilitated, moderators will keep the lock in place and make a call on what the persistent form of the question or answer should look like.</p>\n\n<p>I should add: edit wars that can't be resolved amicably are exceedingly rare on Ask Different.</p>\n","OwnerUserId":"292","LastActivityDate":"2015-08-30T18:06:33.053","CommentCount":"2"},{"Id":"2604","PostTypeId":"1","CreationDate":"2015-09-02T15:17:52.010","Score":"3","ViewCount":"33","Body":"<p>Please remove <a href=\"https://apple.stackexchange.com/help/whats-beta\">https://apple.stackexchange.com/help/whats-beta</a></p>\n\n<p>This applies to sites that are still in \"beta\" and clouds the issue we have on the site with respect to beta software questions in general.</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/1119/\">Despite the general rule to not answer questions about beta products, should we allow Messages on OS X and Siri on iPhone 4S questions?</a></li>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/1712/\">Are iOS 10, macOS 10.12, watchOS 3 or tvOS 10 (beta) questions OK?</a></li>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/573/\">Update to FAQ regarding beta and pre-release software</a></li>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/798/\">Pre-release software that doesn&#39;t require an NDA</a></li>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/2396/\">Are Apple iCloud / iWork beta web apps on topic for the main site?</a></li>\n</ul>\n\n<p>The site beta status is \"inside baseball\" describing what steps Ask Different went through to get to where we are today. It's no longer relevant to have up and the help could use some thinning since it's not even viewable on one page.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-09-03T16:06:55.393","Title":"Please remove this \"beta\" article from help","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2605","PostTypeId":"2","ParentId":"2604","CreationDate":"2015-09-03T16:06:46.117","Score":"2","Body":"<p>This is a specific article about what we wish the community to know about the term \"beta\" as it pertains to any site in the SE network.  It serves as information for users who have never been a part of the SE network and wish to learn how a site evolves.</p>\n","OwnerUserId":"7","LastActivityDate":"2015-09-03T16:06:46.117","CommentCount":"1"},{"Id":"2606","PostTypeId":"1","AcceptedAnswerId":"2607","CreationDate":"2015-09-03T19:40:34.560","Score":"3","ViewCount":"26","Body":"<p>In the title, what I mean by it is that if I have a problem, and I already solve it, and someone posts a good answer (that could answer the question but might not be the solution for me). Can I still accept it? Or should I rather post an answer of my own and accept it myself? I want to give credit to someone with good quality content.</p>\n","OwnerUserId":"121023","LastActivityDate":"2015-09-04T00:28:06.623","Title":"Is it okay to accept answers that don't directly answer the question?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2607","PostTypeId":"2","ParentId":"2606","CreationDate":"2015-09-03T20:23:05.217","Score":"4","Body":"<p>If your solution is the 100% correct, canonical way to answer the question you asked, you should post it and accept it. There is absolutely nothing wrong with answering your own question. In fact: the facilities are provided by the Stack Exchange software to both ask and answer a question at the exact same time!</p>\n\n<p>You can still up vote the other user's answer. It's a nice way to show them that they were helpful, even if they didn't give the perfect solution to the problem. But even that isn't strictly necessary and may need some caution if, in up voting the other user's answer, you end up making it higher voted than the accepted-correct answer. It can cause confusion in that case for future readers.</p>\n","OwnerUserId":"292","LastEditorUserId":"292","LastEditDate":"2015-09-04T00:28:06.623","LastActivityDate":"2015-09-04T00:28:06.623","CommentCount":"0"},{"Id":"2608","PostTypeId":"1","CreationDate":"2015-09-06T14:02:00.263","Score":"3","ViewCount":"39","Body":"<p>I just asked a question about \"Why Apple doesn't support android gear watches?\" and did a lot of research on how they could support them.</p>\n\n<p>Other similar questions have been closed (or edited or simply left open):</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/81451/\">How long did it take to create iOS?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/100109/\">Why did Apple Decide not to install Command Line Tools as default?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/152735/\">Did Apple drop the keyword &#39;Server&#39; from the Mac Mini category?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/204554/\">How can Apple produce new iPhone 6s if iOS9 is not yet ready</a></li>\n</ul>\n\n<p><sup>Be sure to check revisions of the question if they are edited at a date later than this post.</sup></p>\n\n<p>Why was my question closed as \"not a practical\" question?</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-09-06T14:26:10.350","Title":"Why does the FAQ say \"asking how/why Apple does <some thing XYZ>\" is off-topic?","Tags":"<discussion><closed-questions><close-reasons>","AnswerCount":"1","CommentCount":"0"},{"Id":"2609","PostTypeId":"2","ParentId":"2608","CreationDate":"2015-09-06T14:16:09.363","Score":"1","Body":"<p>Here are some guidelines to help people decide to cast close/reopen votes as well as help you if your question was placed on temporary hold and remains closed.</p>\n\n<ol>\n<li>First - look at whether the question is really about opinions or debate or discussion. We close questions that are primarily opinion based, so \"Why did Apple X\" are historically quintessential questions that are opinion based.</li>\n<li>Look for the practical use case being presented. If the question is critical or even ranty, that can be edited out if needed.</li>\n</ol>\n\n<p>In both cases above, edits are only needed if language is truly offensive or if your post has <a href=\"https://en.wikipedia.org/wiki/Straw_man\" rel=\"nofollow noreferrer\">straw men</a> or if by removing the debate language and arguments allows a real issue to be surfaced. Polite criticism is always welcome here. I enjoy seeing <a href=\"https://twitter.com/monteiro/status/640296000293236737\" rel=\"nofollow noreferrer\">withering shade being cast</a> within the bounds of proper etiquette, so when you want to rip someone or something publicly, <a href=\"https://en.wikipedia.org/wiki/Damning_with_faint_praise\" rel=\"nofollow noreferrer\">do it with style</a>, please. </p>\n\n<p>However, that criticism has to set the stage for a real problem that a real user of Apple products is facing. If the question is merely hypothetical and lacks compelling practical application, then it should be closed until it can be edited. Adding research about what Apple has or has not done helps, but in the end open questions need to state clearly the <strong>problem that is to be solved</strong> Otherwise, discussions should be <a href=\"http://chat.stackexchange.com\">held in chat</a> or on another internet user forum of some sort as opposed to this narrowly focused Question and Answer platform.</p>\n\n<p>Here are guidelines that can help you add documented research and clarify a practical question so that we can reopen questions that will allow reasoned answers to be offered.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/help/dont-ask\">https://apple.stackexchange.com/help/dont-ask</a></li>\n<li><a href=\"https://apple.stackexchange.com/help/how-to-ask\">https://apple.stackexchange.com/help/how-to-ask</a></li>\n</ul>\n\n<p>In a nutshell, here is a template for fixing all the above close reasons if a question you like has been labeled \"not practical\" or \"opinion based\" or \"off topic\":</p>\n\n<ol>\n<li>I am angry/confused/delighted because: document clearly what Apple has done, has announced, has not done, has not announced.</li>\n<li>Document your efforts to solve your dilemma. (n.b. saying you searched everywhere and tried everything you know isn't documentation. It's lack of effort and shows how little time and thought you spent on organizing your search strategy)</li>\n<li>Frame in some detail what precisely you expect to be able to do with the knowledge you seek. Give numbers, facts, timelines so that this doesn't look like you asking for opinions and instead asking for experience and facts to move your problem a step or two towards resolution if it cannot be solved in a few paragraphs.</li>\n</ol>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-09-06T14:26:10.350","CommentCount":"0"},{"Id":"2610","PostTypeId":"1","CreationDate":"2015-09-09T18:50:46.430","Score":"3","ViewCount":"22","Body":"<p>I was just noticed via mail that an <a href=\"https://apple.stackexchange.com/posts/52886/revisions\">edit to an old answer</a> I once posted was approved. I was curious and noticed that it <a href=\"https://apple.stackexchange.com/review/suggested-edits/128056\">got approved after only one vote in favour</a>. <a href=\"https://apple.stackexchange.com/help/privileges/edit\">The help pages</a>, however, state that \"<em>Two</em> votes in either direction will finalize the action...\".</p>\n\n<p>Since I'm not particularly fond of the edit (seeing that it changes the tone and intent of my answer significantly, removes my disclaimer about it being not elegant and puts the phrase \"This is the simplest and fastest way...\" in my mouth, an absolute statement which I'd never use in such a text), I'd like to know why it went live with only one vote and what significance the reject vote has.</p>\n","OwnerUserId":"2643","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-09-09T18:54:37.020","Title":"Approving an edit after one \"Approve\" and one \"Reject\" vote","Tags":"<support><suggested-edits>","AnswerCount":"1","CommentCount":"0"},{"Id":"2611","PostTypeId":"2","ParentId":"2610","CreationDate":"2015-09-09T18:54:37.020","Score":"3","Body":"<p>Moderator votes have kind of more power :-)</p>\n\n<p>As always, feel free to rollback the edit if you don't agree (or rollback and edit it yourself if part of the edit looks useful to you).</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-09-09T18:54:37.020","CommentCount":"0"},{"Id":"2612","PostTypeId":"1","CreationDate":"2015-09-15T00:21:13.113","Score":"1","ViewCount":"43","Body":"<p>I am really getting tired of flags getting rejected when they are clearly in the scope of what the flag was intended for.</p>\n\n<p>For example:</p>\n\n<p>Not An Answer:</p>\n\n<p>This was posted as an answer, but it does not attempt to answer the question. It should possibly be an edit, <strong>a comment</strong>, another question, or deleted altogether.</p>\n\n<p>If the \"Answer\" takes the form of \"Hey I tried it, and it worked\" or even \"Hey I tried it, it didn't work for me but this did\" then it should be a comment to the original answer, and not an answer.</p>\n\n<p>These usually take the form of first posts or late answers, which generally means that the user doesn't have the reputation to comment. That doesn't mean that a valid flag should be rejected just so that they can get around the reputation restriction.</p>\n\n<p>And the use of \"Flags should not be used to point out technical inaccuracies\" is absolutely the wrong approach to take. Answers on SE are supposed to be Peer Reviewed, meaning that the presumption is that answers that are left standing have been found to be accurate. Not addressing flags for Technical inaccuracies, especially for First Posts, where there is likely no hope that the poster will return to make suggested changes, is tantamount to circumventing the Peer Review process.</p>\n\n<p>If there is something redeeming about the answer and it warrants and edit, then an edit is more appropriate, but if the edit would add nothing to the discussion or would only have to reiterate and answer already given, then a flag to delete should be honored.</p>\n","OwnerUserId":"135441","LastActivityDate":"2015-09-15T03:42:33.167","Title":"DIscussion: Flags","Tags":"<discussion><flagging><moderators><moderation>","AnswerCount":"1","CommentCount":"2"},{"Id":"2613","PostTypeId":"2","ParentId":"2612","CreationDate":"2015-09-15T03:42:33.167","Score":"4","Body":"<p>No.</p>\n\n<p>It is true that some people post comments as answers, but my experience shows that those posts usually do get deleted.</p>\n\n<p>If something answers a question, it should not be flagged as not an answer.</p>\n\n<p>Redundant answers are still answers, and could possibly be worded more clearly than the answers they duplicate.</p>\n\n<p>Wrong answers are still answers, and it not moderators' jobs to identify wrong answers.</p>\n\n<p>If an answer, read by itself as if no other answer were posted, can reasonably be constructed as an answer to the question, flags identifying it as \"not an answer\" should be, often are, and will continue to be denied.</p>\n","OwnerUserId":"9388","LastActivityDate":"2015-09-15T03:42:33.167","CommentCount":"0"},{"Id":"2615","PostTypeId":"1","AcceptedAnswerId":"2616","CreationDate":"2015-09-22T15:47:19.437","Score":"0","ViewCount":"29","Body":"<p>I accidentally created this tag instead of <a href=\"https://apple.stackexchange.com/questions/tagged/mobile-calendar\" class=\"post-tag\" title=\"show questions tagged &#39;mobile-calendar&#39;\" rel=\"tag\">mobile-calendar</a> to be inline with other tags like <a href=\"https://apple.stackexchange.com/questions/tagged/mobile-safari\" class=\"post-tag\" title=\"show questions tagged &#39;mobile-safari&#39;\" rel=\"tag\">mobile-safari</a>. </p>\n","OwnerUserId":"4160","LastEditorUserId":"37797","LastEditDate":"2015-09-26T07:52:12.423","LastActivityDate":"2015-09-26T07:52:12.423","Title":"Burniate mobile-calendar.app tag","Tags":"<support><tags>","AnswerCount":"2","CommentCount":"0"},{"Id":"2616","PostTypeId":"2","ParentId":"2615","CreationDate":"2015-09-22T16:02:02.510","Score":"1","Body":"<p>Done - As long as no one uses it before the next tag culling interval (0000 UTC I believe) we should be set.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-09-22T16:02:02.510","CommentCount":"0"},{"Id":"2617","PostTypeId":"1","AcceptedAnswerId":"2618","CreationDate":"2015-09-22T16:48:40.213","Score":"3","ViewCount":"23","Body":"<p>I don't know if I should flag this question:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/q/206944/121023\">Problems with downloading iTunes on Windows 7</a> </li>\n</ul>\n\n<p>I would close it as off topic because it is not related to Apple hardware or software. However iTunes is Apple software, but the problem is with downloading on a Windows computer.</p>\n\n<p>Is this question considered as on topic?</p>\n","OwnerUserId":"121023","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-09-22T17:23:22.820","Title":"Is this question on topic?","Tags":"<discussion><flagging><close-reasons>","AnswerCount":"1","CommentCount":"0"},{"Id":"2618","PostTypeId":"2","ParentId":"2617","CreationDate":"2015-09-22T17:08:23.367","Score":"4","Body":"<p>It's absolutely on topic. With a few exceptions there's an OR clause between the following:</p>\n\n<ul>\n<li>Apple Hardware </li>\n<li>Apple Software</li>\n<li>Apple Services</li>\n</ul>\n\n<p>See <a href=\"https://apple.stackexchange.com/help/on-topic\">https://apple.stackexchange.com/help/on-topic</a></p>\n\n<p>Even third party products when the use of them involves Apple products in some obvious and clear manner we allow those questions too. The only thing that's off topic is if the use of Apple HW/SW/Services is in passing. The question does need to revolve centrally around use of some Apple thing to fly - but other than that, it's game on for Windows questions about iTunes.</p>\n\n<h1>Now just being on topic isn't enough and it's so bad it needs to be put on hold for improvement.</h1>\n\n<p>It's unclear (we don't know what version of windows and iTunes is in play, we don't know what the error is, we don't know a ton of things). For that reason, I voted to close it as too broad. Someone could write an entire book of all the steps needed to cover all the eventualities, but it's up the the OP to fill in the details or someone to adopt the question and make up / fill in their specific details and it might be fine to reopen. </p>\n\n<p>It also might be SuperUser material and off topic once the actual details are listed.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-09-22T17:23:07.343","CommentCount":"1"},{"Id":"2619","PostTypeId":"1","AcceptedAnswerId":"2622","CreationDate":"2015-09-22T17:18:54.727","Score":"4","ViewCount":"46","Body":"<p>I noticed a strange answer in the shape of <em>\"If you need help, we can help you out at example.com\"</em> </p>\n\n<p>Is it in the zone of validity to post such answer? I would possibly flag as spam since it appears to be promoting this persons webpage.</p>\n\n<hr>\n\n<p>The answer can be found here:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/a/206953\">Problems with downloading iTunes on Windows 7</a> </li>\n</ul>\n","OwnerUserId":"121023","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-09-22T20:39:07.683","Title":"Should answers shaped like this be flagged?","Tags":"<support><flagging>","AnswerCount":"2","CommentCount":"0"},{"Id":"2620","PostTypeId":"2","ParentId":"2619","CreationDate":"2015-09-22T17:36:51.863","Score":"2","Body":"<p>That's definitively flag-worthy, as are all other answers which basically lead people offsite for the details.</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-09-22T17:36:51.863","CommentCount":"1"},{"Id":"2621","PostTypeId":"2","ParentId":"2570","CreationDate":"2015-09-22T17:51:34.040","Score":"4","Body":"<p>I agree and I think we should follow the same practice that we use for iPhone and iOS. Thus we should have at a high level <a href=\"https://apple.stackexchange.com/questions/tagged/apple-watch\" class=\"post-tag\" title=\"show questions tagged &#39;apple-watch&#39;\" rel=\"tag\">apple-watch</a> for hardware and <a href=\"https://apple.stackexchange.com/questions/tagged/watchos\" class=\"post-tag\" title=\"show questions tagged &#39;watchos&#39;\" rel=\"tag\">watchos</a> for software. Also we should have break downs for watchOS so there should be <a href=\"https://apple.stackexchange.com/questions/tagged/watchos-1\" class=\"post-tag\" title=\"show questions tagged &#39;watchos-1&#39;\" rel=\"tag\">watchos-1</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/watchos-2\" class=\"post-tag\" title=\"show questions tagged &#39;watchos-2&#39;\" rel=\"tag\">watchos-2</a>, just like iOS. The only issue I see is that down-cased watchOS is a little hard to read.</p>\n\n<p>Also I don't see why <a href=\"https://apple.stackexchange.com/questions/tagged/workout.app\" class=\"post-tag\" title=\"show questions tagged &#39;workout.app&#39;\" rel=\"tag\">workout.app</a> is a synonym of <a href=\"https://apple.stackexchange.com/questions/tagged/apple-watch\" class=\"post-tag\" title=\"show questions tagged &#39;apple-watch&#39;\" rel=\"tag\">apple-watch</a>. That needs to be fixed too.</p>\n","OwnerUserId":"4160","LastActivityDate":"2015-09-22T17:51:34.040","CommentCount":"3"},{"Id":"2622","PostTypeId":"2","ParentId":"2619","CreationDate":"2015-09-22T20:07:06.793","Score":"5","Body":"<p>Answers which link elsewhere to answer the question should be flagged, but there's a bit more to it than that.</p>\n\n<ul>\n<li><p>Answers which answer the question through quoting content from an external link or providing sufficient information such that if the link is removed <em>an</em> answer exists, regardless of quality, don't need flagging. If the content besides the link is thin, a comment may be worthwhile.</p></li>\n<li><p>Answers which solely include a link to a page which answers the question, such as example.com/how-to-fix-x/ should be edited to include a quote or summary of the content. If the link is broken, look for a suitable alternative or look for an archived copy.</p></li>\n<li><p>Answers which include a link to slightly-related, indirectly-related or unrelated content should be flagged as spam.</p></li>\n</ul>\n\n<p>All single instances of self-promotion is fine as long as:</p>\n\n<ul>\n<li>your relationship to the product is disclosed</li>\n<li>it's actually 100% relevant to the question being asked</li>\n<li>it's not a pattern of posting the same links over and over - even if each is correct in isolation.</li>\n</ul>\n\n<p>For example, if I've written an extensive article on my site prior to a question being posted, I will include a link to this content in my answer. However, I will also include a summary of the information such that if the link is later unavailable, the answer is still valid.</p>\n\n<p>Self-promotion can be a fine line if you are just parroting marketing copy without regards to customizing it for the question at hand and you don't offer alternatives to your \"solution\". </p>\n\n<p>Basically, if it's a 1 reputation user blatantly promoting their own content, flags for spam are generally approved since the OP came here only to promote and not to participate. If a 101 reputation user posts a link to their own content, check their network profile to see if they have the dofollow privilege elsewhere, and include a link to the self-promotion help page if you deem it necessary.</p>\n\n<p>You can always ask on meta or flag as \"other\" and ask for feedback if a post is spam if you're not sure.</p>\n","OwnerUserId":"37797","LastEditorUserId":"5472","LastEditDate":"2015-09-22T20:39:07.683","LastActivityDate":"2015-09-22T20:39:07.683","CommentCount":"0"},{"Id":"2623","PostTypeId":"1","CreationDate":"2015-09-22T20:12:20.520","Score":"1","ViewCount":"90","Body":"<p>Currently tags for Apple Apps are all over the place.</p>\n\n<p>At first I thought it would be a good idea to have separate tags for each app on each platform like having <a href=\"https://apple.stackexchange.com/questions/tagged/mail.app\" class=\"post-tag\" title=\"show questions tagged &#39;mail.app&#39;\" rel=\"tag\">mail.app</a> for OS X and <a href=\"https://apple.stackexchange.com/questions/tagged/mobile-mail\" class=\"post-tag\" title=\"show questions tagged &#39;mobile-mail&#39;\" rel=\"tag\">mobile-mail</a> for iOS but that quickly gets out of hand with all the new platforms (tv and watch) and there isn't a simple naming convention to follow (why a prefix for one platform and a suffix for the other). Apple used to refer to Mail on iOS as Mobile Mail but now they do not. I think internally it is still MobileMail and NanoMail for the watch but most people wouldn't recognize them as such.</p>\n\n<p>Thus I propose that we move tags for Apple apps that have the same name across platforms to use the <code>.app</code> suffix such as <a href=\"https://apple.stackexchange.com/questions/tagged/mail.app\" class=\"post-tag\" title=\"show questions tagged &#39;mail.app&#39;\" rel=\"tag\">mail.app</a> and drop or make the <code>mobile</code> prefix a synonym. Then the user would just combine the app tag with the relevant platform to indicate which one they are interested in. Also we would still keep general nouns such as <a href=\"https://apple.stackexchange.com/questions/tagged/maps\" class=\"post-tag\" title=\"show questions tagged &#39;maps&#39;\" rel=\"tag\">maps</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/photos\" class=\"post-tag\" title=\"show questions tagged &#39;photos&#39;\" rel=\"tag\">photos</a> separate from their <code>.app</code> tags. Thoughts?</p>\n","OwnerUserId":"4160","LastActivityDate":"2017-06-06T02:15:05.813","Title":"Overhaul tags for Apple apps across OS X, iOS, watchOS, and tvOS","Tags":"<discussion><tags>","AnswerCount":"2","CommentCount":"0"},{"Id":"2624","PostTypeId":"2","ParentId":"2623","CreationDate":"2015-09-23T13:24:54.143","Score":"1","Body":"<p>.app only makes sense for OS X applications as this is the only one that shows .app. OS X users will unserstand .app but I think there will be new IOS users who will not understand .app as an extension (and the default for OS X is show no extension) so I think .app is only for experienced people. This is especially as auto complete will show the name without the .app and users will choose that.</p>\n\n<p>I agree the mobile prefix makes no sense,</p>\n","OwnerUserId":"237","LastActivityDate":"2015-09-23T13:24:54.143","CommentCount":"0"},{"Id":"2625","PostTypeId":"2","ParentId":"2615","CreationDate":"2015-09-26T07:51:30.087","Score":"1","Body":"<p>You don't need to involve a moderator to delete a tag like this. If you accidently create a tag, simply remove the tag from the questions that it is used on (likely one if you created it) and at 3:00 UTC it will be deleted automatically.</p>\n","OwnerUserId":"37797","LastActivityDate":"2015-09-26T07:51:30.087","CommentCount":"0"},{"Id":"2626","PostTypeId":"1","AcceptedAnswerId":"2627","CreationDate":"2015-09-28T13:40:35.907","Score":"1","ViewCount":"37","Body":"<p>Recently I posted an answer including source code with a method I regularly used here and on web pages:</p>\n\n<blockquote>\n  <p><a href=\"https://apple.stackexchange.com/a/206843/22003\">Corruptions within Calendar: duplicates. How to analyse their cause and fix?</a></p>\n</blockquote>\n\n<p>My (stackexchange) source (of this source code) is:</p>\n\n<pre><code>    &lt;pre&gt;\n    $ cat &lt;&lt;'eof' &gt;duplicate.pl\n    #!/usr/bin/perl\n    &lt;/pre&gt;\n</code></pre>\n\n<p>and the result obtained, is:</p>\n\n<pre><code>    $ cat duplicate.pl\n    #!/usr/bin/perl\n</code></pre>\n\n<p>Which is wrong in term of displayed text and in term of working answer, since the shell script is not working. \nI'm not able to present the problem here through the use of <code>&lt;pre&gt;</code> and\nused a lot of <code>return</code> and spaces to achieve a presentable explanation.</p>\n\n<hr>\n\n<p>What is the easiest way to insert source code with just one enclosing\nmarkup?</p>\n\n<p>What did I do wrong to not being able to get a correct behaviour of a basic <code>&lt;pre&gt;</code> markup?</p>\n","OwnerUserId":"22003","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-10-04T12:15:07.677","Title":"How to improve this source code quoting?","Tags":"<discussion><support>","AnswerCount":"2","CommentCount":"0"},{"Id":"2627","PostTypeId":"2","ParentId":"2626","CreationDate":"2015-09-28T14:05:58.533","Score":"1","Body":"<p>Let me try :-)</p>\n\n<pre><code>$ cat &lt;&lt;'eof' &gt;duplicate.pl\n#!/usr/bin/perl\n</code></pre>\n\n<p>Ok so far? Or is there any special meaning of using <code>&lt;pre&gt;</code> tags?</p>\n\n<p>The easiest way to format larger blocks of code is to just paste the code into the edit window, select the whole code block and the click on the code formatter (<strong>{}</strong>) at the top of the edit window.</p>\n\n<p>See also the help pages on supported markdown formatting (especially the second screenshot below) and <a href=\"https://meta.stackexchange.com/questions/22186/how-do-i-format-my-code-blocks\">this question on the main meta site</a>:</p>\n\n<p><a href=\"https://i.stack.imgur.com/CBVaQ.jpg\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/CBVaQ.jpg\" alt=\"enter image description here\"></a></p>\n\n<p><a href=\"https://i.stack.imgur.com/oLIm7.jpg\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/oLIm7.jpg\" alt=\"enter image description here\"></a></p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-09-28T14:46:27.950","CommentCount":"6"},{"Id":"2630","PostTypeId":"1","AcceptedAnswerId":"2631","CreationDate":"2015-09-29T19:23:24.843","Score":"6","ViewCount":"79","Body":"<p>Did something break?</p>\n\n<p>This morning there were about 2, now there seem to be 1200 Late Answers.</p>\n\n<p><a href=\"https://i.stack.imgur.com/EzRNF.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/EzRNF.png\" alt=\"enter image description here\"></a></p>\n","OwnerUserId":"85275","LastEditorUserId":"52123","LastEditDate":"2015-10-08T16:28:50.643","LastActivityDate":"2015-10-08T17:38:51.297","Title":"Late Answers... 1.2k?","Tags":"<bug><review-page><late-answers>","AnswerCount":"1","CommentCount":"7"},{"Id":"2631","PostTypeId":"2","ParentId":"2630","CreationDate":"2015-09-29T19:38:22.843","Score":"6","Body":"<p>This appears to be intentional. As of 1700 UTC October 8, the backlog queue has been reviewed. The site-wide change is being discussed in this answer/question:</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/a/267080/165931\">https://meta.stackexchange.com/a/267080/165931</a></li>\n</ul>\n\n<blockquote>\n  <p>I'd like to try raising the reputation for getting enqueued to the Late Answer reviews to 50 and reconsider upping it to 100 at some point in the future</p>\n</blockquote>\n\n<p>If there's a big problem with this change, asking on MSE directly or here would be ideal.</p>\n\n<p>Personally, I'm seeing a majority of answers that deserve up votes. A few answers that are spam/terrible, but the real benefit I'm seeing is giving attention to the questions themselves. Most of the bad answers are due to a bad question, so I'm cleaning them up when I find a bad late answer as well.</p>\n\n<p>When the OP doesn't accept an answer, it encourages late answers, so I'll encourage everyone that reviews to <strong>take their time on this large queue and really give each post some attention</strong> before moving to the next review.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-10-08T17:38:51.297","CommentCount":"8"},{"Id":"2632","PostTypeId":"1","AcceptedAnswerId":"2633","CreationDate":"2015-10-01T16:10:04.790","Score":"4","ViewCount":"42","Body":"<p>I was on my profile and wanted to look at the tag badge tracker, I selected it in the drop down and the graphics below the point graph disappeared! So I can't go back to the privilege tracker and I can't see the tag badge tracker.</p>\n\n<p><a href=\"https://i.stack.imgur.com/3S4so.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/3S4so.png\" alt=\"enter image description here\"></a> </p>\n\n<p>I am running:</p>\n\n<p><strong>OS</strong></p>\n\n<ul>\n<li>OS X Yosemite version 10.10.5</li>\n</ul>\n\n<p><strong>Browser</strong></p>\n\n<ul>\n<li>Google Chrome version 45.0.2454.101</li>\n</ul>\n\n<p><strong>Extensions</strong></p>\n\n<ul>\n<li>AdBlock version 2.40.1</li>\n<li>Google Docs version 0.9</li>\n<li>Google Docs Offline version 0.5</li>\n<li>Google Mail Checker version 4.4.0</li>\n<li>New Tab Redirect version 3.1.4 (not enabled)</li>\n<li>Print Friendly &amp; PDF version 2.3</li>\n</ul>\n","OwnerUserId":"149206","LastEditorUserId":"64429","LastEditDate":"2015-10-02T11:36:02.953","LastActivityDate":"2015-10-02T11:36:02.953","Title":"A bug with the tag badge tracker vanishing","Tags":"<support><bug><status-completed>","AnswerCount":"1","CommentCount":"3"},{"Id":"2633","PostTypeId":"2","ParentId":"2632","CreationDate":"2015-10-02T11:35:53.037","Score":"3","Body":"<p>There used to be an issue where, if your account had no activity in any badge, and you opened the tag badge selector, your tag badge tracker would become hidden and you couldn't select a new tag badge. This is apparently what happened to your profile.</p>\n\n<p>I've reset the tracker for your profile so you can select a tag badge now.</p>\n","OwnerUserId":"64429","LastActivityDate":"2015-10-02T11:35:53.037","CommentCount":"1"},{"Id":"2634","PostTypeId":"2","ParentId":"2626","CreationDate":"2015-10-04T12:15:07.677","Score":"0","Body":"<p>Am I missing something, or is </p>\n\n<p><a href=\"https://i.stack.imgur.com/CBVaQ.jpg\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/CBVaQ.jpg\" alt=\"enter image description here\"></a></p>\n\n<p>not just the same as selecting the block &amp; hitting <kbd> Cmd ⌘ </kbd>  <kbd> K </kbd> ?</p>\n\n<p>Prior to discovering that I used to add extra indents in a text editor &amp; paste it over, which was a tad irritating...</p>\n\n<hr>\n\n<p>Unformatted  </p>\n\n<p>$ cat &lt;&lt;'eof' >duplicate.pl</p>\n\n<h1>!/usr/bin/perl</h1>\n\n<p>Using <code>&lt;pre&gt; &lt;/pre&gt;</code></p>\n\n<pre>\n$ cat duplicate.pl\n#!/usr/bin/perl\n</pre>\n\n<p>Using <kbd> Cmd ⌘ </kbd>  <kbd> K </kbd>  </p>\n\n<pre><code>$ cat &lt;&lt;'eof' &gt;duplicate.pl\n#!/usr/bin/perl\n</code></pre>\n\n<p>Using <code>{}</code></p>\n\n<pre><code>$ cat &lt;&lt;'eof' &gt;duplicate.pl\n#!/usr/bin/perl\n</code></pre>\n","OwnerUserId":"85275","LastActivityDate":"2015-10-04T12:15:07.677","CommentCount":"0"},{"Id":"2635","PostTypeId":"1","AcceptedAnswerId":"2638","CreationDate":"2015-10-04T14:08:09.290","Score":"1","ViewCount":"29","Body":"<p>I found a question here that needs cleanup when I was reviewing.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/90066/app-or-webapp-for-learning-touch-type-on-ios-with-apple-wireless-keyboard\">https://apple.stackexchange.com/questions/90066/app-or-webapp-for-learning-touch-type-on-ios-with-apple-wireless-keyboard</a></li>\n</ul>\n\n<p>It got protected by Community about 3 minutes before I posted this question. It contains a surprising amount of answers in the shape of \"This app is good. I tried it\" that the answer thread now looks like a chat room.</p>\n","OwnerUserId":"121023","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-10-04T15:36:25.197","Title":"\"Typing Fingers\" is in need of cleanup","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2636","PostTypeId":"1","CreationDate":"2015-10-04T14:17:45.913","Score":"2","ViewCount":"28","Body":"<p>To me, there are enough differences with prior versions of Safari  and Safari 9 that a [safari-9] tag is worthwhile.</p>\n","OwnerUserId":"121949","LastActivityDate":"2015-10-05T16:06:48.347","Title":"Tag request: safari-9","Tags":"<feature-request><tags>","AnswerCount":"2","CommentCount":"6"},{"Id":"2637","PostTypeId":"2","ParentId":"2636","CreationDate":"2015-10-04T14:28:53.843","Score":"-2","Body":"<p>I created the tag. I am mainly a chrome user so I don't know the difference. Please feel free to make the tag edit. It could however be later turned into a tag synonym to [safari]</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/tagged/safari-9\">https://apple.stackexchange.com/questions/tagged/safari-9</a></p>\n","OwnerUserId":"121023","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-10-04T14:28:53.843","CommentCount":"0"},{"Id":"2638","PostTypeId":"2","ParentId":"2635","CreationDate":"2015-10-04T15:21:21.313","Score":"3","Body":"<p>All five answers that were posted by the one reputation users are spam.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/a/209032\">https://apple.stackexchange.com/a/209032</a></li>\n<li><a href=\"https://apple.stackexchange.com/a/209035\">https://apple.stackexchange.com/a/209035</a></li>\n<li><a href=\"https://apple.stackexchange.com/a/209037\">https://apple.stackexchange.com/a/209037</a></li>\n<li><a href=\"https://apple.stackexchange.com/a/209038\">https://apple.stackexchange.com/a/209038</a></li>\n<li><a href=\"https://apple.stackexchange.com/a/209041\">https://apple.stackexchange.com/a/209041</a></li>\n</ul>\n\n<p>Downvote, flag them as spam and move on. You don't need to ask a meta question for things like this as a quick message in chat will suffice, <a href=\"http://chat.stackexchange.com/transcript/message/24502416#24502416\">as was already done</a>.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-10-04T15:35:28.097","CommentCount":"1"},{"Id":"2639","PostTypeId":"2","ParentId":"2636","CreationDate":"2015-10-05T16:06:48.347","Score":"2","Body":"<p>I've merged the safari versions all into safari. There's simply not enough traffic to warrant a specific tag for that when we can search for safari 9 in the body of posts.</p>\n\n<p>If it keeps popping up, I'll probably make a synonym so that people realize that we're keeping the safari questions together for now.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-10-05T16:06:48.347","CommentCount":"0"},{"Id":"2640","PostTypeId":"1","AcceptedAnswerId":"2641","CreationDate":"2015-10-08T02:41:09.683","Score":"3","ViewCount":"32","Body":"<p>More than once I've run into a question in First Posts which I knew the answer to, and have popped open the question in a new tab to submit one.</p>\n\n<p>Well, there's no button in the queue for actually taking you to the main question page or submitting an answer, and I'm just wondering if there's a reason for this :)</p>\n","OwnerUserId":"50295","LastActivityDate":"2015-10-08T03:16:49.513","Title":"Is it considered bad form to answer questions out of the review queue?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"2641","PostTypeId":"2","ParentId":"2640","CreationDate":"2015-10-08T03:16:49.513","Score":"5","Body":"<p>I don't think it was intentional that there's no way to contribute an answer when you're perusing the review queue. I think it was just a purpose-built UI; it was made for reviews and not reviews-and-possibly-answering.</p>\n\n<p>I certainly don't think it's bad form to provide an answer to question. Ever. That's the whole reason the site exists. If you can help a person out with your knowledge I say go for it.</p>\n\n<p>Also, in most of review situations, if you mouse over the question title it'll let you open the question. I'll pop questions in to background tabs as I'm reviewing and revisit them when I'm done to answer or comment or improve them beyond what the review tasks were asking me to do.</p>\n","OwnerUserId":"292","LastActivityDate":"2015-10-08T03:16:49.513","CommentCount":"3"}]