[{"Id":"3064","PostTypeId":"1","CreationDate":"2017-06-21T01:59:35.710","Score":"8","ViewCount":"53","Body":"<p>I have encountered this a few times recently: A user will ask a question about a problem, the solution to which is generally a one-liner troubleshooting thing posted in the comments (i.e. \"Have you tried resetting the SMC?\" \"Great, it works now!\") or something like a the location of a menu item buried somewhere. Every now and then, the user will subsequently delete this question.</p>\n\n<p>I don't like this because I feel that some other users might benefit greatly from reading the question when they are having a similar issue, even if the answer was \"easy\" for those who are more familiar with the products and troubleshooting techniques.</p>\n\n<p>Am I the only person who feels this way, or do other people agree and, if there is agreement, is there a good way to encourage users not to delete their posts?</p>\n","OwnerUserId":"178418","LastActivityDate":"2017-06-21T08:34:00.923","Title":"Thoughts on OPs deleting questions","Tags":"<discussion><questions><closed-questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"3065","PostTypeId":"2","ParentId":"3064","CreationDate":"2017-06-21T08:34:00.923","Score":"7","Body":"<p>The main countermeasure against this is that <a href=\"https://meta.stackexchange.com/q/5221/222623\">Stack Exchange prevents the asker from deleting their question if it has an upvoted answer or if it has multiple answers</a>.</p>\n\n<p>Unfortunately, due to the low voting on this site, it can happen that an answer given wasn't upvoted, which leaves OP free to delete their question. If this happens and you suspect it to be because someone provided their answer, you can bring it up in chat so a moderator can have a look and potentially undelete the question.</p>\n\n<p>If you see a pattern of this with a particular user, that's definitely grounds to flag for a moderator. Should a user regularly delete their questions, <a href=\"https://meta.stackexchange.com/a/97720/222623\">an automatic question ban would be applied anyway</a>.</p>\n\n<p>With regard to deleting questions after an answer was given in comments, this is another reason for answering using the answer box rather than in the comments, so the answer can be upvoted. For the exact transcript you give, I'd still be inclined to raise it in chat as I would if it had been an answer, since it is clear that OP has deleted simply because they have an answer.</p>\n\n<p>In my opinion, this kind of thing happens rarely. I've given over 2.5k answers and only had this happen a couple of times. This is the kind of ratio where moderators can take a look manually, and I don't think anything else needs implementing specifically to deal with this.</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-06-21T08:34:00.923","CommentCount":"0"},{"Id":"3066","PostTypeId":"1","CreationDate":"2017-06-23T00:14:51.203","Score":"6","ViewCount":"29","Body":"<p>A few days ago I asked \"<a href=\"https://apple.stackexchange.com/questions/287161/how-can-i-turn-off-siris-joke-responses\">How can I turn off Siri's joke responses?</a>\"</p>\n\n<p>I thought this was a perfectly legitimate question. It's on-topic, not subjective, and (I think) pretty clear what I'm asking. It's not intended as a complaint or an invitation to discussion, just a simple \"how do I do this\" question. I understand that the answer may be \"you can't currently\" or \"nobody knows\", although I hope it's not.</p>\n\n<p>My question received several helpful comments and a possible answer. The score is currently -2, which means at least two people thought it was a bad question. Obviously no one but them knows why they voted, but I'm pretty surprised by this. I thought it was a decent question. Is there something obviously wrong that I'm missing? Or if not, is there anything I could change to make this question acceptable?</p>\n","OwnerUserId":"11533","LastActivityDate":"2017-06-23T05:23:58.357","Title":"How can I improve this question about Siri?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"3067","PostTypeId":"2","ParentId":"3066","CreationDate":"2017-06-23T05:23:58.357","Score":"6","Body":"<p>I've had a look at the question and, to be honest, don't see any major problems with it. </p>\n\n<p>Obviously there's no way to know what the users who downvoted you were thinking, but I had a look and see they were all before you changed the title, so who knows if that played a role. </p>\n\n<p>In this case it may be best to move on and forget it. For what it's worth, I don't get the joke responses you get when I use Siri to set a timer, so that in itself makes the question valid in my opinion.</p>\n","OwnerUserId":"168832","LastActivityDate":"2017-06-23T05:23:58.357","CommentCount":"1"},{"Id":"3068","PostTypeId":"1","CreationDate":"2017-06-23T06:43:29.430","Score":"2","ViewCount":"30","Body":"<p>Not sure this is the right place to ask this (where else?).\nI'm doing some research on iPhone software and hardware and have learnt some stuff that I couldn't find anywhere else.  I thought I'd like to share this information with the general public. </p>\n\n<p>Is there any website where anyone can publish their articles?.  I've been looking at some such as Techradar, appleinsider, etc. and they seem to just have their own tech people for that.</p>\n","OwnerUserId":"205397","OwnerDisplayName":"Antonio MS","LastActivityDate":"2017-06-24T14:48:12.467","Title":"Where could I publish my own technical articles?","Tags":"<discussion><iphone>","AnswerCount":"1","CommentCount":"2","FavoriteCount":"0"},{"Id":"3069","PostTypeId":"2","ParentId":"3059","CreationDate":"2017-06-23T16:09:17.187","Score":"2","Body":"<p>How would you handle situations involving less than warm welcomes given to new users?</p>\n\n<p>For example, a new user posts a well written first question consisting of a clearly defined problem statement, admission of a high level of domain ignorance, and a request for the proper solution methodology, but no actual attempts to tackle the problem.</p>\n\n<p>Said question receives many downvotes and impolite comments. The asker gets upset about the situation and complains to you directly on chat and/or meta.</p>\n\n<p>What would you do?</p>\n\n<p>(taken from <a href=\"https://meta.stackexchange.com/a/220323/193295\">https://meta.stackexchange.com/a/220323/193295</a>)</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-06-23T16:09:17.187","CommentCount":"0"},{"Id":"3070","PostTypeId":"2","ParentId":"3059","CreationDate":"2017-06-23T16:10:44.697","Score":"2","Body":"<p>As a moderator, your votes become binding. Actions you used to take like flagging, closing, and deleting will take effect immediately without any input from any other users or moderators.</p>\n\n<p>How will you adapt the way you currently flag and vote to deal with this change?</p>\n\n<p>(taken from <a href=\"https://meta.stackexchange.com/a/220332/193295\">https://meta.stackexchange.com/a/220332/193295</a>)</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-06-23T16:10:44.697","CommentCount":"0"},{"Id":"3071","PostTypeId":"2","ParentId":"3059","CreationDate":"2017-06-23T16:12:00.037","Score":"-1","Body":"<p>You see the question which was put on hold by another moderator (not with 5 votes of community). But you think that this question is good and should not be closed. What will you do?</p>\n\n<p>(taken from <a href=\"https://meta.stackexchange.com/a/220457/193295\">https://meta.stackexchange.com/a/220457/193295</a>)</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-06-23T16:12:00.037","CommentCount":"2"},{"Id":"3072","PostTypeId":"2","ParentId":"3059","CreationDate":"2017-06-23T16:15:04.427","Score":"1","Body":"<p>A question is asked and receives some very good answers. The asker then flags this question and asks for it to be deleted because having it up will cause them trouble at work or school. Do you delete the question?</p>\n\n<p>(taken from <a href=\"https://meta.stackoverflow.com/a/289454/1088558\">https://meta.stackoverflow.com/a/289454/1088558</a>)</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-06-23T16:15:04.427","CommentCount":"0"},{"Id":"3073","PostTypeId":"2","ParentId":"3059","CreationDate":"2017-06-23T16:16:06.437","Score":"-1","Body":"<p>A user had done a veeery long series of Looks OK flags in Low Quality Posts without editing anything. What would you do?</p>\n\n<p>(taken from <a href=\"https://meta.stackoverflow.com/a/289476/1088558\">https://meta.stackoverflow.com/a/289476/1088558</a>)</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-06-23T16:16:06.437","CommentCount":"0"},{"Id":"3074","PostTypeId":"2","ParentId":"3059","CreationDate":"2017-06-23T16:17:50.397","Score":"1","Body":"<p>A diamond will be attached to everything you say and have said in the past, including questions, answers and comments. Everything you will do will be seen under a different light. How do you feel about that?</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-06-23T16:17:50.397","CommentCount":"0"},{"Id":"3075","PostTypeId":"2","ParentId":"3059","CreationDate":"2017-06-23T20:16:07.733","Score":"1","Body":"<p>If there is one thing you could/would like to change in the way the site is moderated, what would it be?</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-06-23T20:16:07.733","CommentCount":"0"},{"Id":"3076","PostTypeId":"2","ParentId":"3068","CreationDate":"2017-06-24T14:48:12.467","Score":"2","Body":"<p>This question and sort of question doesn't do well on the main site. It's basically asking about an off-site resource or recommendation and only tangentially has to do with Apple.</p>\n\n<p>I'm also not sure why the question remains open here on meta unless it's to discuss the merits of my opinion above that the question itself isn't suited for the main site or this meta site.</p>\n\n<p>For any question - we ask that you \"show your research\" so I would posit - since GitHub pages is a free platform to publish your work on the web in an open / collaborative environment - what makes you not just self publish and if your work is good - it will rapidly get noticed and someone will want to ask you to work to provide content for their site.</p>\n","OwnerUserId":"5472","LastActivityDate":"2017-06-24T14:48:12.467","CommentCount":"0"},{"Id":"3077","PostTypeId":"1","AcceptedAnswerId":"3079","CreationDate":"2017-06-24T17:35:39.833","Score":"4","ViewCount":"25","Body":"<p>I'm seeing a lot of 'http -> https' suggested edits show-up in the review queue to be reviewed and approved (<a href=\"https://apple.stackexchange.com/review/suggested-edits/207693\">example</a>).  Almost all of these are several years-old posts that don't have any other changes except for edits to a link.</p>\n\n<p>I went thru 5 of these types of edits just this morning.</p>\n\n<p>I understand the <a href=\"https://meta.stackexchange.com/questions/292058/network-wide-https-its-time\">netword-wide move to https</a> and I don't have any problem with that.  <strong>I'm just wondering if it's a good use or our time to be reviewing/approving dozens of these types of edits each day?</strong>  I know I could just hit <kbd>Skip</kbd> during the review but then I'm just pushing that decision to a different reviewer and that's not fair to them.</p>\n\n<p>I read the meta post about the move to https as well as all, well...most, of the answers &amp; comments there to try to find guidance on this topic. I believe things like this were to be handled on a site-by-site basis so I'm bringing it up here to ask for guidance. </p>\n","OwnerUserId":"88313","LastEditorUserId":"37797","LastEditDate":"2017-06-24T18:45:21.303","LastActivityDate":"2017-06-24T19:11:55.277","Title":"Reviewing/Approving Post Edits for http -> https","Tags":"<discussion><suggested-edits>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"1"},{"Id":"3078","PostTypeId":"2","ParentId":"3077","CreationDate":"2017-06-24T18:45:13.760","Score":"2","Body":"<p><a href=\"https://math.meta.stackexchange.com/a/26540/78482\">@Glorfindel is going around the tag wikis and moving links to HTTPS.</a></p>\n\n<p>In my opinion, this is mostly fine:</p>\n\n<ul>\n<li>the links are tidied in other ways too if necessary</li>\n<li>the edits are on tag wikis so no bumping occurs</li>\n<li>Ask Different generally has a low number of items in the review queue so it's not preventing other edits from going through (we're nowhere near the queue cap)</li>\n</ul>\n\n<p>One could argue this is farming reputation, but I would still say the benefits outweigh this.</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-06-24T18:45:13.760","CommentCount":"0"},{"Id":"3079","PostTypeId":"2","ParentId":"3077","CreationDate":"2017-06-24T19:11:55.277","Score":"4","Body":"<p>I would suggest refraining from any sort of manual cleanup on this. The system cleanup is scripted and unless you are in making a substantive edit and happen to fix http / https you are causing human review effort for something that can / should be automated. </p>\n\n<p>If you find breakage systematically - please raise a bug question here on meta - new questions here summon all moderators with a notification. </p>\n","OwnerUserId":"5472","LastActivityDate":"2017-06-24T19:11:55.277","CommentCount":"1"},{"Id":"3080","PostTypeId":"2","ParentId":"3059","CreationDate":"2017-06-25T00:10:53.653","Score":"2","Body":"<p>In addition to <em>moderation</em> activities (e.g. dealing with flagged posts, deleting spam, etc), what other role do you see that moderators can play to improve the overall success of our community?</p>\n","OwnerUserId":"168832","LastActivityDate":"2017-06-25T00:10:53.653","CommentCount":"0"},{"Id":"3081","PostTypeId":"2","ParentId":"3059","CreationDate":"2017-06-25T00:29:15.393","Score":"1","Body":"<p>Since being a moderator requires you to commit a significant amount of your time, as well as having to perform a number of <em>mundane</em> activities, I am wondering why you've nominated for this role? What is it you feel you have to offer that makes you worthy of our trust?</p>\n","OwnerUserId":"168832","LastActivityDate":"2017-06-25T00:29:15.393","CommentCount":"2"},{"Id":"3082","PostTypeId":"2","ParentId":"3059","CreationDate":"2017-06-25T00:44:07.523","Score":"2","Body":"<p>As a user of this site, what would you say is the number one issue we face moving forward? And, do you have any thoughts on how we tackle that issue?</p>\n","OwnerUserId":"168832","LastActivityDate":"2017-06-25T00:44:07.523","CommentCount":"0"},{"Id":"3083","PostTypeId":"1","CreationDate":"2017-06-26T20:05:21.587","Score":"13","ViewCount":"426","Body":"<p>In connection with the moderator elections, we are holding a Q&amp;A thread for the candidates. Questions collected <a href=\"https://apple.meta.stackexchange.com/questions/3059/2017-moderator-election-qa-question-collection\">from an earlier thread</a> have been compiled into this one, which shall now serve as the space for the candidates to provide their answers. </p>\n\n<p>Not every question was compiled - as noted, we only selected the top 8 questions as submitted by the community, plus 2 pre-set questions from us.</p>\n\n<p>As a candidate, your job is simple - post an answer to this question, citing each of the questions and then post your answer to each question given in that same answer. For your convenience, I will include all of the questions in quote format with a break in between each, suitable for you to insert your answers. Just <a href=\"https://apple.meta.stackexchange.com/revisions/c4fc82be-1c95-48aa-8bfa-a1482bd47254/view-source\">copy the whole thing after the first set of three dashes</a>.Please consider putting your name at the top of your post so that readers will know who you are before they finish reading everything you have written, and also including a link to your answer on your nomination post.</p>\n\n<p>Once all the answers have been compiled, this will serve as a transcript for voters to view the thoughts of their candidates, and will be appropriately linked in the Election page.</p>\n\n<p>Good luck to all of the candidates!</p>\n\n<p><strong>Oh, and when you've completed your answer, please provide a link to it after this blurb here, before that set of three dashes. Please leave the list of links in the order of submission.</strong></p>\n\n<p>To save scrolling here are links to the submissions from each candidate (in order of submission):</p>\n\n<p><a href=\"https://apple.meta.stackexchange.com/a/3085\">Jackson1442</a> </p>\n\n<p><a href=\"https://apple.meta.stackexchange.com/a/3086\">grgarside</a> </p>\n\n<p><a href=\"https://apple.meta.stackexchange.com/a/3087\">Monomeeth</a> </p>\n\n<p><a href=\"https://apple.meta.stackexchange.com/a/3088\">Glorfindel</a></p>\n\n<hr>\n\n<blockquote>\n  <ol>\n  <li><p>How would you deal with a user who produced a steady stream of valuable answers, but tends to generate a large number of arguments/flags from comments?</p></li>\n  <li><p>How would you handle a situation where another mod closed/deleted/etc a question that you feel shouldn't have been?</p></li>\n  <li><p>As a moderator, your votes become binding. Actions you used to take like flagging, closing, and deleting will take effect immediately without any input from any other users or moderators.</p>\n  \n  <p>How will you adapt the way you currently flag and vote to deal with this change?</p></li>\n  <li><p>In addition to <em>moderation</em> activities (e.g. dealing with flagged posts, deleting spam, etc), what other role do you see that moderators can play to improve the overall success of our community?</p></li>\n  <li><p>As a user of this site, what would you say is the number one issue we face moving forward? And, do you have any thoughts on how we tackle that issue?</p></li>\n  <li><p>Since being a moderator requires you to commit a significant amount of your time, as well as having to perform a number of <em>mundane</em> activities, I am wondering why you've nominated for this role? What is it you feel you have to offer that makes you worthy of our trust?</p></li>\n  <li><p>If there is one thing you could/would like to change in the way the site is moderated, what would it be?</p></li>\n  <li><p>A question is asked and receives some very good answers. The asker then flags this question and asks for it to be deleted because having it up will cause them trouble at work or school. Do you delete the question?</p></li>\n  <li><p>A diamond will be attached to everything you say and have said in the past, including questions, answers and comments. Everything you will do will be seen under a different light. How do you feel about that?</p></li>\n  <li><p>How would you handle situations involving less than warm welcomes given to new users?</p>\n  \n  <p>For example, a new user posts a well written first question consisting of a clearly defined problem statement, admission of a high level of domain ignorance, and a request for the proper solution methodology, but no actual attempts to tackle the problem.</p>\n  \n  <p>Said question receives many downvotes and impolite comments. The asker gets upset about the situation and complains to you directly on chat and/or meta.</p>\n  \n  <p>What would you do?</p></li>\n  </ol>\n</blockquote>\n","OwnerUserId":"52123","LastEditorUserId":"4604","LastEditDate":"2017-07-11T20:16:06.997","LastActivityDate":"2017-07-11T20:16:06.997","Title":"2017 Moderator Election Q&A - Questionnaire","Tags":"<discussion><election>","AnswerCount":"4","CommentCount":"0","FavoriteCount":"1"},{"Id":"3084","PostTypeId":"1","CreationDate":"2017-06-26T20:05:31.003","Score":"2","ViewCount":"29","Body":"<p>The 2017 Community Moderator Election is now underway!</p>\n\n<p>Community moderator elections have three phases:</p>\n\n<ol>\n<li>Nomination phase</li>\n<li>Primary phase</li>\n<li>Election phase</li>\n</ol>\n\n<p>Most elections take between two and three weeks, but this depends on how many candidates there are.</p>\n\n<p>Please visit the official election page at</p>\n\n<p><a href=\"https://apple.stackexchange.com/election\">https://apple.stackexchange.com/election</a></p>\n\n<p>for more detail, and to participate!</p>\n\n<p>If you have general questions about the election process, or questions for moderator candidates, feel free to ask them here on meta -- just make sure your questions are tagged <a href=\"/questions/tagged/election\" class=\"post-tag\" title=\"show questions tagged &#39;election&#39;\" rel=\"tag\">election</a>.</p>\n","OwnerUserId":"-1","LastActivityDate":"2017-06-26T20:05:31.003","Title":"2017 Community Moderator Election","Tags":"<discussion><moderators><election>","AnswerCount":"0","CommentCount":"0","FavoriteCount":"0","CommunityOwnedDate":"2017-06-26T20:05:31.003"},{"Id":"3085","PostTypeId":"2","ParentId":"3083","CreationDate":"2017-06-27T17:35:17.690","Score":"4","Body":"<blockquote>\n  <ol>\n  <li>How would you deal with a user who produced a steady stream of valuable answers, but tends to generate a large number of arguments/flags from comments?</li>\n  </ol>\n</blockquote>\n\n<p>First, I would contact the user to see what's up. If he is in violation of the \"Be Nice\" policy, and is coming off as just plain rude, I will probably issue a temporary suspension. However, if the user's answers are just a little blunt, I'd just ask them to soften up what they write and ask for a few edits on some of the harsher answers.</p>\n\n<blockquote>\n  <ol start=\"2\">\n  <li>How would you handle a situation where another mod closed/deleted/etc a question that you feel shouldn't have been?</li>\n  </ol>\n</blockquote>\n\n<p>I'd contact the mod. Hopefully, this is simply a mistake - a misclick, anything. If not, I'm sure we can sort it out, because the other mod will have a valid reason for whatever they did. I believe that <strong>communication is key</strong>, so communication is almost always the first step for me.</p>\n\n<blockquote>\n  <ol start=\"3\">\n  <li><p>As a moderator, your votes become binding. Actions you used to take like flagging, closing, and deleting will take effect immediately without any input from any other users or moderators.</p>\n  \n  <p>How will you adapt the way you currently flag and vote to deal with this change?</p></li>\n  </ol>\n</blockquote>\n\n<p>It shouldn't really affect much of what I do. I only flag things that have serious issues, and edit things that have minor issues. If I'm not sure, I leave it for others to take a pass at. Like I said, I don't over-flag, but I think this <em>will</em> make me make some tough decisions that require the input of others.</p>\n\n<blockquote>\n  <ol start=\"4\">\n  <li>In addition to <em>moderation</em> activities (e.g. dealing with flagged posts, deleting spam, etc), what other role do you see that moderators can play to improve the overall success of our community?</li>\n  </ol>\n</blockquote>\n\n<p>I think moderators need to take some time and help promote the site, which is what I'll try to do. We also need to keep the site active and encourage users to earn more rep and answer more questions.</p>\n\n<blockquote>\n  <ol start=\"5\">\n  <li>As a user of this site, what would you say is the number one issue we face moving forward? And, do you have any thoughts on how we tackle that issue?</li>\n  </ol>\n</blockquote>\n\n<p>I think the biggest problem we face now as a site is that user's aren't being very active. I think we should encourage users to ask more questions, answer more questions, and reach those high-reputation marks.</p>\n\n<blockquote>\n  <ol start=\"6\">\n  <li>Since being a moderator requires you to commit a significant amount of your time, as well as having to perform a number of <em>mundane</em> activities, I am wondering why you've nominated for this role? What is it you feel you have to offer that makes you worthy of our trust?</li>\n  </ol>\n</blockquote>\n\n<p>Like most people on this site, what I really want to do is help other people. The main reason I stayed on this site is that I asked a question and people were eager to help me - and I liked that. I want to help others the way this site has helped me, only now by keeping it clean, organized, and helpful.</p>\n\n<blockquote>\n  <ol start=\"7\">\n  <li>If there is one thing you could/would like to change in the way the site is moderated, what would it be?</li>\n  </ol>\n</blockquote>\n\n<p><em>I honestly can't think of anything.</em> \n<br> I just want the mods to remain active, and since people have other things happening in their life than Ask Different, a growing mod staff is always helpful. I've never had a problem with site moderation.</p>\n\n<blockquote>\n  <ol start=\"8\">\n  <li>A question is asked and receives some very good answers. The asker then flags this question and asks for it to be deleted because having it up will cause them trouble at work or school. Do you delete the question?</li>\n  </ol>\n</blockquote>\n\n<p><strong>No, but there are things we can do about it.</strong> For situations like these, there are two options:</p>\n\n<ol>\n<li>We disassociate the answer from the user. Their name is no longer shown - problem solved.</li>\n<li>We can also make edits to the question to remove sensitive information and redact the revision history. This same approach will be used when we need to remove personal information about users (IP, email, passwords, you have it).</li>\n</ol>\n\n<p>Sometimes we can use a combination of both tools when/if someone posts confidential information about their work that can get them in trouble.</p>\n\n<blockquote>\n  <ol start=\"9\">\n  <li>A diamond will be attached to everything you say and have said in the past, including questions, answers and comments. Everything you will do will be seen under a different light. How do you feel about that?</li>\n  </ol>\n</blockquote>\n\n<p>I don't have any problem with it. I have tried to always be polite and respectful in my comments, and have written some well thought out answers, so I think this diamond will actually help other people see the things I wrote.</p>\n\n<blockquote>\n  <ol start=\"10\">\n  <li><p>How would you handle situations involving less than warm welcomes given to new users?</p>\n  \n  <p>For example, a new user posts a well written first question consisting of a clearly defined problem statement, admission of a high level of domain ignorance, and a request for the proper solution methodology, but no actual attempts to tackle the problem.</p>\n  \n  <p>Said question receives many downvotes and impolite comments. The asker gets upset about the situation and complains to you directly on chat and/or meta.</p>\n  \n  <p>What would you do?</p></li>\n  </ol>\n</blockquote>\n\n<p>Like I said earlier, <strong>communication is key.</strong> StackExchange is not your average forum - I was confused by the rules and restrictions too when I first joined. All I think this situation requires is explaining what the problem is and helping them find all the other rules that they should be aware of. This isn't like other places where you can write <code>MEE 2 PLZ HLP</code> as a comment or answer, and that's confusing to some people, so I think an explanation of the rules and SE etiquette is in order.</p>\n\n<p>As for the impolite comments, those will be removed and warnings may be issued.</p>\n","OwnerUserId":"191432","LastActivityDate":"2017-06-27T17:35:17.690","CommentCount":"0"},{"Id":"3086","PostTypeId":"2","ParentId":"3083","CreationDate":"2017-06-28T13:07:17.267","Score":"13","Body":"<h1>George's answers @grgarside</h1>\n\n<blockquote>\n  <ol>\n  <li>How would you deal with a user who produced a steady stream of valuable answers, but tends to generate a large number of arguments/flags from comments?</li>\n  </ol>\n</blockquote>\n\n<p>No one is exempt from <a href=\"https://apple.stackexchange.com/help/be-nice\">being nice</a>. Thankfully, inappropriate behaviour is something rarely seen here (separate from spam, which is something <a href=\"https://chat.stackexchange.com/transcript/message/35637558\">Ask Different suffers heavily from</a>), let alone from someone with an otherwise good contribution history.</p>\n\n<p>However, should it come to it, I would attempt to work with them, letting them know some of their contributions are not being well-received, ensuring their future contributions adhere to the code of conduct. Hopefully this will have the desired effect, but if not, a suspension is a likely course of action. One hopes this won’t often be necessary.</p>\n\n<blockquote>\n  <ol start=\"2\">\n  <li>How would you handle a situation where another mod closed/deleted/etc a question that you feel shouldn't have been?</li>\n  </ol>\n</blockquote>\n\n<p>As with anyone, I would raise it with the person who performed the action. There can be more to something than initially appears, or I’ve missed something in the way I’ve viewed the issue. Either way, this has always solved such discrepancies in the past and I would continue in this manner.</p>\n\n<blockquote>\n  <ol start=\"3\">\n  <li><p>As a moderator, your votes become binding. Actions you used to take like flagging, closing, and deleting will take effect immediately without any input from any other users or moderators.</p>\n  \n  <p>How will you adapt the way you currently flag and vote to deal with this change?</p></li>\n  </ol>\n</blockquote>\n\n<p>I am familiar with binding votes through my two gold tag badges in the most popular tags on the site and the ability this provides to close questions as duplicate. Furthermore, I strive to be as accurate as possible with my flags in general; I have a 99% post flag accuracy on 3k flags and I encourage anyone to raise with me any queries regarding the actions I take at any time.</p>\n\n<blockquote>\n  <ol start=\"4\">\n  <li>In addition to <em>moderation</em> activities (e.g. dealing with flagged posts, deleting spam, etc), what other role do you see that moderators can play to improve the overall success of our community?</li>\n  </ol>\n</blockquote>\n\n<p>Moderators are still normal people in the community. The moderators on this site are extremely knowledgeable on Apple topics and contribute greatly to providing answers, directly helping people who come to the site looking for help with their issue. I look to continue providing answers to your Apple questions, assisting in the core principle of the site: Q&amp;A.</p>\n\n<blockquote>\n  <ol start=\"5\">\n  <li>As a user of this site, what would you say is the number one issue we face moving forward? And, do you have any thoughts on how we tackle that issue?</li>\n  </ol>\n</blockquote>\n\n<p>Tags. The tagging system is a reasonable way to find questions in a certain category, but at the moment it’s not an excellent way. Inappropriate use of tags is one thing and is regularly fixed through editing, but there are plenty of other structural tag issues, many of which lead to the incorrect tagging. I regularly <a href=\"https://apple.meta.stackexchange.com/search?tab=newest&amp;q=user%3a37797%20%5btags%5d%20is%3aquestion\">raise issues with tags on meta</a>, but understandably there doesn’t seem to be much priority placed on them, exemplified by the regular automatic freezing of the tag chat room due to inactivity. The existing tools for dealing with this are unused by the majority: there’s barely a single tag synonym vote, let alone a synonym which went through without mod intervention. Yet despite this, tags are used by a large number of people to track and subscribe to various topics, so I think more could be done with improving how tags are organised on the site with proper synonyms and tag wiki.</p>\n\n<blockquote>\n  <ol start=\"6\">\n  <li>Since being a moderator requires you to commit a significant amount of your time, as well as having to perform a number of <em>mundane</em> activities, I am wondering why you've nominated for this role? What is it you feel you have to offer that makes you worthy of our trust?</li>\n  </ol>\n</blockquote>\n\n<p>Ask Different is an amazing community, I’ve learned so much over the years and enjoy repaying this where I can by contributing my knowledge; problem solving is very rewarding. Part of that transcends to moderation duties including reviewing and flagging — helping make things in order is rewarding in itself, especially when that helps as many people as a site like Ask Different does on a daily basis.</p>\n\n<p>As for the trust aspect of this question, it might be a British thing but if someone says ‘trust me’, you probably shouldn’t. I’d like to suggest <a href=\"https://apple.stackexchange.com/users/37797/grgarside?tab=profile\">my actions</a> speak for themselves on this.</p>\n\n<blockquote>\n  <ol start=\"7\">\n  <li>If there is one thing you could/would like to change in the way the site is moderated, what would it be?</li>\n  </ol>\n</blockquote>\n\n<p>The moderators, past and present, have done a wonderful job of keeping the site in order for many years. I am extremely grateful of the work the moderator team has done, both behind the scenes and in their contributions to Q&amp;A, both of which lead me like many others to discover this site and what it has to offer. A very minor point I could raise for this question would be that, in more recent years, there are occasional lapses in the level of communication over meta posts on topics brought up by the community. I’m sure with the addition of moderators from this election, in an effort to continue the excellent work of those departed over the years, will bring a temperate faster pace.</p>\n\n<blockquote>\n  <ol start=\"8\">\n  <li>A question is asked and receives some very good answers. The asker then flags this question and asks for it to be deleted because having it up will cause them trouble at work or school. Do you delete the question?</li>\n  </ol>\n</blockquote>\n\n<p>I do not delete the question, as there are generally other ways of dealing with such a problem. Since the contribution was licensed under Creative Commons, Stack Exchange does not need to remove the post.</p>\n\n<ol>\n<li>The question can be edited to remove information which is causing the issue and which is only secondary to the problem. This would mean the question could remain without causing problems due to the extraneous information provided.</li>\n<li>Editing can also be used to replace proprietary details with other information which still demonstrates or explains the problem appropriately, but does not infringe on the content causing issue.</li>\n<li>Depending on the situation, post disassociation may be suitable if the issue is with the link back to the particular person or their subsequent links elsewhere. This removes the ties between the person and the content causing issue.</li>\n<li>A recent moderator ability is revision redaction (previously requiring CM intervention). This is useful for cleaning up a post where an edit resolves the problem but the revision history retains the issue.</li>\n</ol>\n\n<blockquote>\n  <ol start=\"9\">\n  <li>A diamond will be attached to everything you say and have said in the past, including questions, answers and comments. Everything you will do will be seen under a different light. How do you feel about that?</li>\n  </ol>\n</blockquote>\n\n<p>I always do my upmost to be respectful and appropriate with my contributions, for posts as well as other media such as comments or chat. As such I have no problem with any of my past actions on the site and aim to continue that in the future.</p>\n\n<blockquote>\n  <ol start=\"10\">\n  <li><p>How would you handle situations involving less than warm welcomes given to new users?</p>\n  \n  <p>For example, a new user posts a well written first question consisting of a clearly defined problem statement, admission of a high level of domain ignorance, and a request for the proper solution methodology, but no actual attempts to tackle the problem.</p>\n  \n  <p>Said question receives many downvotes and impolite comments. The asker gets upset about the situation and complains to you directly on chat and/or meta.</p>\n  \n  <p>What would you do?</p></li>\n  </ol>\n</blockquote>\n\n<p>Driving users away from a site is something everyone wants to avoid as much as possible. Situations like the one given in the question make users feel frustrated and encourage them to pursue other options. I would remove inappropriate comments from the post and work with the person to refine their question. Chat is a good place for this and in my opinion is under-utilised on Ask Different for helping people with such issues. There is a difference between someone not knowing how to start with a question despite much research, and someone unwilling to put in the effort in the first place to try — chat is a good way to provide pointers in the right direction either way, such that the question and therefore the problem can be rectified.</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-06-28T13:07:17.267","CommentCount":"1"},{"Id":"3087","PostTypeId":"2","ParentId":"3083","CreationDate":"2017-06-30T05:01:17.757","Score":"9","Body":"<p><a href=\"https://stackexchange.com/users/5474807\">\n<img src=\"https://stackexchange.com/users/flair/5474807.png?theme=clean\" width=\"208\" height=\"58\" alt=\"profile for Monomeeth on Stack Exchange, a network of free, community-driven Q&amp;A sites\" title=\"profile for Monomeeth on Stack Exchange, a network of free, community-driven Q&amp;A sites\">\n</a></p>\n\n<blockquote>\n  <ol>\n  <li>How would you deal with a user who produced a steady stream of valuable answers, but tends to generate a large number of arguments/flags from comments?</li>\n  </ol>\n</blockquote>\n\n<p>My first point of call would be to touch base with our existing moderators. I’d want to know what precedent has been established for this type of scenario. I’d be surprised if there isn’t one, but if that were the case I’d still assume the moderators were already aware of this particular user, so I’d want to try and reach consensus with them first on the way forward.</p>\n\n<p>However, if I was the only moderator available, my approach would be to invite the user to a private chat and try to build some sort of rapport with them. I’d be sure to start on a positive note (such as commending them on the time they spend formulating such good quality answers). Then, when bringing up the issue at hand, I’d want to give them the opportunity to express their thoughts on what was going on, and give them the chance to suggest a way forward. Basically, I’d try to find some sort of common ground so that we could avoid a suspension.</p>\n\n<p>Either way, after a bit of an uncomfortable conversation such as this, I’d want to finish off on a more positive note. I’d be sure to remind them just how valued their answers are and how much we appreciate their efforts. My hope would be that this approach will achieve a win-win situation for the community as a whole.</p>\n\n<blockquote>\n  <ol start=\"2\">\n  <li>How would you handle a situation where another mod closed/deleted/etc a question that you feel shouldn't have been?</li>\n  </ol>\n</blockquote>\n\n<p>I’ve always been a team player and get along with most people, so I would just ask them about it. This way we’d quickly establish what their reasoning was and, if I had an alternative view, I’d be able to express that as well. If an error was made I’m sure the other mod would change it themselves. In the end, I think we’d generally reach a consensus one way or the other. </p>\n\n<blockquote>\n  <ol start=\"3\">\n  <li><p>As a moderator, your votes become binding. Actions you used to take like flagging, closing, and deleting will take effect immediately without any input from any other users or moderators.</p>\n  \n  <p>How will you adapt the way you currently flag and vote to deal with this change?</p></li>\n  </ol>\n</blockquote>\n\n<p>I always try to take a Stop-Think-Do approach to most things, so I don’t think I’ll need to adapt how I currently flag and vote. In fact, 99% of all my flags have been rated as <em>helpful</em> by the existing mods. I’m happy with that and hope to continue that standard regardless of whether I'm elected as a moderator.</p>\n\n<blockquote>\n  <ol start=\"4\">\n  <li>In addition to <em>moderation</em> activities (e.g. dealing with flagged posts, deleting spam, etc), what other role do you see that moderators can play to improve the overall success of our community?</li>\n  </ol>\n</blockquote>\n\n<p>My view is that the number 1 thing moderators can do is to lead by example.</p>\n\n<p>Some ways of doing this are easy to measure (e.g. answering questions, dealing with flags, deleting spam, editing posts, and so on).</p>\n\n<p>Other ways are not so obvious. </p>\n\n<p>For example, I think moderators have a role to play trying to calm things down if they come across a heated debate in comments (e.g. posting a comment like <em>I think it’s great you’re all so passionate, but can we please agree to focus on the specifics of the question rather than getting bogged down in a debate about…</em>). </p>\n\n<p>This type of thing is hard to measure, but it's definitely a role that moderators can play.</p>\n\n<blockquote>\n  <ol start=\"5\">\n  <li>As a user of this site, what would you say is the number one issue we face moving forward? And, do you have any thoughts on how we tackle that issue?</li>\n  </ol>\n</blockquote>\n\n<p>George (@grgarside) has already raised the issue of tags and I tend to agree as I find myself regularly changing the tags used on questions. So I like what George has to say about this and would support his approach.</p>\n\n<p>However, for me the number one issue is improving engagement between users and the site. I'll try and explain what I’m getting at:</p>\n\n<p>Since its launch, Ask Different has had over 164,000 registered users. Of these, only 0.024% of them have ever reached a reputation score of 200. Using the last 30 days as an example, we’ve had 2,930 new registrations in that time. Of these, 2,540 (86.7%) were totally new to the Stack Exchange network. Unfortunately, only 180 (that’s 0.07%) of these now have a reputation above 1.</p>\n\n<p>Now, how is this the case? Is it just that the site has an issue of low voting? Or, is it because the overwhelming majority of new users don’t ask and/or answer questions? </p>\n\n<p>For me, the only way to tackle this type of thing is to measure it. I believe if we can measure it, we can improve it. So if I’m elected as a moderator one of my side projects would be to really start measuring/analysing site usage and trying to work back from there. If it’s clear that we need to encourage voting, then we’d try to find ways to educate users on how important voting is. If it’s something else, then we tackle that. </p>\n\n<p>This is just one issue (e.g. about one-third of the site's questions - that's over 26,000 - remain unanswered, likewise many questions/answers have no votes whatsoever, and so on).</p>\n\n<p>The point is, unless we do the analysis to begin with, how will we ever know? </p>\n\n<blockquote>\n  <ol start=\"6\">\n  <li>Since being a moderator requires you to commit a significant amount of your time, as well as having to perform a number of <em>mundane</em> activities, I am wondering why you've nominated for this role? What is it you feel you have to offer that makes you worthy of our trust?</li>\n  </ol>\n</blockquote>\n\n<p>I’ve just checked and I’ve been active on the site for 444 days, and I’ve actually visited the site for the last 300 consecutive days. So I guess I’m already investing a fair bit of my time here. </p>\n\n<p>If I’m elected, it’ll probably be more about how I reprioritise that time. In terms of mundane activities, well, I’ve already been doing most of these types of things anyway (reviews, edits, flagging, etc), as I’m sure many other users can relate to as well.</p>\n\n<p>So I’m putting myself forward because I feel I can contribute to the success and growth of the site. For example:</p>\n\n<ul>\n<li>I have an analytical mind and like measuring things to see how we can do them better. As a user I’ve already started thinking about the site and how it’s being used. </li>\n<li>I’m already contemplating ways to improve engagement. For examples, see these meta posts: <a href=\"https://apple.meta.stackexchange.com/q/3041/168832\">WWDC Keynote Live Chat Event</a>  and <a href=\"https://apple.meta.stackexchange.com/q/3036/168832\">Ask Different Blog</a>.</li>\n</ul>\n\n<p><strong>So, why am I worthy of your trust?</strong></p>\n\n<p>For starters, this is not a power grab for me. I hadn't considered nominating for a moderator until recently when one of the current moderators mentioned they hoped I’d volunteer. So for me, being a moderator isn’t something I've been working towards for any sort of personal gain, or just as part of some sort of ego trip - it's really more a calling to serve.</p>\n\n<p>Along with many of you, I have dedicated a lot of time to making this site the wonderful resource it is. Anyone here can go back and read the entire history of my <a href=\"https://apple.stackexchange.com/users/168832/monomeeth?tab=answers\">answers</a> and/or <a href=\"https://apple.stackexchange.com/users/168832/monomeeth?tab=activity&amp;sort=comments\">comments</a> and see for themselves that I’ve always tried to help users, and I’m not shy to encourage them. I’m also a prolific voter of both questions and answers, regardless of whether the user was above or below me in the ranks. </p>\n\n<p>Other examples of me putting the site first include my volunteering to:</p>\n\n<ul>\n<li>allow <a href=\"https://meta.stackexchange.com/questions/291301/can-a-machine-be-taught-to-flag-spam-automatically?cb=1\">Smoke Detector</a> to use my account to flag spam automatically</li>\n<li>be part of the <a href=\"https://crowdcrafting.org/project/sehttpimagescleanup/\" rel=\"nofollow noreferrer\">crowdcrafting effort</a> to cleanup Stack Exchange’s HTTP images.</li>\n</ul>\n\n<p>While the above doesn’t necessarily prove I’m worthy of your trust, it does show my motivations have been to put the site first.</p>\n\n<blockquote>\n  <ol start=\"7\">\n  <li>If there is one thing you could/would like to change in the way the site is moderated, what would it be?</li>\n  </ol>\n</blockquote>\n\n<p>The current moderators do a fantastic job. So much so that when this election was called, my first reaction was to jump straight into Chat and ask why we were having an election. That’s because things generally run very well.</p>\n\n<p>However, there are two things that could be improved:</p>\n\n<ol>\n<li><p>Having more time to manage meta posts, as some of these do require a bit of follow-up work. Sometimes these are followed up pretty quickly, and other times they’re left sitting there with no real resolution. I do not blame the current moderators for this, I genuinely believe this is just a consequence of the fact we’ve only had <a href=\"https://apple.stackexchange.com/users?tab=moderators\">four moderators</a> for quite a while now. By way of comparison, the <a href=\"https://mathoverflow.net/users?tab=moderators\">MathOverflow</a> site basically has the same number of questions and answers as we do, but has seven active moderators.</p></li>\n<li><p>Having a moderator presence on a 24/7 basis whenever possible. At present we have four moderators, three based in the US and one in Europe. As someone who lives in Australia, I regularly find there’s a bit of a gap in terms of coverage. This isn’t usually a problem as we all have a role to play in moderation, but if we had some more time zones covered it can only be a good thing.</p></li>\n</ol>\n\n<p>The first point, and maybe even the second, will be rectified simply by having these elections.</p>\n\n<blockquote>\n  <ol start=\"8\">\n  <li>A question is asked and receives some very good answers. The asker then flags this question and asks for it to be deleted because having it up will cause them trouble at work or school. Do you delete the question?</li>\n  </ol>\n</blockquote>\n\n<p>The short answer is no, especially since users have gone to the trouble to provide some very good answers. Instead, I’d invite the OP into chat and ask them what specifically could create problems for them. This allows us to address the issue. For example, the question itself can be edited to remove any offending elements. Likewise, the OP’s profile can be edited to remove any identifying information. Regardless, I’m sure we’d be able to find a resolution that didn’t require the need to delete the question.</p>\n\n<blockquote>\n  <ol start=\"9\">\n  <li>A diamond will be attached to everything you say and have said in the past, including questions, answers and comments. Everything you will do will be seen under a different light. How do you feel about that?</li>\n  </ol>\n</blockquote>\n\n<p>I’d feel no different to how I do now.</p>\n\n<p>As I mentioned previously, anyone can go back and read the entire history of my <a href=\"https://apple.stackexchange.com/users/168832/monomeeth?tab=answers\">answers</a>,  <a href=\"https://apple.stackexchange.com/users/168832/monomeeth?tab=activity&amp;sort=comments\">comments</a> etc, and see for themselves that I’ve always conducted myself appropriately. I basically aim to always help users whenever possible, so having a diamond next to my name isn’t going to change that.</p>\n\n<blockquote>\n  <ol start=\"10\">\n  <li><p>How would you handle situations involving less than warm welcomes given to new users?</p>\n  \n  <p>For example, a new user posts a well written first question consisting of a clearly defined problem statement, admission of a high level of domain ignorance, and a request for the proper solution methodology, but no actual attempts to tackle the problem.</p>\n  \n  <p>Said question receives many downvotes and impolite comments. The asker gets upset about the situation and complains to you directly on chat and/or meta.</p>\n  \n  <p>What would you do?</p></li>\n  </ol>\n</blockquote>\n\n<p>Firstly I’d review the question and comments. Any inappropriate comments would be deleted and I’d apologise on behalf of the community for any offence caused. \nFinally, I would try to help the user to reformulate their question so we could get things back on track.</p>\n","OwnerUserId":"168832","LastEditorUserId":"168832","LastEditDate":"2017-06-30T11:48:28.263","LastActivityDate":"2017-06-30T11:48:28.263","CommentCount":"2"},{"Id":"3088","PostTypeId":"2","ParentId":"3083","CreationDate":"2017-07-02T11:31:05.587","Score":"7","Body":"<p>Here are my (<a href=\"https://apple.stackexchange.com/election/4#post-288564\">Glorfindel</a>'s) answers to your questions:</p>\n\n<hr>\n\n<blockquote>\n  <ol>\n  <li>How would you deal with a user who produced a steady stream of valuable answers, but tends to generate a large number of arguments/flags from comments?</li>\n  </ol>\n</blockquote>\n\n<p><a href=\"/help/be-nice\">Be Nice</a> is very important to the success of Stack Exchange; more important than posting good answers (or questions, for that matter). I'd remind this user (in a polite but strict way) to change their behaviour or face the consequences in the form of a suspension. There are enough other users who can write those valuable answers instead.</p>\n\n<blockquote>\n  <ol start=\"2\">\n  <li>How would you handle a situation where another mod closed/deleted/etc a question that you feel shouldn't have been?</li>\n  </ol>\n</blockquote>\n\n<p>I'd discuss this with them in a private chatroom. I might bring in a third (or fourth) moderator as well if I feel we need to make a tough decision, so that it can be a decision of a majority. There's no need doing this in public and risk harming the trust the community has in the moderator team.</p>\n\n<blockquote>\n  <ol start=\"3\">\n  <li><p>As a moderator, your votes become binding. Actions you used to take like flagging, closing, and deleting will take effect immediately without any input from any other users or moderators.</p>\n  \n  <p>How will you adapt the way you currently flag and vote to deal with this change?</p></li>\n  </ol>\n</blockquote>\n\n<p>From what I've seen, the community already does a decent job of moderating this site. My job as a moderator would be mainly to <em>guide</em> that, and not make unilateral decisions, unless strictly necessary. A ♦ moderator is a <em>representative</em> of the community, not a <em>ruler</em>; if the community thinks something is worth keeping (open), I'm willing to forego my personal opinions. I'd probably end up <kbd>Skip</kbd>ping more reviews than I usually do.</p>\n\n<blockquote>\n  <ol start=\"4\">\n  <li>In addition to <em>moderation</em> activities (e.g. dealing with flagged posts, deleting spam, etc), what other role do you see that moderators can play to improve the overall success of our community?</li>\n  </ol>\n</blockquote>\n\n<p>The following isn't limited to moderators; it concerns all users. But I believe moderators should lead by example:</p>\n\n<ul>\n<li>Increase participation\n\n<ul>\n<li>This starts with welcoming other users, so that they're more likely to stick around.</li>\n<li>\"Being nice\" helps tremendously in the long run.</li>\n<li>I'm not necessarily trying to draw people away from Super User, but I see a lot of Mac questions there that would fit here perfectly.</li>\n<li>I like the idea of organizing chat events around Apple's keynotes. I'm sorry I wasn't around the previous time this happened.</li>\n</ul></li>\n<li>Represent the interests of Ask Different across the network. (I can't think of something specific right now, to be honest.)</li>\n<li>Sometimes, we spot certain trends (e.g. a sudden spike in the number of questions about a single topic). We should think of a solution (e.g. creating one or two canonical questions) and propose this on Meta, so that the community can chime in and decide.</li>\n</ul>\n\n<blockquote>\n  <ol start=\"5\">\n  <li>As a user of this site, what would you say is the number one issue we face moving forward? And, do you have any thoughts on how we tackle that issue?</li>\n  </ol>\n</blockquote>\n\n<p>We have a very low (69%) of <a href=\"https://stackexchange.com/sites#percentanswered\">questions which are answered</a> &lt;-- you have to scroll down a bit, alas. For comparison: one of the (not always enforced) criteria for graduation of a beta site is that it must have an answered percentage of at least 80%. 90% or higher is considered healthy.</p>\n\n<p>This can have two possible reasons: we have too many questions, or too few people able to answer those questions (or close them as a duplicate of a canonical question – closed questions don't count in that metric). If it's the first, we should focus on increasing the chance that a (new) user is able to solve his/her problem with the vast number of questions we already have. The second is probably harder, and would mean we probably need more knowledgeable people here.</p>\n\n<blockquote>\n  <ol start=\"6\">\n  <li>Since being a moderator requires you to commit a significant amount of your time, as well as having to perform a number of <em>mundane</em> activities, I am wondering why you've nominated for this role? What is it you feel you have to offer that makes you worthy of our trust?</li>\n  </ol>\n</blockquote>\n\n<p>As indicated in my <a href=\"https://apple.stackexchange.com/election/4#post-288564\">nomination</a>, I love moderating. I have been doing a lot of mundane tasks <em>behind the scenes</em>; not being in the spotlight works right for 95% of the time. For the other 5%, it's useful to have a ♦ behind your name. I'm offering to work hard, just as I've done in the past.</p>\n\n<blockquote>\n  <ol start=\"7\">\n  <li>If there is one thing you could/would like to change in the way the site is moderated, what would it be?</li>\n  </ol>\n</blockquote>\n\n<p>I don't think major changes are needed. Sometimes, my Not-An-Answer flags on \"I'm having the same problem, did you solve it?\" take quite long to be processed, but I guess the election will take care of this, by increasing the number of moderators and the hours that they are available. (And to be honest, those posts are annoying but not really harmful.)</p>\n\n<p>I mentioned some areas in need of attention under point 4, but those do not really fall under <em>moderation</em>, and are shared responsibilities between the ♦ moderators and other community members.</p>\n\n<blockquote>\n  <ol start=\"8\">\n  <li>A question is asked and receives some very good answers. The asker then flags this question and asks for it to be deleted because having it up will cause them trouble at work or school. Do you delete the question?</li>\n  </ol>\n</blockquote>\n\n<p>No. By signing up and posting content on Stack Exchange, the user has granted a non-revocable right, under the <a href=\"https://creativecommons.org/licenses/by-sa/3.0/\" rel=\"nofollow noreferrer\">CC BY-SA 3.0 license</a>, for SE to distribute that content. I'd explain that to the user (licenses can be tricky material) and ask them to submit a <em>disassociation request</em> via the contact us form (that can only be performed by Stack Overflow staff, not by ♦s). This will keep the valuable content but remove the association with the user. In addition, if the post contains Personally Identifiable Information, I'll redact it if necessary (so that it doesn't end up in the revision history).</p>\n\n<blockquote>\n  <ol start=\"9\">\n  <li>A diamond will be attached to everything you say and have said in the past, including questions, answers and comments. Everything you will do will be seen under a different light. How do you feel about that?</li>\n  </ol>\n</blockquote>\n\n<p>Yes. I always try to Be Nice to all people, even if I think they have bad ideas or opinions which I can outright refute. <strong>Respect</strong> is the keyword for building a community where everybody is welcome. I have certainly made some mistakes in the past, but that only proves I'm human and <a href=\"https://chat.stackexchange.com/transcript/11540?m=38051363#38051363\">not an AI</a>.</p>\n\n<blockquote>\n  <ol start=\"10\">\n  <li><p>How would you handle situations involving less than warm welcomes given to new users?</p>\n  \n  <p>For example, a new user posts a well written first question consisting of a clearly defined problem statement, admission of a high level of domain ignorance, and a request for the proper solution methodology, but no actual attempts to tackle the problem.</p>\n  \n  <p>Said question receives many downvotes and impolite comments. The asker gets upset about the situation and complains to you directly on chat and/or meta.</p>\n  \n  <p>What would you do?</p></li>\n  </ol>\n</blockquote>\n\n<p>\"This question does not show any research effort\" is a good reason to downvote a question (it's on the downvote tooltip), and I support the <a href=\"https://apple.meta.stackexchange.com/q/3030/121968\">No Research</a> close reason (which would put the question <em>on hold</em> so that it can be improved – many people forget about that). I'd try to make clear (in a respectful manner) to the user <em>why</em> we don't allow/like these types of questions on Stack Exchange, and discuss together how to improve his/her question (e.g. by suggesting some avenues to explore). Chat is a perfect medium for that because it's interactive.</p>\n\n<p>Impolite comments can always be flagged and, if necessary, reposted (with attribution) keeping the constructive bits.</p>\n","OwnerUserId":"121968","LastActivityDate":"2017-07-02T11:31:05.587","CommentCount":"1"},{"Id":"3089","PostTypeId":"1","AcceptedAnswerId":"3090","CreationDate":"2017-07-03T07:04:11.733","Score":"2","ViewCount":"21","Body":"<p>For the last couple of weeks, I've had the weird rainbow header on AskDifferent, as seen in <a href=\"https://apple.meta.stackexchange.com/questions/3033/why-do-i-occasionally-get-a-big-rainbow-in-the-top-banner\">Why do I occasionally get a big rainbow in the top banner?</a></p>\n\n<p>This is what it looks like:</p>\n\n<p><a href=\"https://i.stack.imgur.com/uTAwQ.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/uTAwQ.png\" alt=\"Rainbow Header\"></a></p>\n\n<p>The Meta site does not show a header at all, it's just blank:</p>\n\n<p><a href=\"https://i.stack.imgur.com/myKRP.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/myKRP.png\" alt=\"Meta Site without header\"></a></p>\n\n<p>This is on Chrome 59.0.3071.115 on macOS 10.12.5. Other browsers (Safari) on the same machine work fine. Here's what I tried to fix this:</p>\n\n<ul>\n<li>Refresh the page with a hard reload/clear browser cache)</li>\n<li>Logged out and in again - not easy since the log out/in links are not visible without the header</li>\n<li>Tried to load the page on different networks (home/work)</li>\n</ul>\n\n<p>None of these have helped.</p>\n\n<p>Other StackOverflow sites work fine. When loading the page, the header is visible for a second or two, then it's covered by the rainbow header or the empty header on Meta.</p>\n\n<p>The issues is making AskDifferent pretty much unusable for me at the moment (at least from my default browser). Any idea what could be causing this?</p>\n","OwnerUserId":"24130","LastActivityDate":"2017-07-03T07:10:38.953","Title":"Rainbow/Empty header on on AskDifferent and Meta.AskDifferent","Tags":"<bug><design>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"0"},{"Id":"3090","PostTypeId":"2","ParentId":"3089","CreationDate":"2017-07-03T07:10:38.953","Score":"3","Body":"<p>Found the answer after a couple of minutes...</p>\n\n<p>This issue was caused by the following TamperMonkey script: <a href=\"https://github.com/shu8/Stack-Overflow-Optional-Features\" rel=\"nofollow noreferrer\">https://github.com/shu8/Stack-Overflow-Optional-Features</a></p>\n\n<p>Disabling this in TamperMonkey made the site work again. The version in question is <em>1.8DEV</em>, which seems to be the latest version.</p>\n\n<p>I've disabled this script now and everything is working again.</p>\n","OwnerUserId":"24130","LastActivityDate":"2017-07-03T07:10:38.953","CommentCount":"1"},{"Id":"3091","PostTypeId":"1","CreationDate":"2017-07-04T07:07:25.563","Score":"-6","ViewCount":"51","Body":"<p>I'm reviewing candidates for moderator. I would like to see their comments and other actions like up-votes, down-votes and closures (in addition to questions and answers). The comments, up-votes, down-votes and closures indicate (to me) how the candidate will perform (assuming past performance is an indicator of future expectations).</p>\n\n<p>The comments, up-votes, down-votes and closures are tucked away under <em>All Actions</em> tab of a profile. I can view mine, but I cannot view others.</p>\n\n<p>I'd like to request the entire profile for Moderator candidates be made available for inspection.</p>\n","OwnerUserId":"83961","LastActivityDate":"2017-07-04T16:21:12.290","Title":"Please provide entire profile for Moderator candidates","Tags":"<feature-request><moderators><election><profile-page>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"0"},{"Id":"3092","PostTypeId":"2","ParentId":"3091","CreationDate":"2017-07-04T08:49:03.387","Score":"4","Body":"<p>The places to learn more about mod candidates are the Q&amp;A here on Meta and the Election chat room where all the candidates answer questions thrown at them. </p>\n\n<p>Please keep in mind that the site is primarily community moderated, so the individual voting pattern of mods isn't very important. Even their casting of close votes isn't as important nowadays, there are enough highrep users to close (or not close) a lot of questions without a mod joining in. Which is how it should be, actually. </p>\n\n<p>More important is their ability to step in in situations where the community can't resolve an issue on its own and/or where emotions start to take over. Also, even mods don't work in isolation but as Part of a team which supports decision making by mods and sometimes also discusses individual mod behavior (in case things go severely wrong). </p>\n\n<p>PS: Not even moderators can see up/down votes of other users when locking at a specific question/answer. We can see the \"All Actions\" tab for all users but honestly I had to verify this first because there just never was the need to look.</p>\n","OwnerUserId":"9058","LastEditorUserId":"9058","LastEditDate":"2017-07-04T10:59:14.457","LastActivityDate":"2017-07-04T10:59:14.457","CommentCount":"5"},{"Id":"3094","PostTypeId":"1","CreationDate":"2017-07-04T15:58:18.757","Score":"4","ViewCount":"45","Body":"<p>I love this site, and I'm doing my best to provide good questions and helpful answers. But as I browse through the questions, I find a lot of orphaned questions that IMO don't contribute anything to the site.</p>\n\n<p>Examples are:</p>\n\n<ul>\n<li>Questions that weren't clear, there was a comment asking for clarification, but the questioner never got back - like <a href=\"https://apple.stackexchange.com/questions/186330/unable-to-connect-to-a-server-over-vpn?rq=1\">this one</a></li>\n<li>Questions that weren't answered for a long time, and now refer to old iOS or OS X versions that are probably no longer in use - like <a href=\"https://apple.stackexchange.com/questions/63672/forcing-vpn-on-demand-to-on?rq=1\">this one</a> </li>\n</ul>\n\n<p>How should I as a user react when I come across such questions?</p>\n","OwnerUserId":"164512","LastActivityDate":"2017-07-17T18:28:54.587","Title":"How to get rid of orphaned questions?","Tags":"<discussion>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"0"},{"Id":"3095","PostTypeId":"2","ParentId":"3091","CreationDate":"2017-07-04T16:21:12.290","Score":"4","Body":"<p>Some of what you ask isn’t exposed to any end user whether you’re a new user or trusted user with 20k rep or an elected moderator.</p>\n\n<p>However, most of that data is already available from the periodic data dumps and Stack Exchange data explorer interface. </p>\n\n<p>Comments are trivial to look at:</p>\n\n<ul>\n<li><a href=\"http://data.stackexchange.com/apple/query/947/my-comment-score-distribution\" rel=\"nofollow noreferrer\">http://data.stackexchange.com/apple/query/947/my-comment-score-distribution</a></li>\n</ul>\n\n<p>Change the user and pick out any data you wish to review. </p>\n\n<p>Also, I wouldn’t worry too much about single votes to close or even patterns as an end user. Those votes aren’t binding and are easily reviewed, challenged, undone - the system is designed to withstand malicious actors so people acting in good faith rarely cause issues. </p>\n\n<p>I echo Patrix in that the moderation team is collaborative and is given detailed guidance and support by the community team - we end up being much more than the same user as before with a diamond tacked on our names. </p>\n\n<p>Lastly, we rarely need to worry about pleasing or dis-pleasing and instead we just help when pattern are starting to form to reach out to a person and say “hey - I see a few of your questions were closed recently - can I help you work on them to edit or are the guidelines clear at this point” or “hey - I can see both sides of this. Rather than keep editing this post - let’s get a new post up to make the point for which you are making a good case.”</p>\n\n<p>We really do moderate far more than discipline or act unilaterally and when we do act unilaterally - we have channels to get someone else to double check our work to make sure we weren’t missing something or not too hasty.</p>\n","OwnerUserId":"5472","LastActivityDate":"2017-07-04T16:21:12.290","CommentCount":"0"},{"Id":"3096","PostTypeId":"2","ParentId":"3094","CreationDate":"2017-07-04T16:31:40.370","Score":"5","Body":"<p>The good news is that the site is designed to have a large number of unanswered / orphaned / closed but not deleted questions and they only serve to index issues and eventually point to the most on-topic and best answered post covering the main issue.</p>\n\n<p>Whether a post is 5 days old or 5 years old - it can always be edited to make it more clear or more relevant or in some cases - more general.</p>\n\n<p>Comments can always be left to help clarify what the issue is in case that brings back the poster. Unless someone makes votes or posts in answer - questions get cleaned up automatically over time if they never generate any interest.</p>\n\n<p>As to old questions - as long as they are tagged appropriately with versions instead of saying “the latest iPhoto” old posts will help people that don’t want to upgrade or can’t upgrade.</p>\n\n<ul>\n<li>This one isn’t that bad and someone could come and answer a “here’s how to troubleshoot VPN in general and here are links to more articles.” - <a href=\"https://apple.stackexchange.com/questions/186330/unable-to-connect-to-a-server-over-vpn\">Unable to connect to a server over VPN</a> The other is just fine since it calls out iOS 6 and you’re right - even with potential benefit - chances are they may sit in the back waters of the site forever without an answer.</li>\n</ul>\n\n<p>Lastly - you are free to exercise your franchise and down vote them for reasons above. At some point they get cleared out when they are 0 or less score and untouched for a while. A single vote might be all that’s needed to clear them even without close votes.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2017-07-04T16:39:00.910","LastActivityDate":"2017-07-04T16:39:00.910","CommentCount":"2"},{"Id":"3098","PostTypeId":"1","CreationDate":"2017-07-11T20:21:15.880","Score":"24","ViewCount":"161","Body":"<p>Ask Different's <a href=\"https://apple.stackexchange.com/election/4\">4th moderator election</a> has come to a close, the votes have been tallied, and the 3 new moderators are:</p>\n\n<p><a href=\"https://apple.stackexchange.com/users/37797\"><img src=\"https://apple.stackexchange.com/users/flair/37797.png\" alt=\"grgarside\"></a> <a href=\"https://apple.stackexchange.com/users/168832\"><img src=\"https://apple.stackexchange.com/users/flair/168832.png\" alt=\"Monomeeth\"></a> <a href=\"https://apple.stackexchange.com/users/121968\"><img src=\"https://apple.stackexchange.com/users/flair/121968.png\" alt=\"Glorfindel\"></a> </p>\n\n<p>They'll be joining <a href=\"https://apple.stackexchange.com/users?tab=moderators\">the existing crew</a> shortly — please thank them for volunteering, and share your assistance and advice with them as they learn the ropes!</p>\n\n<p>For details on how the voting played out, you can download the election results <a href=\"https://apple.stackexchange.com/election/4\">here</a>, or <a href=\"https://www.opavote.com/results/5636392960917504/0\" rel=\"nofollow noreferrer\">view a summary report online</a>.</p>\n","OwnerUserId":"4604","LastActivityDate":"2017-07-11T20:21:15.880","Title":"2017 Community Moderator Election Results","Tags":"<discussion><election>","AnswerCount":"0","CommentCount":"7","FavoriteCount":"1"},{"Id":"3099","PostTypeId":"1","CreationDate":"2017-07-11T21:20:35.110","Score":"1","ViewCount":"18","Body":"<p>Now and again, an old question will make its way up onto the homepage... like, <em>really</em> old. </p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/36786/how-do-i-enroll-devices-while-can-enable-remote-management-is-disabled\">How do I enroll devices while &quot;Can enable remote management&quot; is disabled?</a> was bumped just a few minutes ago, and is from 2012.</p>\n\n<p>Since technology is changing a lot (unlike a lot of other SE topics), what can we do about this? These questions are very difficult to answer and are nearly uneditable because of how different iOS 4 and MobileMe were from iOS 11 and iCloud.</p>\n","OwnerUserId":"191432","LastActivityDate":"2017-07-11T21:20:35.110","Title":"What is there to be done about all those old questions?","Tags":"<discussion>","AnswerCount":"0","CommentCount":"0","FavoriteCount":"0","ClosedDate":"2017-07-12T04:20:22.047"},{"Id":"3100","PostTypeId":"1","CreationDate":"2017-07-12T03:28:49.280","Score":"2","ViewCount":"23","Body":"<p>Yes, there are already a lot of questions on meta about prerelease software, but I don’t think any of them actually focus on Public Betas. </p>\n\n<p>Sure, in the past, people would illegally download developer ipsw files to get ios betas on their phones. But now, since it is easy and legal to download the iOS 11 beta (I’m running it right now), we are seeing more and more questions crop up about iOS betas that do not apply to a vast majority of users on this forum, like <a href=\"https://apple.stackexchange.com/q/290556/191432\">Will Siri in iOS 11 support Spotify?</a></p>\n\n<p>What should we do about these questions? </p>\n","OwnerUserId":"191432","LastEditorUserId":"121968","LastEditDate":"2017-07-12T08:17:14.410","LastActivityDate":"2017-07-12T08:17:14.410","Title":"Revisiting prerelease software","Tags":"<discussion><site-scope>","AnswerCount":"0","CommentCount":"2","FavoriteCount":"1","ClosedDate":"2017-07-12T04:17:49.103"},{"Id":"3101","PostTypeId":"5","CreationDate":"2017-07-12T08:17:49.490","Score":"0","Body":"","OwnerUserId":"121968","LastEditorUserId":"121968","LastEditDate":"2017-07-12T08:17:49.490","LastActivityDate":"2017-07-12T08:17:49.490","CommentCount":"0"},{"Id":"3102","PostTypeId":"4","CreationDate":"2017-07-12T08:17:49.490","Score":"0","Body":"For questions about what is in scope (on-topic) for Ask Different and what not.","OwnerUserId":"121968","LastEditorUserId":"121968","LastEditDate":"2017-07-12T08:17:49.490","LastActivityDate":"2017-07-12T08:17:49.490","CommentCount":"0"},{"Id":"3103","PostTypeId":"1","CreationDate":"2017-07-12T08:20:39.853","Score":"11","ViewCount":"147","Body":"<p>Similar to <a href=\"https://apple.meta.stackexchange.com/q/2433/217210\">this situation</a>, I've had 7 recent comment flags declined on noisy comments.</p>\n\n<p>These comments are just of the '+1' or 'Thanks' type:</p>\n\n<blockquote>\n  <p>Huge \"THANKS!\". :)</p>\n</blockquote>\n\n<p></p>\n\n<blockquote>\n  <p>+100 to <code>apachectl configtest</code></p>\n</blockquote>\n\n<p></p>\n\n<blockquote>\n  <p>+10 for \"Scrollen und Zoomen\"</p>\n</blockquote>\n\n<p>When you go to post a comment, you see this:</p>\n\n<p><a href=\"https://i.stack.imgur.com/rh88N.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/rh88N.png\" alt=\"see blockquote below\"></a></p>\n\n<blockquote>\n  <p>Use comments to ask for more information or suggest improvements. <strong>Avoid comments like \"+1\" or \"thanks\".</strong> (emphasis mine)</p>\n</blockquote>\n\n<p>And <a href=\"https://meta.stackexchange.com/a/15292/294691\">Jeff Atwood said to flag these</a>.</p>\n\n<p>So... why did I have these flags declined? I know that 9 declined flags out of 521 total isn't bad, but still... why were they declined?</p>\n","OwnerUserId":"217210","LastEditorUserId":"5472","LastEditDate":"2017-07-15T18:23:50.520","LastActivityDate":"2017-07-15T18:23:50.520","Title":"Why were these too chatty flags declined on some +1 comments?","Tags":"<discussion><flagging><comments>","AnswerCount":"2","CommentCount":"1","FavoriteCount":"1","ClosedDate":"2017-08-24T17:35:57.403"},{"Id":"3104","PostTypeId":"2","ParentId":"3103","CreationDate":"2017-07-12T23:20:10.337","Score":"9","Body":"<p>I'm the 'culprit', so to speak, for declining the three comments you're asking about. </p>\n\n<p>In summary:</p>\n\n<p>The <code>Huge \"THANKS!\". :)</code> comment <em>should</em> have been deleted (I think that was a case of me hitting the wrong option). My apologies for that one.</p>\n\n<p>As for the other two, for me they were 50/50 and I could have gone either way. The reasons I opted to leave them were as follows:</p>\n\n<ul>\n<li>The community had upvoted these comments (one has 6, the other 5) which is relatively high, so for me this was an indication they were <em>valued</em> in some way.</li>\n<li>They added a sense of <em>confirmation</em> that the answer (or something in the answer) was useful/correct.</li>\n<li>They're relatively old (one is over 4 yrs old), so there was probably nothing to gain by deleting them.</li>\n</ul>\n\n<p>Now, if the comments were posted today, I would have:</p>\n\n<ul>\n<li>deleted the <code>+10 for \"Scrollen und Zoomen\"</code> comment as it wouldn't have had the votes and doesn't really add anything significant to the answer.</li>\n<li>left the <code>+100 to apachectl configtest</code> comment alone on the basis that many users are 'nervous' when it comes to using Terminal, so for those users this comment adds some weight to what was suggested in the answer. </li>\n</ul>\n\n<p>Finally, it's quite possible (even probable) that I was over thinking all of this since it was my first day as a Mod, so I'll be checking with the others on their view of this as well. I appreciate you taking the time to ask the question in meta and sincerely hope this doesn't discourage you from flagging posts in future.</p>\n","OwnerUserId":"168832","LastActivityDate":"2017-07-12T23:20:10.337","CommentCount":"1"},{"Id":"3105","PostTypeId":"2","ParentId":"3103","CreationDate":"2017-07-14T22:14:04.787","Score":"5","Body":"<p>Right on cue - a long discussion on how the “too chatty” standard was loose and unhelpful - <a href=\"https://meta.stackexchange.com/questions/292011/drop-not-constructive-combine-noisy-reword-rude-and-other-comment-flag\">we’ve done away with that flag across all sites effective immediately.</a></p>\n\n<p><a href=\"https://i.stack.imgur.com/GxUfW.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/GxUfW.png\" alt=\"rude or abusive, no longer needed, in need of moderator intervention\"></a></p>\n\n<h1>The problem</h1>\n\n<p>Comments are terrible; no one agrees on what they're for, or how long they should be kept. Comment flags are equally terrible, because if no one's on the same page as far as what should be posted in the first place then no one can agree on what should be removed either. On top of that, we have this confusing set of flags where two mean \"noise\", one means \"vile\", one means \"moderator, help!\" and one means nothing at all - the end result is that it's all but impossible to even analyze comment flagging.</p>\n","OwnerUserId":"5472","LastActivityDate":"2017-07-14T22:14:04.787","CommentCount":"1"},{"Id":"3106","PostTypeId":"2","ParentId":"3094","CreationDate":"2017-07-17T18:28:54.587","Score":"0","Body":"<p>If you find a question that isn't clear, to the point where it is unanswerable, and where the poster hasn't responded to a request for clarification, vote to close it as 'Unclear what you are asking'.  If there is no existing comment identifying what is unclear, it would be appropriate to leave a comment explaining what is unclear.</p>\n\n<p>For old questions that relate to old versions, as long as it is clear that they are specific to the older version, do nothing -- leave them be.  If the question is more general and not specific to a newer version, you can provide a new answer with the updated information.  (In some cases you might be able to vote to close as a duplicate of another question that has better answers, if a suitable one exists, or possibly edit to clarify that the question is about an older version.)</p>\n\n<p>If you can't vote to close yet, you can always flag it for closure, which will put it into a queue where others with the privileges to vote for closure can review it and decide whether they want to vote to close it too.</p>\n","OwnerUserId":"24154","LastActivityDate":"2017-07-17T18:28:54.587","CommentCount":"0"},{"Id":"3107","PostTypeId":"1","CreationDate":"2017-07-18T22:55:25.787","Score":"2","ViewCount":"69","Body":"<p>Now and then I find something here that is very, very helpful, and I want to thank the person who posted it, by commenting in some apposite phrases. But I can't. I need 50 'reputation' points. </p>\n\n<p>I really haven't time to contribute to that extent, so a lot of people here are missing out on kudos. I don't wish merely to click-and-upvote, I don't experience sufficient problems to be seeking all the time for assistance. Besides, click-vote is too easy, too impersonal. Just one of the many reasons I long ago deleted my Facebook account was the culture of the inane 'Like' button. It doesn't demand any thought of the button clicker (Why do you like it? Give reasons for your approval) and is part of the widespread dumbing-down trend.</p>\n\n<p>So, to all the brilliant, non-dumbing people here, who take and have taken the trouble to share their knowledge, and break Gordian knots for those of us in toils, please share this 'thank you' among yourselves. I'm afraid it's the only one I am currently allowed to give you.</p>\n","OwnerUserId":"246958","OwnerDisplayName":"Stephen Gard","LastEditorUserId":"121968","LastEditDate":"2017-07-19T07:08:57.263","LastActivityDate":"2017-07-19T07:08:57.263","Title":"How to Thank People","Tags":"<discussion><comments>","AnswerCount":"1","CommentCount":"9","FavoriteCount":"0"},{"Id":"3108","PostTypeId":"1","AcceptedAnswerId":"3111","CreationDate":"2017-07-19T01:17:33.287","Score":"7","ViewCount":"71","Body":"<p>I was doing a little bit of poking around today and realized that <a href=\"https://apple.stackexchange.com/questions/tagged/waterproof\" class=\"post-tag\" title=\"show questions tagged &#39;waterproof&#39;\" rel=\"tag\">waterproof</a> is a synonym for <a href=\"https://apple.stackexchange.com/questions/tagged/environment\" class=\"post-tag\" title=\"show questions tagged &#39;environment&#39;\" rel=\"tag\">environment</a>. Seems correct, right? Well, let's take a look at the description of <a href=\"https://apple.stackexchange.com/questions/tagged/environment\" class=\"post-tag\" title=\"show questions tagged &#39;environment&#39;\" rel=\"tag\">environment</a>.</p>\n\n<blockquote>\n  <p>Environment variables are used to create shared settings that persist between invocations of applications. They are used to provide information such as paths to important directories, user information and other information programs need for common tasks.</p>\n</blockquote>\n\n<p>Now <em>that</em> doesn't seem right, does it.</p>\n\n<p>I propose that we remove the tag synonym <code>waterproof</code> from <a href=\"https://apple.stackexchange.com/questions/tagged/environment\" class=\"post-tag\" title=\"show questions tagged &#39;environment&#39;\" rel=\"tag\">environment</a></p>\n","OwnerUserId":"191432","LastActivityDate":"2017-07-19T10:58:58.693","Title":"Removing tag synonym","Tags":"<discussion><tags>","AnswerCount":"2","CommentCount":"3","FavoriteCount":"0"},{"Id":"3109","PostTypeId":"2","ParentId":"3107","CreationDate":"2017-07-19T03:50:43.190","Score":"5","Body":"<p>You say \"thank you\" on the Stack Exchange network by giving their answer or question an \"up vote\". It's that simple.</p>\n\n<p>From <a href=\"https://meta.stackexchange.com/a/126184/151364\">this meta discussion on whether comments to say \"thank you\" are appropriate</a>: that's not really what comments are for. They're for:</p>\n\n<blockquote>\n  <p><strong>When should I comment?</strong></p>\n  \n  <p>You should submit a comment if you want to:</p>\n  \n  <ul>\n  <li>Request clarification from the author;</li>\n  <li>Leave constructive criticism that guides the author in improving the post;</li>\n  <li>Add relevant but minor or transient information to a post (e.g. a link to a related question, or an alert to the author that the question has been updated).</li>\n  </ul>\n  \n  <p><strong>When shouldn't I comment?</strong></p>\n  \n  <ul>\n  <li>Compliments which do not add new information (\"+1, great answer!\"); instead, up-vote it and <a href=\"https://stackoverflow.com/questions/how-to-answer\">pay it forward</a>;</li>\n  </ul>\n</blockquote>\n","OwnerUserId":"292","LastActivityDate":"2017-07-19T03:50:43.190","CommentCount":"1"},{"Id":"3110","PostTypeId":"2","ParentId":"3108","CreationDate":"2017-07-19T07:40:58.447","Score":"3","Body":"<p>We have a tag <a href=\"https://apple.stackexchange.com/questions/tagged/environmental\" class=\"post-tag\" title=\"show questions tagged &#39;environmental&#39;\" rel=\"tag\">environmental</a> which is a better match for <a href=\"https://apple.stackexchange.com/questions/tagged/waterproof\" class=\"post-tag\" title=\"show questions tagged &#39;waterproof&#39;\" rel=\"tag\">waterproof</a>, but it's already <a href=\"https://apple.stackexchange.com/tags/temperature/synonyms\">synonymized</a> to <a href=\"https://apple.stackexchange.com/questions/tagged/temperature\" class=\"post-tag\" title=\"show questions tagged &#39;temperature&#39;\" rel=\"tag\">temperature</a>. Given that tag's excerpt:</p>\n\n<blockquote>\n  <p>Using Apple products in wet, dry, hot, low- or high-pressure environments.</p>\n</blockquote>\n\n<p>it's probably better to reverse that synonym direction, and a good deal of the questions are actually about Apple devices <em>themselves</em> having a high temperature. So that's worth having another look on.</p>\n\n<p>For now, I have removed the synonym and renamed <a href=\"https://apple.stackexchange.com/questions/tagged/environment\" class=\"post-tag\" title=\"show questions tagged &#39;environment&#39;\" rel=\"tag\">environment</a> to <a href=\"https://apple.stackexchange.com/questions/tagged/environment-variables\" class=\"post-tag\" title=\"show questions tagged &#39;environment-variables&#39;\" rel=\"tag\">environment-variables</a> to avoid confusion in the future. I retagged a dozen or so questions where the tag no longer made sense, e.g. <a href=\"https://apple.stackexchange.com/questions/103056/retina-macbook-pro-15-overheating\">this one</a>, but I could have missed some of them. My apologies for the (minor) flooding of the homepage.</p>\n","OwnerUserId":"121968","LastEditorUserId":"121968","LastEditDate":"2017-07-19T07:58:08.187","LastActivityDate":"2017-07-19T07:58:08.187","CommentCount":"5"},{"Id":"3111","PostTypeId":"2","ParentId":"3108","CreationDate":"2017-07-19T10:58:58.693","Score":"4","Body":"<p>This is a good question and discussion to have. Apart from the mechanics of changing a synonym. What would the purpose of \"waterproof\" be. On one level we could make thousands of tags to cover all the items, all the conditions, all the verbs and then try to organize them. I'm pretty sure I made the synonym (unless someone else beat me to it).</p>\n\n<p>The other would be to have a short discussion on what the tags will do for the main site. My inclination would be to look at the various envorinmental concerns and see if they are adequately searchable without needing a special tag and maybe adjusting the description of environmental / environment tag.</p>\n\n<p>Great tags explain what sort of questions that tag serves to collect. Waterproof and overheating and temperature and altitude are all operating conditions that relate to the normal functioning of hardware. It might still be better for the site to have the common tag so that the people that care to answer questions about hardware usage / design can find those questions to answer.</p>\n\n<p>I think we can clean up the naming so that people are less likely to get confused with environment being physical vs environment being a specific classification of variable in a specific command line context.</p>\n","OwnerUserId":"5472","LastActivityDate":"2017-07-19T10:58:58.693","CommentCount":"0"},{"Id":"3112","PostTypeId":"1","CreationDate":"2017-07-24T15:19:35.313","Score":"-3","ViewCount":"68","Body":"<p>I've seen my fair share of 'shady' per-se questions on here, and am looking for input on where we draw the line. </p>\n\n<p>There are several places that we could draw this metaphorical line:</p>\n\n<ul>\n<li>Jailbreak related questions (violates Apple EULA) like this:<br>\n<a href=\"https://apple.stackexchange.com/questions/288157/cydia-unable-to-load-server-certificate-invalid\">Cydia Unable to Load (server certificate invalid)</a></li>\n<li>Hackintoshes (violates Apple EULA, potentially DMCA?) like this:<br>\n<a href=\"https://apple.stackexchange.com/questions/118014/hackintosh-vmware-amd-7950-chipset\">Hackintosh / VMWare AMD 7950 Chipset</a></li>\n<li>Piracy related questions (violates Apple, StackExchange EULA, is <em>actually</em> illegal) like this:<br>\n<a href=\"https://apple.stackexchange.com/questions/292762/quicktime-player-wont-record-iphone-hotstar-or-amazon-prime-videos-any-more\">QuickTime Player won&#39;t record iPhone Hotstar or Amazon Prime videos any more</a></li>\n</ul>\n\n<p>What should we allow? It can be using one of these points, or even something in between. </p>\n","OwnerUserId":"191432","LastActivityDate":"2017-07-24T15:19:35.313","Title":"Where do we draw the legal line?","Tags":"<discussion><site-scope>","AnswerCount":"1","CommentCount":"3","FavoriteCount":"2"},{"Id":"3113","PostTypeId":"2","ParentId":"3112","CreationDate":"2017-07-24T15:19:35.313","Score":"-3","Body":"<p>I believe that we should <strong>allow</strong> jailbreak related questions. There's a big enough community - and as long as they aren't questions like <em>When will an iOS 11.0.4 jailbreak come out</em> they are fine. Might as well add in a jailbreak tag. Oh, wait - we already have one: <a href=\"https://apple.stackexchange.com/questions/tagged/jailbreak\" class=\"post-tag\" title=\"show questions tagged &#39;jailbreak&#39;\" rel=\"tag\">jailbreak</a></p>\n\n<p>I also believe that we should <strong>disallow</strong> hackintosh questions. Since these are already going to be highly technical, they may confuse some of the newcomers, and can also detract from the community. They will be asking about non-apple parts, and that can get a little messy. Also, the hackintosh community's a little too small for this right now.</p>\n\n<p>Finally, I think we should <strong>disallow</strong> questions about piracy because that's straight-up <strong>illegal</strong>, and we're actually forbidden from posting about it on StackExchange, from what I've determined from the <a href=\"/legal\">ToS</a> and <a href=\"/legal/content-policy\">content policy</a></p>\n\n<h2>Summary:</h2>\n\n<p>Should we allow...  </p>\n\n<ul>\n<li>Jailbreak: <strong>YES</strong>  </li>\n<li>Hackintosh: <strong>NO</strong>  </li>\n<li>Piracy: <strong>NO</strong></li>\n</ul>\n","OwnerUserId":"191432","LastActivityDate":"2017-07-24T15:19:35.313","CommentCount":"5"},{"Id":"3114","PostTypeId":"1","CreationDate":"2017-08-04T18:34:14.683","Score":"1","ViewCount":"39","Body":"<p>I flagged several comments under a legacy question but all the flags were declined.  I was under the impression, under SE guidelines, +1 and thanks were to be removed.  As a new member to this SE site I wanted to start contributing but it seems the rules are different.  Can a moderator shed some light on this topic?  Are thanks and +1 supposed to removed or not?</p>\n\n<p>Reference: <a href=\"https://meta.stackexchange.com/questions/279449/should-1-and-thanks-comments-be-a-declined-flag\">Should +1 and thanks comments be a declined flag?</a></p>\n\n<p>Denied flags:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/400/please-share-your-hidden-macos-features-or-tips-and-tricks/6267#comment1376_414\">Holy crap. That is seriously a hidden gem.</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/400/please-share-your-hidden-macos-features-or-tips-and-tricks/6267#comment1069_414\">I didn't know about the \"space\" aspect -- very nice!</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/400/please-share-your-hidden-macos-features-or-tips-and-tricks/6267#comment3970_568\">WOW!!!! I never knew this trick, thanks!!!</a> </li>\n<li><a href=\"https://apple.stackexchange.com/questions/400/please-share-your-hidden-macos-features-or-tips-and-tricks/6267#comment256352_568\">Wow I had NO idea and I've owned macs for 6 years!</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/400/please-share-your-hidden-macos-features-or-tips-and-tricks/6267#comment305962_568\">Woah, I never knew this worked for brightness, too! Thanks, @Florin!</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/400/please-share-your-hidden-macos-features-or-tips-and-tricks/6267#comment12201_568\">I think I love you.</a> </li>\n</ul>\n\n<p>I believe all but one are at least two years old.</p>\n","OwnerUserId":"67990","LastEditorUserId":"67990","LastEditDate":"2017-08-04T19:00:26.283","LastActivityDate":"2017-08-04T20:09:14.750","Title":"Why are my flags declined?","Tags":"<discussion>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"1","ClosedDate":"2017-08-24T17:36:34.390"},{"Id":"3115","PostTypeId":"2","ParentId":"3114","CreationDate":"2017-08-04T18:50:05.373","Score":"1","Body":"<p>In general - comment flags for too chatty ar highly subjective. We don't have a large comment problem, so we're generally more lenient that large sites.</p>\n\n<p>See <a href=\"https://apple.meta.stackexchange.com/questions/3103/why-were-these-too-chatty-flags-declined-on-some-1-comments\">Why were these too chatty flags declined on some +1 comments?</a> for some recent discussion on this.</p>\n\n<p>If you want to list some specific flags or hop in a chat room - we can look at specifics. Just @ me here or in the chat. The problem with robot flagging all comments that match a pattern is that there's benefit on sites where the proportion of users are new to the SE model is that they help explain how voting and accepting answers work. </p>\n\n<p>If we were to take a strict \"there shall be no chat, no thanks, no meta discussion in comments\" my experience is that causes more harm than good, but I'm willing to look over some specifics. </p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2017-08-04T18:55:48.183","LastActivityDate":"2017-08-04T18:55:48.183","CommentCount":"4"},{"Id":"3116","PostTypeId":"2","ParentId":"3114","CreationDate":"2017-08-04T20:09:14.750","Score":"1","Body":"<p>I declined some of the flags raised on comments on this one question and its answers. As @bmike already pointed out we don't get so many comments on AD so we aren't that strict with removing them over time. And comments with upvotes (even they aren't worth anything) somehow raised enough interest Songhai people considered them worthy in a way. Also, and that applies especially to old questions and to CW type of questions/answers a lot of these comments add some small aspect of human exchange to the posts, which makes this long threaded Q&amp;As a lot easier to read (and throws a light on things which a lot of Apple users don't/didn't know a few years past). </p>\n\n<p>In general flagging a comment as too chatty should IMHO only be used in really extrem cases (e.g. a user adding a lot of thank you comments or similar). Otherwise it just means that both the flagget and the mod handling the flag use a significant amount of time to flag posts/commands and evaluating these flags respectively, time which may also be used in improving the wording of an answer for instance. </p>\n","OwnerUserId":"9058","LastActivityDate":"2017-08-04T20:09:14.750","CommentCount":"0"},{"Id":"3118","PostTypeId":"1","CreationDate":"2017-08-12T04:00:40.603","Score":"0","ViewCount":"23","Body":"<p>I cannot find a link to my own questions (that I asked). Nor can I find anything obvious in searching for \"my questions\" or \"How can I find my own questions\".</p>\n\n<p>EDIT: OK, So I have a partial answer.</p>\n\n<p>If I click on the bar on the top of the window, where the reputation and badge count is, I get a list of my questions. Except that it does not show a question that I asked earlier today -- it only shows one from months ago.</p>\n\n<p>Is this a simple \"a cache that updates infrequently\" issue -- if so, I should see my other question tomorrow, right?</p>\n\n<p>Otherwise, what happened to (and how do I find) my \"missing\" question?</p>\n","OwnerUserId":"198208","LastEditorUserId":"198208","LastEditDate":"2017-08-12T04:05:42.420","LastActivityDate":"2017-08-12T06:02:32.803","Title":"How do I find my own questions?","Tags":"<support>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"0"},{"Id":"3119","PostTypeId":"2","ParentId":"3118","CreationDate":"2017-08-12T06:02:32.803","Score":"3","Body":"<p>I see two questions on your <a href=\"https://apple.stackexchange.com/users/198208/keybounce\">AskDifferent profile</a>, one from last year and one asked a few minutes <em>after</em> you asked the question on meta. It might help to add a screenshot next time the problem happens to you, otherwise it's difficult to see what could be wrong. </p>\n","OwnerUserId":"9058","LastActivityDate":"2017-08-12T06:02:32.803","CommentCount":"0"},{"Id":"3120","PostTypeId":"1","CreationDate":"2017-08-12T12:21:15.447","Score":"4","ViewCount":"61","Body":"<p>I asked a question regarding how to perform an action on macOS Sierra.  Over the years Apple has changed the OS in specific ways that older solutions don't apply to the latest version of their OS, and in fact it seems they change something related to this issue every other version of macOS.  There's no universal solution or answer to this issue that applies across all versions of macOS.</p>\n\n<p>I've clarified this in the question, but another user contends that we should have all the answers for all the versions in one question, rather than a separate question for each version of macOS.</p>\n\n<p>Having participated on many stack exchanges, it's not unusual to do things differently for these types of questions.</p>\n\n<p>How does Apple.SE handle this sort of situation?</p>\n\n<p>If we accept new questions for new versions of macOS when the previous questions and answer don't apply, then I'll leave my version specific question open, making sure to tag it and title it appropriately for that version of macOS.</p>\n\n<p>If we want to have one canonical question and answer for this issue, then when a new version of macOS causes the issue again, how do we bring that question back up so users can participate in answering it? How do we signal that the question is unanswered for a specific version of macOS? Do we then expect someone to edit the accepted answer with a list of solutions for each version of macOS, or do we want people to wade through the 10+ answers, trying out various versions and editing them to indicate which ones apply to each version of macOS?</p>\n\n<p>For questions where one or two answers apply to  most versions of macOS I don't see a problem with the second approach - one question for all version - but there seem to be several problems with the second approach when macOS breaks the old solutions so frequently.  Nevertheless, if that's what the Apple.SE community desires then I'll comply.</p>\n","OwnerUserId":"219","LastEditorUserId":"5472","LastEditDate":"2017-08-24T17:39:56.517","LastActivityDate":"2017-08-24T18:51:34.427","Title":"How should we manage questions that have very different answers per version of macOS?","Tags":"<discussion><featured><questions><exact-duplicates>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"0"},{"Id":"3122","PostTypeId":"2","ParentId":"3120","CreationDate":"2017-08-12T13:37:49.777","Score":"1","Body":"<blockquote>\n  <p>we should have all the answers for all the versions in one question,\n  rather than a separate question for each version of macOS</p>\n</blockquote>\n\n<p>In short, yes.</p>\n\n<h3>TL;DR</h3>\n\n<p>Apple changes things with each revision of their hardware <strong>and</strong> software;  some of it unintentional (aka ahem...\"<em>features</em>\") and lots intentional (aka \"stuff that annoys users to the nth degree\").</p>\n\n<p>Simply stating that a question is for a different version and/or product doesn't negate it from still being current or relevant.  </p>\n\n<p>In the <a href=\"https://apple.stackexchange.com/questions/294986/is-there-a-faster-way-to-restart-macos-sierra-into-the-bootcamp-partition\">question</a> you originally asked, you state (via an edit):</p>\n\n<blockquote>\n  <p>The duplicate question how to quickly reboot from OSX to Windows and\n  back does have one answer that <strong><em>may</em></strong> work for macOS Sierra,</p>\n</blockquote>\n\n<p><sup>(emphasis mine)</sup></p>\n\n<p>The key element that would disqualify it from being a duplicate is if the solution presented <em>didn't</em> work; which would be more than significant enough a factor to not be flagged.</p>\n\n<hr>\n\n<p>Looking at this from a purely logistical point of view, having the same question for each version of macOS would be rather large.  From Mavericks (10.9) to High Sierra shipping today (10.14), that's 5 different versions (not including the minor upgrades).  </p>\n\n<p>Why would we need 5 different questions/answers for the same thing if the question/answer are still relevant?</p>\n\n<p>Going further, if the question is \"different\" because of the hardware being is is older further adds to number of permutations.    Just doing a cursory check the MBP goes back to 2006 and has about 20 major versions (i.e. Mid-2011) excluding the sizes (13\", 15\", 17\") and options (i.e. Retina, TouchBar, etc.)  </p>\n\n<p>Would we need to have 100 different permutations of the same question/answer because the hardware/software combo is older/different?  I think it would be illogical and inefficient to have a separate question for each possibility even if limited to only the major releases of hardware/software.</p>\n\n<h3>Reopening Closed Questions</h3>\n\n<p>As this is community driven, we do make mistakes and close things for many reasons including marking questions as dupes when they are in fact not.  For instance, in <a href=\"https://apple.stackexchange.com/questions/290765/how-do-i-get-os-x-10-11-6-to-return-my-free-space\">this question</a> asked within the last 30 days, it was marked as a dupe but reopened because the OP added the following clarification:</p>\n\n<blockquote>\n  <p>This isn't the same question as the proposed duplicated, at all. I am\n  not suggesting that anything is eating my disk space. I'm also not\n  saying that restarting it changes anything. I'm stating that the disk\n  util says I have 300 GB free, which is likely the case given what I\n  deleted, and the OS says ~90 GB free, an amount that did not change as\n  I was deleting things and did not change when restarting the\n  system...so basically the freed space was not given back.</p>\n</blockquote>\n\n<p>As is the case with your question.  It's entirely possible that your question <em>isn't</em> a duplicate, but until you rule out the solution(s) already provided for the previously asked question, it's a duplicate.</p>\n\n<h3>Updating the previously asked question</h3>\n\n<p>Being a community site, it's encouraged to edit questions/answers to make them more accurate (without trying to change the author's intent).  For example, if the previous question/answer was (not) a solution to your issue, you could edit the answer with a single line saying:</p>\n\n<blockquote>\n  <p>Update as of some date:  This is confirmed to (not) work in mac OS Sierra (10.13.x).</p>\n</blockquote>\n\n<p>Asking a new question wouldn't be considered a dupe at that point and you would be contributing back to the community by keeping the original question relevant.</p>\n\n<p>To address your comment:</p>\n\n<blockquote>\n  <p>So your suggestion is essentially to try every one of the many broken\n  answers in the dupe and then ask a new question if none of them work?</p>\n</blockquote>\n\n<p>The <a href=\"https://apple.stackexchange.com/help/how-to-ask\">Help Center</a> addresses that concern:</p>\n\n<blockquote>\n  <p>Have you thoroughly searched for an answer before asking your\n  question? Sharing your research helps everyone. Tell us what you found\n  and why it didn’t meet your needs. This demonstrates that you’ve taken\n  the time to try to help yourself, it saves us from reiterating obvious\n  answers, and above all, it helps you get a more specific and relevant\n  answer!</p>\n</blockquote>\n\n<p>If the answer is works or is broken, you can <a href=\"https://apple.stackexchange.com/help/why-vote\">up/down vote</a> and even add comments (i.e. \"This answer doesn't work for whatever reason\")</p>\n\n<p>The key is to reasonably attempt to research before generically stating a question is <strong>may</strong> not be relevant because it's <strong>perceived</strong> to be obsolete.  </p>\n","OwnerUserId":"119271","LastEditorUserId":"119271","LastEditDate":"2017-08-12T13:52:29.810","LastActivityDate":"2017-08-12T13:52:29.810","CommentCount":"3"},{"Id":"3124","PostTypeId":"2","ParentId":"3120","CreationDate":"2017-08-24T18:51:34.427","Score":"1","Body":"<p>I think finding a solution for somebody is more relevant than hunting all (possible) duplicates down. I'd rather find two complete different answers for a quite similar question than finding a closed question which is like 6 years more recent than the \"possible duplicate\".</p>\n","OwnerUserId":"34561","LastActivityDate":"2017-08-24T18:51:34.427","CommentCount":"0"},{"Id":"3125","PostTypeId":"1","CreationDate":"2017-08-26T14:08:14.073","Score":"3","ViewCount":"21","Body":"<p>The site encourages editing questions, comments and answers.\nThe site also encourages to vote, up or down on each of these entry types.\nMaybe I do not understand this correctly but what happens in the following scenarios:</p>\n\n<p>There is a simple answer. It may be bad or at least perceived as such. It gets down votes. Now this answer is edited, and hopefully improved. If there was a mistake that is now no longer there, whatever, the negative vote still stands. What was the point in editing it?</p>\n\n<p>There is a simple question. It may be quite well received and some people give good answers to how they understand the question. Question and/or answer get up votes. Now the original poster of the question realises that he was misunderstood, edits the question and the answers given do not really address the newly formulated question. Or the new question would now not be perceived as so interesting or valuable as the previous version. The votes remain the same. What was the point in editing it, now in relation to the votes to no longer fitting answers?</p>\n\n<p>Currently I do not see how this dynamic is addressed.</p>\n\n<p>This was regarding old posts. But it is also applicable to very new entries:\nIt seems to me that many votes are cast quite quickly, because someone likes or dislikes an answer or a question she just read. \nMy current impression: Quick voting is the first phase that accumulates votes fast but also dies down quickly. After the first votes the voting slows down considerably. </p>\n\n<p>This effect is contrary to how the system is explained to work. (Good content raises to the top bad sinks down.)</p>\n\n<p>If the example is a really fresh entry then diligence requires you to refine this (possibly your own) entry, based on comments, suggestions, better insight. But this is currently problematic:</p>\n\n<ol>\n<li><p>\"Likes or dislikes\" is purposely opinion based, I understand. But asking these opinion based questions is discouraged. Technical merit or correctness are not emphasised enough in this voting system. Wit and humour, grammatical prowess, or the lack of both, play a role here. So voting is very largely influenced by opinion. If opinion is mostly discouraged in questions and answers, the it should be minimised in voting.</p></li>\n<li><p>If these votes are cast before a fresh and still dynamic Q&amp;A is only half-way settled then the concerns raised above become even more important. These should self-correct automatically (through the system as designed). But they only do if they are still within the attention span of those involved so far. Seems that sometimes the individual attention span or how this site is used by the community aren't really catering to that. This demotivates participants and muffles the discussion.</p></li>\n</ol>\n\n<p>So, ideas for improvement or feature requests are:</p>\n\n<ol>\n<li><p>Differentiate in the temporal sense votes cast and edits thereafter. Or make an automated request to review votes if (substantial) editing took place. Or introduce a voting quarantine.</p></li>\n<li><p>Enable more feedback that encourages editing, improving the existing content. If this site is not only about answering but also about learning, then the feedback has to be more direct. This feedback will likely improve the overall quality on its own.</p></li>\n<li><p>Make it easier or explicitly possible to differentiate between likes and votes. The latter being based solely on technical correctness. (I understand that this might be either unwanted or even too late, given the content produced so far.)</p></li>\n</ol>\n","OwnerUserId":"251859","LastEditorUserId":"251859","LastEditDate":"2017-08-26T18:54:41.750","LastActivityDate":"2017-08-26T18:54:41.750","Title":"Voting vs Editing, are they at Odds in the Current System?","Tags":"<feature-request><editing><voting>","AnswerCount":"1","CommentCount":"2"},{"Id":"3126","PostTypeId":"2","ParentId":"3125","CreationDate":"2017-08-26T15:50:03.497","Score":"1","Body":"<p>The editing is mostly a way to avoid a large period of time where people would be inclined to down vote as opposed to remedy past impressions. Ideally, each edit would then ping the voters or come back and revisit their expression - but without that, there’s still the chance that everyone else will see the edited post and help right the down votes if the edit fixes whatever issues existed.</p>\n","OwnerUserId":"5472","LastActivityDate":"2017-08-26T15:50:03.497","CommentCount":"6"}]