[{"Id":"2210","PostTypeId":"2","ParentId":"2206","CreationDate":"2014-09-13T21:16:06.177","Score":"5","Body":"<p>This is tricky because of the new open Betas that Apple are expanding into a wider audience.  I am running Beta Yosemite, maybe next year they will do the same for iOS?</p>\n\n<p>But, as a whole I think that if it's not released, it's not up for discussion.  Anyone using these products for anything other than idle interest will know about the associated dev forums and know to use them properly.  We do not want this place to be a discussion ground for the curious, so expanding (or perhaps more accurately just making it clearer by expanding the wording) the scope of our out of scope topics makes sense.  </p>\n\n<p>Make it as obvious as possible, and also include the old \"including but not limited to\" clause, to stop someone finding something we didn't explicitly list then complaining when we shut discussion down about it :)</p>\n","OwnerUserId":"9495","LastActivityDate":"2014-09-13T21:16:06.177","CommentCount":"0"},{"Id":"2211","PostTypeId":"2","ParentId":"2200","CreationDate":"2014-09-19T12:36:51.257","Score":"0","Body":"<p>Appears to be fixed with OS 10.9.5 &amp; Safari 7.0.6, even with Click to Flash &amp; YouTube5 enabled.</p>\n","OwnerUserId":"85275","LastActivityDate":"2014-09-19T12:36:51.257","CommentCount":"0"},{"Id":"2212","PostTypeId":"1","CreationDate":"2014-09-19T12:32:58.160","Score":"-4","ViewCount":"46","Body":"<p>I've noticed that solutions to questions that require jailbreak are only mentioned if specifically requested by the asker. What is the proper way to suggest that Apple.SE becomes increasingly timeless by encouraging all relevant answers to be posted including jailbreak, with the restriction that the first sentence of each answer requiring jailbreak must be \"Jailbreak only.\\n\\n\".</p>\n","OwnerUserId":"84112","OwnerDisplayName":"user84112","LastEditorUserId":"9058","LastEditDate":"2014-09-19T12:58:56.203","LastActivityDate":"2014-09-19T17:06:32.897","Title":"Should we encourage jailbreak-only solutions when answering questions?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"2215","PostTypeId":"2","ParentId":"2212","CreationDate":"2014-09-19T17:06:32.897","Score":"5","Body":"<blockquote>\n  <p>I've noticed that solutions to questions that require jailbreak are only mentioned if specifically requested by the asker.</p>\n</blockquote>\n\n<p>This certainly isn't by any specific convention we've established on the site. I believe it's because jailbreak users represent a significantly smaller portion of iDevice users than non-jailbreak users.</p>\n\n<p>You're free to suggest solutions that require jailbreaking any time you like. Answers are answers.</p>\n\n<p>Likewise, the community is free to vote up and down answer they believe to best solve the problem being posted.</p>\n\n<p>I will say: if you post a jailbreak solution on a question where the user did not specifically indicate they were comfortable with jailbreaking their phone you should include relevant information on how to jailbreak. It's a process that is completely opaque to most users and requires savvy beyond average to perform and maintain IMO.</p>\n","OwnerUserId":"292","LastActivityDate":"2014-09-19T17:06:32.897","CommentCount":"0"},{"Id":"2216","PostTypeId":"2","ParentId":"529","CreationDate":"2014-09-25T20:11:14.250","Score":"1","Body":"<p>This appears to be fixed (no idea when, though).</p>\n","OwnerUserId":"49393","LastActivityDate":"2014-09-25T20:11:14.250","CommentCount":"0"},{"Id":"2217","PostTypeId":"1","AcceptedAnswerId":"2218","CreationDate":"2014-09-30T02:32:24.310","Score":"6","ViewCount":"58","Body":"<p>Questions on unreleased hardware like the Apple Watch. Can we questions about the features of the product and it's working? </p>\n","OwnerUserId":"49189","LastEditorUserId":"37797","LastEditDate":"2014-10-12T14:47:21.093","LastActivityDate":"2014-10-12T14:47:21.093","Title":"Are questions related to unreleased hardware OK?","Tags":"<discussion><questions><site-scope>","AnswerCount":"1","CommentCount":"0"},{"Id":"2218","PostTypeId":"2","ParentId":"2217","CreationDate":"2014-09-30T02:37:11.473","Score":"4","Body":"<p>There's some discussion on whether to formally extend the prohibition on pre-release topics to explicitly include hardware - so at the moment it's not spelled out in the [help] for the main site.</p>\n\n<p>That being said, questions speculating on Apple's future plans in general are closed as off-topic even without a pre-release hardware clause.</p>\n\n<p>If you have a specific question, you can ask that here / expand on the question here by editing in what you are asking for more detailed feedback.</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/2206/is-there-support-to-widen-the-pre-release-prohibition\">Is there support to widen the pre-release prohibition?</a></li>\n</ul>\n\n<p>You could also answer / extend the discussion there on what sort of questions you feel would be beneficial to the site.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2014-09-30T02:37:11.473","CommentCount":"4"},{"Id":"2219","PostTypeId":"2","ParentId":"2206","CreationDate":"2014-09-30T02:47:37.480","Score":"1","Body":"<p>Here are some reasons to prohibit pre-release questions for hardware and services.</p>\n\n<p>Apple has currently announced the following services and hardware in Fall 2014 that is not available.</p>\n\n<ul>\n<li>Apple Watch</li>\n<li>Apple Pay</li>\n<li>Home Kit</li>\n</ul>\n\n<p>Even with iOS 8, Apple committed to shipping Health Kit apps on release day and that was changed at the last moment and the first 3 weeks of iOS 8 had no support for Health Kit. The Watch is committed to be released in Early 2015 (assuming that regulatory approval is granted). Apple Pay was committed in October 2014 and I don't have a good date for when Home Kit will arrive.</p>\n\n<p>The reasons for prohibiting questions in general about pre-release software is to maintain the possibility to have <em>high quality</em> answers that don't enter into rumor, reading tea leaves, or over-parsing limited details that are released before the work to finish the product is done. Had we allowed Health Kit answers, we would have had incorrect information at launch as well as demonstrably poor answers to health kit questions until 8.0.2 and releases today September 29 allowed consumers to actually use the product.</p>\n\n<p>The Stack Exchange sites are optimized to provide <strong>great answers</strong> by attracting knowledgable, expert people to address clearly worded questions. We even tolerate miserable questions when there is a demonstrated good answer or the possibility of a good answer to be provided.</p>\n\n<p>With pre-release products that may or may not be covered with NDA - the pool of professional, capable, and knowledgable answers is severely limited. Furthermore, anyone that comes up with a good answer can probably be assumed to be breaking NDA. That environment fosters a \"those who know aren't talking, those who are talking don't know\" effect.</p>\n\n<p>By widening the prohibition, it helps site moderators of all reputation levels to know that they should probably close most or all questions on pre-release software so that the site doesn't waste attention and discussion on un-answerable questions.</p>\n\n<p>Once the product is released, all of the on-hold questions are easily reviewed and edited and reopened for all of the well worded questions.</p>\n\n<p>I have seen these patterns as a user of the site as well as one of the elected moderators since day one. By following the same spirit of discouraging all but the most answerable and helpful questions on pre-release software - we would have consistency by prohibiting all but the most answerable questions about pre-release hardware and services.</p>\n\n<p>My vote is to edit the [help] to broaden the prohibition on pre-release to cover hardware and services.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-09-30T02:47:37.480","CommentCount":"0"},{"Id":"2222","PostTypeId":"1","CreationDate":"2014-10-01T18:15:40.260","Score":"3","ViewCount":"40","Body":"<p>Sometimes I see posts (questions and answers) written in HTML, with &lt;i> and &lt;b> tags for formatting, &lt;a href=… tags for links and one or more &lt;br>s for paragraphing.</p>\n\n<p>Should I edit these posts to use Markdown formatting? I'm debating whether it counts as 'OP&nbsp;style' or just incorrect usage.</p>\n\n<p><sup>I'm referring only to posts that I would edit anyway for other reasons.</sup></p>\n","OwnerUserId":"37797","LastActivityDate":"2014-10-03T03:58:17.940","Title":"Should I edit posts written with HTML formatting rather than Markdown?","Tags":"<discussion><editing>","AnswerCount":"2","CommentCount":"0"},{"Id":"2223","PostTypeId":"2","ParentId":"2222","CreationDate":"2014-10-01T20:18:42.847","Score":"2","Body":"<p>I think it is incorrect formatting and <strong>as long as there are other</strong> edits I would change.   </p>\n\n<p>A reason for this is consistency so that other users only have to learn one set of formatting.</p>\n\n<p>I also suspect usage of &lt;i> and &lt;b> and definitely &lt;sup> shows an article that needs reformatting to simplify. (However thanks for reminding me of HTML entities - so I don't need to put all XML in code blocks.)</p>\n","OwnerUserId":"237","LastActivityDate":"2014-10-01T20:18:42.847","CommentCount":"0"},{"Id":"2224","PostTypeId":"2","ParentId":"2222","CreationDate":"2014-10-03T03:58:17.940","Score":"0","Body":"<p>Whenever I see HTML formatting on any StackExchange site I wince. Mainly because the tools to assist in formatting are really right in front of you. Yes, there are some formatting codes that are not part of the editor, but raw HTML will always lead to issues. So best to just nip that in the bud when possible.</p>\n","OwnerUserId":"40457","LastActivityDate":"2014-10-03T03:58:17.940","CommentCount":"0"},{"Id":"2225","PostTypeId":"2","ParentId":"715","CreationDate":"2014-10-03T07:03:48.843","Score":"1","Body":"<p>I think this problem has gone away in the 3 years since this was posted, and that user has since been deleted.</p>\n","OwnerUserId":"49393","LastActivityDate":"2014-10-03T07:03:48.843","CommentCount":"0"},{"Id":"2226","PostTypeId":"1","AcceptedAnswerId":"2228","CreationDate":"2014-10-03T07:57:52.037","Score":"9","ViewCount":"100","Body":"<p><img src=\"https://i.stack.imgur.com/oXW9h.png\" alt=\"Flag Declined\"></p>\n\n<p>I flagged a post as \"It could give rise to opinion based answers\" but my flag was declined by a moderator. While I was checking out the questions again, I noticed the post was put on hold for the same reason I had flagged the post in the first place. </p>\n\n<p>Why did this happen?</p>\n\n<p><img src=\"https://i.stack.imgur.com/cHj9O.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"49189","LastActivityDate":"2015-04-07T15:55:31.000","Title":"Why was my flag \"opinion based answer\" declined but was the same reason why it was closed later","Tags":"<discussion>","AnswerCount":"2","CommentCount":"0"},{"Id":"2227","PostTypeId":"2","ParentId":"2226","CreationDate":"2014-10-03T08:21:21.077","Score":"4","Body":"<p>Moderators sometimes don't agree either :-)</p>\n\n<p>To be honest I didn't notice that there was already a declined flag on the question until a few hours after I closed it. I probably wouldn't have closed it if I would have noticed that earlier.</p>\n\n<p>Having said that, I still think that the question as asked doesn't really help and should at least be more specific about usage scenarios, apps etc.</p>\n","OwnerUserId":"9058","LastActivityDate":"2014-10-03T08:21:21.077","CommentCount":"0"},{"Id":"2228","PostTypeId":"2","ParentId":"2226","CreationDate":"2014-10-03T10:42:51.927","Score":"6","Body":"<p>There are seven moderators. They don't always come to the same conclusions. The system doesn't provide a way to reverse a ruling on a flag. We can go back and change the outcome (open a post that had been closed or vice versa), but the original ruling on the flag stays, even if it happened because someone clicked in the wrong place.</p>\n\n<p>In this case, two volunteer moderators on two different continents who have never met each other in person read a flag on a post and came to different conclusions, without even realizing until after the fact that they disagreed with each other. What is remarkable, actually, is how consistent rulings often are.</p>\n\n<p>But moderators sometimes even overrule themselves. If someone flags something, a moderator reads the flag and decides how to handle it, which might involve declining the flag. If later, the same person disagrees win the moderator's choice to decline the flag and flags the post again, the same moderator might read the second flag, be persuaded by what the person wrote, and act on it.</p>\n\n<p>In this case, by the way, I believe that asking users to report the facts of their firsthand experience is the definition of \"not an opinion.\" But I also see how the question could turn into an invitation for people to rant about how Apple ruined their phones with iOS 8, and how this is the. worst Update Ever and Never Would Have Happened If Steve Were Still Here (etc).</p>\n\n<p>This is all an imprecise science, but the point is that while we can reverse what is done to a post, we cannot reverse the decision we made about whether a flag was helpful or not.</p>\n","OwnerUserId":"9388","LastEditorUserId":"9388","LastEditDate":"2015-04-07T15:55:31.000","LastActivityDate":"2015-04-07T15:55:31.000","CommentCount":"0"},{"Id":"2229","PostTypeId":"2","ParentId":"723","CreationDate":"2014-10-06T21:49:23.350","Score":"2","Body":"<p>Well, uh. This is only mildly embarrassing. </p>\n\n<p>Three years, two lines of CSS, one bug fixed!</p>\n","OwnerUserId":"17358","LastActivityDate":"2014-10-06T21:49:23.350","CommentCount":"0"},{"Id":"2230","PostTypeId":"2","ParentId":"1908","CreationDate":"2014-10-06T22:34:19.910","Score":"1","Body":"<p>Sorry 'bout the delay. This will be fixed in the next build, bringing the layout in line with the rest of the network:</p>\n\n<p><img src=\"https://i.stack.imgur.com/qE2mS.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"17358","LastActivityDate":"2014-10-06T22:34:19.910","CommentCount":"0"},{"Id":"2232","PostTypeId":"1","AcceptedAnswerId":"2233","CreationDate":"2014-10-08T09:50:21.230","Score":"1","ViewCount":"38","Body":"<p>As a proud Apple fan, I would like to use Apple product even on the server side. I was asking a <a href=\"https://apple.stackexchange.com/questions/148198/pro-and-cons-of-using-clusters-of-mac-mini-servers\">question about clustering Apple Mac Mini servers</a>, and one user asked: \"Why do  you want to use Apple Mini Server?\". Just as a rule of thumb for my future questions, do I need to explain myself on why I would like to use Apple-based products? </p>\n","OwnerUserId":"85243","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-10-08T11:05:20.100","Title":"Do I need to explain myself about choosing an Apple-based product?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"2233","PostTypeId":"2","ParentId":"2232","CreationDate":"2014-10-08T11:05:20.100","Score":"3","Body":"<p>Comments are (among other things) intended for asking follow-up and clarification questions to a post, in your case the question you've asked. I understand the comment primarily as an inquiry about any functional needs to run OS X on your server (e.g. you are developing a server component with Objective C or are you planning to deploy this into an all-Apple environment). Clarifactions like this can help to improve the question and its constraints, which usually results in better answers.</p>\n","OwnerUserId":"9058","LastActivityDate":"2014-10-08T11:05:20.100","CommentCount":"0"},{"Id":"2234","PostTypeId":"1","AcceptedAnswerId":"2254","CreationDate":"2014-10-09T02:27:32.050","Score":"12","ViewCount":"353","Body":"<p>I can't comment, can't do jack until i've gained rep, but can't gain rep because can't do anything. Surely a captcha would do the job as well?</p>\n\n<p>For example: I can't talk in the meta forums. This requires 5 reputation. Yet the smallest reputation award i can next get is from posting in the meta forum. I feel caught in an insane Catch-22.</p>\n\n<p>Can someone describe to me a simple path to be allowed to use this site in an interactive fashion?</p>\n","OwnerUserId":"86312","OwnerDisplayName":"flow in","LastEditorUserId":"292","LastEditDate":"2014-10-09T03:08:34.473","LastActivityDate":"2015-06-15T10:25:27.183","Title":"Why is it SO hard to get reputation to start using this site?","Tags":"<discussion>","AnswerCount":"3","CommentCount":"11"},{"Id":"2235","PostTypeId":"2","ParentId":"2234","CreationDate":"2014-10-09T03:06:16.523","Score":"8","Body":"<p>Cut-and-paste wholesale from the excellent answer to: <a href=\"https://meta.stackexchange.com/a/214174/151364\">Why do I need 50 reputation to comment? What can I do instead?</a></p>\n\n<hr>\n\n<h1>Why does this limit exist?</h1>\n\n<p>We realize that new users may have valuable comments, and that we may lose some of those contributions by requiring 50 reputation points to unlock the feature. </p>\n\n<p>However, history and experience have shown that the downsides of allowing <em>everyone</em> to comment are far greater than a few good-quality comments:</p>\n\n<ul>\n<li><p>There are big problems with spam. Automated filters cannot catch all of it.</p></li>\n<li><p>Even among the real comments, most would either say \"I have the same problem\" or \"I agree\". Such comments do not add any value, and have to be manually removed. </p></li>\n<li><p>Comments are very painful to moderate. Stack Exchange sites have a process of community moderation (voting, flagging, review queues) that works great for questions and answers, but not so much for comments. Comments cannot be downvoted or closevoted, nor searched (nor do we want that).</p></li>\n<li><p>Comments are second class citizens on the Stack Exchange network, not designed to hold information for all eternity. They may get cleaned up at any time. Generally, <strong>truly important information should be incorporated into an answer of its own anyway</strong>. <strong>[Ed.: THIS IS VERY IMPORTANT IN MY OPINION!]</strong></p></li>\n</ul>\n\n<p>Providing good answers will get you 50 rep points in no time. Alternatively, you can <a href=\"https://meta.stackexchange.com/questions/76251/how-do-suggested-edits-work\">suggest edits</a> that improve existing questions and answers. Each of those will gain you 2 reputation points.</p>\n\n<h1>But I want to contribute  now. What should I do instead?</h1>\n\n<h2>Can I put my comment in an answer?</h2>\n\n<p><strong>No.</strong></p>\n\n<p>Asking and answering, the core actions on the Stack Exchange network of sites, are open to all users regardless of reputation. </p>\n\n<p>However, this is not meant as a workaround to the comments barrier. <strong>Comments posted as an answer are subject to removal.</strong> </p>\n\n<p>To make requests for clarification, or mere responses to other answers, you need to wait until you have the comment privilege.</p>\n\n<h2>How do I write a good answer?</h2>\n\n<p>If you are sure you can provide a real <em>answer</em>, then you are of course welcome to go ahead, but make sure it's <strong>a <a href=\"https://meta.stackexchange.com/a/214174/151364\">full, valid answer to the question</a></strong>. If you saw something wrong with an existing answer, do mention it and its flaws, but make sure you provide an alternative solution <strong>that can stand on its own.</strong> Do not just copy and paste your original comment into the \"answer\" field.</p>\n\n<h2>But I can't write a good answer without more information!</h2>\n\n<p>Answers don't have to be exhaustive or infallible, they just need to <em>try</em> to answer the question. It's perfectly fine to post an answer saying, for example, \"I'm not sure what the cause of your problem is, but if it's <em>X</em>, you can solve it by doing <em>Y</em>. If that doesn't help, try <em>Z</em> and let me know what it says.\"  Also, if further information does become available, you can edit your answer later to make it more precise. This is a good habit to get into <em>even if you <strong>can</strong> comment!</em> </p>\n\n<p>Welcome to the community, and good luck!</p>\n\n<h1>How do I gain reputation?</h1>\n\n<p>Another cut-and-paste from this meta question and answer: <a href=\"https://meta.stackexchange.com/questions/17204/six-simple-tips-to-get-stack-overflow-reputation-fast\">Six simple tips to get Stack Overflow reputation fast</a></p>\n\n<p>Aww heck I can summarize it: <strong>ANSWER QUESTIONS WELL</strong>. <a href=\"https://meta.stackexchange.com/a/17250/151364\">But you should really read the top-voted answer because it's excellent</a>.</p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-10-09T03:06:16.523","CommentCount":"3"},{"Id":"2237","PostTypeId":"1","CreationDate":"2014-10-11T14:10:31.483","Score":"11","ViewCount":"79","Body":"<p>Being elected as a moderator doesn't mean you have to continue serving for the rest of your life. Moderators sometimes resign, but sometimes they fade away, becoming less and less active on the site over time. This is a natural and healthy thing.</p>\n\n<p>There seems to be some sort of cleanup process by which Stack Exchange eventually removes the names of inactive moderators from the list of moderators for the site.</p>\n\n<p>Some moderators not active today played instrumental roles in the early days of the site, such that the community would likely not exist today in all its helpfulness were it not for their great work.</p>\n\n<p>Is it possible for there to be some mechanism whereby we can honor the work of our retired forbearers without simply making their names disappear silently from the list of current moderators? Reputation stays forever, and the list of users by reputation acknowledges reputation earned long ago by users who are no longer active. Can the moderation service of our founding elected moderators be similarly honored and cherished?</p>\n","OwnerUserId":"9388","LastEditorUserId":"168832","LastEditDate":"2017-05-22T13:07:59.237","LastActivityDate":"2017-05-22T13:07:59.237","Title":"Is there a way we can honor the service of retired moderators?","Tags":"<feature-request><moderators><users>","AnswerCount":"0","CommentCount":"4","FavoriteCount":"2"},{"Id":"2238","PostTypeId":"1","AcceptedAnswerId":"2239","CreationDate":"2014-10-14T15:52:43.743","Score":"3","ViewCount":"62","Body":"<p>Here's a sample of two, consecutive, new user questions posted a while ago that prompted this discussion. Let's ignore the non-optimal titles for now and focus on the choices for the tags on the questions:</p>\n\n<ol>\n<li><blockquote>\n  <p><strong>MacBook typing issue</strong></p>\n  \n  <p>My MacBook keeps kicking the typing curser backwards into the body of the text line while I'm typing. This is extremely annoying. Is there any solution?</p>\n  \n  <p><a href=\"https://apple.stackexchange.com/questions/tagged/single-user\" class=\"post-tag\" title=\"show questions tagged &#39;single-user&#39;\" rel=\"tag\">single-user</a></p>\n</blockquote>\n\n<p>Only a single tag has been applied to this question: <a href=\"https://apple.stackexchange.com/questions/tagged/single-user\" class=\"post-tag\" title=\"show questions tagged &#39;single-user&#39;\" rel=\"tag\">single-user</a>. This tag doesn't seem related to the content of this question regarding a possible hardware or software issue.</p>\n\n<p>The question is not tagged with any platform information (<a href=\"https://apple.stackexchange.com/questions/tagged/macbook\" class=\"post-tag\" title=\"show questions tagged &#39;macbook&#39;\" rel=\"tag\">macbook</a>-series), or tagged with <a href=\"https://apple.stackexchange.com/questions/tagged/osx\" class=\"post-tag\" title=\"show questions tagged &#39;osx&#39;\" rel=\"tag\">osx</a> or <a href=\"https://apple.stackexchange.com/questions/tagged/mac\" class=\"post-tag\" title=\"show questions tagged &#39;mac&#39;\" rel=\"tag\">mac</a>. <a href=\"https://apple.stackexchange.com/questions/tagged/osx\" class=\"post-tag\" title=\"show questions tagged &#39;osx&#39;\" rel=\"tag\">osx</a> is not being used on OS X questions.</p></li>\n<li><blockquote>\n  <p><strong>How to work around the issue that I can't access some iStore apps of a different country?</strong></p>\n  \n  <p>My family is spread across the world and I live and work in a different country than my native one. My iPhone and Apple ID are registered to my country of residence. On a few occasions, recently, I…</p>\n  \n  <p><a href=\"https://apple.stackexchange.com/questions/tagged/apple-id\" class=\"post-tag\" title=\"show questions tagged &#39;apple-id&#39;\" rel=\"tag\">apple-id</a> <a href=\"https://apple.stackexchange.com/questions/tagged/internationalization\" class=\"post-tag\" title=\"show questions tagged &#39;internationalization&#39;\" rel=\"tag\">internationalization</a> <a href=\"https://apple.stackexchange.com/questions/tagged/apple-store\" class=\"post-tag\" title=\"show questions tagged &#39;apple-store&#39;\" rel=\"tag\">apple-store</a></p>\n</blockquote>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/apple-id\" class=\"post-tag\" title=\"show questions tagged &#39;apple-id&#39;\" rel=\"tag\">apple-id</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/internationalization\" class=\"post-tag\" title=\"show questions tagged &#39;internationalization&#39;\" rel=\"tag\">internationalization</a> can be related to this question and seem suitable.</li>\n<li>Tagging this question with <a href=\"https://apple.stackexchange.com/questions/tagged/apple-store\" class=\"post-tag\" title=\"show questions tagged &#39;apple-store&#39;\" rel=\"tag\">apple-store</a> appears to be a misunderstanding as to the intent of this tag. The tag excerpt concisely details that this tag is for Apple Retail but besides this (and researching other questions which have used this tag) it is not clear to a new user that this tag does not apply to the iTunes store, etc, and this tag is commonly misused.</li>\n</ul></li>\n</ol>\n\n<p><strong>What can be done to help new users tag their questions correctly?</strong></p>\n\n<p>There's already tag excerpts that most users aren't reading and tag wikis that no-one reads. The tags themselves on this site are generally quite self-explanatory; there doesn't appear to be any serious problems with the tags themselves (i.e. not much overlap of areas or ambiguity)—it seems users just don't know because they are not aware.</p>\n\n<p>I know the community can retag questions, but that doesn't happen often enough, or promptly enough, and still requires the participation of the community, and doesn't solve the problem of the dupehammer…</p>\n\n<p>As more users gain the dupehammer ability, the lack of appropriate tags on the <em>original revisions</em> of questions mean that users won't be able to close the questions as duplicates using this, defeating the purpose.</p>\n\n<p>Is there a way to encourage users to tag their questions appropriately?</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-10-14T18:36:58.370","LastActivityDate":"2014-10-14T18:36:58.370","Title":"New users don't tag questions correctly","Tags":"<discussion><tags><questions><asking-questions><new-users>","AnswerCount":"1","CommentCount":"0"},{"Id":"2239","PostTypeId":"2","ParentId":"2238","CreationDate":"2014-10-14T16:09:43.820","Score":"4","Body":"<blockquote>\n  <p>Is there a way to encourage users to tag their questions appropriately?</p>\n</blockquote>\n\n<p>Yes, and you've mentioned it already in your post:</p>\n\n<blockquote>\n  <p>the community can retag questions</p>\n</blockquote>\n\n<p>That's really the answer. We can't make people read FAQs and guides. We can't make them take a test before they can answer. We can, only through our good actions, guide them to better behaviour. Re-tagging questions flag as an edit and a user gets notified when their question is edited. Astute users will start to get the hints and figure it out.</p>\n\n<p>Ultimately it is up to those who are investing their time and effort in the community to help keep it going. It's a collaborative Q&amp;A site for this very reason. Editing \"horrendous titles\" (instead of flagging them or commenting negatively on the questions) is also very appropriate behaviour for community members. Likewise grammar and spelling corrections in posts are the charter of everyone to help maintain and improve.</p>\n","OwnerUserId":"292","LastActivityDate":"2014-10-14T16:09:43.820","CommentCount":"3"},{"Id":"2240","PostTypeId":"1","AcceptedAnswerId":"2241","CreationDate":"2014-10-15T19:26:59.257","Score":"7","ViewCount":"93","Body":"<p>I'm wondering - If I created a question which I feel requires a tag that doesn't exist, what would I do? </p>\n\n<p>Suggest it? Put it at the end of the question?</p>\n","OwnerUserId":"95661","LastActivityDate":"2014-10-23T14:49:48.990","Title":"Adding tags that don't exist","Tags":"<discussion><support><tags>","AnswerCount":"3","CommentCount":"0","FavoriteCount":"1"},{"Id":"2241","PostTypeId":"2","ParentId":"2240","CreationDate":"2014-10-15T19:43:26.293","Score":"3","Body":"<p>If you don't have enough reputation to <a href=\"https://apple.stackexchange.com/help/privileges/create-tags\">create a new tag</a>, you can comment on your question stating what tag you wish to be added to your question and why you think that tag is necessary.</p>\n\n<blockquote>\n  <p>Could someone add the <a href=\"https://apple.stackexchange.com/questions/tagged/foobar\" class=\"post-tag\" title=\"show questions tagged &#39;foobar&#39;\" rel=\"tag\">foobar</a> tag to my question because [reason]?</p>\n</blockquote>\n\n<p>Someone with the necessary reputation may agree with you and add it for you. Don't append such meta-content to your question as it is not part of the question itself.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-10-15T19:43:26.293","CommentCount":"0"},{"Id":"2242","PostTypeId":"2","ParentId":"2240","CreationDate":"2014-10-16T02:06:29.890","Score":"4","Body":"<p>Actually, asking here on Meta is the correct / canonical way to have someone create a new tag when you can't do it yourself. Commenting may sometimes help, but that's not really why comments exist.</p>\n\n<p>You would want to link to the question here and explain what tag should be created for the item. Feel free to edit your question and tag suggestion into the question above or start a new thread on [meta] here with the pertinent details and we'll see what can or should be done.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-10-16T02:06:29.890","CommentCount":"1"},{"Id":"2245","PostTypeId":"1","CreationDate":"2014-10-17T12:35:30.737","Score":"3","ViewCount":"28","Body":"<p>I was just about to type up a question regarding installation of OSX Server 4.0 inside VMware Workstation on non-Apple hardware.</p>\n\n<p>The more I typed my question, the better the suggestions in the suggestion box got.</p>\n\n<p>So I checked out the first three and all of them ended up answering an inherently technical question with a reference to the EULA.</p>\n\n<p>Example for one of those questions and answers:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/q/52789/65841\">How to install Mac OS X as a guest OS in VMware Workstation 8 (running in Ubuntu host)?</a></li>\n</ul>\n\n<hr>\n\n<p>Now don't get me wrong. It's fine if this reference to the EULA accompanies a technical solution (or the statement that it's technically impossible) to the purely technical question. But for the life of me I cannot figure out how such an answer which is borderline legalese can garner so many upvotes or even acceptance.</p>\n\n<p>Questions about the EULA are inherently tied to the jurisdiction under which this EULA is accepted. The relevant jurisdiction is neither clear from a purely technical question (though the assumption always appears to be that it's the US, despite English being official language in many countries) nor would giving the jurisdiction generally help <strong>anyone</strong>. Who knows what the relevance and validity of the Apple EULA in Zimbabwe, Russia or China is?</p>\n\n<p>If I'd ask a question about the EULA I'd be lucky not to get my question plastered with \"IANAL\" comments or answers. However, somehow it's legit to answer a completely technical question with a reference to a EULA, taking the EULA at its face value.</p>\n\n<p>A EULA is nothing but a contract and always governed (and overridden) by the jurisdiction under which it is accepted. Assuming what's in the EULA is true to the comma means disregarding that fact.</p>\n\n<p>Yes, I've read <a href=\"https://apple.stackexchange.com/help/on-topic\">What topics can I ask about here?</a></p>\n\n<p>So could anyone shed any light on how and why such answers are acceptable?</p>\n\n<p>To me it would seem more logical to close such a question as off-topic from the outset, if it is (off-topic). But answering with borderline irrelevant information isn't helping anyone.</p>\n\n<p>Thanks for reading. Double thanks for answering.</p>\n","OwnerUserId":"65841","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-10-17T13:48:56.450","Title":"Asking technical question, getting advice about EULA","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"2246","PostTypeId":"2","ParentId":"2245","CreationDate":"2014-10-17T13:48:56.450","Score":"2","Body":"<p>I don't have a solid complete answer for your question, but I have one nugget of wisdom to share:</p>\n\n<ul>\n<li>Steer away from legal ramifications and just acknowledge frankly that you are aware that you are possibly in violation of the EULA and/or want to set aside EULA complications and just discuss technically what is possible.</li>\n</ul>\n\n<p>Once you dismiss the many problems of legality (location, time, circumstances, ability to fund a proper legal defense, etc...) most good questions are easy to gain support on the main site in my experience even if they stray close to the line of what the FAQ prohibits.</p>\n\n<p>The FAQ is intended to be very brief and there is room for interpretation and even disagreement on the main site about leaving some questions open when they are not blatantly about pirating and/or how to steal software.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-10-17T13:48:56.450","CommentCount":"0"},{"Id":"2247","PostTypeId":"1","AcceptedAnswerId":"2249","CreationDate":"2014-10-17T18:45:16.953","Score":"1","ViewCount":"28","Body":"<p>So many times, a simple question is given a 'correct' answer (I shall use one of my own 'answers' as an example - <a href=\"https://apple.stackexchange.com/questions/150889/upgrade-iphone-5-from-ios-7-0-4-to-ios-7-1-2\">Upgrade iPhone 5 from iOS 7.0.4 to iOS 7.1.2</a>)</p>\n\n<p>The chances are that this is the 'correct' answer, yet the OP will never return to show it as such (it doesn't matter for this case whether my actual answer was right or not, it's just an example) &amp; so this question will hang in perpetuity, hogging valuable Google space if nothing else.</p>\n\n<p>The question already has a few up-votes, so the regular 'bad question' scenario doesn't apply.</p>\n\n<p>I guess my real question would be \"Does this type of non-question/non-answer\" quickly drop off SE after some time, or does it really hang around forever?\"<br>\n.. or \"Can this stuff be cleared up manually?\"</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-10-17T19:10:01.017","Title":"Dealing with 'fly-by' users & answers","Tags":"<discussion><flagging>","AnswerCount":"1","CommentCount":"1","FavoriteCount":"1"},{"Id":"2248","PostTypeId":"1","AcceptedAnswerId":"2250","CreationDate":"2014-10-17T18:56:38.600","Score":"3","ViewCount":"28","Body":"<p>If I had a question solely bash or bash-related, would AskDifferent be the right place to ask? Or is there another community more appropriate for that?</p>\n","OwnerUserId":"95661","LastActivityDate":"2014-10-17T19:14:17.267","Title":"Is AskDifferent the right place for bash questions?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2249","PostTypeId":"2","ParentId":"2247","CreationDate":"2014-10-17T19:10:01.017","Score":"2","Body":"<p>It will hang around for ever only questions with down votes will get automatically deleted.</p>\n\n<p>Automatic deletion criteria are in this <a href=\"https://meta.stackexchange.com/questions/78048/enable-automatic-deletion-of-old-unanswered-zero-score-questions-after-a-year\">question</a></p>\n\n<p>Note there are <a href=\"https://meta.stackoverflow.com/questions/273043/are-questions-automatically-deleted-if-they-are-1-without-answers\">discussions</a> on Stack Overflow about what more to do </p>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-10-17T19:10:01.017","CommentCount":"2"},{"Id":"2250","PostTypeId":"2","ParentId":"2248","CreationDate":"2014-10-17T19:14:17.267","Score":"3","Body":"<p>As bash is a part of OSX then Ask Different is a place to ask as can be seen by the <a href=\"https://apple.stackexchange.com/questions/tagged/bash\" class=\"post-tag\" title=\"show questions tagged &#39;bash&#39;\" rel=\"tag\">bash</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/shell\" class=\"post-tag\" title=\"show questions tagged &#39;shell&#39;\" rel=\"tag\">shell</a> tags. </p>\n\n<p>For OSX specific bash questions e.g. how to set environment variables for GUI and what files are read when a Terminal starts this is really the main site (SuperUser is also OK with these as any OSX question here is also on topic there)</p>\n\n<p>Bash is also on topic on Superuser - Unix &amp; Linux - Ubuntu and no doubt others as a user. Some question re programming bash could be on topic for Stack Overflow but I think that is not going to be the best site.</p>\n","OwnerUserId":"237","LastActivityDate":"2014-10-17T19:14:17.267","CommentCount":"0"},{"Id":"2251","PostTypeId":"1","AcceptedAnswerId":"2252","CreationDate":"2014-10-17T21:03:17.350","Score":"3","ViewCount":"58","Body":"<p>I'm convinced editing is the best way to receive rep. All you need to do is fix a couple of typos and bam! You have +2 rep. I know answering is probably the best was to receive rep, but, if you look at my (or most people's answer history), you'll probably notice hardly any have been check marked. This ruins the motivation for answering.</p>\n\n<p>Moreover, answering has a risk/reward factor. While editing only gets a little rep, there is no penalty for it if rejected.</p>\n\n<p>Opinions?</p>\n","OwnerUserId":"95661","LastActivityDate":"2014-10-19T02:26:12.313","Title":"Editing most effective way to recieve rep?","Tags":"<discussion><editing>","AnswerCount":"2","CommentCount":"1"},{"Id":"2252","PostTypeId":"2","ParentId":"2251","CreationDate":"2014-10-17T21:53:14.203","Score":"2","Body":"<p>Editing posts is definitely a way of earning reputation, but it's not the most efficient. The nominal 2 reputation you receive per accepted suggested edit won't earn you a great deal of reputation unless you edit a lot.</p>\n\n<p><a href=\"https://stackoverflow.com/users/1549818/grgarside?tab=reputation\">My Stack Overflow profile</a> mainly consists of editing posts. At the time of writing, I have over <a href=\"https://stackoverflow.com/users/1549818/grgarside?tab=activity&amp;sort=suggestions\">400 approved suggested edits</a>, earning me <a href=\"https://stackoverflow.com/users/1549818/grgarside?tab=reputation\">748 reputation out of a total ~1100</a>. However, these 400 edits took a large proportion of time compared with the <a href=\"https://stackoverflow.com/users/1549818/grgarside?tab=answers\">13 answers</a> I've provided, earning me ~300 reputation. Those 13 answers didn't take very long to write and the reward for the effort I gave was worth it far more than the suggested edits.</p>\n\n<p>In a more extreme case, here on Ask Different, I've earned 160 reputation from my lifetime of suggested edits, including tag wiki edits—an insignificant contribution to the ~35k reputation from <a href=\"https://apple.stackexchange.com/users/37797/grgarside?tab=answers\">other means</a>.</p>\n\n<p>Only when you edit many, many edits very quickly do they become a worthwhile strategy for earning reputation, but suggested edits should be substantial improvements to a post and making minor/bad edits would get you suspended if they get rejected.</p>\n\n<p>Posting great answers will earn you <a href=\"https://apple.stackexchange.com/users?tab=Reputation&amp;filter=all\">plenty of reputation</a>, far exceeding that from suggested edits.</p>\n\n<p>Finally, a point of note regarding rejected suggested edits: yes, there's no penalty for having a few rejected edits, but having a high reject/approve ratio will get you suspended, if not manually by a moderator.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-05-23T11:33:34.410","LastActivityDate":"2014-10-17T22:02:41.747","CommentCount":"4"},{"Id":"2253","PostTypeId":"2","ParentId":"2251","CreationDate":"2014-10-19T02:26:12.313","Score":"2","Body":"<p>I will re-iterate what <a href=\"https://apple.meta.stackexchange.com/users/37797/grgarside\">George</a> has said:</p>\n\n<p>The best way to earn reputation is to:</p>\n\n<ul>\n<li>know actual useful information</li>\n<li>post that information on the correct question in a way that helps others</li>\n</ul>\n\n<p>All the other methods are an order of magnitude or more less efficient. The rep increase for edits and questions is far less voted upon here and combined with the decreased point value of a successful vote makes them icing on the cake so to speak.</p>\n\n<p>If you don't know useful facts, then editing can be hazardous since the community has to expend work to reject edits that don't <strong>substantially improve</strong> a post.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2014-10-19T02:26:12.313","CommentCount":"0"},{"Id":"2254","PostTypeId":"2","ParentId":"2234","CreationDate":"2014-10-19T02:36:57.200","Score":"1","Body":"<p>Very simple.</p>\n\n<p>Just ask questions - like this :)</p>\n","OwnerUserId":"92222","LastActivityDate":"2014-10-19T02:36:57.200","CommentCount":"3"},{"Id":"2257","PostTypeId":"2","ParentId":"2182","CreationDate":"2014-10-20T14:50:00.547","Score":"1","Body":"<p>Yes.</p>\n\n<p>The public beta for Yosemite has passed and it is now officially released. Ask away.</p>\n","OwnerUserId":"292","LastActivityDate":"2014-10-20T14:50:00.547","CommentCount":"0"},{"Id":"2258","PostTypeId":"1","CreationDate":"2014-10-21T17:04:18.433","Score":"15","ViewCount":"299","Body":"<p>I flagged <a href=\"https://apple.stackexchange.com/questions/7947/sort-trash-files-by-date-trashed/151837#151837\">this answer</a> (note the link now goes nowhere, except maybe higher rep mods can see it?) twice. The answer essentially said \"Apple wouldn't have a trash if they didn't intend you to use it, so why are you questioning people using the trash as a backup folder?\" It was posted as an answer, but it is pretty clearly a comment to/criticism of <a href=\"https://apple.stackexchange.com/a/11653/54484\">this answer</a>. Both times I flagged it, the flag was declined stating \"flags should not be used to indicate technical inaccuracies, or an altogether wrong answer\". The second time I wrote about a paragraph explaining that the prior flag was declined, and why I disagreed with it:</p>\n\n<blockquote>\n  <p>I previously flagged this and it was rejected stating that technical inaccuracies or altogether wrong answers are not reasons to flag/delete. This answer is not technically inaccurate, or altogether wrong. To be technically inaccurate or wrong, it would have to be an answer. It does not attempt to answer the original question. It instead comments on a statement made in another answer regarding using Trash as a backup folder, and whether that is its intended use.</p>\n</blockquote>\n\n<p>I see the answer is now gone, but the point remains that somebody (multiple people?) declined the flag twice when it was (in my opinion) accurate. Even if the consensus was the answer should remain, the reason for declining the flag was clearly wrong/not relevant to the answer.</p>\n\n<p>Am I out in left field here? Was the answer not actually a comment on another answer?</p>\n","OwnerUserId":"54484","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-10-27T03:38:31.603","Title":"Technically Inaccurate or Altogether Wrong Answers","Tags":"<discussion><flagging>","AnswerCount":"2","CommentCount":"0"},{"Id":"2259","PostTypeId":"2","ParentId":"2258","CreationDate":"2014-10-21T17:58:52.267","Score":"6","Body":"<p>I declined your flag since I try not to delete things that are not actually harmful. In this case, someone had already commented asking the poster to improve the post.</p>\n\n<p>It's sometimes a decision point to leave something up so a new person or the community editing process can fix things and the OP can learn.</p>\n\n<p>It's another thing to remove totally off-topic comments.</p>\n\n<p>In this case I chose to leave that post up in hopes that the first answer by that user would get improved and we don't shut the door on that person.</p>\n\n<p>Also keep in mind, we do not delete posts that are blatantly incorrect. Deletion is for keeping the post on topic and I saw some faint merit in leaving the post up. Apparently the moderator that deleted it felt differently as that can often be the case on marginal posts.</p>\n\n<p>Bringing it up here on meta is the best thing since everyone can see, discuss and learn. For me, the harm in a marginal answer on a question from 2011 wasn't worse than shutting down a new user trying to contribute his first answer - especially when a comment pointed out politely the weakness of the post.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-10-21T17:58:52.267","CommentCount":"5"},{"Id":"2260","PostTypeId":"2","ParentId":"2258","CreationDate":"2014-10-21T19:23:25.293","Score":"12","Body":"<p>In my opinion, It's not an answer and it should have been deleted.</p>\n","OwnerUserId":"9388","LastActivityDate":"2014-10-21T19:23:25.293","CommentCount":"0"},{"Id":"2261","PostTypeId":"2","ParentId":"2240","CreationDate":"2014-10-23T14:49:48.990","Score":"1","Body":"<p>The proper place to propose a tag, if you really want to, is here on meta, but my proposal for where to propose a tag is nowhere.</p>\n\n<p>Please think twice before proposing a new tag. We have far too many tags already. Tags are for filtering: people with particular expertise can search for questions tagged with their preferred subject matter.  People with topics that do not interest them can use tags to block posts they don't want to see.</p>\n\n<p>If you really want a tag to exist, be ready to explain why you think there is a population of people who are specifically interested in reading or ignoring questions tagged with that tag that would not have their interests defined by existing tags.</p>\n\n<p>Tags are NOT just to convey information; that can go in the body of the post. Tags are for filtering.</p>\n","OwnerUserId":"9388","LastActivityDate":"2014-10-23T14:49:48.990","CommentCount":"1"},{"Id":"2262","PostTypeId":"1","AcceptedAnswerId":"2263","CreationDate":"2014-10-23T19:16:46.610","Score":"0","ViewCount":"56","Body":"<p>Microsoft OneNote doesn't have a space in its name, yet <a href=\"https://apple.stackexchange.com/questions/tagged/one-note\" class=\"post-tag\" title=\"show questions tagged &#39;one-note&#39;\" rel=\"tag\">one-note</a> has a hyphen in its name.</p>\n\n<p>Could the hyphen be removed from the tag name?</p>\n","OwnerUserId":"37797","LastActivityDate":"2014-10-23T21:16:08.720","Title":"Rename \"one-note\" tag to \"onenote\"","Tags":"<support><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2263","PostTypeId":"2","ParentId":"2262","CreationDate":"2014-10-23T19:19:29.563","Score":"0","Body":"<p>Done. Thank you for catching that.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-10-23T19:19:29.563","CommentCount":"4"},{"Id":"2265","PostTypeId":"1","CreationDate":"2014-10-25T13:29:37.893","Score":"1","ViewCount":"40","Body":"<p><a href=\"https://apple.stackexchange.com/questions/152735/did-apple-drop-the-keyword-server-from-the-mac-mini-category/\">Did Apple drop the keyword &#39;Server&#39; from the Mac Mini category?</a></p>\n\n<p><img src=\"https://i.stack.imgur.com/YADoZ.png\" alt=\"\"></p>\n\n<p>In my opinion, to have the Q&amp;A stand as it is not an improvement over the previous version, especially by removing the comment that points out the technical inaccuracy of the accepted answer. Is it the case that acrimonious comments are all removed regardless of the informational value of each?</p>\n","OwnerUserId":"90351","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-10-26T18:29:10.320","Title":"Why was this exchange in comments removed?","Tags":"<discussion><comments><moderation>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"2267","PostTypeId":"2","ParentId":"2265","CreationDate":"2014-10-25T23:31:37.380","Score":"4","Body":"<p>Comments are ephemeral. Especially if they turn into a long exchange, we delete them. Notice the warning telling you to avoid extended discussions in comments. Either edit the answer if the answer's poster is on board, or propose a new answer.</p>\n","OwnerUserId":"9388","LastActivityDate":"2014-10-25T23:31:37.380","CommentCount":"0"},{"Id":"2268","PostTypeId":"1","AcceptedAnswerId":"2273","CreationDate":"2014-10-26T10:33:33.243","Score":"1","ViewCount":"20","Body":"<p>There are similar questions regarding reopening in here, but the 'master' question is about Lion &amp; has no accepted answer.<br>\nI'm aiming for more specific questions, as people spot them, to perhaps be listed here for consideration, rather than each needing its own meta question.</p>\n\n<p>It might be useful to gather a list of possibles for reopening, if they show issues which were not resolved by the release, or are repeatable pitfalls many users can fall into.  I'm in no way advocating any kind of blanket reopen purely because Yosemite &amp; iOS8 are now released.</p>\n\n<p>Perhaps just using comments for each, with a simple 'Open - <em>reason</em>' or Close - <em>reason</em>' as a straw poll?</p>\n\n<p>My starter would be...<br>\nSince Yosemite beta, there have been many questions relating to partitioning on Logical Volume groups.  </p>\n\n<p>I'm not certain we really have one definitive Question/Answer on it yet, but one that would appear to be fairly comprehensive is this one - <a href=\"https://apple.stackexchange.com/questions/134498/unable-to-resize-partitions\">Unable to Resize Partitions</a> which is marked as closed. Do we consider it a likely candidate to reopen?</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-10-26T18:10:21.820","Title":"Reopening specific Yosemite pre-release questions","Tags":"<discussion><closed-questions><yosemite>","AnswerCount":"1","CommentCount":"0"},{"Id":"2269","PostTypeId":"1","CreationDate":"2014-10-26T13:34:10.727","Score":"0","ViewCount":"16","Body":"<p>Sorry for the ambiguous title.</p>\n\n<p>Better but more wordy question ought to be...<br>\nIs it policy or does it make sense to upvote a question where the user obviously did something incredibly dim, but the question/answer itself could be useful to other people?</p>\n\n<p>I use this as an example [the fact that I answered it has no bearing, I'm still tempted to upvote the question as useful]<br>\n<a href=\"https://apple.stackexchange.com/questions/153000/mac-stopped-working-after-deleting-hidden-files\">Deleted hidden files and now Mac won&#39;t boot, how do I fix this?</a></p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-10-26T13:47:35.747","Title":"Policy/opinion on upvoting a question","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"2270","PostTypeId":"1","CreationDate":"2014-10-26T13:44:48.583","Score":"1","ViewCount":"34","Body":"<p><a href=\"https://apple.stackexchange.com/questions/151821/disable-iphoto-auto-launch-when-connecting-an-iphone-in-yosemite\">Disable iPhoto auto launch when connecting an iPhone or iPad</a>\nis marked as duplicate. It's not. It's similar but it only pertains to iPhoto specifically in Yosemite.</p>\n\n<p>Got feedback that it should explain how it's different. That can't possibly be reasonable, to have to defend why a question is different when it clearly is.\nThe answers in the linked \"duplicate\" works fine for the question posted there. But not for the question I posted.</p>\n\n<p>The last answer in the linked \"duplicate\" even refers to my question since it does not solve the problem I posted about. </p>\n\n<p>Who can remove such duplicate flags?</p>\n","OwnerUserId":"74559","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-10-26T18:12:48.137","Title":"Remove duplicate status for a non-duplicate question","Tags":"<support><closed-questions><exact-duplicates>","AnswerCount":"1","CommentCount":"0"},{"Id":"2271","PostTypeId":"2","ParentId":"2269","CreationDate":"2014-10-26T13:47:35.747","Score":"2","Body":"<p>From the <a href=\"https://apple.stackexchange.com/help/why-vote\">FAQ on Why is voting important</a>:</p>\n\n<blockquote>\n  <p>Voting up a question or answer signals to the rest of the community that a post is interesting, well-researched, and useful, while voting down a post signals the opposite: that the post contains wrong information, is poorly researched, or fails to communicate information. The more that people vote on a post, the more certain future visitors can be of the quality of information contained within that post – not to mention that upvotes are a great way to thank the author of a good post for the time and effort put into writing it!</p>\n</blockquote>\n\n<p>So the key idea is not to vote on the actions/problems of others but primarily on whether a question is \"interesting, well-researched, and useful\". Which also means that down voted questions can have up voted answers (and vice versa, which is probably the case more often).</p>\n\n<p>But also keep in mind that the SE network is all about sharing information and giving back to the community. So if you see ways to improve a question, go ahead and do so because it will benefit all parties involved (the OP might learn how to write better questions, you will get some reputation for the edit and the community has a better question attracting better answers).</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-10-26T13:47:35.747","CommentCount":"5"},{"Id":"2272","PostTypeId":"2","ParentId":"2270","CreationDate":"2014-10-26T13:56:28.880","Score":"3","Body":"<p>All moderators can (and will if necessary) reopen questions, but so can high-rep users if a question is flagged for a reopen. Flagging for reopen can be done either explicitly (by clicking on the \"reopen\" label below the question) or be editing the text of a question.</p>\n\n<p>In the question linked above, the comments indicate why an edit is deemed necessary, primarily because <em>as written</em> the question doesn't say anything about the solution in the linked question not solving the problem in Yosemite any longer. So if you want the question reopened, the easiest way would be to rewrite the question to show the steps already tried (e.g. changing the setting in iPhoto).</p>\n\n<p>PS: Please keep in mind that it's not just the moderators who can moderate/improve the site -- all users can (and are invited to) do that.</p>\n","OwnerUserId":"9058","LastActivityDate":"2014-10-26T13:56:28.880","CommentCount":"4"},{"Id":"2273","PostTypeId":"2","ParentId":"2268","CreationDate":"2014-10-26T14:14:42.203","Score":"3","Body":"<p>Closed questions can be put into the reopen queue by</p>\n\n<ul>\n<li>users requesting a reopen by clicking the \"reopen\" label beneath the question (requires >3000 reputation)</li>\n<li>users editing a closed question (e.g. to improve issues pointed out in comments, add some details etc.)</li>\n<li>moderators after question got flagged by a &lt;3000 rep user</li>\n</ul>\n\n<p>The \"reopen\" queue works the same way as the other review queues, so if enough reviewers (3 or 5, don't remember right now) support the reopen, the question gets reopened.</p>\n\n<p>Also please keep in mind that a closed question doesn't disappear from the site and still shows up in search results. So unless you expect additional answers to be given to a closed question there is no direct benefit from opening a closed question.</p>\n","OwnerUserId":"9058","LastActivityDate":"2014-10-26T14:14:42.203","CommentCount":"0"},{"Id":"2276","PostTypeId":"1","CreationDate":"2014-10-31T17:15:19.837","Score":"4","ViewCount":"42","Body":"<ul>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/mdm\" class=\"post-tag\" title=\"show questions tagged &#39;mdm&#39;\" rel=\"tag\">mdm</a> — 51 tagged, 20 this year</p>\n\n<blockquote>\n  <p>Mobile Device Management (MDM). A server platform that a company can deploy to centrally manage portable network-connected devices such as the iPhone, iPad and iPod touch. Also applies to MCX/OS X management since Apple Store apps are now as much a part of OS X as they are for iOS.</p>\n</blockquote></li>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/mobile-device-management\" class=\"post-tag\" title=\"show questions tagged &#39;mobile-device-management&#39;\" rel=\"tag\">mobile-device-management</a> — 17 tagged, 4 this year</p>\n\n<blockquote>\n  <p>Also known as MDM, mobile device management is software that helps manage devices for reporting, policy compliance as well as saving labor and standardizing setup amongst many devices when used by the same company or group. iOS MDM uses a framework for device management and often involves third party management software if the company's needs exceed the MDM capabilities of Lion Server.</p>\n</blockquote></li>\n</ul>\n\n<p>These are one and the same, even referencing each other in their tag wiki excerpts.</p>\n\n<p>Could the shortened version be made a synonym of the full description?</p>\n","OwnerUserId":"37797","LastActivityDate":"2014-10-31T17:16:54.423","Title":"Make \"mdm\" a synonym of \"mobile-device-management\"","Tags":"<support><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2277","PostTypeId":"2","ParentId":"2276","CreationDate":"2014-10-31T17:16:54.423","Score":"3","Body":"<p>I'm tempted to merge the long tag into the short one.</p>\n\n<p>If someone wants to type mobile... they will see and select the synonym, but MDM is a great tag IMO.</p>\n\n<p>Before I merge things, let's see if there is more support for your request to point the short tag at the long one...</p>\n\n<hr>\n\n<p>Clearly, we should merge these - the only question is which way (which we can easily reverse later if needed).</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-10-31T17:16:54.423","CommentCount":"2"},{"Id":"2278","PostTypeId":"1","CreationDate":"2014-11-03T23:43:33.180","Score":"1","ViewCount":"33","Body":"<p>I would like to request some help on a bounty. I am not seeing options that seem right for the community. In summary, it looks like my only choice is to award a bounty to an unsatisfactory answer. I would like to have more options. Below are the details.</p>\n\n<p>I put a bounty on <a href=\"https://apple.stackexchange.com/questions/106809/expand-symlinked-directory-in-finder\">this question</a> in the hopes that it would attract more attention, but the question did not get any new answers or updates.</p>\n\n<p>The <a href=\"https://apple.stackexchange.com/questions/106809/expand-symlinked-directory-in-finder/154560#154560\">answer which existed before I placed the bounty</a> does not answer the question; it only provides a work-around.</p>\n\n<p>Only after the bounty expired, without any new answers, did I find <a href=\"https://apple.stackexchange.com/questions/106809/expand-symlinked-directory-in-finder/154560#154560\">a satisfactory answer</a>.</p>\n\n<p>The question was a stumper. There was no 'happy' answer to solve the problem. Still, in my opinion, it serves the community better to say \"The answer to the question is 'no' and here are some references that back it up\". Doing so \"admits defeat\" in some sense, but at least it moves the discussion forward. After that admission, then it is fine to add \"Given that, perhaps you can use a work-around such as X\" and/or \"Perhaps you would like to file a bug report with Apple.\" In short, I think it is key to respect the original poster's question and answer it as specified. It would be misleading and incorrect to give the bounty to anything less.</p>\n\n<p>So, I would like to either:</p>\n\n<ul>\n<li>Award the points to my answer. I don't like that this is self-serving, but my answer (actually based on someone else's research) is currently the best answer.</li>\n<li>Delete the bounty. I don't need the points. I'd be happy losing them.</li>\n</ul>\n\n<p>My goal is to promote knowledge. I don't care about getting the points myself. In either case, I think it is wrong to give the bounty to an incorrect answer.</p>\n\n<p>Is what I'm asking possible? Can someone help?</p>\n","OwnerUserId":"24322","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-11-04T07:31:10.210","Title":"Bounty expired without good answers, so did some digging and found the correct answer. Now what?","Tags":"<discussion><support><questions><bounty>","AnswerCount":"1","CommentCount":"0"},{"Id":"2279","PostTypeId":"2","ParentId":"2278","CreationDate":"2014-11-04T02:24:00.113","Score":"6","Body":"<p>You do not have to award the bounty to anyone. You cannot award the bounty to yourself.</p>\n\n<p>The point of the bounty is to \"buy\" exposure and attention for the question. That's what you paid for; that's what you got. If it results in a great answer, awesome. In this case, you determine that it did not generate a sufficient answer from someone other than you (and you get to make that call - you paid for the bounty). You don't have to award the points.</p>\n","OwnerUserId":"9388","LastActivityDate":"2014-11-04T02:24:00.113","CommentCount":"1"},{"Id":"2280","PostTypeId":"1","CreationDate":"2014-11-06T13:52:44.893","Score":"4","ViewCount":"45","Body":"<p>I'm seeing a fair number of questions that describe a problem then ask whether anyone else has experienced the problem. This invites a host of \"yes, I've had that problem\" (or worse, but less common, \"no, that hasn't happened to me\") answers. Ordinarily \"I've got that problem too\" gets deleted as a non-answer, but in this case, it actually answers the OP's question.</p>\n\n<p>The problem is,the question as asked literally invites all of humanity to chime in with yes, me too or no, not me. This is not a question that provokes helpful answers.</p>\n\n<p>What can we do to discourage the question \"has anyone else experienced this problem\" in favor of something that provokes better responses?</p>\n","OwnerUserId":"9388","LastEditorUserId":"3","LastEditDate":"2014-11-07T15:13:24.457","LastActivityDate":"2014-11-07T15:13:24.457","Title":"Questions asking \"Has anyone else experienced this?\"","Tags":"<discussion><asking-questions>","AnswerCount":"2","CommentCount":"0"},{"Id":"2281","PostTypeId":"2","ParentId":"2280","CreationDate":"2014-11-06T14:04:14.150","Score":"3","Body":"<p>It may be enough to just have a look at the Help Center entry about <a href=\"https://apple.stackexchange.com/help/dont-ask\">What types of questions should I avoid asking?</a>:</p>\n\n<blockquote>\n  <p>[...] avoid asking subjective questions where ...</p>\n  \n  <ul>\n  <li>every answer is equally valid: “What’s your favorite ______?”</li>\n  <li>your answer is provided along with the question, and you expect more answers: “I use ______ for ______, what do you use?”</li>\n  <li><strong>there is no actual problem to be solved: “I’m curious if other people feel like I do.”</strong></li>\n  <li>you are asking an open-ended, hypothetical question: “What if ______ happened?”</li>\n  <li>your question is just a rant in disguise: “______ sucks, am I right?”</li>\n  </ul>\n</blockquote>\n\n<p>So I would invite everybody to either edit these kind of questions into something which can be answered in a way which solves the problem or at least flag those questions. And (because the site is supposed to be self-moderating) I want to encourage everybody to give the \"edit\" option a try :-)</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-11-06T14:04:14.150","CommentCount":"0"},{"Id":"2282","PostTypeId":"2","ParentId":"2280","CreationDate":"2014-11-06T14:07:39.367","Score":"1","Body":"<p>We have one site-specific close reason left which we could actually use to close questions which do not ask for an actual solution. Kind of like the \"not a real question\" reason we had in the past, but a bit more specific.</p>\n\n<p>PS: Had to use two different answers to give people a chance to upvote answers based on preferences</p>\n","OwnerUserId":"9058","LastActivityDate":"2014-11-06T14:07:39.367","CommentCount":"0"},{"Id":"2283","PostTypeId":"1","AcceptedAnswerId":"2284","CreationDate":"2014-11-10T07:24:01.213","Score":"3","ViewCount":"60","Body":"<p>I noticed today that a same link had been posted to two different questions from two different users.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/users/99994/yolili\">Yolili</a> - posted in the <a href=\"https://apple.stackexchange.com/questions/35778/how-do-you-restore-files-from-an-icloud-backup/155599#155599\">question</a></li>\n<li><a href=\"https://apple.stackexchange.com/users/99995/babalala\">babalala</a> - posted in the <a href=\"https://apple.stackexchange.com/questions/99276/having-trouble-restoring-backup-of-my-iphone/155600#155600\">question</a></li>\n</ul>\n\n<p>Both those answers have search terms which the user is trying to promote for SEO. I've reported the questions, should I report the users as well?</p>\n\n<p>This brings upon a bigger question where there are some users who've created accounts just for posting a answer with a link to a website like - <a href=\"https://apple.stackexchange.com/users/75960/user75960\">example user</a> who posted an answer for this <a href=\"https://apple.stackexchange.com/questions/35778/how-do-you-restore-files-from-an-icloud-backup/127837#127837\">question</a>, which seems to be okay but the link is shortened which raises a flag for spam i think.</p>\n\n<p>How should such user accounts be handled ?</p>\n","OwnerUserId":"49189","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-11-10T08:29:59.087","Title":"Should I report accounts that were just made to spam/promotion links?","Tags":"<discussion><flagging>","AnswerCount":"1","CommentCount":"0"},{"Id":"2284","PostTypeId":"2","ParentId":"2283","CreationDate":"2014-11-10T07:30:56.183","Score":"5","Body":"<p>In a nutshell: Flagging the answers as spam (or just for moderator attention) is absolutely ok in these cases.</p>\n\n<p>We look into the account when we get notified of spam messages, so there is no urgent need to flag the user as well (especially if you already flagged the answer). </p>\n","OwnerUserId":"9058","LastEditorUserId":"9058","LastEditDate":"2014-11-10T08:29:59.087","LastActivityDate":"2014-11-10T08:29:59.087","CommentCount":"0"},{"Id":"2285","PostTypeId":"1","AcceptedAnswerId":"2286","CreationDate":"2014-11-14T12:26:27.533","Score":"1","ViewCount":"24","Body":"<p>I noticed today that most of the posts in my \"Flagged Posts\" tab are highlighted in a light red shade but one of them weren't highlighted.</p>\n\n<p>Does it mean anything or it is a site bug?</p>\n\n<p><img src=\"https://i.stack.imgur.com/QLK3E.png\" alt=\"\"></p>\n","OwnerUserId":"49189","LastEditorUserId":"37797","LastEditDate":"2014-11-15T12:26:10.243","LastActivityDate":"2014-11-15T12:26:10.243","Title":"Why are some flags not highlighted in red?","Tags":"<bug><flagging>","AnswerCount":"1","CommentCount":"0"},{"Id":"2286","PostTypeId":"2","ParentId":"2285","CreationDate":"2014-11-14T14:28:33.733","Score":"3","Body":"<p>Posts highlighted in red have been deleted. Posts not highlighted are still visible to ordinary users on the site.</p>\n","OwnerUserId":"9388","LastActivityDate":"2014-11-14T14:28:33.733","CommentCount":"0"},{"Id":"2287","PostTypeId":"1","AcceptedAnswerId":"2289","CreationDate":"2014-11-15T07:07:29.223","Score":"7","ViewCount":"243","Body":"<p>The subject says it all. I am light user of this particular Stack Exchnage site, but rolled over in the past few hours to <a href=\"https://apple.stackexchange.com/search?tab=active&amp;q=Clash%20of%20Clans\">see lots of “Clash of Clans” posts</a> new and old on the main page. Including tons of “me too” like answers. What’s up?</p>\n\n<p>FWIW, <a href=\"https://apple.stackexchange.com/questions/150359/2-clash-of-clans-account-on-the-same-game-center-account\">this is a pretty amazing thread</a>. Ditto <a href=\"https://apple.stackexchange.com/questions/156496/2-different-game-center-apple-ids-one-village\">with this one</a>. This many “me too” responses? Really?</p>\n","OwnerUserId":"40457","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-04-18T14:59:48.290","Title":"Is it just me or is there a sudden uptick in Clash of Clans questions with tons of “me too” answers?","Tags":"<discussion><support><answers>","AnswerCount":"2","CommentCount":"2"},{"Id":"2288","PostTypeId":"2","ParentId":"2287","CreationDate":"2014-11-15T10:02:56.650","Score":"6","Body":"<p>I've cleaned up most of them now. If you run into more, just flag them as usual.</p>\n\n<p>As for the reason, I can only guess. Maybe there was a change of rules on CoC server side which triggered some changes in the app. </p>\n","OwnerUserId":"9058","LastActivityDate":"2014-11-15T10:02:56.650","CommentCount":"10"},{"Id":"2289","PostTypeId":"2","ParentId":"2287","CreationDate":"2014-11-15T12:22:03.747","Score":"9","Body":"<p>This kind of thing is very common on Ask Different when a change occurs with something within the scope of the site. It begins with a reasonable question on the subject, and thanks to SE's very high SERP rank, is the #1 result for many search queries.</p>\n\n<p>People then post 'me too' answers, either because they want to participate in the question so that they believe they can be updated when the question is updated (like some forums do, unaware of the 'favourite' feature), or simply because they want to express that they are experiencing the same problem.</p>\n\n<p>Especially with the topic of Clash of Clans, where the stereotypical demographic of the general user base usually results with low quality posts, the situation is extenuated, but the same thing happens with other topics as well.</p>\n\n<p>Downvote, comment and flag the posts. If you have >10k, protect the question to prevent further answers, and vote to delete the posts if you have >20k.</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2015-04-18T14:59:48.290","LastActivityDate":"2015-04-18T14:59:48.290","CommentCount":"2"},{"Id":"2290","PostTypeId":"1","CreationDate":"2014-11-17T15:44:05.510","Score":"3","ViewCount":"47","Body":"<p>I have the same question previously asked as <a href=\"https://apple.stackexchange.com/questions/11012/stop-itunes-from-automatically-stopping-podcast-downloads\">\"Stop iTunes from automatically stopping podcast downloads\"</a>. I don't think there was a satisfactory answer 3.5 years ago, and now one of the top answers even includes a broken link. Perhaps things have changed since then?</p>\n\n<p>Is there an accepted way to bump this question? I could edit it, add a bounty, or ask a similar question again either here or on Superuser.</p>\n","OwnerUserId":"16302","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-11-17T15:50:08.263","Title":"If an old question wasn't answered, is there a good way to bump it?","Tags":"<discussion><questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"2291","PostTypeId":"2","ParentId":"2290","CreationDate":"2014-11-17T15:50:08.263","Score":"3","Body":"<p>Editing for the sake of bumping is discouraged, as is posting duplicate questions. Bounties are appropriate, but you only have 121 reputation.</p>\n\n<p>It would be reasonable, though, to ask a new question and specify that your new question is asking specifically about what is available in 2014 using iTunes version (whatever) running on operating system version whatever. Even link to the old question to let people know you know about it but are looking for something more current.</p>\n","OwnerUserId":"9388","LastActivityDate":"2014-11-17T15:50:08.263","CommentCount":"1"},{"Id":"2292","PostTypeId":"1","CreationDate":"2014-11-19T04:46:49.033","Score":"3","ViewCount":"99","Body":"<p>I am sure you are aware of this web site that pops up in Google search using the Titles from the Ask Different.</p>\n\n<p><a href=\"http://help.howproblemsolution.com/\" rel=\"nofollow noreferrer\">http://help.howproblemsolution.com/</a></p>\n\n<p>All it does is it shows the copy of the Title or the question, but not the answers.</p>\n\n<p>It is loaded with adds ect..</p>\n\n<p>Just wondering is someone has found a great way to get high web site hits and make lots of money that way?</p>\n\n<p>Maybe it is my Google search but the Tile is definitely the same the time of post is with in a hour and sometimes even the body text is almost the same.</p>\n\n<p>Here are few examples:</p>\n\n<p><img src=\"https://i.stack.imgur.com/j5q0e.jpg\" alt=\"scam 1\"></p>\n\n<p><img src=\"https://i.stack.imgur.com/TsrrR.jpg\" alt=\"scam 2\"></p>\n\n<p>Here</p>\n\n<p><img src=\"https://i.stack.imgur.com/aH5Ul.jpg\" alt=\"here\"></p>\n\n<p>and There</p>\n\n<p><img src=\"https://i.stack.imgur.com/JEA8N.jpg\" alt=\"There\"></p>\n","OwnerUserId":"46541","LastEditorUserId":"46541","LastEditDate":"2014-11-20T18:27:24.237","LastActivityDate":"2014-11-20T18:27:24.237","Title":"Scam or clever way of making money","Tags":"<discussion><support>","AnswerCount":"1","CommentCount":"2","FavoriteCount":"1"},{"Id":"2293","PostTypeId":"2","ParentId":"2292","CreationDate":"2014-11-19T13:47:35.827","Score":"3","Body":"<p>If you find a web site that doesn't honor the <a href=\"http://creativecommons.org/licenses/by-sa/3.0/\" rel=\"nofollow noreferrer\">cc by-sa 3.0</a> license with <a href=\"http://blog.stackoverflow.com/2009/06/attribution-required/\">proper attribution</a>, you can and probably should <a href=\"https://apple.meta.stackexchange.com/contact\">contact a stack exchange employee</a> with the details.</p>\n\n<p>They also monitor <a href=\"https://apple.stackexchange.com/questions/tagged/support\" class=\"post-tag\" title=\"show questions tagged &#39;support&#39;\" rel=\"tag\">support</a> requests here, so you could tag the question thusly as well.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.967","LastActivityDate":"2014-11-19T13:47:35.827","CommentCount":"2"},{"Id":"2294","PostTypeId":"1","CreationDate":"2014-11-19T15:33:45.133","Score":"21","ViewCount":"214","Body":"<p>We currently (as of November 19) have 65 questions tagged \"Clash of Clans\" on the site, with an average question score of 0.2. Currently, these questions have generated a grand total of two answers that have received multiple up votes. This isn't a recipe for quality Q&amp;A, which is what the site is designed to encourage.</p>\n\n<p>Accordingly, I'd like to make questions about the particulars of specific games to be off-topic for this site. Maybe there are fora that can generate constructive discussion about \"how do I change users in Sonic and Zelda Assassin: Grand Theft Unicorn Edition,\" but it doesn't seem to be working here.</p>\n\n<p>The only two CoC answers with multiple up votes are pretty trivial answers themselves: one quotes the documentation for the game and the other indicates that there is no OS X version of the game. Good information, but if these are the best responses CoC questions generate, maybe that's a sign that the site is better off without CoC questions.</p>\n","OwnerUserId":"9388","LastEditorUserId":"5472","LastEditDate":"2014-11-26T19:44:48.783","LastActivityDate":"2015-02-19T12:51:51.693","Title":"Making Clash of Clans questions off-topic here","Tags":"<discussion><status-completed><site-scope>","AnswerCount":"6","CommentCount":"12"},{"Id":"2295","PostTypeId":"2","ParentId":"2294","CreationDate":"2014-11-19T15:39:29.247","Score":"13","Body":"<p>Yes. This makes sense to me. The answer to the vast majority of these questions has been: contact the developer.</p>\n","OwnerUserId":"292","LastActivityDate":"2014-11-19T15:39:29.247","CommentCount":"2"},{"Id":"2297","PostTypeId":"2","ParentId":"2294","CreationDate":"2014-11-21T21:12:19.577","Score":"5","Body":"<p>\"questions about the particulars of specific games to be off-topic \"  </p>\n\n<p>That hits the nail on the head for me. </p>\n\n<p>CoC had a few days of irritation, due to server issues, but in the relatively short time I've been here, it's the only game that seems to crop up as a taggable one. The rest don't seem to generate questions here. So, blanket ban on games questions would almost seem to be 'CoC only' anyway.</p>\n\n<p>Having typed that, I'm not sure whether I voted yes or no, but games just don't seem to fit AskDifferent's ethos anyway; there are a million sites better-suited.</p>\n","OwnerUserId":"85275","LastActivityDate":"2014-11-21T21:12:19.577","CommentCount":"5"},{"Id":"2298","PostTypeId":"2","ParentId":"2294","CreationDate":"2014-11-26T19:42:19.720","Score":"2","Body":"<p>I'm going to say we don't need to make COC off topic.</p>\n\n<p>It seems odd to rule out one app because we already have all the tools we need to close low quality (and total crap) questions.</p>\n\n<p>If someone can show me a question that needs to be closed as \"off topic\" if we were to implement this request, my suspicion is that it could also easily be closed as low quality, unclear, or duplicate.</p>\n\n<p>If people don't document the exact build of COC and the iOS version, then that's good enough for me to close it as too broad and/or unclear.</p>\n\n<p>I'd rather a few canonical answers get assembled and then we can dupe vague questions and/or close them with little to no additional effort. I don't see how adding a clause to the off-topic makes things better for anyone.</p>\n\n<p>As things stand, we have this clause:</p>\n\n<blockquote>\n  <p>Questions about the particulars of specific games, such as game account or in-app purchase issues, should be directed to the game's developer.</p>\n</blockquote>\n\n<p>What if we substituted running apps or Apple apps for games. Isn't this a big broad ban for no real benefit?</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-11-26T19:42:19.720","CommentCount":"6"},{"Id":"2299","PostTypeId":"2","ParentId":"2294","CreationDate":"2014-11-28T07:45:40.750","Score":"2","Body":"<p>I'm adding this as another answer just to make one specific point/question/poll…</p>\n\n<p>How many of the mods &amp; high rep others here have ever actually played CoC? or had any of the issues we've seen described on the topic?</p>\n\n<p>Or are we, between us, providing the best LMGTFY service to single-digit AD users that we possibly can, yet coming up far shorter than we would on a question about, say, Terminal &amp; how to use sudo?</p>\n\n<p>Personally, I wouldn't <em>expect</em> a 50k rep user on here to be a gamer; I'd expect them to have a deep knowledge of MacOS &amp; iOS - that's how they got their rep in the first place. </p>\n\n<p>I'm not casting us as old, crotchety &amp; bah-humbug - I just think there may be a significant proportion who wouldn't give a rat's ass for gaming &amp; would consider they have far better things to think about.</p>\n\n<p><em>[Doesn't really need comments, though who am I to stop you;-) but just a straw poll by voting this up or down might give some indication as to degree of agreement with my point]</em></p>\n","OwnerUserId":"85275","LastActivityDate":"2014-11-28T07:45:40.750","CommentCount":"2"},{"Id":"2300","PostTypeId":"1","CreationDate":"2014-12-05T02:14:40.973","Score":"1","ViewCount":"44","Body":"<p>How can I contact a user of this site?</p>\n\n<p>I think the user name is l'L'l and he had offered it somewhere but I dont know how to ask him for software that plays Quicktime movies like mplayer -playlist (yourplaylist) or realplayer bla.ram. Series of URLs in ASCII.</p>\n","OwnerDisplayName":"user103484","LastEditorUserId":"5472","LastEditDate":"2014-12-05T16:37:58.660","LastActivityDate":"2014-12-05T16:37:58.660","Title":"How can I ask user l'L'l for his simple Quicktime Playlist player?","Tags":"<discussion>","AnswerCount":"3","CommentCount":"0"},{"Id":"2301","PostTypeId":"2","ParentId":"2300","CreationDate":"2014-12-05T03:57:26.697","Score":"2","Body":"<p>If you earn more reputation you can participate in the chat forums. If you earn even more reputation, you can write comments on others' posts.</p>\n","OwnerUserId":"9388","LastActivityDate":"2014-12-05T03:57:26.697","CommentCount":"0"},{"Id":"2302","PostTypeId":"2","ParentId":"2300","CreationDate":"2014-12-05T11:54:07.710","Score":"0","Body":"<p>However in general you can't contact an individual user. This is by design in Stack Exchange see <a href=\"https://meta.stackexchange.com/questions/431/any-way-to-send-a-personal-message-to-another-user\">this meta stackexchange question</a></p>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-12-05T11:54:07.710","CommentCount":"0"},{"Id":"2303","PostTypeId":"2","ParentId":"2300","CreationDate":"2014-12-05T16:37:05.327","Score":"1","Body":"<p>You should put your contact information in your profile (the info I edited out of your question body). Similarly, if someone wants to be contacted outside the site, you can look in their profile.</p>\n\n<p>If you link to the user in question, I'll explain where that contact info lies. For me, look at <a href=\"https://apple.stackexchange.com/users/5472/bmike\">https://apple.stackexchange.com/users/5472/bmike</a></p>\n\n<p>The site notification methods are to @user ping them in comments or chat. Both of these require you to gain some reputation so asking here is your only hope of pinging the user without them self-disclosing their contact information or you gaining reputation.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-12-05T16:37:05.327","CommentCount":"0"},{"Id":"2304","PostTypeId":"1","AcceptedAnswerId":"2305","CreationDate":"2014-12-08T01:47:20.043","Score":"9","ViewCount":"155","Body":"<p>I've just noticed that I got downvoted on my voice dictation questions:</p>\n\n<p><img src=\"https://i.stack.imgur.com/4O0UW.png\" alt=\"enter image description here\"></p>\n\n<p>Are voice dictation questions out of scope here? If not, is there any other issues with my  voice dictation questions?</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/q/159833/20338\">Equivalent of Dragon NaturallySpeaking&#39;s HeardWord function in Dragon Dictate 4</a></li>\n<li><a href=\"https://apple.stackexchange.com/q/159831/20338\">No cap after a period in Dragon Dictate 4</a></li>\n<li><a href=\"https://apple.stackexchange.com/q/159829/20338\">Voice command to output &quot;\\ref{}&quot; in Dragon Dictate 4</a></li>\n</ul>\n","OwnerUserId":"20338","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-12-08T02:12:01.903","Title":"Serial downvoting on voice dictation questions","Tags":"<discussion><site-scope>","AnswerCount":"1","CommentCount":"0"},{"Id":"2305","PostTypeId":"2","ParentId":"2304","CreationDate":"2014-12-08T02:12:01.903","Score":"9","Body":"<p>Those questions are not only on topic, but I view them as good ones. My guess is someone doesn't like questions about third party products.</p>\n\n<p>I'll watch for vote patterns, but so far nothing is in \"moderator needs to act\" range. If you see two dozens of votes, please flag a post or bump this again and we can see if there is a pattern that would merit intervention.</p>\n\n<p>You are clearly trying to use OS X software and hardware to do some useful automation and voice recognition. I hope a few cranky votes don't put you off on the site.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-12-08T02:12:01.903","CommentCount":"7"},{"Id":"2306","PostTypeId":"1","CreationDate":"2014-12-09T12:19:29.377","Score":"9","ViewCount":"140","Body":"<p>I wanted to answer this <a href=\"https://apple.stackexchange.com/questions/160001/binding-multiple-items-to-clipboard\">question</a>. But the user jherran was faster commenting this question instead of answering it.</p>\n\n<p>So i just added a comment instead of answering it, expecting jherran will add an answer based on his – in my opinion correct – comment (and maybe other peoples comments) soon.</p>\n\n<p>I still hesitate to answer it because i feel uncomfortable to \"steal\" someone else's answer.</p>\n\n<p>What is good-practice or considered polite in such a case?</p>\n","OwnerUserId":"93229","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-12-12T00:44:29.440","Title":"Is it good-practice to use a comment (or parts of it) of someone else to answer a question?","Tags":"<discussion><answers><comments><etiquette>","AnswerCount":"2","CommentCount":"1"},{"Id":"2307","PostTypeId":"2","ParentId":"2306","CreationDate":"2014-12-09T16:23:50.713","Score":"13","Body":"<p>I would say just answer it. I would put more content in an answer than your comment, but if the other person wants to answer it they can too. That's how SE is supposed to work. People answer the questions and other people vote those answers up or down. </p>\n","OwnerUserId":"70930","LastActivityDate":"2014-12-09T16:23:50.713","CommentCount":"2"},{"Id":"2308","PostTypeId":"2","ParentId":"2306","CreationDate":"2014-12-11T19:28:32.183","Score":"4","Body":"<p>Please always use an answer as comments are (sometimes) pretty pointless. An answer is something I read at first when I open a new question.</p>\n","OwnerUserId":"34561","LastActivityDate":"2014-12-11T19:28:32.183","CommentCount":"0"},{"Id":"2310","PostTypeId":"1","CreationDate":"2014-12-13T18:28:38.923","Score":"4","ViewCount":"40","Body":"<p>I was attempting to upload a picture to add <a href=\"https://apple.stackexchange.com/questions/161701/how-can-i-force-or-an-application-to-be-launched-to-the-2nd-monitor\">to my question here</a> but I kept getting this message box (which I've never seen before across StackExchange):</p>\n\n<p><img src=\"https://i.stack.imgur.com/Pmi18.png\" alt=\"enter image description here\"></p>\n\n<p>Which, after clicking OK, lead to this page, which I've also never seen on StackExchange.</p>\n\n<p><img src=\"https://i.stack.imgur.com/9pbQI.png\" alt=\"enter image description here\"></p>\n\n<p>Now clearly, I'd like to add pictures to my question.  And I can tell that the error message says its not my fault, but...</p>\n\n<p>What is \"framing\"?  I've never heard that and had no idea my pictures had this.  Is there an easy way I can remove the framing from my pictures before attempting to upload them so that StackExchange doesn't crash when attempting to do it?</p>\n\n<p>For what it's worth, the picture is one of two images created when I did a Cmd+Shift+3 screenshot on a dual-monitor setup.</p>\n","OwnerUserId":"102178","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-12-14T15:49:46.250","Title":"Error trying to upload a picture","Tags":"<bug><questions><editing>","AnswerCount":"1","CommentCount":"1","FavoriteCount":"1"},{"Id":"2311","PostTypeId":"2","ParentId":"2310","CreationDate":"2014-12-14T15:49:46.250","Score":"1","Body":"<p>The maximum image size you can upload is 2 MB. If you try to upload an image greater than this size, you receive this error.</p>\n\n<p>Framing is regarding the error message that Imgur provides, not the image itself. Stack Exchange does not allow framing in general and Imgur trying to do this will cause this error.</p>\n","OwnerUserId":"37797","LastActivityDate":"2014-12-14T15:49:46.250","CommentCount":"1"},{"Id":"2312","PostTypeId":"1","CreationDate":"2014-12-16T19:41:54.553","Score":"1","ViewCount":"105","Body":"<p>What is the recommended practice to avoid or eliminate been bullied by another user that seems to have a OCD problem.</p>\n\n<p>Clearly that user is targeting me, and even commenting to my comments with negative replies.</p>\n\n<p>In order to preserve privacy, I will not publish numerous instance and examples of been bullied.</p>\n\n<p>What are my choices other than Flagging it constantly.</p>\n\n<p>Is there a corrective action moderators can do to stop this?</p>\n","OwnerDisplayName":"user105029","LastActivityDate":"2014-12-16T22:10:00.730","Title":"Bullied by another user","Tags":"<discussion>","AnswerCount":"2","CommentCount":"1"},{"Id":"2313","PostTypeId":"2","ParentId":"2312","CreationDate":"2014-12-16T20:09:00.367","Score":"3","Body":"<p>We take flags quite seriously but given the distributed nature of the mod team it may take some days to detect bigger flagging patterns if different mods handle flags during the day. So for the moment just keep flagging what bothers you.</p>\n\n<p>OTOH we are looking into some issues with one user targeting a specific other user with down votes. As you are posting anonymously it's not clear whether you are referring to this situation but if you are, please flag either the question above or my answer and leave a comment giving us some more details.</p>\n","OwnerUserId":"9058","LastActivityDate":"2014-12-16T20:09:00.367","CommentCount":"0"},{"Id":"2314","PostTypeId":"2","ParentId":"2312","CreationDate":"2014-12-16T22:10:00.730","Score":"4","Body":"<p>Bullying is not tolerated. However, please don't confuse a strong opinion against an idea or a post with a negative comment about you personally.</p>\n\n<p>Assuming there is something where a user isn't following the site guidelines, flagging is the quickest way to get it looked at. Could you edit your post to at list the date/time of flags you raised and what count of flags you believe to be a part of this bullying. I'm sure all the moderators here are willing and interested to ensure no bad behavior is swept under any rug so to speak.</p>\n\n<p>Help us help you by being clear in your flag - choose other and explain in a little detail what the problem is. Cheers and thanks for your assistance.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-12-16T22:10:00.730","CommentCount":"0"},{"Id":"2315","PostTypeId":"1","CreationDate":"2014-12-24T16:08:09.663","Score":"1","ViewCount":"78","Body":"<p>I want to share a list of iOS apps that allow customizing font sizes:</p>\n\n<ul>\n<li>either through support of DynamicType / LargerText system settings</li>\n<li>or have their own settings for font size</li>\n</ul>\n\n<p>(similar to <a href=\"https://apple.stackexchange.com/questions/27897/making-fonts-larger-in-apps-under-lion/\">\"How to make text appear larger in various apps in OS X\"</a>)</p>\n\n<p>I would absolutely welcome others to contribute to the list.</p>\n\n<hr>\n\n<p>What is the best way to do that?</p>\n\n<ol>\n<li><p>Add a table to <a href=\"https://apple.stackexchange.com/a/163399/54644\">the original question</a> where it is very relevant (but not asked for directly), and adds much specifics to general statements like \"some support, other don't; some are larger, others are the same\"</p></li>\n<li><p>Post a separate question, similar to \"How to make text appear larger in various apps in OS X\"--which is definitely better and easier for others to contribute and reuse</p></li>\n</ol>\n\n<hr>\n\n<p>Should I definitely mark the question (and/or my answer) as a \"community wiki\"; how do I decide?</p>\n","OwnerUserId":"54644","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-03-26T19:31:29.873","Title":"Listing iOS apps supporting DynamicType: OK? How?","Tags":"<discussion>","AnswerCount":"2","CommentCount":"6"},{"Id":"2316","PostTypeId":"2","ParentId":"2294","CreationDate":"2014-12-24T21:15:33.580","Score":"0","Body":"<p>This questions either should go games.stackexchange or elsewhere. They are not about features of OS X, iOS or Game Center. They are about specific of game, mostly according to saving progress.</p>\n\n<p>And on the side note I was off the think different for a while and I see we have pretty much low quality questions now. I might say we are flooded with them. Was it that it you have to get some points before asking a question before? </p>\n","OwnerUserId":"11297","LastActivityDate":"2014-12-24T21:15:33.580","CommentCount":"1"},{"Id":"2317","PostTypeId":"2","ParentId":"2315","CreationDate":"2014-12-24T23:54:44.727","Score":"0","Body":"<p>So, to sum up my thoughts from the conversation above: post it. If it's good, the community will vote it up, if they disagree, they'll vote it down. I agree you should do it as CW, organized like that other CW Q&amp;A you linked to.</p>\n","OwnerUserId":"292","LastActivityDate":"2014-12-24T23:54:44.727","CommentCount":"3"},{"Id":"2318","PostTypeId":"1","CreationDate":"2015-01-01T03:27:50.487","Score":"7","ViewCount":"271","Body":"<p>The dawn of a new year, 2015, now approaches, or has already approached, either way it means that it is now time to reset our Community Promotion Ads!</p>\n\n<h3>What are Community Promotion Ads?</h3>\n\n<p>Community Promotion Ads are community-vetted advertisements that will show up on the main site, in the right sidebar. The purpose of this question is the vetting process. Images of the advertisements are provided, and community voting will enable the advertisements to be shown.</p>\n\n<h3>Why do we have Community Promotion Ads?</h3>\n\n<p>This is a method for the community to control what gets promoted to visitors on the site. For example, you might promote the following things:</p>\n\n<ul>\n<li>interesting apple related open source apps</li>\n<li>the site's twitter account</li>\n<li>script packs or power tools</li>\n<li>cool events or conferences</li>\n<li>anything else your community would genuinely be interested in</li>\n</ul>\n\n<p>The goal is for future visitors to find out about <em>the stuff your community deems important</em>. This also serves as a way to promote information and resources that are <em>relevant to your own community's interests</em>, both for those already in the community and those yet to join. </p>\n\n<h3>Why do we reset the ads every year?</h3>\n\n<p>Some services will maintain usefulness over the years, while other things will wane to allow for new faces to show up. Resetting the ads every year helps accommodate this, and allows old ads that have served their purpose to be cycled out for fresher ads for newer things. This helps keep the material in the ads relevant to not just the subject matter of the community, but to the current status of the community. We reset the ads once a year, every December.</p>\n\n<p>The community promotion ads have no restrictions against reposting an ad from a previous cycle. If a particular service or ad is very valuable to the community and will continue to be so, it is a good idea to repost it. It may be helpful to give it a new face in the process, so as to prevent the imagery of the ad from getting stale after a year of exposure.</p>\n\n<h3>How does it work?</h3>\n\n<p>The answers you post to this question <em>must</em> conform to the following rules, or they will be ignored. </p>\n\n<ol>\n<li><p>All answers should be in the exact form of:</p>\n\n<pre><code>[![Tagline to show on mouseover][1]][2]\n\n   [1]: http://image-url\n   [2]: http://clickthrough-url \n</code></pre>\n\n<p>Please <strong>do not add anything else to the body of the post</strong>. If you want to discuss something, do it in the comments.</p></li>\n<li><p>The question must always be tagged with the magic <a href=\"/questions/tagged/community-ads\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;community-ads&#39;\" rel=\"tag\">community-ads</a> tag. In addition to enabling the functionality of the advertisements, this tag also pre-fills the answer form with the above required form.</p></li>\n</ol>\n\n<h3>Image requirements</h3>\n\n<ul>\n<li>The image that you create must be <strong>220 x 250 pixels</strong></li>\n<li>Must be hosted through our standard image uploader (imgur)</li>\n<li>Must be GIF or PNG</li>\n<li>No animated GIFs</li>\n<li>Absolute limit on file size of 150 KB</li>\n</ul>\n\n<h3>Score Threshold</h3>\n\n<p>There is a <strong>minimum score threshold</strong> an answer must meet (currently <strong>6</strong>) before it will be shown on the main site.</p>\n\n<p>You can check out the ads that have met the threshold with basic click stats <a href=\"https://apple.meta.stackexchange.com/ads/display/2318\">here</a>.</p>\n","OwnerUserId":"8994","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.967","LastActivityDate":"2015-05-26T02:22:24.813","Title":"Community Promotion Ads - 2015","Tags":"<discussion><community-ads>","AnswerCount":"4","CommentCount":"4","FavoriteCount":"1","CommunityOwnedDate":"2015-01-01T03:27:50.487"},{"Id":"2319","PostTypeId":"2","ParentId":"2318","CreationDate":"2015-01-01T03:27:50.487","Score":"4","Body":"<p><a href=\"http://twitter.com/askdifferent\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/4keeW.png\" alt=\"Follow us on Twitter\"></a></p>\n","OwnerUserId":"8994","LastEditorUserId":"8994","LastEditDate":"2015-05-26T02:22:24.813","LastActivityDate":"2015-05-26T02:22:24.813","CommentCount":"1","CommunityOwnedDate":"2015-01-01T03:27:50.487"},{"Id":"2320","PostTypeId":"2","ParentId":"2318","CreationDate":"2015-01-01T16:11:10.250","Score":"11","Body":"<p><a href=\"https://apple.stackexchange.com/?tab=featured\">Current Ask Different bounties http://stack-exchange-dynamic-ads.herokuapp.com/apple.stackexchange.com/bounty.png</a></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-01-01T16:11:10.250","CommentCount":"1","CommunityOwnedDate":"2015-01-01T16:11:10.250"},{"Id":"2322","PostTypeId":"1","CreationDate":"2015-01-10T13:44:24.300","Score":"3","ViewCount":"53","Body":"<p>I see that there are some users who left bad comments in the question when they do not understand what the OP wants to ask.<br>\nI hope that the moderators can warn them not to do it again because what they did will discourage the OP from asking new questions.</p>\n","OwnerUserId":"109099","OwnerDisplayName":"kitty","LastEditorUserId":"37797","LastEditDate":"2015-01-10T14:39:19.117","LastActivityDate":"2015-01-10T14:39:19.117","Title":"Is it possible to warn the users who left bad comments other than trying to help in a question?","Tags":"<support><flagging><comments>","AnswerCount":"1","CommentCount":"1"},{"Id":"2323","PostTypeId":"2","ParentId":"2322","CreationDate":"2015-01-10T14:00:19.923","Score":"5","Body":"<p>If you believe a comment is rude or offensive, you can flag it.</p>\n\n<p>Hover over the comment and click the Flag <sub><sub><img src=\"https://i.stack.imgur.com/yDKEr.png\" width=\"20\"></sub></sub> button to the left of the comment, then select an option and click Flag Comment. A ♦︎ moderator will review the flag and delete/edit the comment as they see appropriate, or if a sufficient number of users flag the comment, it will be deleted automatically.</p>\n\n<p>                              <img src=\"https://i.stack.imgur.com/Vn7Wb.png\" width=\"365\"></p>\n\n<p>If you see persistent rude/offensive comments from a user, flag one of the comments and use the 'other' reason, providing further details. If you wish a moderator to have the ability to comment back on your flag, flag one of the user's posts instead making sure to reference the appropriate comments.</p>\n\n<p>For more information on flagging, see <a href=\"https://apple.stackexchange.com/help/privileges/flag-posts\">Privileges - flag posts - Ask Different</a>.</p>\n","OwnerUserId":"37797","OwnerDisplayName":"grgarside","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-01-10T14:06:40.750","CommentCount":"0"},{"Id":"2324","PostTypeId":"1","CreationDate":"2015-01-10T21:12:54.560","Score":"10","ViewCount":"230","Body":"<p>I noticed that (un)accepts...</p>\n\n<p><img src=\"https://i.stack.imgur.com/mHGvZ.png\" alt=\"\"></p>\n\n<p>...and bounties...</p>\n\n<p><img src=\"https://i.stack.imgur.com/WPQjp.png\" alt=\"\"></p>\n\n<p>are red there. Why are all the rep received from bonuses RED?! </p>\n\n<p>I understand unaccepts - they give negative rep gain and therefore logically made red (on any SE site).</p>\n\n<p>But why do accepts have a red background? It should be green, that's the wonderful color which is used for accepts everywhere on SE. Also bounties: why red again? Why not blue, the known color of bounties?</p>\n","OwnerUserId":"78980","LastEditorUserId":"70930","LastEditDate":"2015-01-13T20:40:48.743","LastActivityDate":"2015-01-13T20:40:48.743","Title":"Why are the positive bonus rep red in the reputation tab?","Tags":"<discussion><feature-request><design><reputation>","AnswerCount":"1","CommentCount":"1","ClosedDate":"2015-03-10T13:30:06.113"},{"Id":"2325","PostTypeId":"2","ParentId":"2324","CreationDate":"2015-01-11T10:24:53.330","Score":"3","Body":"<p>Red, or #ab2020, is the accent colour used throughout this site for highlighting.</p>\n\n<ul>\n<li>.review-indicator span</li>\n<li>h3 a:hover</li>\n<li>.bounty-indicator</li>\n<li>.bounty-indicator-tab</li>\n<li>.bounty-award</li>\n<li>.bounty-vote-off</li>\n</ul>\n\n<p>Ask Different isn't the only site to use red (or a shade of red) for this.<br>\nFor example, <a href=\"https://gaming.stackexchange.com/?tab=featured\">Arqade uses red for bounties</a> and Webmasters uses orange (these were just the first two graduated sites I tried).</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:09:35.837","LastActivityDate":"2015-01-11T10:24:53.330","CommentCount":"0"},{"Id":"2327","PostTypeId":"1","CreationDate":"2015-01-17T08:00:12.633","Score":"7","ViewCount":"189","Body":"<p>So, I’m an active member on a few of the Stack Exchange sites. No so much here, but I did as one question here that has received 10,000+ views but I consider a “White Elephant” due to many factors:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/107051/ios-7-syncing-headaches-itunes-11\">iOS 7 Syncing Headaches (iTunes 11)</a></li>\n</ul>\n\n<p>I initially posted this in frustration and hope that somehow there was a clear and sane way of dealing with—what I consider—Apple’s sloppy implementation of iOS/iTunes syncing since iOS7 hit and the iCloud became the new “sync service.”</p>\n\n<p>Now if you read the post, please realize how I feel about it—and the related question—right now: I believe the question is utterly useless since 1+ year later the problem still exists, cannot be easily replicated, cannot be easily solved and is frustrating Apple iOS users all over.</p>\n\n<p>I did stumble across a recent discovery <a href=\"http://www.mcelhearn.com/one-possible-explanation-for-some-itunes-sync-problems/\" rel=\"nofollow noreferrer\">related to Wi-Fi sync failing on this site</a>:</p>\n\n<blockquote>\n  <p>One issue that has been discussed on Apple’s support forums seems to\n  be caused by some incorrect handling of network activity by OS X. It\n  seems that iTunes – or, more correctly, the usbmuxd process that\n  handles connections between a Mac and and iOS device – has some\n  problems. This process opens network connections to the iOS device in\n  order to communicate with it. It opens two connections, one using IPv4\n  and another with IPv6, over TCP, to port 62078. If you run a command\n  in Terminal, you can see how many connections are open.</p>\n</blockquote>\n\n<p>Wonderful! Someone made some progress! But still, it’s only really of concern for those who use Wi-Fi sync and not “tethered” sync. And the problem is not solved.</p>\n\n<p>So personally, I believe my original question and answer thread—which barely exists—should be deleted. But how should a new question be written/framed? Should it simply be: <i>iOS and iTunes Syncing Issues Since iOS7 and OS X Sync Services Removed</i> or something else?</p>\n\n<p>This is massively frustrating to me since I cannot help but feel that with 10,000+ views there are others struggling with this issue. But with no clear hope in site—and nobody else really chiming in on the thread—what can be done?</p>\n\n<p>The question feels like a freak show. A “White Elephant” that’s interesting to look at but nobody knows what to do with it. And no real clues seem to be on the horizon.</p>\n","OwnerUserId":"40457","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-01-17T11:46:14.790","Title":"My iOS syncing headaches is a “White Elephant.” Can anything be done to reframe the question?","Tags":"<discussion><support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2328","PostTypeId":"2","ParentId":"2327","CreationDate":"2015-01-17T11:46:14.790","Score":"10","Body":"<p>Questions shouldn't be deleted just because they haven't received an answer. Despite everything, an answer may still be found in the future and deleting the question doesn't help anyone as the original research is lost. Moving the research to a new question defeats the purpose and the original question may as well remain if this occurs.</p>\n\n<p>Bounties are the main way attention is drawn to a question. Ask Different has very few active bounties running at any one time which means that bounties can be quite effective at attracting attention.</p>\n\n<p>There's a silver <img src=\"https://i.stack.imgur.com/k1rAt.png\" width=\"8\"> <a href=\"https://apple.stackexchange.com/help/badges/44/necromancer\">Necromancer</a> badge to be had for users who answer questions like this, so there's still a incentive to research and answer such questions.</p>\n\n<p>I don't think the question needs to be <em>reframed</em> as such, but providing an update with the latest information might be beneficial. Furthermore, a bounty will attract attention and may get the question seen by someone who has some crucial information in resolving the problem.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-01-17T11:46:14.790","CommentCount":"2"},{"Id":"2329","PostTypeId":"1","AcceptedAnswerId":"2330","CreationDate":"2015-01-23T18:30:40.580","Score":"-4","ViewCount":"46","Body":"<p>If I flag a Moderator comment (as not constructive), does it get reviewed by another (independent) moderator or can the flagged moderator just delete/ignore it.</p>\n\n<p>Just interested in the process here, since none of us is perfect and can make mistakes.</p>\n\n<p>Here is a example (removed moderator name for privacy).</p>\n\n<p><img src=\"https://i.stack.imgur.com/9RgYO.png\" alt=\"flag moderator\"></p>\n","OwnerUserId":"46541","LastActivityDate":"2015-01-23T18:38:12.697","Title":"Process for Flaging a Moderator comment","Tags":"<discussion><flagging><moderators><moderation>","AnswerCount":"1","CommentCount":"0"},{"Id":"2330","PostTypeId":"2","ParentId":"2329","CreationDate":"2015-01-23T18:38:12.697","Score":"7","Body":"<p>They'll show up in the comment queue and all moderators will see the flag. The system doesn't hide the flag from the moderator who's comment was flagged. We discuss flags on our own comments and avoid moderating ourselves.</p>\n","OwnerUserId":"292","LastActivityDate":"2015-01-23T18:38:12.697","CommentCount":"3"},{"Id":"2331","PostTypeId":"1","CreationDate":"2015-01-24T20:13:48.760","Score":"4","ViewCount":"19","Body":"<p>In edit review I got this.</p>\n\n<p><img src=\"https://i.stack.imgur.com/XJgaY.png\" alt=\"enter image description here\"></p>\n\n<p>Clearly a vandalism. It is always by Anonymous user. What sense does it make to allow anonymous to edit? Do we have any insightful edit by those?</p>\n","OwnerUserId":"11297","LastActivityDate":"2015-01-24T20:19:36.183","Title":"Edits by anonymous users?","Tags":"<feature-request><suggested-edits><spam>","AnswerCount":"1","CommentCount":"0"},{"Id":"2332","PostTypeId":"2","ParentId":"2331","CreationDate":"2015-01-24T20:19:36.183","Score":"5","Body":"<p>Yes - There have been many anonymous edits that are very high quality. Often it's someone who knows their stuff and doesn't want to log in on a strange computer or possibly compromised network but also wants to fix something that's really wrong.</p>\n\n<p>You are certainly correct that the majority of simple edits are bad and should be reviewed and rejected. I probably see more spam edits by \"named\" users than anonymous users, but the system to automatically catch and reduce these is getting much better hence the uptick in edits to spam as opposed to posting spam.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-01-24T20:19:36.183","CommentCount":"0"},{"Id":"2333","PostTypeId":"1","CreationDate":"2015-01-24T22:42:42.067","Score":"0","ViewCount":"24","Body":"<p>I was writing a question on <em><a href=\"http://apple.stackexchange.com\">apple.stackexchange.com</a></em>. I saw the little “draft saved”. I went away, then I went back to the page.</p>\n\n<p>I found my draft question, with even the tags, but the title was empty.</p>\n\n<p>Here just now I reproduce the bug.</p>\n\n<p>I have Safari on iOS 7 on an iPad mini.</p>\n\n<p>It would be nice to fix this bug. Thank you !</p>\n","OwnerUserId":"38177","LastActivityDate":"2015-01-24T22:42:42.067","Title":"Draft forgets title of question","Tags":"<bug><questions><asking-questions>","AnswerCount":"0","CommentCount":"1","FavoriteCount":"1"},{"Id":"2334","PostTypeId":"1","CreationDate":"2015-01-25T16:12:52.510","Score":"1","ViewCount":"49","Body":"<p>I am authenticating on the site <em><a href=\"http://apple.stackexchange.com\">Ask Different</a></em>. I am entering my password. </p>\n\n<ol>\n<li>When I press Shift, the site says \"Caps Lock is on\". This is incorrect. </li>\n<li>When Shift is released, the site still says \"Caps Lock is on\". This is even more incorrect.</li>\n</ol>\n\n<p>I have Safari on iOS 7 on an iPad mini.</p>\n\n<p>It would be nice to fix that. Thank you.</p>\n","OwnerUserId":"38177","LastActivityDate":"2015-01-25T16:12:52.510","Title":"Incorrect message \"Caps Lock is on\" when entering password","Tags":"<bug>","AnswerCount":"0","CommentCount":"1","FavoriteCount":"1"},{"Id":"2335","PostTypeId":"2","ParentId":"2315","CreationDate":"2015-01-25T18:31:05.160","Score":"1","Body":"<p>When I created <a href=\"https://apple.stackexchange.com/questions/27897/making-fonts-larger-in-apps-under-lion/\">Making fonts larger in apps under Lion</a>, it was partly to learn the answer and partly to try the sort of question that I hoped Community Wiki would work well for. I don't think it was a disaster, but it didn't turn out as great as I'd hoped it would. Maybe your question would take off in that format; if it can, I hope it does. I'd recommend trying, but I'm not overly hopeful it will get a great response. I'd recommend a separate question.</p>\n","OwnerUserId":"9388","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-01-25T18:31:05.160","CommentCount":"1"},{"Id":"2336","PostTypeId":"2","ParentId":"2318","CreationDate":"2015-01-27T07:42:17.683","Score":"-4","Body":"<p><a href=\"http://CmisSync.com\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/WOjZC.png\" alt=\"CmisSync: Dropbox-like desktop synchronization for Alfresco, SharePoint, FileNet, and any CMIS-compatible document management server\"></a></p>\n","OwnerUserId":"22061","LastActivityDate":"2015-01-27T07:42:17.683","CommentCount":"1","CommunityOwnedDate":"2015-01-27T07:42:17.683"},{"Id":"2337","PostTypeId":"2","ParentId":"2318","CreationDate":"2015-01-27T10:29:07.450","Score":"5","Body":"<p><a href=\"https://softwarerecs.stackexchange.com/\"><img src=\"https://i.stack.imgur.com/f7KtY.png\" alt=\"Software Recommendations\"></a></p>\n","OwnerUserId":"22061","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:50:01.460","LastActivityDate":"2015-01-27T10:34:40.520","CommentCount":"0","CommunityOwnedDate":"2015-01-27T10:29:07.450"},{"Id":"2338","PostTypeId":"1","CreationDate":"2015-01-27T14:44:02.853","Score":"3","ViewCount":"42","Body":"<p>Just noticed that a question I posted on Ask Different <a href=\"https://apple.stackexchange.com/questions/169136/sort-contacts-marked-as-company\">HERE</a> was ripped off at <a href=\"http://osquestions.com/osx-ios/169136/sort-contacts-marked-as-company\" rel=\"nofollow noreferrer\">osquestions.com found here</a>.  Is this site affiliated with the SE sites or just an RSS grabbing knock off with a ton of SPAM ads?</p>\n\n<p>So, it appears they do \"reference\" the source at the bottom of the page, however the link back adds a \"nyud.net\" into the core domain which is probably a hook for them.  So not a true reference back.</p>\n\n<p><img src=\"https://i.stack.imgur.com/7PYC6.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"108753","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-01-27T14:59:16.507","Title":"What is http://osquestions.com/?","Tags":"<discussion><support>","AnswerCount":"1","CommentCount":"3","FavoriteCount":"1"},{"Id":"2339","PostTypeId":"2","ParentId":"2338","CreationDate":"2015-01-27T14:56:45.147","Score":"2","Body":"<p>The content on this site is licensed wih a Creative Commons license with attribution required, meaning that other sites ARE allowed to take content from this site, but they are required to say they got it from here. This site doesn't appear to do that. I tagged your question with the support tag so SE employees will see this to take appropriate action.</p>\n","OwnerUserId":"9388","LastActivityDate":"2015-01-27T14:56:45.147","CommentCount":"1"},{"Id":"2341","PostTypeId":"1","CreationDate":"2015-01-28T19:00:08.737","Score":"0","ViewCount":"40","Body":"<p><a href=\"https://apple.stackexchange.com/q/153589/83288\">Trying to get Hadoop to work; &quot;connection refused&quot; in Hadoop and in Telnet</a></p>\n\n<p>This question just passed 1,000 views today. I understand how \"tumbleweed questions\" work (I have the badge on several sites), and that's what I <em>thought</em> my question was. But unless these views came all at once from some automated source, this question is not a tumbleweed.</p>\n\n<p>So what's up with this question? Is it on the wrong StackExchange site? It has one non-answer, and the user never responded to my comment asking for clarification.</p>\n","OwnerUserId":"83288","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-01-28T22:08:19.477","Title":"My question has 1,000 views, no upvotes, and one non-answer. What's up with it?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"2342","PostTypeId":"2","ParentId":"2341","CreationDate":"2015-01-28T22:08:19.477","Score":"3","Body":"<p>I would flag it for migration to StackOverflow or even ServerFault. Your question deals more with Hadoop than it does with OS X and Hadoop is way out of scope for this site. There are very little developer service experts viewing questions here.</p>\n\n<p>To your voting question: we suffer from poor voting participation on this site. It's a long-standing issue we've been trying to solve by promoting voting behaviour and such through commenting on posts and in the chat channel. But we deal with higher number of \"passerby\" type users here because of our subject nature. Casual computer users are more common here than on a site like StackOverflow or ServerFault.</p>\n\n<p>As for visibility: you can always attach a bounty to the question to make it more visible. I find letting people know about it in the chat channel can help too. Though even the chat channel isn't as active as it is some place like StackOverflow.</p>\n","OwnerUserId":"292","LastActivityDate":"2015-01-28T22:08:19.477","CommentCount":"1"},{"Id":"2343","PostTypeId":"1","CreationDate":"2015-01-31T00:05:34.233","Score":"3","ViewCount":"65","Body":"<p>Although I'm pretty liberal about most things, a new user, <a href=\"https://apple.stackexchange.com/users/111822/rectumrectifier\">rectumrectifier</a>, has a name which is a little childish, if not mildly pornographic.</p>\n\n<p>How is this approached by the admins on AskDifferent? Is there a standard for usernames?</p>\n","OwnerUserId":"22824","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-01-31T11:02:56.470","Title":"Somewhat inappropriate|distasteful user name - what can be done?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"2","FavoriteCount":"2"},{"Id":"2344","PostTypeId":"2","ParentId":"2343","CreationDate":"2015-01-31T11:02:56.470","Score":"2","Body":"<p>If you find that something about a user is offensive or inappropriate outside of any particular post, flag any post from that user with a custom flag.</p>\n\n<p>There is more leeway with what is allowed in the <a href=\"https://stackoverflow.com/users/52443/welbog\">About Me section</a> of a user's profile as this requires a click-through, however avatars and names are subject to removal if deemed inappropriate.</p>\n\n<p><sup>Related on Meta.SE: <a href=\"https://meta.stackexchange.com/questions/147519/inappropriate-username-and-or-gravatars\">Inappropriate username and/or gravatars.</a></sup></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-05-23T11:33:34.410","LastActivityDate":"2015-01-31T11:02:56.470","CommentCount":"0"},{"Id":"2345","PostTypeId":"1","AcceptedAnswerId":"2347","CreationDate":"2015-02-04T12:28:54.507","Score":"3","ViewCount":"70","Body":"<p>I just went through my flags and saw that some were declined with the following reason:</p>\n\n<blockquote>\n  <p>flags should only be used to make moderators aware of content that requires their intervention</p>\n</blockquote>\n\n<p>For example: <a href=\"https://apple.stackexchange.com/questions/141591/ios-create-un-resettable-and-undeletable-app\">these</a> <a href=\"https://apple.stackexchange.com/questions/128623/circuit-simulator-tool-for-os-x\">two</a> questions were flagged as low quality and migratable respectively. These actions require mod intervention, but the flags were declined with the above reason.</p>\n\n<p>So: why shouldn't I have flagged these type of questions?</p>\n","OwnerUserId":"24324","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-09-18T10:45:26.570","Title":"When not to flag?","Tags":"<discussion><flagging>","AnswerCount":"3","CommentCount":"3","FavoriteCount":"1"},{"Id":"2346","PostTypeId":"1","AcceptedAnswerId":"2349","CreationDate":"2015-02-04T15:09:01.590","Score":"1","ViewCount":"36","Body":"<p>Does that mean I already raised it on this particular post but forgot, or that I've used up my day's ration of this type of flag?<br>\n… or something else?</p>\n\n<p>I've seen it twice today, but wasn't paying close enough attention to what may have caused it. I certainly didn't think I'd raised enough flags for the system to limit me.</p>\n","OwnerUserId":"85275","LastEditorUserId":"37797","LastEditDate":"2015-02-04T20:34:12.590","LastActivityDate":"2015-02-04T20:34:12.590","Title":"\"you have already raised this type of flag\"","Tags":"<support><flagging>","AnswerCount":"2","CommentCount":"1"},{"Id":"2347","PostTypeId":"2","ParentId":"2345","CreationDate":"2015-02-04T15:18:29.950","Score":"6","Body":"<p>In a nutshell, just because a flag was declined doesn't mean at all you shouldn't have raised them. I'll try to break down how I see things:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/141591/ios-create-un-resettable-and-undeletable-app\">https://apple.stackexchange.com/questions/141591/ios-create-un-resettable-and-undeletable-app</a></li>\n</ul>\n\n<p>I wouldn't flag it as low quality (which is what it looks like you chose). It's too broad / unclear - there's clearly something that would be on-topic. Unless there was a pattern of bad questions or spammy activity - I'd probably put it on hold instead of insta-deleting, but I didn't dig deeply into that user to see if/why it was handled for deletion.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/128623/circuit-simulator-tool-for-os-x\">Circuit simulator tool for OS X?</a></li>\n</ul>\n\n<p>This was flagged as other asking for migration. That flag should be declined since we cannot migrate anything more than a few months old. Even then, it's perfectly fine here.</p>\n\n<hr>\n\n<p>Apart from the specifics, here are things to consider in general when moderators handle flags. A problem arises when there are multiple flags on the same post. Sometimes a moderator has to choose the lesser of two evils and decline all flags if most of them are wrong. Also - sometimes I mis-click and decline a flag that should have been approved. I don't know if that happened, but if you end up with a dozen declines amongst 100 flags - I wouldn't worry. If you get 50% flags declined, then absolutely ask here for explanation, help, etc...</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-02-04T15:18:29.950","CommentCount":"0"},{"Id":"2348","PostTypeId":"2","ParentId":"2346","CreationDate":"2015-02-04T15:21:13.763","Score":"1","Body":"<p>Without details, I would trust that you actually flagged that specific post already.</p>\n\n<p>The message for \"go away\" due to no flags left is different.</p>\n\n<p>However, if the code burps, you could get these when the conditions are not present. Hard to say for sure unless it continues.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-02-04T15:21:13.763","CommentCount":"1"},{"Id":"2349","PostTypeId":"2","ParentId":"2346","CreationDate":"2015-02-04T20:33:21.757","Score":"1","Body":"<p>This was a bug. Generally, the error message is meant to show if you've flagged the post before, but a bug caused this to break. <a href=\"https://meta.stackexchange.com/a/248107/222623\">This is now fixed.</a></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-02-04T20:33:21.757","CommentCount":"1"},{"Id":"2350","PostTypeId":"1","CreationDate":"2015-02-05T04:24:26.660","Score":"-3","ViewCount":"38","Body":"<p>I have a problem how to handle the 99% new users with questions how to crack a password, or AppleID, in some cases forgotten recovery email, or claiming the email is no longer in use.</p>\n\n<p>The questions vary from system log in password, iPhone, iCloud, Firmware password an so on.</p>\n\n<p>Since there is no way to verify it is the rightful owner, I hesitate to provide information.</p>\n\n<p>Should one use \"Close\" or \"Flag\" or am I just paranoid, or should I try to help how to.</p>\n","OwnerUserId":"46541","LastEditorUserId":"9058","LastEditDate":"2015-02-05T08:56:19.993","LastActivityDate":"2015-02-05T09:03:40.970","Title":"How should I handle questions about forgotten credentials","Tags":"<discussion><flagging><closed-questions><moderators>","AnswerCount":"1","CommentCount":"0"},{"Id":"2351","PostTypeId":"2","ParentId":"2345","CreationDate":"2015-02-05T04:31:43.947","Score":"4","Body":"<p>When it comes to migration, our policy in the past here has been only to migrate if the poster requested it. If the post were off-topic here, we close. If the post is on-topic here, we leave it here unless the poster requests sending it somewhere else. So a migration flag from someone other than the OP would be declined. We've had pretty heavy moderator turnover since that policy was explained to me, so I don't know it that is current practice by all current mods, but that's what I was taught, and thus why I declined the flag in question.</p>\n","OwnerUserId":"9388","LastEditorUserId":"9388","LastEditDate":"2015-09-18T10:45:26.570","LastActivityDate":"2015-09-18T10:45:26.570","CommentCount":"0"},{"Id":"2352","PostTypeId":"2","ParentId":"2350","CreationDate":"2015-02-05T09:03:40.970","Score":"3","Body":"<p>There are a lot of reasons why people loose access to their computers, most of them are legitimate. So unless there is a clear indication that something is amiss, these questions are perfectly on-topic and can be answered, often easily by referring the user to the appropriate Apple Support pages or by finding the duplicate question which already has been answered before.</p>\n\n<p>Please keep in mind that we are not the police or so, so there is no way to verify the story/background of a question anyway. If in doubt, flag it and move on.</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-02-05T09:03:40.970","CommentCount":"1"},{"Id":"2353","PostTypeId":"2","ParentId":"2345","CreationDate":"2015-02-05T14:26:19.463","Score":"3","Body":"<p>Regarding \"low quality\" flags in general, there isn't very much a moderator can do which non-mod users can't do as well</p>\n\n<ul>\n<li>downvote</li>\n<li>leave a comment asking for clarification/improvements</li>\n<li>improve the post directly by editing it (<em>this is actually the preferred option</em>)</li>\n</ul>\n\n<p>That's why I tend to decline \"low quality\" flags from higher-rep users (with higher rep starting at the point where the user gets access to the review queue).</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-02-05T14:26:19.463","CommentCount":"1"},{"Id":"2354","PostTypeId":"1","CreationDate":"2015-02-05T18:01:01.180","Score":"5","ViewCount":"132","Body":"<p>I saw this on the review queue as a Vote to Close.</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/15549/how-can-i-get-a-me-com-e-mail-address\">How can I get a me.com e-mail address?</a></p>\n\n<p>I voted to leave open - I guess my prerogative as much as anyone else's, but it prompted me to actually Google it afresh &amp; I managed to add a definitive answer to it from Apple's KB.</p>\n\n<p>Now, I'm not looking for a pat on the back;-) but I feel this type of question ought to stay visible, Googleable for future users, as even though it can't be done any more, the info that it can no longer be done would in itself be useful.</p>\n\n<p>I'm never really sure on closed Questions, whether they 'mean less' to future searchers, because they were deemed, for whatever reason 'not worthy of remaining open'. That one in particular already has Protected status.<br>\nShould that not give it some leeway on closure?</p>\n\n<p><em>tbh, I'm not really sure I'm asking a question, here, or just wanting some high rep/mod input on how this type of 'old news' question should eventually pass down the line into obscurity.</em></p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-02-05T20:26:38.830","Title":"Vote to close? I disagree, comments?","Tags":"<discussion><closed-questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"2355","PostTypeId":"2","ParentId":"2354","CreationDate":"2015-02-05T18:57:33.443","Score":"3","Body":"<p>As you have a good answer with a cite of a reliable source then obviously the question is answerable even if the answer is no.</p>\n\n<p>I was the voter for closing mainly because with no definite answer it seemed to be opinion based and so not exact - which I agree is debatable. But in general with no answer I could not see how this question was of use. With an answer it it should stay. </p>\n\n<p>Note closed questions will be found on Google search so will still be visible - it requires deletion to remove them.</p>\n\n<p>I would note that this is an easy question to deal with here as the state is only affected by one day. Other old questions are more problematic as the correct answer changes many times over time.</p>\n","OwnerUserId":"237","LastEditorUserId":"237","LastEditDate":"2015-02-05T20:26:38.830","LastActivityDate":"2015-02-05T20:26:38.830","CommentCount":"3"},{"Id":"2356","PostTypeId":"1","AcceptedAnswerId":"2360","CreationDate":"2015-02-07T17:43:37.953","Score":"5","ViewCount":"47","Body":"<p>Seems that the only way to see how votes have my comments is going comment by comment and checking it. Is there a better way to display my comment's votes?</p>\n","OwnerUserId":"96174","LastEditorUserId":"37797","LastEditDate":"2015-02-08T10:58:00.070","LastActivityDate":"2015-02-08T10:58:00.070","Title":"Is there any way to display my comment votes?","Tags":"<support><voting><comments>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"2357","PostTypeId":"1","AcceptedAnswerId":"2359","CreationDate":"2015-02-07T18:08:08.910","Score":"3","ViewCount":"32","Body":"<p>An Ask Different user has a problem that I also had. I found a solution this morning and wanted to answer his question, but the question requires a 10 rep to answer. I have a six rep, so I can neither answer or comment on the question. I also looked for a way to message him, but found none. Is there a way to message him? Any ideas on how I can get this guy the solution to his problem?</p>\n","OwnerUserId":"97419","LastActivityDate":"2015-02-07T20:38:25.660","Title":"How can I get an answer to a user when I don't have enough rep to answer his question directly?","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2359","PostTypeId":"2","ParentId":"2357","CreationDate":"2015-02-07T20:38:25.660","Score":"3","Body":"<p>Post a link to the question. We can consider un-protecting it.</p>\n\n<p>Or better: earn the reputation to answer it. You're only four rep points away. That's easy enough to obtain answering one, unprotected question with a great answer. Or doing some suggested edits to some questions and answers. Or some voting.</p>\n\n<p>See <a href=\"https://apple.stackexchange.com/help/whats-reputation\">What is reputation? How do I earn it?</a> for some suggestions on how to break the 10 rep barrier.</p>\n\n<p>It's not arduous or time consuming.</p>\n","OwnerUserId":"292","LastActivityDate":"2015-02-07T20:38:25.660","CommentCount":"0"},{"Id":"2360","PostTypeId":"2","ParentId":"2356","CreationDate":"2015-02-08T10:57:48.000","Score":"4","Body":"<p>You can use the Data Explorer with the following query which shows how many comments of yours has a certain number of votes:</p>\n\n<ul>\n<li><a href=\"http://data.stackexchange.com/apple/query/947/my-comment-score-distribution?userid=96174\" rel=\"nofollow\">My Comment Score distribution (user 96174)</a></li>\n</ul>\n\n<p>There is a delay between the actual data and the Data Explorer's data dump. You can check when the Data Explorer was last updated using <a href=\"http://data.stackexchange.com/apple/query/205012/did-my-contribution-based-on-the-timestamp-made-it-into-sede\" rel=\"nofollow\">this query</a>.</p>\n\n<p>If you want a live list of your comments with comment score, you can use the API:</p>\n\n<ul>\n<li><a href=\"https://api.stackexchange.com/docs/me-comments\">api.stackexchange.com/me/comments</a></li>\n</ul>\n","OwnerUserId":"37797","LastActivityDate":"2015-02-08T10:57:48.000","CommentCount":"0"},{"Id":"2361","PostTypeId":"1","CreationDate":"2015-02-14T17:17:02.903","Score":"8","ViewCount":"200","Body":"<p>I recently made <a href=\"https://apple.stackexchange.com/revisions/171874/2\">an edit</a> to this answer:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/171863/apple-mail-keeps-crashing-frequently-after-ram-problem/171874#171874\">Apple Mail keeps crashing frequently after RAM problem</a></li>\n</ul>\n\n<p>I removed the code formatting from the text, except the shell commands as these are code.</p>\n\n<p>My edit was then <a href=\"https://apple.stackexchange.com/posts/171874/revisions\">reverted</a>. Given that I make hundreds of edits across SE of this type, and this is the first time I've had one reverted that I can recall, I do want to understand why this occurred given that no custom edit summary was provided.</p>\n\n<p>Code formatting misuse has been discussed <a href=\"https://apple.meta.stackexchange.com/questions/2197/markup-of-reserved-words/2199#2199\">here before</a>, yet nothing was said to the contrary at the time; of course, Meta.SE has many discussions on this topic which I linked to in the aforementioned answer.</p>\n\n<p>Why was my edit rolled back?</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-02-24T17:13:57.913","Title":"Why was my edit removing code formatting reverted?","Tags":"<discussion><editing><formatting>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"2362","PostTypeId":"2","ParentId":"2361","CreationDate":"2015-02-14T17:36:54.660","Score":"-4","Body":"<p>The edit was purely for formatting and IMO didn't make it significantly better. Secondly, the author of the post disagreed with the specific edit.</p>\n\n<p>That's two strikes, so a moderator rolled back the edit.</p>\n\n<hr>\n\n<p>Editing is one of the aspects that include multiple guidelines which are often at conflict. I get it's a pet peeve to \"mis use\" certain formatting items, but if you print the original answer out on paper, or look at it in any standard web browser - it's in no way unclear or unuseful.</p>\n\n<p>You are correct that standard formatting is asked for in [help] but there's also an aspect of allowing the original poster to have a little more weight in things that are style as opposed to substance in many cases.</p>\n\n<p>Guidelines:</p>\n\n<ol>\n<li>The OP used valid markdown - <a href=\"https://apple.stackexchange.com/help/formatting\">https://apple.stackexchange.com/help/formatting</a></li>\n</ol>\n\n<p><a href=\"https://apple.stackexchange.com/help/editing\">Editing Guidelines</a>:</p>\n\n<p>Edits are expected to be substantial and to leave the post better than you found it. Common reasons for edits include:</p>\n\n<ul>\n<li>To fix grammar and spelling mistakes</li>\n<li>To clarify the meaning of the post (without changing that meaning)</li>\n<li>To include additional information only found in comments, so all of the information relevant to the post is contained in one place</li>\n<li>To correct minor mistakes or add updates as the post ages</li>\n<li>To add related resources or hyperlinks</li>\n</ul>\n\n<p>Clearly, substantial is a <a href=\"https://www.youtube.com/watch?v=pWdd6_ZxX8c\" rel=\"nofollow noreferrer\">matter of opinion</a> in many cases. Basically, When I reviewed the post after you asked on meta, I saw George's edits as failing to meet any of these criteria. I understand many feel that using \"code blocks\" is a \"mistake\" however, when you point that out to the OP and they say they intentionally formatted it that way - we're not into opinion and judgement.</p>\n\n<p>If you wish to make a second answer with the formatting of your choice, that might be the best avenue if you really feel the post <strong>needs</strong> correcting and if you comment and the OP declines your help with the edit. In that case, the moderation will arrange a chat room for the editor and the OP to discuss things in hopes of coming to a mutual agreement. Only if that fails would a moderator step in and perhaps lock the post in one state.</p>\n\n<p>We're not there - we're just at the \"one edit was made and then rolled back\" stage.</p>\n\n<p>Thanks for all the comments and down votes - it's nice knowing that people really care about the small things. I ask that everyone keep \"the big picture\" in mind - the site exists to allow great answers. Why antagonize one poster with minutia like changing their emphasis style when nothing else is wrong with their answer and a ton of things are right with the answer.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-02-24T17:13:57.913","CommentCount":"11"},{"Id":"2363","PostTypeId":"1","CreationDate":"2015-02-18T13:22:29.610","Score":"-2","ViewCount":"31","Body":"<p>Jawa you can edit, can you help solve my problem please?</p>\n","OwnerUserId":"115166","OwnerDisplayName":"Shasta","LastActivityDate":"2015-02-18T13:28:41.757","Title":"Jaws help solve problems instead of just editing","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2364","PostTypeId":"2","ParentId":"2363","CreationDate":"2015-02-18T13:28:41.757","Score":"3","Body":"<p>Welcome to Stack Exchange and Ask Different.</p>\n\n<p>We are community edited and community supported, so some people will edit questions that need help or that they think need help.</p>\n\n<p>Your best bet is to edit your question after reading the [about] and [help] sections for the main site. Providing details on what specifically you tried, researching an Apple support article or a post on the internet and explaining precisely what you are struggling with while following those instructions is the best way to attract a good answer to your post.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-02-18T13:28:41.757","CommentCount":"0"},{"Id":"2365","PostTypeId":"2","ParentId":"2294","CreationDate":"2015-02-19T12:51:51.693","Score":"1","Body":"<p>IMHO, they should be migrated to <em>SE Arqade</em>. There are many CoC questions there, most of them platform agnostic. Unless there is a specific issue relating to Coc client on an Apple platform, iOS or OS X, (in which case <em>maybe</em> it should be on <em>SE Ask Different</em>) there sh9ould really be asked/migrated to Arqade.</p>\n","OwnerUserId":"100490","LastActivityDate":"2015-02-19T12:51:51.693","CommentCount":"0"},{"Id":"2366","PostTypeId":"1","CreationDate":"2015-02-19T15:03:35.693","Score":"5","ViewCount":"124","Body":"<p>We've had several questions where someone is asking for mailing and/or sharing of files. Here is the latest:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/173516/how-can-i-extract-the-mail-and-messages-icons-for-iphone-6-plus\">https://apple.stackexchange.com/questions/173516/how-can-i-extract-the-mail-and-messages-icons-for-iphone-6-plus</a></li>\n</ul>\n\n<p>Should we close these or can they be saved?</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-02-20T20:56:46.710","Title":"Should I close a question if someone is asking for mailing them files?","Tags":"<discussion><close-reasons>","AnswerCount":"2","CommentCount":"1"},{"Id":"2367","PostTypeId":"2","ParentId":"2366","CreationDate":"2015-02-19T18:54:44.607","Score":"0","Body":"<p>It depends :)</p>\n\n<p>This one I think not because we get into the issue of are these icons under copyright of the supplier (in this case Apple I think) and would they allow this. This needs to be thought out in general (for example macports provides binary downloads in many cases but depending on license it will only provide source in the cases.)</p>\n\n<p>In general on files etc I would say no as in effect the user is asking for a link only answer.</p>\n\n<p>If you can answer in a way such that the user can generate the files then that is OK</p>\n","OwnerUserId":"237","LastActivityDate":"2015-02-19T18:54:44.607","CommentCount":"1"},{"Id":"2368","PostTypeId":"2","ParentId":"2366","CreationDate":"2015-02-20T20:56:46.710","Score":"3","Body":"<p>There's two main categories that these questions fit that, whilst related, are substantially different and require different resolutions IMO:</p>\n\n<ul>\n<li><p>OS X</p>\n\n<p>For OS X, these types of question are more common as files can be deleted or overwritten accidentally or in an attempt to replace them with user-created content and then wish to revert to the original.</p>\n\n<p>With OS X, it is generally not necessary to upload the files for the user as they can extract the file from an install media or use the Recovery HD, as discussed in the canonical Q&amp;A that was created a while ago:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/116611/how-can-i-get-back-a-system-file-after-deleting-it-from-my-mac\">How can I get back a system file after deleting it from my Mac?</a></li>\n</ul>\n\n<p>This means that an answer along the lines of how to achieve this for the specific file mentioned in a user's question could be provided and a link to the aforementioned question could be provided, or the question could be close-voted as a duplicate of the question.</p>\n\n<p>Either way, this situation is avoided in most cases through guiding the user to recover the file themselves.</p></li>\n<li><p>iOS</p>\n\n<p>This is much rarer as iOS doesn't allow a user to accidentally delete core system files, and jailbroken users are <em>generally</em> more careful.</p>\n\n<p>The more common case for this I can imagine is for development purposes. Jailbreaking is the only case I can see for this, as I can't see a case for needing iOS system files for developing App Store apps.</p>\n\n<ul>\n<li>If what they are requesting is generally-public information (such as flagship images e.g. app icons), I don't see a problem in providing them.</li>\n<li>If they are requesting binaries, I don't think these should be provided by the community.</li>\n</ul></li>\n</ul>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-02-20T20:56:46.710","CommentCount":"1"},{"Id":"2369","PostTypeId":"1","AcceptedAnswerId":"2370","CreationDate":"2015-02-24T17:18:52.177","Score":"8","ViewCount":"42","Body":"<p>I accidently marked the wrong flag for a <a href=\"https://apple.stackexchange.com/questions/174266/i-cant-transfer-my-coc-account-from-android-to-an-ipad-mini\">clash of clans</a> question. I truly have no idea what it flagged, but I meant to put it as a low-quality question.</p>\n\n<p>If I flag a question with the wrong flag, what should I do or say?</p>\n","OwnerUserId":"85940","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-02-27T17:06:09.387","Title":"What to do if I mark the wrong flag?","Tags":"<support><flagging>","AnswerCount":"1","CommentCount":"0"},{"Id":"2370","PostTypeId":"2","ParentId":"2369","CreationDate":"2015-02-24T17:22:55.763","Score":"5","Body":"<p>This works for notifying us the best.</p>\n\n<p>Thanks for the flag and the note - all is good and the flag was handled already.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-02-24T17:22:55.763","CommentCount":"0"},{"Id":"2371","PostTypeId":"1","AcceptedAnswerId":"2373","CreationDate":"2015-02-24T17:48:16.473","Score":"3","ViewCount":"45","Body":"<p>I'm seeing what appear to be commercial advertisements on the site which are not included in the <a href=\"https://apple.meta.stackexchange.com/questions/2318/community-promotion-ads-2015\">roll of 2015 community promotion ads</a>.</p>\n\n<p><img src=\"https://i.stack.imgur.com/BAZgw.png\" alt=\"enter image description here\"></p>\n\n<p>Is this a change or has the sales team succeeded to sign up paying clients for non-trilogy sites?</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-02-26T23:04:16.397","Title":"Have paid ads for high reputation users been modified?","Tags":"<discussion><advertising>","AnswerCount":"2","CommentCount":"0"},{"Id":"2372","PostTypeId":"2","ParentId":"2371","CreationDate":"2015-02-26T19:37:33.340","Score":"2","Body":"<p>Limited advertising has been available on some of the non-trilogy sites since last fall. See <a href=\"https://meta.stackexchange.com/questions/243364/what-sites-have-advertisements-enabled\">What sites have advertisements enabled?</a> Danny Miller who wrote that reply is head of our ad sales. This might just be one of the first ads that's actually been bought on Ask Different, so there's nothing unusual here. Any products or services of interest to this site are all subject to our insanely strict no-distracting-content policies, so don't expect to see <em>punch-the-monkey</em> ads or scrolling television animations meandering across the screen <strike>anytime soon</strike>&hellip; well, ever.</p>\n","OwnerUserId":"3","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-02-26T19:37:33.340","CommentCount":"0"},{"Id":"2373","PostTypeId":"2","ParentId":"2371","CreationDate":"2015-02-26T19:57:33.827","Score":"4","Body":"<p>@robert's answer is correct, but I'd like to add a few things.</p>\n\n<ul>\n<li>Advertising is available on a handful of sites outside the trilogy: Android, Arqade, Ask Ubuntu, Dba, Drupal, Gamedev, Programmers, Security, SharePoint, U/L, WebApps, WordPress, and of course, Ask Different.</li>\n<li>This is indeed one of the first ads targeted to Ask Different.</li>\n<li>The advertising on any and all Stack Exchange sites must meet our high bar of relevance and quality. While some ads are better than others, the company or product will have a reasonable likelihood of relevance.</li>\n<li>You may not have noticed other paid ads because there haven't been many campaigns targeting Ask Different just yet.</li>\n</ul>\n\n<p><strong>TL;DR:</strong> we opened up advertising to thirteen sites outside of the trilogy last year and this is one example. Nothing regarding high-rep privileges has changed.</p>\n\n<hr>\n\n<p>Relevant question here: \"<a href=\"https://meta.stackexchange.com/questions/243364/what-sites-have-advertisements-enabled\">What sites have advertisements enabled?</a>\"</p>\n","OwnerUserId":"59869","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-02-26T19:57:33.827","CommentCount":"0"},{"Id":"2374","PostTypeId":"1","CreationDate":"2015-03-09T05:41:17.713","Score":"24","ViewCount":"474","Body":"<p>As you can see, Ask Different community site got a slight design update today. I have moved site's CSS to a newly refactor LESS system, so it's easier for us to fix SE network CSS bugs globally going on forward. Also I've updated site's logo and icons to SVG for retina support. Visually it should \"feel\" the same as the old site, but with updated Apple aesthetics(yes, I did flatten all the things). I have retired Lucida Sans for Helvetica.</p>\n\n<p>This update should retro-actively fix most of the old CSS bugs. If you see any new ones, or old ones not being fixed, please let me know!</p>\n\n<p>P.S. I can't believe it's been over 4 years since AD launched. Here's the <a href=\"https://i.imgur.com/H9Q9b7V.png\" rel=\"nofollow noreferrer\">original design</a> when the site first launched.</p>\n","OwnerUserId":"6","LastEditorUserId":"2313","LastEditDate":"2015-04-20T11:54:52.437","LastActivityDate":"2015-04-20T11:54:52.437","Title":"Site design update","Tags":"<discussion><design>","AnswerCount":"4","CommentCount":"25"},{"Id":"2375","PostTypeId":"2","ParentId":"1372","CreationDate":"2015-03-09T09:34:55.643","Score":"2","Body":"<p>Solved with the <a href=\"https://apple.meta.stackexchange.com/questions/2374/site-design-update\">design update</a>.</p>\n\n<p><img src=\"https://i.stack.imgur.com/LMhCi.png\" alt=\"\"></p>\n","OwnerUserId":"78980","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-03-09T09:34:55.643","CommentCount":"0"},{"Id":"2376","PostTypeId":"1","CreationDate":"2015-03-09T16:19:39.453","Score":"1","ViewCount":"68","Body":"<p>On March 9 - 10 AM PDT, Apple has a live event.</p>\n\n<p><a href=\"http://www.apple.com/live/2015-mar-event/\" rel=\"nofollow\">http://www.apple.com/live/2015-mar-event/</a></p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2015-03-09T18:10:01.523","LastActivityDate":"2015-04-09T16:24:15.047","Title":"Will there be any site events for the Apple Watch live stream?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2377","PostTypeId":"2","ParentId":"2376","CreationDate":"2015-03-09T16:55:59.197","Score":"1","Body":"<p>Why yes - <a href=\"http://chat.stackexchange.com/rooms/38/ask-different-chat\">our chat room</a> is a good place to follow along. </p>\n\n<p>In addition, these resources are covering the event:</p>\n\n<ul>\n<li><a href=\"http://www.apple.com/live/2015-mar-event/\" rel=\"nofollow noreferrer\">http://www.apple.com/live/2015-mar-event/</a></li>\n<li><p>Apple TV - look for Apple Events using this icon:</p>\n\n<p><img src=\"https://i.stack.imgur.com/Gs6VF.png\" width=\"320\"></p></li>\n<li><p><a href=\"http://liveblog.macobserver.com/\" rel=\"nofollow noreferrer\">http://liveblog.macobserver.com/</a></p></li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"37797","LastEditDate":"2015-04-09T16:24:15.047","LastActivityDate":"2015-04-09T16:24:15.047","CommentCount":"0","CommunityOwnedDate":"2015-03-09T16:55:59.197"},{"Id":"2378","PostTypeId":"1","CreationDate":"2015-03-09T18:52:43.507","Score":"0","ViewCount":"50","Body":"<p>Overall the update is awesome. I really like the new fonts and the <em>really</em> like the updated look to the Markdown input box for question asking and answering.</p>\n\n<p>I'm noticing, on my Thunderbolt display (which is attached to my 15\" rMPB), that the top bar text has a bad case of the jaggies.</p>\n\n<p><img src=\"https://i.stack.imgur.com/zPc7z.png\" alt=\"Thunderbolt display\"></p>\n\n<p>(Direct link: <a href=\"https://i.stack.imgur.com/zPc7z.png\" rel=\"nofollow noreferrer\">http://i.stack.imgur.com/zPc7z.png</a>)</p>\n\n<p>The Thunderbolt display is running at native 2560 x 1440 resolution.</p>\n\n<p>For comparison here's how it looks on the retina display on the MacBook Pro (which is great):</p>\n\n<p><img src=\"https://i.stack.imgur.com/XywMV.png\" alt=\"Retina MacBook Pro display\"></p>\n\n<p>(Direct link: <a href=\"https://i.stack.imgur.com/XywMV.png\" rel=\"nofollow noreferrer\">http://i.stack.imgur.com/XywMV.png</a>)</p>\n\n<p>I'm using Chrome 41.0.2272.76 (64-bit) on OS X 10.2.2 to view the site but it renders equally jaggy in Safari.</p>\n\n<p>Edit: those scaled-down images don't show the problem. Use the direct links to see them at full resolution.</p>\n","OwnerUserId":"292","LastActivityDate":"2015-03-09T18:52:43.507","Title":"Top bar on updated site has some unsharp text in it on a Thunderbolt display","Tags":"<bug><design>","AnswerCount":"0","CommentCount":"2"},{"Id":"2379","PostTypeId":"2","ParentId":"2374","CreationDate":"2015-03-10T01:12:33.520","Score":"3","Body":"<p>@mark </p>\n\n<p>create a user style sheet with for example:</p>\n\n<pre><code>tr.comment&gt;td {\n\n    font: 16px Lucida Sans !important; \n\n}\n</code></pre>\n\n<p>---------- Or</p>\n\n<pre><code>tr.comment&gt;td {\n\n    font: 15px Helvetica !important; \n\n}\n</code></pre>\n\n<p>Save the file ( plain text) it as  stackComments.css</p>\n\n<p>And then in the Safari preferences -> Advanced: </p>\n\n<p>Use the <strong>style sheet</strong> drop down option 'other' to navigate and select your style sheet.</p>\n\n<p>This should change the font size and font to whatever you set it to.</p>\n","OwnerUserId":"17128","LastActivityDate":"2015-03-10T01:12:33.520","CommentCount":"1"},{"Id":"2380","PostTypeId":"1","AcceptedAnswerId":"2381","CreationDate":"2015-03-10T17:08:34.717","Score":"1","ViewCount":"27","Body":"<p>I recently asked this question <a href=\"https://apple.stackexchange.com/questions/170938/macbook-air-usb-c-to-usb-a\">Are there USB-A to USB-C adapters for the Early 2015 MacBook</a> and it was closed as \"primarily opinion-based\" due to there not being enough detail since it was all rumours then. Now the 12″ Air has been launched, could we re-open it? This is because there's more official detail about it and if not there will be soon.</p>\n","OwnerUserId":"112840","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-03-12T13:59:32.007","Title":"How to get my question re-opened?","Tags":"<discussion><questions><closed-questions>","AnswerCount":"1","CommentCount":"2"},{"Id":"2381","PostTypeId":"2","ParentId":"2380","CreationDate":"2015-03-10T17:28:06.470","Score":"3","Body":"<p>As it stands, it's both opinion-based and off topic. We are for practical questions about shipping hardware. I would say you can edit to ask more \"how to determine how USB-C works and less dependent on Apple releasing a modified MacBook Air in 2015.</p>\n\n<p>The short answer, is no one can order any Apple product with USB C so there's not much benefit to the site to have a speculative discussion question open. If and when hardware is orderable and/or announced with technical details - flag that question for moderator review if you don't have the reputation to cast a reopen vote.</p>\n\n<p>If you were to change this to be - is there anything in the <a href=\"https://en.wikipedia.org/wiki/USB#TYPE-C\" rel=\"nofollow\">USB-C connector specification</a> that makes it impossible to plug in a <a href=\"https://en.wikipedia.org/wiki/USB#Connector_types\" rel=\"nofollow\">Standard A USB connector</a> - I couldn't see keeping it closed.</p>\n\n<p>Basically, when you have a hardware purchase dilemma, ask here how to educate yourself to understand the technology directly. Illuminate that core question with the hardware you wish to buy - but make the question about how does one learn to understand [protocol | connector | software | performance benchmarking | etc... ] so that you can make a good decision.</p>\n\n<p>Shopping questions that revolve around price, avaiability, or soft generalizations (e.g. Which MacBook for a developer) get closed as off-topic and/or opinion based.</p>\n\n<p>Cheers and welcome to the site. I look forward to learning about USB C as well.</p>\n","OwnerUserId":"5472","LastEditorUserId":"292","LastEditDate":"2015-03-10T18:05:19.207","LastActivityDate":"2015-03-10T18:05:19.207","CommentCount":"2"},{"Id":"2382","PostTypeId":"1","AcceptedAnswerId":"2391","CreationDate":"2015-03-10T18:51:39.363","Score":"3","ViewCount":"40","Body":"<p>I gave an answer to this question: <a href=\"https://apple.stackexchange.com/questions/173841/install-xcode-without-admin/176141\">Install Xcode without admin</a></p>\n\n<p>But the answer mostly amounts to \"Your question was answered at SO here: <a href=\"https://stackoverflow.com/questions/1837889/authorize-a-non-admin-developer-in-xcode-mac-os\">https://stackoverflow.com/questions/1837889/authorize-a-non-admin-developer-in-xcode-mac-os</a>\"</p>\n\n<p>But it's not considered correct to answer a question with someone else's answer. What should I have done here? Just skipping the question didn't seem like a good idea since it's over 2 weeks old now and only had about 20 views.</p>\n\n<p>The answer here, <a href=\"https://apple.meta.stackexchange.com/questions/2157/what-is-the-correct-response-to-cross-posted-questions\">What is the correct response to cross-posted questions?</a>, doesn't help me because I do not yet have permission to comment or flag posts.</p>\n","OwnerUserId":"106137","LastEditorUserId":"-1","LastEditDate":"2017-05-23T11:33:34.410","LastActivityDate":"2015-03-23T22:10:30.840","Title":"What is the correct way to inform an Asker their answer is on another SE site?","Tags":"<discussion><questions>","AnswerCount":"2","CommentCount":"0"},{"Id":"2383","PostTypeId":"2","ParentId":"2374","CreationDate":"2015-03-10T20:05:52.023","Score":"1","Body":"<p>The newsletter ad looks a bit outdated now.</p>\n\n<p><img src=\"https://i.stack.imgur.com/PlUER.jpg\" alt=\"full ad\"></p>\n\n<p><img src=\"https://i.stack.imgur.com/fLjGn.jpg\" alt=\"The image at time of posting\"></p>\n\n<p><a href=\"http://cdn.sstatic.net/apple/img/newsletter-ad.png\" rel=\"nofollow noreferrer\">http://cdn.sstatic.net/apple/img/newsletter-ad.png</a></p>\n","OwnerUserId":"67260","LastActivityDate":"2015-03-10T20:05:52.023","CommentCount":"4"},{"Id":"2385","PostTypeId":"1","CreationDate":"2015-03-11T17:09:38.660","Score":"0","ViewCount":"27","Body":"<p>Regarding this answer - <a href=\"https://apple.stackexchange.com/a/176247/85275\">https://apple.stackexchange.com/a/176247/85275</a></p>\n\n<p>Ought we to leave sites like iFixit to the task of full take-aparts &amp; just provide links?</p>\n\n<p>The alternative would be pretty much to copy it verbatim… including 'borrowing' their photographs.</p>\n\n<p>Personally, I feel this is one time where link-only answers are the correct way to handle this type of question.</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-03-11T18:07:02.310","Title":"SE vs iFixit etc","Tags":"<discussion><hyperlinks><policy>","AnswerCount":"1","CommentCount":"0"},{"Id":"2386","PostTypeId":"5","CreationDate":"2015-03-11T17:10:47.673","Score":"0","Body":"","OwnerUserId":"-1","LastEditorUserId":"-1","LastEditDate":"2015-03-11T17:10:47.673","LastActivityDate":"2015-03-11T17:10:47.673","CommentCount":"0"},{"Id":"2387","PostTypeId":"4","CreationDate":"2015-03-11T17:10:47.673","Score":"0","Body":"Generally-accepted practise in dealing with a specific question-type (perhaps should be synonymised to 'best-practise' & 'guideline')","OwnerUserId":"85275","LastEditorUserId":"85275","LastEditDate":"2015-03-13T07:39:59.457","LastActivityDate":"2015-03-13T07:39:59.457","CommentCount":"0"},{"Id":"2388","PostTypeId":"2","ParentId":"2385","CreationDate":"2015-03-11T18:07:02.310","Score":"2","Body":"<p>I say we should add value and summarize the key points of any external resource. Unless that resource is licensed under a similar creative commons license as the one we use here: <a href=\"http://creativecommons.org/licenses/by-sa/3.0/\" rel=\"nofollow\">http://creativecommons.org/licenses/by-sa/3.0/</a> then you'll want to attribute anything that's copied more or less verbatim properly.</p>\n\n<p>Also, the subscriber content portion of the \"legal\" agreement has good guidelines on what and how you choose to submit as an answer.</p>\n\n<blockquote>\n  <p><a href=\"http://stackexchange.com/legal\">http://stackexchange.com/legal</a></p>\n</blockquote>\n","OwnerUserId":"5472","LastActivityDate":"2015-03-11T18:07:02.310","CommentCount":"0"},{"Id":"2389","PostTypeId":"1","CreationDate":"2015-03-12T10:52:58.203","Score":"8","ViewCount":"202","Body":"<p>I imagine we'll be seeing a lot of questions on this over the coming months.</p>\n\n<p>Do we have a consensus on whether it would be on or off-topic until then?</p>\n\n<p>It doesn't appear to require any NDA, so we wouldn't be breaking any agreements on that front, but it's beta so it might be all 'broken to heck' at any given point.</p>\n\n<p>Cases in point<br>\n<a href=\"https://apple.stackexchange.com/questions/176384/how-to-restore-outlook-15-email-database\">https://apple.stackexchange.com/questions/176384/how-to-restore-outlook-15-email-database</a><br>\n<a href=\"https://apple.stackexchange.com/questions/175189/syncing-contacts-between-outlook-for-mac-2015-and-google-contacts\">Syncing contacts between Outlook for Mac (2015) and Google Contacts</a><br>\n<a href=\"https://apple.stackexchange.com/questions/171337/whats-the-best-way-to-synchronize-calendar-icloud-with-outlook-2015\">What&#39;s the best way to synchronize Calendar/iCloud with Outlook 2015</a>  </p>\n\n<p>Based on <a href=\"https://apple.stackexchange.com/help/on-topic\">https://apple.stackexchange.com/help/on-topic</a><br>\n\"Pre-release, non-publicly available beta software and software granted only under an NDA\"<br>\nAs it is publicly available &amp; not NDA, then it should be OK, but just for clarification.</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-03-25T18:25:44.777","Title":"Office for Mac 2016 - on or off-topic until release?","Tags":"<discussion><policy>","AnswerCount":"2","CommentCount":"2","FavoriteCount":"1"},{"Id":"2390","PostTypeId":"2","ParentId":"2389","CreationDate":"2015-03-12T13:50:06.447","Score":"3","Body":"<p>It's off-topic until final release. Breaking NDA is one thing, but that's not the main reason why pre-release questions are off-topic here. Things are broken in pre-release that won't be broken for the official release, and features can change, both in functionality and in method of use.</p>\n\n<p>Ideally, answers here should not be subject to imminent change and ideally want to last for the foreseeable future: this isn't the case with most questions about pre-release software, hence the prohibition.</p>\n","OwnerUserId":"37797","LastEditorUserId":"9058","LastEditDate":"2015-03-17T21:38:50.450","LastActivityDate":"2015-03-17T21:38:50.450","CommentCount":"6"},{"Id":"2391","PostTypeId":"2","ParentId":"2382","CreationDate":"2015-03-12T13:57:51.130","Score":"3","Body":"<p>My question which you linked to is with regard to cross-posting: where the same user posts the same question to multiple sites across Stack Exchange. In this case, it's simply that the site scope of both sites allows the question to be on-topic in both places and has been asked on one site by one user and then on another site by a different user. This is <em>not</em> as a case for flagging as no moderator action is required in this situation.</p>\n\n<p>In general, it is fine to copy a suitable answer from the original question and provide it as an answer to the second question. Use quote formatting to indicate that this is not your own work and provide a link to the source.</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2015-03-23T22:08:00.150","LastActivityDate":"2015-03-23T22:08:00.150","CommentCount":"6"},{"Id":"2392","PostTypeId":"2","ParentId":"2389","CreationDate":"2015-03-12T15:47:38.267","Score":"5","Body":"<p>I think all of these specific questions should be open and on-topic.</p>\n\n<p>Specifically, it's not part of the prohibited software listed as <strong><em>Pre-release, non-publicly available beta software and software granted only under an NDA</em></strong></p>\n\n<p><a href=\"http://products.office.com/en-US/mac/mac-preview\" rel=\"nofollow noreferrer\">Microsoft's Office for Mac 2016 Preview</a> is publicly available.\nIt also is granted <a href=\"http://blogs.office.com/2015/03/05/office-2016-mac-preview/\" rel=\"nofollow noreferrer\">without an NDA</a>.</p>\n\n<p>Furthermore, the general category should be on-topic IMO. For example, I asked a question today about something Apple labels as beta.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/177722/is-it-possible-to-wipe-an-entire-icloud-photo-library\">Is it possible to wipe an entire iCloud Photo Library?</a></li>\n</ul>\n\n<p><img src=\"https://i.stack.imgur.com/gDHME.png\" alt=\"enter image description here\"></p>\n\n<p>I'm legitimately stumped and at a standstill using this feature. I've opened two support tickets with Apple and it's been 5 days with no progress. I think there are good questions about beta software that can and should be asked. I'm of an opinion that <strong>we should close bad questions that are not precise</strong>. </p>\n\n<p><strong>We should encourage questions about narrow topics or narrow windows in time <em>as long as they are clear and precise</em></strong>. If there is confusion about beta status or versions, it's up to the asker to revise and phrase the question to meet community standards. </p>\n\n<p>This site aims to be the ultimate resource for community knowledge of products, and the benefits of beta exclusions seem to diminish the longer I see the site working day in and day out.</p>\n\n<p>Keep in mind, Apple launched iWork for iCloud as beta in June 2013. In August 2013, it was available to anyone. Recently, they rolled it out to anyone with a Mac or PC and Safari 6.0.3 or later, Internet Explorer 9.0.8 or later, or Google Chrome 27.0.1 or later.</p>\n\n<p>So, here we are 580 days after the general availability of the product and it's \"still in beta\" and turning down questions on a product that's in production that long seems odd to me just because it's \"beta\"</p>\n\n<p>I'll step off this little soapbox now, but wanted to add more data than just \"beta bad\" or \"beta good\".</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-03-25T18:25:44.777","CommentCount":"6"},{"Id":"2393","PostTypeId":"1","AcceptedAnswerId":"2395","CreationDate":"2015-03-12T18:39:22.917","Score":"3","ViewCount":"33","Body":"<p>Does a poster get notified if an edit is made to an answer, or should I add a comment to prompt?</p>\n","OwnerUserId":"85275","LastEditorUserId":"37797","LastEditDate":"2015-03-12T20:29:11.037","LastActivityDate":"2015-03-12T20:29:11.037","Title":"Does a poster get notified if an edit is made to an answer?","Tags":"<discussion><editing>","AnswerCount":"2","CommentCount":"0"},{"Id":"2394","PostTypeId":"2","ParentId":"2393","CreationDate":"2015-03-12T19:01:54.473","Score":"1","Body":"<p>The OP should get a notification whenever an edit is made to a post.</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-03-12T19:01:54.473","CommentCount":"6"},{"Id":"2395","PostTypeId":"2","ParentId":"2393","CreationDate":"2015-03-12T20:19:26.313","Score":"3","Body":"<p>Edits that other people make to posts which are yours (both questions and answers) will cause an edit notification to show in your inbox.</p>\n\n<p>                                 <img src=\"https://i.stack.imgur.com/o1a86.png\" width=\"374\"></p>\n\n<p>However, these notifications are not sent for minor edits. Edits need to be substantiative enough for the system to deem it necessary to notify you. For more information, see Meta.SE:</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/202359/no-notification-was-received-for-an-edit-to-a-post\">No notification was received for an edit to a post</a></li>\n</ul>\n\n<blockquote>\n  <p>In order to reduce noise sent to users, we only notify when \"substantive\" changes are happening on their posts.</p>\n  \n  <p>There are a few rules in how \"substantive\" is defined, but typically one of these two should be enough to trigger a message:</p>\n  \n  <ul>\n  <li>the edit in the post body should be over a threshold</li>\n  <li>the edit in code sections should be over another threshold</li>\n  </ul>\n  \n  <p>The threshold varies from site to site.</p>\n</blockquote>\n\n<p>Notifications are not sent to the user who asked a question if an answer to their question is edited.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-03-12T20:19:26.313","CommentCount":"5"},{"Id":"2396","PostTypeId":"1","CreationDate":"2015-03-12T20:31:36.950","Score":"4","ViewCount":"60","Body":"<p>Apple has 4 web apps in beta status when you log in at www.icloud.com:</p>\n\n<ul>\n<li>Photos</li>\n<li>Pages</li>\n<li>Numbers</li>\n<li>Keynote</li>\n</ul>\n\n<p><img src=\"https://i.stack.imgur.com/0sGdE.png\" alt=\"iCloud\"></p>\n\n<p>Since the FAQ and help section state that questions about <strong><em>Pre-release, non-publicly available beta software and software granted only under an NDA</em></strong> are off-topic, should any or all of these be on-topic while they say \"beta\"?</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2015-03-12T20:43:41.347","LastActivityDate":"2015-03-13T21:58:35.990","Title":"Are Apple iCloud / iWork beta web apps on topic for the main site?","Tags":"<discussion><faq><close-reasons>","AnswerCount":"1","CommentCount":"2"},{"Id":"2398","PostTypeId":"1","AcceptedAnswerId":"2399","CreationDate":"2015-03-13T12:31:07.390","Score":"4","ViewCount":"70","Body":"<p>I want to ask a questurn asking peoples opinions on why they hate having one port only on the new MacBook.</p>\n\n<p>I know I cannot ask this on <a href=\"http://apple.stackexchange.com\">Ask Different</a> since it is opinion based however could I ask the question on <a href=\"http://meta.apple.stackexchange.com\">Ask Different Meta</a> using the discussion tag?</p>\n\n<p>What I am meaning here is can I ask people about opinions on Apple products and design here on meta or is this not allowed?</p>\n","OwnerUserId":"112840","LastActivityDate":"2015-03-13T14:39:26.780","Title":"Can I ask this question on Meta?","Tags":"<discussion><support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2399","PostTypeId":"2","ParentId":"2398","CreationDate":"2015-03-13T12:39:59.617","Score":"6","Body":"<p>No certainly don't ask that here as meta is for discussing the site. Asking why you might or might not ask something on main is exactly the point here.</p>\n\n<p>For opinion and discussion on the main site - we have the blog (where someone needs to write an opinion piece and then the discussion happens in the comments) and the [chat] rooms.</p>\n\n<p>Now, if you can distill your opinion question down to how to learn about technology, that's on topic on the main site. So for example. I have a Retina MacBook Pro and I run certain apps. I might want to ask how I could measure the performance of my current workload so I can decide between the MacBook or MacBook Pro both of just announced.</p>\n\n<p>Basically - by analyzing my needs, documenting them and then asking how to learn - the question becomes less about opinion and more about objective facts and knowledge. Boom - the question would not be primarily opinion based if you do some work to nail down what you're really asking.</p>\n\n<p><em>With data, you're not just another person with an opinion.</em> (not <a href=\"https://en.wikipedia.org/wiki/W._Edwards_Deming\" rel=\"nofollow\">W. Edwards Deming</a>)</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2015-03-13T14:39:26.780","LastActivityDate":"2015-03-13T14:39:26.780","CommentCount":"5"},{"Id":"2400","PostTypeId":"2","ParentId":"2396","CreationDate":"2015-03-13T21:58:35.990","Score":"5","Body":"<p>My opinion is that they should be acceptable (and <em>not</em> off-topic) much in <a href=\"https://apple.meta.stackexchange.com/questions/1119/despite-the-general-rule-to-not-answer-questions-about-beta-products-should-we\">the same way Siri and Messages were</a>. While they are are technically \"beta\", I think it is largely in name only as the general public has easy access to them from the <em>default</em> panel in www.iCloud.com.</p>\n\n<p>I think they also come very close to fitting into the FAQ criteria as they really aren't pre-release, and are public available.</p>\n\n<p>I believe they used to be only accessible from beta.icloud.com in which case, I think it would be different, as it would more more fit into the \"pre-release\" clause.</p>\n","OwnerUserId":"18917","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.967","LastActivityDate":"2015-03-13T21:58:35.990","CommentCount":"1"},{"Id":"2401","PostTypeId":"2","ParentId":"1809","CreationDate":"2015-03-14T17:17:41.757","Score":"1","Body":"<p>This has been fixed in the recent <a href=\"https://apple.meta.stackexchange.com/questions/2374/site-design-update\">site design update</a>:</p>\n\n<p>                                                            <img src=\"https://i.stack.imgur.com/zRuKK.gif\" alt=\"\"></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-03-14T17:17:41.757","CommentCount":"0"},{"Id":"2402","PostTypeId":"1","CreationDate":"2015-03-15T03:43:21.897","Score":"-5","ViewCount":"56","Body":"<p>I asked a <a href=\"https://apple.stackexchange.com/questions/159369/how-much-difference-between-i5-and-i7-13-macbook-pro-2014-especially-for-xcode\">question</a> about the difference that processor architectures make to compiler performance. I asked with a lot of supporting detail to make it possible for someone who knew facts to be able to say <em>X feature of the processor directly helps compilation</em> and I tried to avoid simple comparative \"opinion-based\" wording.</p>\n\n<p>Still, it was closed.</p>\n\n<p>We seem to have an increasing tendency to close questions as \"opinion based\" when I see many of them as being more, the closer doesn't know enough about the topic to know if there will be relevant facts so assumes the question leads to just opinions. Is this just \"moderation activity for ego sake?\"</p>\n\n<p>(Yes I looked at the profile of the person who closed it and they don't seem to be an authority in this area.)</p>\n\n<p>It was a real issue I was trying to get answered and I put significant work into technical preparation to seed the answers. The question just won me a silver badge for the 2,5000 views it's had so I was just reminded of how annoyed I was by the closure.</p>\n","OwnerUserId":"4645","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-03-15T05:01:19.767","Title":"Closure due \"primarily opinion-based\" seems more like ignorance of moderator - a trend?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"2403","PostTypeId":"2","ParentId":"2402","CreationDate":"2015-03-15T04:55:52.257","Score":"7","Body":"<p>That question reads like you musing about benchmarks and their applicability to your specific work requirements.</p>\n\n<p>Closing a question doesn't mean it needs to stay closed; it means that, in its current form, it isn't a question that will lead to a clear and canonical answer. You'll get a bunch of \"well I tried this\" and \"maybe this will work\" type stuff which is wholly <em>not</em> the kind of Q&amp;A site this happens to be.</p>\n\n<p>Closing a question means it needs more work.</p>\n\n<p>Even your follow-up semi-answer, semi-comment comment frames how not-a-question  your question was:</p>\n\n<blockquote>\n  <p>I thought it might be useful to add a comment on how well the 13\" has worked out. The 16GB RAM helps as does the SSD so it seems faster then my iMac most of the time when compiling or running AppCode. I have noticed a tendency to hog the more if compiling - try to avoid doing big builds and lots of web browsing simultaneously.</p>\n</blockquote>\n\n<p>That's not an answer, that's a single experience and some speculation.</p>\n\n<p>There might well be a reasonable question in what you posted, but as it stands I agree with the moderator who closed it: it's not a question that can be answered in any other way that would lead to a useful, guiding response. Really, the only answer that can be given for \"How much difference between i5 and i7 13\" Macbook Pro 2014 especially for XCode &amp; Visual Studio compilation?\" is:</p>\n\n<blockquote>\n  <p>It depends entirely on what, specifically, you're trying to do with those IDEs.</p>\n</blockquote>\n\n<p>Full stop.</p>\n\n<p>You might say the benchmarks provide as much illumination as possible on the differences and that's about it. Neither of those tools have standard benchmarking suites behind them so there isn't any empirical result you can point to to understand their behavioural differences on the two difference machines.</p>\n\n<p>As for your comment about the moderator: the site is <em>community moderated</em>, as are <em>all</em> Stack Exchange sites. The question was brought to the attention of the moderators by flags from your peers. It was not a lone decision.</p>\n","OwnerUserId":"292","LastEditorUserId":"292","LastEditDate":"2015-03-15T05:01:19.767","LastActivityDate":"2015-03-15T05:01:19.767","CommentCount":"1"},{"Id":"2404","PostTypeId":"2","ParentId":"2374","CreationDate":"2015-03-17T17:51:43.200","Score":"0","Body":"<p>Have to say - I didn't like the new font at all to start with.</p>\n\n<p>Couple of weeks go by &amp; now all the other SE sites actually look a bit fat &amp; bold by comparison.</p>\n\n<p>Nice job - seeing further than I did initially ;-)</p>\n","OwnerUserId":"85275","LastActivityDate":"2015-03-17T17:51:43.200","CommentCount":"0"},{"Id":"2405","PostTypeId":"1","AcceptedAnswerId":"2406","CreationDate":"2015-03-19T12:21:29.670","Score":"5","ViewCount":"186","Body":"<p>I noticed the other day that a <a href=\"https://apple.stackexchange.com/questions/177253/iphone-is-disabled-connect-to-itunes\">question about a disabled iPhone</a> was flagged a duplicated of Activation Lock. That's not true at all, though.</p>\n\n<p>Activation lock is when you can't activate your iPhone because it's under another person's account.</p>\n\n<p>An disabled iPhone occurs when someone has entered the wrong passcode so many times, the only way to get your stuff back is to wipe it and restore.</p>\n\n<p>I flagged the question, and the reply was to find what it should be.</p>\n\n<p>Well, I searched, and found all of the questions either duplicate of Activation Lock, or they were closed as too broad!</p>\n\n<p>What shoud I do in this case?</p>\n","OwnerUserId":"85940","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-03-19T12:53:52.787","Title":"Activation Lock and Disabled iPhones","Tags":"<discussion><flagging>","AnswerCount":"1","CommentCount":"0"},{"Id":"2406","PostTypeId":"2","ParentId":"2405","CreationDate":"2015-03-19T12:43:24.160","Score":"3","Body":"<p>I share your assessment that the question most probably is <em>not</em> a duplicate. Nevertheless right now it's difficult to understand what the question is about actually.</p>\n\n<p>Your flag was declined with</p>\n\n<blockquote>\n  <p>Please comment or edit the post to explain why it's not duplicate. If we were to reopen it, it would need to be closed as too broad/unclear </p>\n</blockquote>\n\n<p>From looking at the question in question (sic), I agree with the moderator declining the flag. The question can be read either as \"how do I recover from a \"iPhone is disabled\" situation\" or as a \"how do I recover forgotten Apple ID/password\", also it's (at least to me) not clear how these two statements even fit together (AFAIK Apple ID/password are not required to re-enable an iPhone via iTunes after too many wrong password attempts). This means that just reopening the question would have it closed again as \"unclear\" rather quickly.</p>\n\n<p>It's worth keeping in mind that this site (as well as all the other SE sites) is mainly community moderated. So in this case please go ahead, tidy up the question and leave a comment for the OP on what you did and why you did it.</p>\n\n<p>PS: And thanks for bringing the issue up on Meta!</p>\n","OwnerUserId":"9058","LastEditorUserId":"9058","LastEditDate":"2015-03-19T12:53:52.787","LastActivityDate":"2015-03-19T12:53:52.787","CommentCount":"2"},{"Id":"2407","PostTypeId":"1","CreationDate":"2015-03-21T23:13:15.357","Score":"1","ViewCount":"38","Body":"<p>I seem to be the victim of a bug that effects the reputation \"score\" system.  About two days ago I a question which was down voted that day and the day before it was asked, how can that happen?</p>\n","OwnerUserId":"109103","LastEditorUserId":"5472","LastEditDate":"2015-03-22T00:37:21.853","LastActivityDate":"2015-03-22T00:37:21.853","Title":"I think there is a bug in the system","Tags":"<support><bug>","AnswerCount":"1","CommentCount":"2","FavoriteCount":"1"},{"Id":"2408","PostTypeId":"2","ParentId":"2407","CreationDate":"2015-03-22T00:37:06.760","Score":"1","Body":"<p>I've taken a look at your reputation on the main site, and it looks like the balance is correct.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/users/109103/tom?tab=reputation\">https://apple.stackexchange.com/users/109103/tom?tab=reputation</a></li>\n</ul>\n\n<p>The only vote that you didn't receive was an initial down vote and rather than give you negative reputation, the casting of that vote only cost the voter and not you reputation.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-03-22T00:37:06.760","CommentCount":"2"},{"Id":"2409","PostTypeId":"1","AcceptedAnswerId":"2410","CreationDate":"2015-03-22T22:09:20.430","Score":"1","ViewCount":"27","Body":"<p>There is an <a href=\"https://apple.stackexchange.com/questions/176371/can-i-delete-private-var-folders-bf\">question and an accepted answer</a>.</p>\n\n<p>I do not want to dig into the technical details (meta is not the right place) - in short:</p>\n\n<p>It is possible to prove that the <strong>accepted answer is wrong</strong>. Since I know that the original response is bad - <a href=\"https://apple.stackexchange.com/questions/177780/run-level-shell-scripts-cleaning-var-folders-when-changing-run-levels?noredirect=1#comment210435_177780\">I asked an another question</a> (now deleted) what (partially) is an variant to the original - what <em>could be correct</em> - but I'm not sure.</p>\n\n<p>@Patrik closed it as a duplicate.</p>\n\n<p>What to do when a question is marked as a duplicate (and commented as unclear and opinion based), but</p>\n\n<ul>\n<li>The answer to the original question is entirely wrong</li>\n<li>the new question is <strong>not an exact</strong> duplicate - but it is new approach  what could be right</li>\n<li>The question doesn't contains anything for what could't be exists unambiguous and clear answer - i.e. nothing is \"opinion based\"</li>\n<li>And trying solve the problem (with respect to possible complications)</li>\n<li>but the moderator closes it :(</li>\n</ul>\n\n<p><a href=\"https://stackoverflow.com/users/632407/jm666\">I could call myself as StackOverflow veteran</a> trusted user with 23k reputation and ability closing <code>bash</code> questions by one click. But I trying to be pretty sure that I did not make hasty conclusions, and when I made a mistake <a href=\"https://stackoverflow.com/q/29112449/632407\">what also happens</a>, quickly reopening the question again.</p>\n\n<p>Also trying edit the question if I can improve it to be better instead of the \"blind close\". (unfortunately, English isn't my primary language, so mainly doing only code-snipets improving).</p>\n\n<p>For the \"disputable\" moderator decisions are <a href=\"https://meta.stackexchange.com/a/158877/163674\">here</a> and <a href=\"https://meta.stackoverflow.com/a/253129/632407\">here</a> some good answers (to bad questions) - so, asking in the apple's meta - maybe the Think Different idea applies here too. ;)</p>\n\n<p>Thank you for reading this.</p>\n","OwnerUserId":"6838","LastEditorUserId":"-1","LastEditDate":"2017-05-23T11:33:34.410","LastActivityDate":"2015-03-22T22:32:00.720","Title":"Accepted, but wrong answer - question marked as duplicate to the wrong answer","Tags":"<discussion><close-reasons><moderators>","AnswerCount":"1","CommentCount":"4"},{"Id":"2410","PostTypeId":"2","ParentId":"2409","CreationDate":"2015-03-22T22:32:00.720","Score":"4","Body":"<p>You initially asked </p>\n\n<blockquote>\n  <p>It is safe delete everything bellow /private/var/folders/?</p>\n  \n  <p>Another (more important) question - has the OS X something as rc.6, e.g. an shell script what is running when changing the run level to 6 - e.g. at every reboot? (Or rc.0 at every boot), to where I could add the rm?</p>\n  \n  <p>Is safe clean the /var/folders/* at every reboot? (asking because i could imagine than some update utility could use it...).</p>\n</blockquote>\n\n<p>There are several problems with this question which may have lead to it being put on hold in the next hours/days:</p>\n\n<ul>\n<li>there are (at least) two questions at once, leading to a close due to being too broad or unclear what you are asking</li>\n<li>part of the question have come up before (and being answered already), leading to a close as a duplicate</li>\n</ul>\n\n<p>I've decided to follow up on the second option (as there was no reference at all to that question in your text), I also recommended to ask a new question to cover the \"can I safely clean the folders on reboot\".</p>\n\n<p>If you think the answer to the original question is wrong, the best course of action would be to add a comment to that answer (you have more than enough reputation for this), post a new answer on your own or do both.</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-03-22T22:32:00.720","CommentCount":"2"},{"Id":"2411","PostTypeId":"1","AcceptedAnswerId":"2413","CreationDate":"2015-03-23T04:35:04.940","Score":"5","ViewCount":"87","Body":"<p>I posted an answer to a question earlier and attached a screenshot, then almost immediately realised that my screenshot contained sensitive information that I'd missed (in this case my personal e-mail addresses).</p>\n\n<p>Had I edited my answer, there would still have been a link to the old image (which was automatically uploaded to <em>i.stack.imgur.com</em>) in the answer's edit history. For lack of a better immediate solution, I deleted my answer and then reposted it with the correct image.</p>\n\n<p>Firstly, I notice that my old answer is still there and visible to me. Is there a way to permanently remove it? Secondly, was deleting and reposting the answer the best thing to do, or is there another way to undo posting an answer without leaving a trace of it that I've missed?</p>\n","OwnerUserId":"112471","LastEditorUserId":"5472","LastEditDate":"2015-03-23T13:50:51.400","LastActivityDate":"2015-03-23T14:38:01.130","Title":"Removing accidentally posted sensitive information from own answer","Tags":"<support>","AnswerCount":"2","CommentCount":"0"},{"Id":"2412","PostTypeId":"2","ParentId":"2411","CreationDate":"2015-03-23T12:11:12.207","Score":"4","Body":"<p>There's no need to delete and repost your answer just because you've included your email address in an image.</p>\n\n<p>Whilst the revision history will show the information, the correct procedure is to flag the answer for moderator attention and request that the revision be removed from the revision history. Whilst moderators themselves are unable to do this themselves, they are able to elevate your request to those who can.</p>\n\n<p>Deleting your answer, whilst removing it from public view, still allows it to be viewed by moderators, both those who are elected moderators (with the diamonds) and those with the moderator tools privilege such as me.</p>\n\n<p>Note that editing your post within the 5 minute grace period will not leave a revision in the revision history, so if you make your change fast enough, there is no need for moderator intervention (unless you wish the image to be removed from i.stack.imgur.com too). You posted the answer at 04:17:52 and deleted it at 04:18:27; simply editing it at that point wouldn't have created a revision in the revision history.</p>\n","OwnerUserId":"37797","LastActivityDate":"2015-03-23T12:11:12.207","CommentCount":"1"},{"Id":"2413","PostTypeId":"2","ParentId":"2411","CreationDate":"2015-03-23T13:50:42.057","Score":"4","Body":"<p>Yes - permanent deletion of content is possible.</p>\n\n<p>No - elected moderators and users cannot do it. Worse, I believe you'll have to work with imgur directly to get that post reversed/deleted or the URL changed. I've not done that and perhaps someone else can edit this or answer if Stack Exchange employees have any tools to assist that deletion on the service they have chosen as the official image hosting provider for the network.</p>\n\n<p>The best way to request deletion:</p>\n\n<ol>\n<li>Firstly - edit the post yourself. Leave everything up but the part that needs to be deleted. This allows the wiki/revision tool to show exactly what is problematic and allows preservation of the majority of the content that was contributed under the site terms to remain.</li>\n<li>Secondly -  use the <a href=\"https://apple.stackexchange.com/contact\">contact us link</a> and explain to the site owners what specifically you need removed. The more narrow a scalpel you can use, the faster the decision and operation can be completed. Send links to the content and be sure to leave good contact information (email/phone/sms) and check in on the site regularly in case you get pinged here with a question.</li>\n<li>Thirdly - flag the post to let the moderator team know you asked for help deleting the word/image/post/key in question.</li>\n</ol>\n\n<p>If you uploaded a private key, or a screenshot - immediately upload a new screenshot with the sensitive info blurred/redacted. If it's text, make an edit so that the team can see exactly which revision to purge. Use the site tools to make it clear how you want the post to read permanently.</p>\n\n<p>Lastly, asking here is awesome. It lets anyone help out with how the site works.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-03-23T14:38:01.130","CommentCount":"0"},{"Id":"2414","PostTypeId":"1","CreationDate":"2015-03-23T20:29:02.047","Score":"3","ViewCount":"38","Body":"<p>I created this account when I asked a question. Now the header at the top says \"Stack Exchange\" and there is a red rectangle with the number 9; hovering over it says I have 9 unread messages in my Inbox.</p>\n\n<p>So how the hell do I get to the inbox?</p>\n","OwnerUserId":"119060","LastEditorUserId":"37797","LastEditDate":"2015-03-24T15:48:28.540","LastActivityDate":"2015-03-24T15:48:28.540","Title":"How do I get to my Stack Exchange Inbox? Nothing to click in header area","Tags":"<support><inbox><notifications>","AnswerCount":"2","CommentCount":"2"},{"Id":"2415","PostTypeId":"2","ParentId":"2414","CreationDate":"2015-03-23T21:42:25.353","Score":"2","Body":"<p>Click on the number \"9\" in the bar at the top.  It will expand to show you a list of the messages in your inbox.</p>\n","OwnerUserId":"24154","LastActivityDate":"2015-03-23T21:42:25.353","CommentCount":"0"},{"Id":"2416","PostTypeId":"2","ParentId":"2382","CreationDate":"2015-03-23T21:57:31.493","Score":"2","Body":"<p>Kudos for asking so constructively.  I think your reaction/approach was entirely reasonable.</p>\n\n<p>In general we tend not to like link-only answers.  There are several reasons.  For instance, links often die.  However, those reasons probably don't apply here.  For instance, it seems hard to imagine a situation where Stackoverflow disappears from the Internet but Ask Different remains.  That said, it never hurts to supplement your answer by adding a summary of the main idea from the other answer you are linking to, so the best solution is probably to provide a link to the detailed answer on Stackoverflow and add a short summary to your answer here.</p>\n\n<p>It is OK to copy from someone else's answer, as long as you provide suitable attribution and link to that other answer.</p>\n\n<p>The only place where I disagree with <a href=\"https://apple.meta.stackexchange.com/a/2391/24154\">grgarside's excellent answer</a> -- and I admit it's a small nit -- is that I think there's no need to mark your answer as community wiki.  Community wiki is only appropriate in those very rare cases where <a href=\"http://blog.stackoverflow.com/2011/08/the-future-of-community-wiki/\">massive collaboration from the community is needed</a>; this is extremely rare and I don't see why it would apply to your situation.  I would suggest you leave your answer as an ordinary answer (don't make it community wiki) -- I think your answer is helpful, and I'd prefer to be able to upvote it and have you receive the rep for your useful, well-written, well-researched answer.  If you want to remove community wiki status, you can flag your answer for moderator attention and ask them to remove the community wiki status.</p>\n\n<p>Thank you for your valuable contributions to Ask Different.  I hope you will keep contributing!</p>\n","OwnerUserId":"24154","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-03-23T22:10:30.840","CommentCount":"1"},{"Id":"2417","PostTypeId":"2","ParentId":"2414","CreationDate":"2015-03-24T15:42:42.247","Score":"4","Body":"<p>                             <img src=\"https://i.stack.imgur.com/ccjN8.gif\" alt=\"Click the button\"></p>\n","OwnerUserId":"37797","LastActivityDate":"2015-03-24T15:42:42.247","CommentCount":"1"},{"Id":"2418","PostTypeId":"1","AcceptedAnswerId":"2419","CreationDate":"2015-03-25T15:37:48.933","Score":"22","ViewCount":"423","Body":"<p>Where can we store a list of questions that are considered canonical?</p>\n\n<p>Canonical means that it's asked frequently enough to warrant an excellent clear and detailed answer that the site edits and maintains so that it's broad, clear and helps many people troubleshoot or solve a common issue or misunderstanding.</p>\n\n<p>Rather than blame people for coming and asking the same question over and over, the intent is to organize and realize that this will never and and instead have an efficient manner to link these to canonical answers.</p>\n\n<p>That way, if the new asker actually has a different question, it will be easier for them to edit the post and get it reopened. It also will signal to the community that the answers are going to be heavily used and that it's worth it to keep them current, clear, and exemplary so that they can shoulder the burden of answering many questions on the same core topic.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2017-06-09T13:26:56.897","LastActivityDate":"2017-08-09T10:03:20.090","Title":"Where is the list of canonical questions stored for Ask Different?","Tags":"<discussion><faq><closed-questions><canonical-questions>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"7"},{"Id":"2419","PostTypeId":"2","ParentId":"2418","CreationDate":"2015-03-25T15:47:27.403","Score":"13","Body":"<h1>The list of existing canonical questions is here:</h1>\n\n<h3>iTunes Store</h3>\n\n<ul>\n<li>How can I change regions?</li>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/2464/\">Can someone help with sorting / merging questions about transferring iTunes store balances?</a>  </li>\n<li><a href=\"https://apple.stackexchange.com/questions/100955/\">How do you use an existing AppleID on iOS App Store without providing a credit card number?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/187286/\">How can I use a pre-existing AppleID with Mac App Store without a billing address?</a></li>\n</ul>\n\n<h3>iOS</h3>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/182966/\">Forgotten iCloud email ID and password</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/291055/\">Got a new iPhone - where am I supposed to receive the verification code?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/114985/how-can-i-bypass-activation-lock\">How can I bypass Activation Lock?</a></li>\n<li>What is all this \"Other\" space on my iPhone/iPad?</li>\n<li><a href=\"https://apple.stackexchange.com/questions/116623/\">iTunes sometimes doesn&#39;t recognize connected device</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/102928/can-i-install-any-ios-version-i-wish-by-picking-and-choosing-which-firmware-to-r\">Can I install any iOS version I wish by picking and choosing which firmware to restore?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/104888/\">How secure is Activation Lock on iOS 7 (and later)?</a> or <a href=\"https://apple.stackexchange.com/questions/116010/\">Our iPad is locked and we&#39;re not sure of the Apple ID / iCloud password</a> or <a href=\"https://apple.stackexchange.com/questions/114985/\">How can I bypass Activation Lock?</a> These cover locked iOS devices whether you have the iCloud account to unlock it or have to resort to proving ownership to Apple to release the lock.</li>\n</ul>\n\n<h3>Game Center</h3>\n\n<ul>\n<li>How can I fix my Clash of Clans Villages or online account?</li>\n</ul>\n\n<h3>Mac / OS X</h3>\n\n<ul>\n<li>How can I download an older version of OS X?</li>\n<li>How can I change PATH in Terminal and make it stick?</li>\n<li><a href=\"https://apple.stackexchange.com/questions/30552/os-x-computer-name-not-matching-what-shows-on-terminal\">OS X computer name not matching what shows on terminal</a></li>\n<li>Memory management and usage (<em>do I need to say more?</em>)</li>\n<li>Are Kernel Panics harmful? - <a href=\"https://apple.stackexchange.com/questions/74209/\">How serious are occasional kernel panics?</a>  </li>\n<li><a href=\"https://apple.stackexchange.com/questions/14869/\">How can I troubleshoot Kernel Panics on my iMac</a>  </li>\n<li><a href=\"https://apple.stackexchange.com/q/5353/88313\">How can I figure out what&#39;s slowly eating my HD space?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/116611/how-can-i-get-back-a-system-file-after-deleting-it-from-my-mac\">How can I get back a system file after deleting it from my Mac?</a> (with a meta post <a href=\"https://apple.stackexchange.com/questions/116482/usr-bin-codesign-from-mac-10-9/116483#comment136260_116483\">discussing this file recovery method</a>)</li>\n<li><a href=\"https://apple.stackexchange.com/questions/74209/how-serious-are-occasional-kernel-panics\">How serious are occasional kernel panics?</a></li>\n<li><a href=\"https://apple.stackexchange.com/q/236741/88313\">Single application not showing up in Spotlight</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/288995\">Loss of Internet while on VPN on Mac</a> (VPN split tunnel isn’t allowed)</li>\n<li><a href=\"https://apple.stackexchange.com/questions/20889/how-do-i-write-to-ntfs-drives-in-os-x\">How do I write to NTFS drives in OS X?</a></li>\n</ul>\n\n<h3>Development for iOS</h3>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/15092/is-it-possible-to-develop-an-ipad-or-iphone-app-without-an-ipad-or-iphone\">Is it possible to develop an iOS app without a test device?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/3295/\">What are minimum specs for a MacBook to develop iOS apps?</a> (and possibly <a href=\"https://apple.stackexchange.com/questions/6650/\">Is the white MacBook suitable for software development?</a> or <a href=\"https://apple.stackexchange.com/questions/7495/\">Which Mac to develop iPhone apps?</a> )</li>\n</ul>\n\n<h3>Development or iTunes Connect</h3>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/102961/how-to-upgrade-individual-developer-account-to-a-company-account\">How to upgrade Individual Developer Account to a Company Account?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/294421/what-happens-when-a-distribution-certificate-expires-or-revoked\">What happens when a distribution certificate expires or revoked?</a></li>\n</ul>\n\n<h3>Daemons</h3>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/57514/what-is-assistantd\">What is assistantd?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/294666/what-is-hidd\">What is &quot;hidd&quot;?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/178895/what-is-nfsd-on-macos\">What is nfsd on macOS?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/266989/what-is-parsecd\">What is parsecd?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/159809/what-is-secd\">What is &quot;secd&quot;?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/294291/what-is-touristd\">What is touristd?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/212970/what-is-usernoted-and-why-is-it-eating-my-cpu\">What is &quot;usernoted&quot; and why is it eating my CPU?</a></li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"61744","LastEditDate":"2017-08-09T10:03:20.090","LastActivityDate":"2017-08-09T10:03:20.090","CommentCount":"11","CommunityOwnedDate":"2017-07-17T10:44:01.810"},{"Id":"2420","PostTypeId":"1","CreationDate":"2015-03-28T16:07:09.877","Score":"2","ViewCount":"26","Body":"<p>It has been suggested that we have a canonical question  on what machine can be used to develop with \ne.g.</p>\n\n<ul>\n<li><p><a href=\"https://apple.stackexchange.com/questions/3295/\">What are minimum specs for a MacBook to develop iOS apps?</a> (and possibly <a href=\"https://apple.stackexchange.com/questions/6650/\">Is the white MacBook suitable for software development?</a> or <a href=\"https://apple.stackexchange.com/questions/7495/\">Which Mac to develop iPhone apps?</a> </p>\n\n<p>The first one is simply</p></li>\n</ul>\n\n<blockquote>\n  <p>I want to buy a MacBook to develop iOS apps. What are the minimum requirements?</p>\n</blockquote>\n\n<p>I would suggest that this is difficult to do - I am raising issues here so the question looks very slanted - so I think the best way to show agreement or not is using metas different meaning of down votes - a dozen vote does not mean the question is bad just that you disagree with it. (Or someone can see how to edit this into a neutral question)</p>\n\n<p>The issue that I would raise is how can we keep this up to date. This question was asked in Sept 2010. The comments and answers imply that the base model with 4GB RAM would be sufficient. However nowadays I would suggest that Xcode takes more memory and you need 8GB. </p>\n\n<p>I also think this is not objective as development covers a lot of things. Simple web front end development in HTML and CSS needs no more than add ins to a browser whilst writing large C/C++/Objective C/Java programs require much CPU and memory for compilation.</p>\n\n<p>What possibly could be done as occurs in the uprooted answers is to emphasis which parts of a Mac are worth upgrading e.g. RAM to a certain level, then SSD rather than Hard disk and then also CPU e.g. <a href=\"https://apple.stackexchange.com/questions/178325/is-it-better-to-have-more-cores-or-higher-processor-clock-speed-to-decrease-buil/178350#178350\">this</a></p>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-03-31T18:58:40.473","Title":"Canonical question on hardware specs","Tags":"<discussion><canonical-questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"2421","PostTypeId":"2","ParentId":"2420","CreationDate":"2015-03-28T17:55:08.683","Score":"1","Body":"<p>I think there are two edges to this sword:</p>\n\n<ol>\n<li><p>The minimum requirements are really that. Absolute minimum - I really like steering one question on the site to be just that. Apple authors first party tools to create iOS apps and they are Xcode. If your Mac runs Xcode - it can develop apps. Full stop.</p></li>\n<li><p>Opinions on what makes a reasonable minimum setup will vary. In fact, it has to vary. A student in a country that has no Apple stores, perhaps limited access to the internet very rightly could want to know what is needed to program an iOS app. They might rightly not care about the latest and greatest and would need an answer taking their requirements into factor. Similarly, someone with three Macs and a budget might very rightly consider hardware that meets the minimum requirements not a solution even worth entertaining. Their answer would rightly not care about budget and really be asking about workflow and efficiency.</p></li>\n</ol>\n\n<p>For the good of the site - I want to find and identify the question that best handles case 1. It would link to Apple's Xcode page and perhaps the minimum requirements page to run OS X. It would then be a resource to teach people the baseline and/or a place to hilight alternative answers covering non-first party tools.</p>\n\n<p>At that point, we have a solid baseline and a link to meta with \"the one\" or \"the few\" canonical questions. From there, we can then entertain and/or close questions of the nature of \"I need storyboards and home kit to develop iOS apps and debug them\" vs \"I'm a student and I need a project to spend 40 hours over the next three months - will my Uncle's hand-me-down iMac running 10.6.8 and Xcode 3 be enough to program my jailbroken iPod stuck at iOS 5.1.2\"</p>\n\n<p>If this all makes sense - the work will be for 10k users to identify and help isolate or edit questions to serve as #1 and not get stuck changing a type #2 question. That will a) irritate the OP b) be more of a mess in general since opinions have to vary based on budget and goals. If we can't find a good #1 question, then you or I will need to ask it and leave all the existing questions to serve role #2.</p>\n","OwnerUserId":"5472","LastEditorUserId":"22824","LastEditDate":"2015-03-31T18:58:40.473","LastActivityDate":"2015-03-31T18:58:40.473","CommentCount":"1"},{"Id":"2422","PostTypeId":"1","AcceptedAnswerId":"2423","CreationDate":"2015-03-29T05:37:26.103","Score":"0","ViewCount":"30","Body":"<p>Once upon a time, I thought I could approve edits.</p>\n\n<p>Now I get this:</p>\n\n<blockquote>\n  <p>This suggestion still needs 1 approve vote from other reviewers. Close this popup (or hit Esc) to continue.</p>\n</blockquote>\n\n<p>Did something change (and I missed the memo) or am I just mistaking?</p>\n","OwnerUserId":"46541","LastEditorUserId":"37797","LastEditDate":"2015-03-29T09:07:21.163","LastActivityDate":"2015-03-29T09:12:08.873","Title":"What is required to approve suggested edits?","Tags":"<support><suggested-edits>","AnswerCount":"1","CommentCount":"0"},{"Id":"2423","PostTypeId":"2","ParentId":"2422","CreationDate":"2015-03-29T08:20:44.853","Score":"4","Body":"<p>You've never been able to single-handedly approve suggested edits (except on your posts).</p>\n\n<p>Suggested edits require two approve or reject votes before being committed. If you are the first reviewer (or second if you disagreed with the first) then another review vote is still required.</p>\n\n<p>With regard to <a href=\"https://apple.stackexchange.com/review/suggested-edits/101814\">your last review</a>, you were the first to approve it and you couldn't have approved it solely yourself as it wasn't suggested on one of your posts. Therefore it required a second person to approve it for it to be approved, which is what occurred.</p>\n\n<p>This isn't the first time you've approved something first; <a href=\"https://apple.stackexchange.com/review/suggested-edits/38462\">this one was approved</a> first by you then by me. In the same vein, <a href=\"https://apple.stackexchange.com/review/suggested-edits/51182\">you rejected this one</a> first, but it wasn't rejected until the second person rejected it.</p>\n\n<p>For more information on suggested edits, see:</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/76251\">How do suggested edits work?</a></li>\n</ul>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-03-29T09:12:08.873","CommentCount":"5"},{"Id":"2424","PostTypeId":"2","ParentId":"1629","CreationDate":"2015-03-29T09:42:35.040","Score":"2","Body":"<p>I tend to drop a line into the 'other' category if there is some doubt, if the post needs simply a more experienced eye cast over it for confirmation, or if it definitely needs migrating to the question body itself; a task I'm assuming only mods can do. </p>\n\n<p>I do wish there was a sub-heading for 'not an answer' to split the 3 possibilities -  comment, new question, delete - because 'not an answer' in itself is a tad vague.<br>\nI'm fully aware that being a lousy answer doesn't qualify it for deletion, so I tend to down-vote &amp;/or post a comment on those; but some of them are frankly far less clear than a question we would have all flagged to close within an hour.</p>\n\n<p>Also, being an 'answer' there's no <em>close</em> or equivalent voting available, unless [I think] it was already in the LQP review queue (correct me if I'm wrong on that), so the only option sometimes is to throw it into the mod queue.  </p>\n\n<p>I constantly keep my copy/paste cheat-sheet of the 'close options' open on my desktop to throw into some of the more obvious disasters ;-)</p>\n","OwnerUserId":"85275","LastActivityDate":"2015-03-29T09:42:35.040","CommentCount":"0"},{"Id":"2425","PostTypeId":"1","CreationDate":"2015-03-29T12:19:02.797","Score":"0","ViewCount":"24","Body":"<p>I was writing a question on <a href=\"http://apple.stackexchange.com\"><em>Ask Different</em></a>. With Safari on iOS&nbsp;8.2 on my iPad.</p>\n\n<p><strong>The text area has a nice handle to make it taller. However, this does not work. It would be nice to make this work on iPad.</strong></p>\n\n<p>Thank you.</p>\n","OwnerUserId":"38177","LastActivityDate":"2015-03-29T12:19:02.797","Title":"The handle to make the text area taller does not work on Safari on iPad","Tags":"<bug><questions><asking-questions><ipad><user-interface>","AnswerCount":"0","CommentCount":"1","FavoriteCount":"1"},{"Id":"2426","PostTypeId":"1","CreationDate":"2015-04-02T14:32:46.920","Score":"4","ViewCount":"82","Body":"<p>The community has been doing a good job closing opinion based questions, but I wanted to see if there was community support for adding a new close reason to make it very clear to the OP how to improve a question when we choose to close them for opinion based and hardware shopping reasons.</p>\n\n<p>In addition to the default close reason (<em>This question does not appear to be about Apple hardware or software within the scope defined in the help center.</em>) and the two custom Off-Topic Close Reasons: (<em>Questions about software development are off-topic here, but can be asked on Stack Overflow.</em> and <em>Questions about pre-release products and services are off-topic.</em> )</p>\n\n<p>I'm proposing to add a third custom close reason:</p>\n\n<h1>Questions asking us to <a href=\"https://meta.stackoverflow.com/questions/254393/what-exactly-is-a-recommendation-question\">recommend or find</a> a Mac, book, tool, tutorial or other off-site resource are generally off-topic for Ask Different as they tend to attract opinionated answers and spam. Instead, edit this question to describe the problem and what has been done so far to solve it.</h1>\n\n<p>Yea, Nea or \"yes but it should be edited\" answers requested. As long as we have a majority of \"yes\" we can refine the wording, intent and links in the answer and make the change without needing to retire any current close reasons.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T09:16:27.723","LastActivityDate":"2015-04-08T15:33:43.473","Title":"Adding a close reason to explain why recommendations (hardware, book) are Off Topic","Tags":"<discussion><close-reasons>","AnswerCount":"2","CommentCount":"1","FavoriteCount":"1"},{"Id":"2427","PostTypeId":"2","ParentId":"2426","CreationDate":"2015-04-02T14:53:45.163","Score":"3","Body":"<p>Sounds good! I was using very similar wording, also inspired by the Stack Overflow close reason, as a custom close reason in the free-form box on the close dialog.</p>\n\n<p>I like the wording as it stands: concise and objectified, providing sufficient information for the OP to understand not just why their question was closed but <em>why</em> it was closed, as well as a nice link which I rarely included myself. Seems perfect!</p>\n\n<p>An official close reason for this would lead to more consistency across the community.</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2015-04-08T15:33:24.063","LastActivityDate":"2015-04-08T15:33:24.063","CommentCount":"3"},{"Id":"2429","PostTypeId":"1","AcceptedAnswerId":"2490","CreationDate":"2015-04-03T20:09:52.283","Score":"-7","ViewCount":"98","Body":"<p>Often when I return to a question I find my comment deleted. Yes I know the purpose of the comment field, so no need to lecture me on that.</p>\n\n<p>Most of the time I just think I just forgot (result of getting senile, which is a possibility considering the advanced age), and did not make a comment in first place, but quickly I am coming to a conclusion it was there but it is deleted.</p>\n\n<p>Is there a way to get notified when my comment was deleted. </p>\n\n<p>Is there a common guide when to delete the comments?</p>\n\n<p>Since that can only be done by a moderator it should be easy to be notified and the reason for it, so to improve.</p>\n\n<p>Here is a <a href=\"https://apple.stackexchange.com/q/179369/46541\">sample of most recent comments</a> (none was deleted so far) and yes it contains potential answer. So what is wrong with that if at all?</p>\n\n<p><img src=\"https://i.stack.imgur.com/UtuJO.jpg\" alt=\"comments\"></p>\n","OwnerUserId":"46541","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-05-18T01:24:27.440","Title":"What happens with deleted comments","Tags":"<discussion><comments>","AnswerCount":"4","CommentCount":"6"},{"Id":"2430","PostTypeId":"2","ParentId":"2429","CreationDate":"2015-04-03T20:27:35.627","Score":"7","Body":"<blockquote>\n  <p>Yes I know the purpose of the comment field, so no need to lecture me on that.</p>\n</blockquote>\n\n<p>I would disagree that this is the case. The question your asking here is proof of that.</p>\n\n<p>Comments are intentionally disposable. From <a href=\"https://meta.stackexchange.com/questions/19756/how-do-comments-work\">How do comments work?</a>:</p>\n\n<blockquote>\n  <p>Comments exist so that users can talk about questions and answers\n  without posting new answers that do not actually answer their parent\n  questions. Comments are often used to ask for clarification on,\n  suggest corrections to and provide meta-information about posts.</p>\n  \n  <p>Comments are intentionally short, having maximum length of 600\n  characters, and allow only limited markup. URLs in comments\n  automatically become hyperlinks. Each user may post only one comment\n  every 15 seconds.</p>\n  \n  <p>Comments are disposable: unlike posts, there's no revision history,\n  and they can be deleted without warning by their authors, by\n  moderators, and in response to flags.</p>\n</blockquote>\n\n<p>As for why your comments are disappearing, if they weren't deleted by you, they have been flagged by other users or a moderator. Again, from that meta post:</p>\n\n<blockquote>\n  <p>Comments that are flagged by multiple users are deleted automatically.\n  The number of flags needed is based on the comment's score. It\n  currently takes \"3 + (Score / 3)\" flags to delete a comment.</p>\n  \n  <p>Moderators can delete any comment, or purge all comments from a post.</p>\n</blockquote>\n\n<p>Specifically, from that meta post, I draw your attention to:</p>\n\n<blockquote>\n  <p>You should not expect them to be around forever: Once a clarification\n  has been made, an edit added to the post to include new information,\n  or the issue in the comment is otherwise resolved, it is subject to\n  deletion. In reality, many obsolete or chatty comments remain\n  untouched due to the high volume of comments posted, but this does not\n  mean that they can't or shouldn't be deleted in the future.</p>\n</blockquote>\n\n<p>I would characterize your commenting behaviour on the site as being \"overly chatty\" and thus you see a high number of your comments removed.</p>\n\n<p>In any case, you shouldn't be making comments as a permanent record of anything on Stack Exchange sites. They are to be \"used to ask for clarification on, suggest corrections to and provide meta-information about posts\" -- not for providing witty remarks, \"thank you\" type posts or for long-drawn out back-and-forth discussions on questions and answers.</p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-04-03T20:33:24.877","CommentCount":"2"},{"Id":"2431","PostTypeId":"2","ParentId":"2429","CreationDate":"2015-04-03T20:28:28.930","Score":"4","Body":"<p>I delete a lot of comments. Usually they are flagged for deletion. There's no way I know to track it. It would help us as well - if we ended up deleting 100 comments from one user where there was a pattern, it would be nice to be able to see that and address it head on and with data as opposed to \"human recollection\" which can be faulty at best. </p>\n\n<ul>\n<li>Let's spin your feature request off as a separate question.</li>\n</ul>\n\n<p>As to when I recall deleting comments from you in particular - when you are answering the question in a comment - it often goes, especially if that answer has been provided by you or another. Please don't do that going forward - if you are trying to clarify the question - do that in the comments. If the author needs to troubleshoot or you know how to troubleshoot that - make an answer stating that here's how you would troubleshoot the situation.</p>\n\n<p>Since comments are never meant to last - there's no notification of edits or deletions. There's no wiki revision history. If you are putting information into a comment that merits that level of information - that's a good sign you should be asking on meta or chatting or editing the post or just making an answer.</p>\n\n<p>Without looking into specifics it's hard to know if I'm the deleter or if other moderators are also deleting comments.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2015-04-03T20:55:51.950","LastActivityDate":"2015-04-03T20:55:51.950","CommentCount":"7"},{"Id":"2432","PostTypeId":"2","ParentId":"2429","CreationDate":"2015-04-04T01:40:37.490","Score":"3","Body":"<h1>No</h1>\n\n<p>No, there is not a way to get notified when your comment was deleted.</p>\n\n<p>No, there is not a common guide when to delete the comments.</p>\n\n<p>Comments are temporary. They frequently get deleted, and are designed to not endure. If a comment is removed, that dos not necessarily mean you did something wrong (although sometimes it does). Comments are like the grass of the fields. The grass withers, the flowers fade. <em>Sic transit gloria mundi</em>.</p>\n","OwnerUserId":"9388","LastActivityDate":"2015-04-04T01:40:37.490","CommentCount":"3"}]