[{"Id":"1135","PostTypeId":"2","ParentId":"1133","CreationDate":"2012-02-22T17:59:08.000","Score":"1","Body":"<p>Quite a while ago I asked an OS X Server question here, and then when I had little traffic and no answers, I flagged it for migration to Server Fault. Suggesting you do the same obviously carries a lot of my own personal bias, but I suggest this route as well.</p>\n\n<p>I know there are a few users around here with some server administration experience, so if you feel that it's at all possible to have enough traffic and a potential answer here it'd be wonderful if you started the question here.</p>\n\n<p>You are in charge of your own question, so at any time you can flag it and ask us to send it over to Super User or Server Fault, or anywhere else it's on-topic in the network for that matter.</p>\n","OwnerUserId":"1346","LastActivityDate":"2012-02-22T17:59:08.000","CommentCount":"0"},{"Id":"1136","PostTypeId":"1","AcceptedAnswerId":"1137","CreationDate":"2012-02-22T22:53:29.203","Score":"1","ViewCount":"53","Body":"<p>I've only cast three votes on meta this week, and yet I was just awarded the Vox Populi badge. I see there was a spate of awarding this particular badge, but I haven't noticed a spate of meta voting.</p>\n","OwnerUserId":"9388","LastEditorUserId":"5472","LastEditDate":"2013-09-26T21:11:42.833","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Why were a whole bunch of users just awarded the Vox Populi badge on meta?","Tags":"<bug><status-bydesign><badges>","AnswerCount":"1","CommentCount":"3","ClosedDate":"2012-02-25T06:48:57.100"},{"Id":"1137","PostTypeId":"2","ParentId":"1136","CreationDate":"2012-02-22T23:09:14.017","Score":"3","Body":"<p>We just deployed a change that affects the voting badges.  This is why you see a number of these badges being awarded.</p>\n\n<p>For more information about this change, you can see <a href=\"https://meta.stackexchange.com/a/123048/140548\">this answer</a>.</p>\n\n<p>Note that there was a bug with Vox Populi only that awarded too many of them (beyond the expected more for retroactive awards) and a fix has been deployed.  The erroneous awards have been cleaned up.</p>\n","OwnerUserId":"884","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2012-02-22T23:09:14.017","CommentCount":"1"},{"Id":"1138","PostTypeId":"1","CreationDate":"2012-02-23T14:10:36.140","Score":"1","ViewCount":"24","Body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"https://apple.meta.stackexchange.com/questions/1029/could-the-voted-unvoted-button-artwork-be-further-differentiated-on-meta-apple\">Could the voted/unvoted button artwork be further differentiated on meta.apple?</a>  </p>\n</blockquote>\n\n\n\n<p>I must be getting old. I have a hard time telling when I've voted on meta questions. The registered vote arrow is too close in contrast to the unregistered vote arrow.</p>\n\n<p><img src=\"https://i.stack.imgur.com/rk7Cc.png\" alt=\"Registered vs. unregistered vote arrows\"></p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-02-23T14:10:36.140","Title":"Can we make the registered vote arrow more obvious on meta-se?","Tags":"<feature-request><graphics>","AnswerCount":"0","CommentCount":"0","ClosedDate":"2012-02-23T14:47:04.150"},{"Id":"1140","PostTypeId":"1","CreationDate":"2012-02-24T15:59:32.653","Score":"3","ViewCount":"200","Body":"<p>Come join Ask Different and <a href=\"http://drbrendan.com/\" rel=\"nofollow\">Dr. Brendan</a> for a party to honor Steve Jobs on his birthday. The party will start around 3 pm EST, and will take place outside the flagship Apple Store in NYC (59th Street and Fifth Avenue). </p>\n\n<p>There will be black turtlenecks, cupcakes, and dancers. For more information, see this <a href=\"http://www.nypost.com/p/news/business/fans_day_fete_for_jobs_HQzFUcSxhYb531oFfG6kmJ\" rel=\"nofollow\">New York Post article</a> covering the event. This event was also <a href=\"http://video.cnbc.com/gallery/?video=3000075169\" rel=\"nofollow\">covered by CNBC</a> this morning, so we're hoping for a great turnout! </p>\n\n<p>If you can't make it to the event, we will be live tweeting it from @StackApple, so follow along!</p>\n","OwnerUserId":"13125","LastEditorUserId":"11241","LastEditDate":"2012-02-24T17:20:27.087","LastActivityDate":"2012-03-01T19:55:10.447","Title":"NYC area users - join us to celebrate Steve Jobs' Birthday!","Tags":"<discussion>","AnswerCount":"1","CommentCount":"7","FavoriteCount":"0"},{"Id":"1141","PostTypeId":"1","CreationDate":"2012-02-24T17:47:14.940","Score":"-6","ViewCount":"130","Body":"<p>When ever i asked question in this forum. i got some common comments like what is your system's specifications. \nSo i want to propose this feature request that while registering, user should provide the specifications of his system and it will be shown on mouse over event or something.</p>\n\n<p>I will also feel comfortable when i have some knowledge of system requirements of OP system.</p>\n","OwnerUserId":"7451","LastEditorUserId":"9388","LastEditDate":"2012-02-24T17:55:07.350","LastActivityDate":"2012-02-27T17:12:27.903","Title":"I think system specifications should show as signature?","Tags":"<discussion><feature-request>","AnswerCount":"7","CommentCount":"2"},{"Id":"1142","PostTypeId":"2","ParentId":"1141","CreationDate":"2012-02-24T17:52:53.560","Score":"8","Body":"<p>Stack Exchange as a whole does not do signatures. When I'm reading a question regarding an iOS device, I hate skimming over way too-many lines of Desktop/Laptop specifications, especially when they delve into listing certain low-level apps that they felt were relevant when creating their signature.</p>\n\n<p>Not to even mention how out-of-date this information gets.</p>\n\n<p>It is, in my opinion, not unreasonable to expect the user asking a question to provide this information when necessary.</p>\n","OwnerUserId":"1346","LastActivityDate":"2012-02-24T17:52:53.560","CommentCount":"1"},{"Id":"1143","PostTypeId":"2","ParentId":"1141","CreationDate":"2012-02-24T17:54:47.367","Score":"6","Body":"<p>A question should contain the information needed to solve the OP's problem. Sometimes that does include system information. Sometimes it does not. Some users have more than one system. Some users' systems change over time.</p>\n\n<p>An automated system <em>might</em> reduce the number of information requests needed to answer a question, or it might provide wrong/out-of-date information that still requires information requests.</p>\n\n<p>I would suggest that this piece of complexity would not be merited by the problems it might solve.</p>\n","OwnerUserId":"9388","LastActivityDate":"2012-02-24T17:54:47.367","CommentCount":"0"},{"Id":"1144","PostTypeId":"2","ParentId":"1141","CreationDate":"2012-02-24T18:02:14.750","Score":"12","Body":"<p>I've seen similar systems implemented on other sites (like the Apple Discussions).</p>\n\n<p>The idea is good (force people to know and tell us their system info), but this kind of feature isn't always helpful or practical, for a few reasons:</p>\n\n<ul>\n<li><strong>It isn't always necessary</strong><br>\nMany questions (especially those that relate to software) don't require system info.</li>\n<li><strong>All of it is never necessary</strong><br>\nI've never seen a question that requires background about every single piece of hardware that the asker owns. Unless there was a good way to only include the relevant system info, having it all there would be distracting and confusing ('Wait, is it the MacBook or the iMac that has the problem?')</li>\n<li><strong>It takes up a lot of space</strong><br>\nListing every piece of software and hardware that you own takes up space and adds clutter. There's no reason to take up more space outside of a question's body, especially when system info isn't relevant.</li>\n<li><strong>People forget to update it</strong><br>\nIn my experience, people are more likely to include current system info if they write it into their question as they're asking. Centralized info (profile-linked) tends to be forgotten about and gets stale.</li>\n</ul>\n\n<p>I don't think that adding system info to the signature is the right path to take.</p>\n\n<p>What I would like to see, though, is another 'reminder' item shown while posting a question that tells people to be sure to include all relevant hardware and software information.</p>\n\n<p>Of course people wouldn't always follow it, but commenting and asking for info is easy, and people generally respond to it.</p>\n","OwnerUserId":"2220","LastActivityDate":"2012-02-24T18:02:14.750","CommentCount":"2"},{"Id":"1145","PostTypeId":"2","ParentId":"1141","CreationDate":"2012-02-24T19:08:58.203","Score":"3","Body":"<p>A distinct point that I just thought of; In some cases, at least for myself personally (and maybe also bmike?), I have routinely asked questions on behalf of another individual. Or in other cases, I've asked questions that relate to hardware at work.</p>\n\n<p>In this case, it was just a software (OS X Server) question, but had it been a hardware question, it would have been <em>another</em> entry I'd have to add into some constrained system that you're proposing.</p>\n\n<p>The answer is really very simple:</p>\n\n<p>Add the detail that is relevant to the question you ask, no more, and certainly no less.</p>\n","OwnerUserId":"1346","LastActivityDate":"2012-02-24T19:08:58.203","CommentCount":"0"},{"Id":"1146","PostTypeId":"2","ParentId":"1141","CreationDate":"2012-02-24T19:19:37.570","Score":"9","Body":"<p>I strongly oppose this. One of the HUGE problems in searching the internet and finding a result on the Apple discussion forums is that very often the machine I'm searching for isn't mentioned anywhere in the thread, but instead in someone's signature on the page as one of a litany of machines they happened to own. Very frustrating if you need to find an answer. If Ask Different allowed this, we would have the same problem.</p>\n","OwnerUserId":"13","LastEditorUserId":"13","LastEditDate":"2012-02-24T19:30:56.917","LastActivityDate":"2012-02-24T19:30:56.917","CommentCount":"0"},{"Id":"1147","PostTypeId":"2","ParentId":"1141","CreationDate":"2012-02-27T09:44:37.467","Score":"4","Body":"<p>Don't think any further answers are required, but I'll add a small point anyway, which is that if everyone on here did this, every question ever would look like a roll call of who chugged the most Kool-aid.  Putting my 3 macs, 1 iPad, 2 iPhones, 1 iPod Touch, 2 Airport Extreme Routers, 1 Time Capsule, Magic Trackpad and various other keyboard/mouse accessories etc would make every question waste as much space as this answer, especially given that generally speaking it's software levels, not hardware, that is the most pertinent piece of config info required to effectively assist.</p>\n","OwnerUserId":"9495","LastActivityDate":"2012-02-27T09:44:37.467","CommentCount":"0"},{"Id":"1148","PostTypeId":"2","ParentId":"1141","CreationDate":"2012-02-27T17:12:27.903","Score":"3","Body":"<p>I also strongly oppose this for the exact same reasons that everyone else has.<br>\nHowever, my suggestion is <em>not</em> to add a new feature to Ask Different. I would suggest you save a document with all the specs for your machines/devices. Then when you need the specs, you can just copy/paste. You could also create a TextExpander shortcut.</p>\n","OwnerUserId":"7833","LastActivityDate":"2012-02-27T17:12:27.903","CommentCount":"0"},{"Id":"1149","PostTypeId":"1","CreationDate":"2012-02-28T00:19:16.493","Score":"20","ViewCount":"499","Body":"<p>I've put together a <a href=\"https://stackapps.com/questions/3081/senotifier-a-stack-exchange-inbox-notifier-for-mac-os-x\">status bar notifier for Stack Exchange sites</a> (inspired by Google Notifier) and I thought I'd ask here to get some feedback on a couple of things.</p>\n\n<p><a href=\"http://hewgill.com/senotifier/senotifier.png\" rel=\"nofollow noreferrer\">screenshot http://hewgill.com/senotifier/senotifier.png</a></p>\n\n<p>I've developed this on Lion and am curious about whether it works on previous releases of OS X (or whether this even matters very much, in practical terms). This is my first Mac OS X app ever, so I'm not even sure what issues are important.</p>\n\n<p>Also, it sort of needs an application icon, so if you're feeling inclined, artwork would get you a mention and a link in the About panel!</p>\n\n<p>Any other comments and suggestions are welcome.</p>\n","OwnerUserId":"9428","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:25:39.367","LastActivityDate":"2012-03-22T10:29:12.030","Title":"SENotifier, a Stack Exchange inbox notifier for Mac OS X","Tags":"<discussion><inbox>","AnswerCount":"2","CommentCount":"5","FavoriteCount":"3"},{"Id":"1151","PostTypeId":"2","ParentId":"1153","CreationDate":"2012-02-28T19:07:12.633","Score":"2","Body":"<p>I believe this type of question will be down-voted since it's an open-ended question and it's doubtful there could be one correct answer. </p>\n","OwnerUserId":"1700","OwnerDisplayName":"gary comtois","LastEditorUserId":"1700","LastActivityDate":"2012-02-28T19:07:12.633","CommentCount":"1"},{"Id":"1152","PostTypeId":"2","ParentId":"1153","CreationDate":"2012-02-28T19:08:31.687","Score":"7","Body":"<p>While I can't speak directly for the sub-culture of the Ask Different site, I don't feel that <em>either</em> question is suitable for the site.</p>\n\n<p>Both of these questions are nothing more than lists (or requests for lists) and badly maintained ones at that.  Specifically, the question you refer to which is still open:</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/82/which-os-x-applications-do-you-find-indispensable\">Which OS X Applications do you find indispensable?</a></p>\n\n<p>Is \"Not Constructive\".  How many of you really have all 210 applications installed on your Mac? Furthermore, what is indispensable for one is almost certainly not for another. The problem where a majority of answers to the question are not selectable as being right. A handful of well intentioned answers can be read and digested in a short period of time. You can see how hard it is to get even through the first page of answers. The rest are effectively buried. Well intentioned or not, these large questions have problems of scale that don't afflict small targeted questions.</p>\n\n<p>On top of that, <a href=\"https://apple.stackexchange.com/a/354\">the highest voted answer, DropBox</a> <em>isn't even an application</em>, it's a website which has an application for the platform.</p>\n\n<p>Both of them should be closed as \"Not Constructive\".  Like the book list questions that are very contentious on Stack Overflow (to say the least), they might be valuable, and they might have a place on the Internet, but that place isn't <strong>here</strong>.</p>\n\n<p>Questions of this sort simply <em>do not</em> fit the format or vision of this site.</p>\n","OwnerUserId":"19440","OwnerDisplayName":"casperOne","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2012-02-28T23:25:32.970","CommentCount":"2"},{"Id":"1153","PostTypeId":"1","AcceptedAnswerId":"1154","CreationDate":"2012-02-28T19:13:33.190","Score":"7","ViewCount":"123","Body":"<p>Here is the question <a href=\"https://apple.stackexchange.com/questions/41969/what-input-devices-do-you-find-to-be-an-indespensable-part-of-using-your-mac\">https://apple.stackexchange.com/questions/41969/what-input-devices-do-you-find-to-be-an-indespensable-part-of-using-your-mac</a></p>\n\n<p>The question is not intended to be about shopping recommendations? After seeing other questions such as <a href=\"https://apple.stackexchange.com/questions/82/which-os-x-applications-do-you-find-indispensable\">Which OS X Applications do you find indispensable?</a> I though it would be useful for such a question to exist for hardware input devices and the things people are doing with those devices to make make an impact on their user experience.</p>\n","OwnerUserId":"17580","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2012-02-28T23:55:36.490","Title":"What is wrong with this hardware question for Ask Different and is there a better way to ask it?","Tags":"<discussion><asking-questions>","AnswerCount":"5","CommentCount":"3"},{"Id":"1154","PostTypeId":"2","ParentId":"1153","CreationDate":"2012-02-28T19:46:49.833","Score":"5","Body":"<p>There was a time when Ask Different had more list-style questions open. I've even written some of them myself, and some were closed and others stayed open. Compared to other Stack Exchange sites, we still have more than average, but we're moving in a direction where the general expectation is that a question asked expecting that there will be a single best answer that can be accepted for the question. While there might still be occasional list questions, they're the exception, not the rule, and the list generated needs to be <em>very</em> <strong>very</strong> useful.</p>\n\n<p>I think you already see how your question is different than the typical question on the site. The general expectation is that a question should be an attempt to solve a particular real-world problem. So if you were looking to do something particular (use a computer with a particular disability, for instance, or enter numbers quickly, or run a slide show from the other side of the room from your computer but also be able to jump to arbitrary slides), asking what input device someone recommends could be a very good question. But \"hey, what input devices do you use and why do you like them?\" is a direction we've been trying to move the site away from.</p>\n\n<p>It's not a bad thing to wonder about, and frankly, I'd be interested in reading the answer to a poll like that, but it's not a constructive question for our Q&amp;A problem-solving format here.</p>\n","OwnerUserId":"9388","LastActivityDate":"2012-02-28T19:46:49.833","CommentCount":"0"},{"Id":"1155","PostTypeId":"2","ParentId":"1153","CreationDate":"2012-02-28T20:20:11.603","Score":"1","Body":"<p>My biggest concern about your post is that this is very <em>unspecific</em> question and <em>unlikely</em> to be helpful to the community on the <em>long run</em>:</p>\n\n<ul>\n<li>It's not a real problem you face. </li>\n<li>Most answers will probably be valid for any computer enthousiast - no matter if he's using Windows, Linux or OSX. </li>\n<li><h3>Hardware does not get updated, but upgraded</h3>\n\n<p>We need to be aware of that a hardware upgrade is a replacement of hardware.  Why do I mean mention this? Software does not change it's name over time. When it get's a major update, the version number changes.</p>\n\n<p>With hardware, a name is closely related to a unique product. <strong>But the product becomes unavailable or outdated over time.</strong> Hence, the list of answers will become very bloated in time and require steady clean-up.</p></li>\n</ul>\n","OwnerUserId":"13414","LastEditorUserId":"13414","LastEditDate":"2012-02-28T20:27:17.430","LastActivityDate":"2012-02-28T20:27:17.430","CommentCount":"1"},{"Id":"1156","PostTypeId":"2","ParentId":"1153","CreationDate":"2012-02-28T20:43:52.110","Score":"4","Body":"<p>What sorts of answers was the \"what devices are indispensable\" were you hoping to get? What problem were you trying to solve? I feel the question would be better if you asked that deeper question and not the warm-up \"list all awesome input devices ever\" question.</p>\n\n<p>A question that allows any answer to be equally valid makes for a noisy mess.</p>\n\n<p>Who can do without a keyboard or a mouse - there's two banner answers without thinking past a millisecond.</p>\n\n<p>Now - if you had a practical problem. Say what hardware is indispensable for someone with cerebral palsy? By listing a specific condition everyone can gain value from the information, expertise and answers. I don't know if a magic mouse or a trackpad is better for someone with that level of motor skill. By having a real problem, the question becomes on topic.</p>\n\n<p>Do read up on these links for background (most of the mods have had a lot of time to think over these issues and are thusly quick to jump on questions that are likely going to run afoul of the guidelines) and let me know in the comments if any of this makes sense to your particular question here. It still can be edited into shape and reopened - just will need some consensus built about what and how it will exist given the goals of the site.</p>\n\n<ul>\n<li><a href=\"http://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/\">http://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/</a></li>\n<li><a href=\"http://blog.stackoverflow.com/2012/01/the-trouble-with-popularity/\">http://blog.stackoverflow.com/2012/01/the-trouble-with-popularity/</a></li>\n<li><a href=\"http://blog.stackoverflow.com/2011/08/the-future-of-community-wiki/\">http://blog.stackoverflow.com/2011/08/the-future-of-community-wiki/</a></li>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/697/how-to-kill-off-community-wiki-entries\">How to kill off &#39;community wiki&#39; entries</a></li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-02-28T23:55:36.490","CommentCount":"2"},{"Id":"1157","PostTypeId":"1","CreationDate":"2012-03-01T14:36:52.937","Score":"6","ViewCount":"83","Body":"<p>In the beginning, the Ask Different blog was only used to distribute podcast episodes.<br>\nThen we expanded to text articles.<br>\nNow we're expanding to videos.</p>\n\n<p>As of today, the Ask Different blog has a <a href=\"http://vimeo.com/askdifferentblog\" rel=\"nofollow\">Vimeo account</a> where we will be posting videos. We'll be starting with screencasts, and hopefully moving to other kinds of videos (hardware reviews, unboxings, iPhone release day footage, etc).</p>\n\n<p>The first video has just been published. You can see it <a href=\"http://apple.blogoverflow.com/2012/03/keyboard-ninja-working-with-text-screencast/\" rel=\"nofollow\">here</a>.</p>\n\n<p><strong>If you're interested in contributing screencasts or have any questions, let me know!</strong> Post an answer to this question or ping me in the <a href=\"http://chat.stackexchange.com/rooms/1408/ask-different-blog\">Blog chat room</a>.<br>\nHere's how the process works.  </p>\n\n<ol>\n<li>You, community member, create an awesome screencast of your Mac or iOS device (or other video).</li>\n<li>You get in touch with me so we can transfer the video file via your\npreferred method.</li>\n<li>I process the video, do any necessary editing, and add our fancy Ask\nDifferent Blog intro and outro.</li>\n<li>You create a blog post with a short writeup for your video.</li>\n<li>When the time comes, I upload the video and publish the blog post.</li>\n</ol>\n\n<hr>\n\n<p>If you're interested in playing around or processing your own screencasts, you can download the template iMovie <a href=\"http://cl.ly/0r3I210h2l3k2d1b1D22\" rel=\"nofollow\">project</a> and <a href=\"http://cl.ly/3u462v3W3N0O150Y0V2E\" rel=\"nofollow\">event</a>. Place the project in <code>~/Movies/iMovie Projects</code> and the event in <code>~/Movies/iMovie/iMovie Events</code>.</p>\n","OwnerUserId":"2220","LastEditorUserId":"2220","LastEditDate":"2012-03-03T22:22:30.973","LastActivityDate":"2012-03-03T22:22:30.973","Title":"Call for contributors: Ask Different Screencasts!","Tags":"<discussion><blog>","AnswerCount":"1","CommentCount":"4"},{"Id":"1158","PostTypeId":"2","ParentId":"1157","CreationDate":"2012-03-01T15:08:17.717","Score":"1","Body":"<p>I'm in.  As I mentioned in Chat, if the final process is to use iMovie which we all have, then creating a dummie screencast with a snippet of video that we can replace as a form of template would be good.  Then we can do the (presumably) h.264 crunchdown for you and transfer a more sensibly sized file.</p>\n","OwnerUserId":"9495","LastActivityDate":"2012-03-01T15:08:17.717","CommentCount":"3"},{"Id":"1159","PostTypeId":"2","ParentId":"1140","CreationDate":"2012-03-01T19:48:28.833","Score":"7","Body":"<p>The party was a TON of fun! The cupcakes and turtlenecks set a really great vibe and there were a few dozen people who joined us for the event. SJ's memory was celebrated in such a positive way - people were all smiles reflecting on how SJ changed their lives personally or just how much they loved their Apple products.  </p>\n\n<p>Unfortunately is was raining and cold, so people were afraid of getting their devices wet (mostly iPhones and iPods). The cupcakes also got a bit wet. All in all though, it was a memorable and happy birthday party for all the SJ admirers who attended.</p>\n\n<p>I know some people got a bad taste in their mouths about this party; I'm sorry for that. For me, the party was a fun way to remember a visionary we all looked up to and those who made it out through the rain and cold seemed to have a really great time too. I think their was certainly a problem in the communication of this event, it was written about and publicized in a way that could have obscured the true joy of the party. </p>\n\n<p>Here's a snapshot taken from one attendee's iPhone: <img src=\"https://i.stack.imgur.com/G7x2B.jpg\" alt=\"enter image description here\"></p>\n","OwnerUserId":"11241","LastEditorUserId":"11241","LastEditDate":"2012-03-01T19:55:10.447","LastActivityDate":"2012-03-01T19:55:10.447","CommentCount":"1"},{"Id":"1160","PostTypeId":"2","ParentId":"1130","CreationDate":"2012-03-01T21:46:22.247","Score":"4","Body":"<p>Congratulations to <a href=\"https://apple.stackexchange.com/users/12285/timothy-mueller-harder\">Timothy Mueller-Harder</a>, <a href=\"https://apple.stackexchange.com/users/292/ian-c\">Ian C</a>, and our esteemed moderator <a href=\"https://apple.stackexchange.com/users/9388/daniel\">Daniel</a> for making and sharing at least 3 new and awesome posts with their friends! These experts get AD shirts and stickers (because we love stickers and free clothes).</p>\n\n<p>(n.b. nobody posted 5 questions or answers and met the rest of the criteria- as we set the bar really high we're still very impressed with everyone's participation)</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2012-03-01T21:46:22.247","CommentCount":"0"},{"Id":"1161","PostTypeId":"2","ParentId":"1119","CreationDate":"2012-03-02T21:03:05.403","Score":"3","Body":"<p>In general, if a \"beta-ish\" product is part of a generally available production release shipped by Apple, questions related to that product should be fair game. Siri is a particularly good example - it's a part of a publicly available product that end users can use without downloading any special beta software package.</p>\n","OwnerUserId":"10639","LastActivityDate":"2012-03-02T21:03:05.403","CommentCount":"0"},{"Id":"1162","PostTypeId":"2","ParentId":"1149","CreationDate":"2012-03-06T06:56:03.400","Score":"1","Body":"<p>To answer your question about its compatibility with previous versions of Mac OS X, I encountered an error when trying to run the program on my Panther machine. So it does not work on 10.3.9.</p>\n","OwnerUserId":"9388","LastActivityDate":"2012-03-06T06:56:03.400","CommentCount":"1"},{"Id":"1164","PostTypeId":"1","CreationDate":"2012-03-06T20:00:22.717","Score":"9","ViewCount":"167","Body":"<p>Just wanted to let everyone know we are going to turn back on autotweeting of <a href=\"http://twitter.com/askdifferent\" rel=\"nofollow noreferrer\">@AskDifferent</a> for the time being. We experimented with tweeting manually, and now we want to see what will happen in terms of engagement if go back to autotweeting questions from our site. Right now, we haven't made any decisions about if/when we will go back to manual tweeting.</p>\n\n<hr>\n\n<p><strong>Update</strong> - we were able to find and acquire the twitter handle <a href=\"https://twitter.com/#!/askdifferent\" rel=\"nofollow noreferrer\">@askdifferent</a>! From now on, we will be using @askdifferent instead of @stackapple, so remember that if you want to @ reply or mention us. </p>\n\n<p>Psst - if you don't follow @askdifferent already, feel free to do so :-)</p>\n\n<hr>\n\n<p>Just wanted to let everyone know that we are testing out using <a href=\"https://twitter.com/#!/askdifferent\" rel=\"nofollow noreferrer\">@StackApple</a> manually. Until very recently, @StackApple was only used to autotweet questions from our site, but we think that Twitter can be a really effective tool for engaging with the Ask Different community as well as other power users of Apple products. If you decide you want to follow @StackApple, you can expect to see more varied content, including</p>\n\n<ul>\n<li>Great questions and answers</li>\n<li>Blog posts from our site</li>\n<li>Contest announcements</li>\n<li>Industry news - such as product releases and posts from places like\nMacRumors, TUAW, etc.</li>\n</ul>\n\n<p>We will also make an effort to follow and highlight our users, as outlined in <a href=\"https://apple.meta.stackexchange.com/questions/1131/assembling-a-twitter-list-of-ask-different-users\">this post</a>. Along those same lines, interacting with @StackApple on Twitter will be an easy way for people (users and non-users) to contact an employee of Stack Exchange.</p>\n\n<p>Please be aware that this is an experiment to see whether investing resources in Twitter is a worthwhile way to grow the site. For now, only @StackApple and @StackGaming are being controlled manually. <strong>This may or may not happen with other sites in the future, based on whether this experiment is successful.</strong> Decisions about other sites' Twitter accounts will be made after this experiment is concluded. We don't have a date set for those decisions, or the end of this trial run.</p>\n\n<p>Feedback on how the Twitters are being handled is welcome. Feel free to post comments, suggestions, etc. as answers here. </p>\n","OwnerUserId":"13125","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2013-09-10T14:43:56.167","Title":"How is Stack Exchange using the @StackApple and @askdifferent Twitter accounts?","Tags":"<discussion><twitter>","AnswerCount":"1","CommentCount":"1"},{"Id":"1165","PostTypeId":"2","ParentId":"1164","CreationDate":"2012-03-06T20:29:00.030","Score":"6","Body":"<p>My initial suggestion would be to get / regain control of the AskDifferent account on twitter by sending a ticket to twitter explaining that it's a trademarked property of Stack Exchange and you wish to use that account for promoting this site.</p>\n\n<p>Already, the site here is hampered by the incomplete branding where the site has two names depending on where you look. (In about half the places the name is Apple - in another half it's Ask Different).</p>\n\n<p>In many places it is known as Ask Different. An informal poll of the moderators have us 100% against keeping \"apple\" in the branding for this site due to confusion. Now you are adding StackApple to the \"nicknames\" for the site.</p>\n\n<p>I feel that the more you dilute the site name with \"apple\" - the more confusing and diluted your promotional efforts will become. I know this is swimming against the stream since all the Stack twitters start in Stack (except for ServerFault) - but I can find no other site where the twitter account has a word that isn't at all in the title. It'd be like @StackSuper_User was @StackComputers or something.</p>\n\n<p>This naming certainly doesn't really affect <em>how</em> you use the account, but it may affect the likelihood that people will identify one with the other.</p>\n","OwnerUserId":"5472","LastActivityDate":"2012-03-06T20:29:00.030","CommentCount":"4"},{"Id":"1167","PostTypeId":"1","CreationDate":"2012-03-08T17:01:33.150","Score":"7","ViewCount":"153","Body":"<p>I wanted to have some discussion on the tags for iPads.</p>\n\n<p>We currently have a need to tag questions about the hardware being released on March 16, 2012 - and Apple is calling them the new iPad.</p>\n\n<p>Pragmaticatically, we had <a href=\"https://apple.stackexchange.com/questions/tagged/ipad-3\" class=\"post-tag\" title=\"show questions tagged &#39;ipad-3&#39;\" rel=\"tag\">ipad-3</a> questions crop up even before the announcement and later a synonym was defined to map <a href=\"https://apple.stackexchange.com/questions/tagged/new-ipad\" class=\"post-tag\" title=\"show questions tagged &#39;new-ipad&#39;\" rel=\"tag\">new-ipad</a> to <a href=\"https://apple.stackexchange.com/questions/tagged/ipad-3\" class=\"post-tag\" title=\"show questions tagged &#39;ipad-3&#39;\" rel=\"tag\">ipad-3</a>.</p>\n\n<p>Until we have more time to digest how Apple will differentiate between the current <em>new</em> iPad and the original <em>then new but now no longer new</em> iPad with a <a href=\"http://support.apple.com/kb/HT1353\" rel=\"nofollow noreferrer\">canonical support article</a> - I wanted to just open a question here for answers, discussion and comments in general about tagging iPads.</p>\n\n<p>Also - please link to specific issues, discussion or problems in an answer here should you see any problems on the main site with tagging confusion around the names of iPads.</p>\n\n<p>In general - use the iPad tag and only use the new-iPad tag when the question needs the additional qualifier.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2012-03-08T17:08:06.387","LastActivityDate":"2012-03-20T10:39:54.860","Title":"Tag usage for iPads now that there are three generations","Tags":"<discussion><tags>","AnswerCount":"5","CommentCount":"2"},{"Id":"1169","PostTypeId":"2","ParentId":"1167","CreationDate":"2012-03-08T21:22:58.923","Score":"5","Body":"<p>I dislike using <code>new-ipad</code> as a tag because it has a built-in expiration date - when the next iPad comes out the current one will no longer be the new one. Because of this, I'd like to use the generation number in the tag, like perhaps <code>ipad-3rd-generation</code>, <code>ipad-2012</code> or even <code>ipad-3</code> and define <code>new-ipad</code> as a synonym for those that we can redefine when a new iPad comes out.</p>\n","OwnerUserId":"13","LastActivityDate":"2012-03-08T21:22:58.923","CommentCount":"3"},{"Id":"1170","PostTypeId":"1","CreationDate":"2012-03-09T11:26:14.523","Score":"4","ViewCount":"56","Body":"<p>I've seen \"added 23 characters in body,\" \"edited body,\" and \"fixed capitalization in title.\" Which of these types of summaries (or another entirely) should we use?</p>\n","OwnerUserId":"12285","LastActivityDate":"2012-03-09T11:41:33.757","Title":"What's the best kind of edit summary?","Tags":"<discussion><editing>","AnswerCount":"1","CommentCount":"0"},{"Id":"1171","PostTypeId":"2","ParentId":"1170","CreationDate":"2012-03-09T11:30:15.657","Score":"7","Body":"<p>You should describe what changes you made, and if necessary why you made them. Edit summaries like \"added 23 characters in body\" are automatically generated if you didn't provide one when editing. Sometimes this is OK if the edit is really simple or you don't have much time, but you really should always put something in there yourself when you can. It doesn't have to be long (or even a full sentence) but it should contain the essence of the changes you made. Like the edit on this post.</p>\n\n<p>Admittedly, the majority of my edits have the automatically generated summaries, but that's because a lot of my edits are moderation-related. However, most users will edit to change the content, and in those cases the description is important.</p>\n","OwnerUserId":"13","LastEditorUserId":"13","LastEditDate":"2012-03-09T11:41:33.757","LastActivityDate":"2012-03-09T11:41:33.757","CommentCount":"4"},{"Id":"1174","PostTypeId":"2","ParentId":"1167","CreationDate":"2012-03-09T18:50:09.530","Score":"3","Body":"<p>By all appearances, Apple is moving along the path it uses for iPod (classic and touch) and computers. The new machine is the iPad (Third Generation). Though the predecessor was known as the iPad 2 (likely to make it easier to identify cases and such), it's safe enough to ignore the market nomenclature and think of it as the iPad (Second gen.). Apply the same logic to the original iPad.</p>\n\n<p>I suggest using the tags <code>ipad</code> as the over all category (which likely addreeses most questions at this time, relatively little is model specific, though that will change as the original model nears end of usable life) and the specialized <code>ipad-1</code>, <code>ipad-2</code> and <code>ipad-3</code> if it's necessary to identify specific models.</p>\n\n<p>This seems to be the simplest and most direct classification. </p>\n","OwnerUserId":"11791","LastEditorUserId":"11791","LastEditDate":"2012-03-12T15:11:24.650","LastActivityDate":"2012-03-12T15:11:24.650","CommentCount":"2"},{"Id":"1175","PostTypeId":"2","ParentId":"1167","CreationDate":"2012-03-10T03:30:29.607","Score":"9","Body":"<p>I think there should be no model specific tags at all. All three iPads are virtually identical and there is no need to categorise questions that are specific to an individual model.</p>\n\n<p>We don't have an <code>ipad-wifi</code> tag, or an <code>ipad-16gb</code> tag, even though these are far more significant distinctions than what generation a user has. We also don't have an <code>ipad-1</code> tag by the way.</p>\n\n<p>There are questions tagged <code>ipad-2</code>, <code>ipad-3</code> and <code>new-ipad</code>... I think these should be deleted/merged into just <code>ipad</code>.</p>\n\n<p>Anything in your question that is specific to an individual iPad model should be in the question text or (perhaps) it's title. In these cases, the new model is officially referred to as the 3rd generation iPad.</p>\n\n<p>I just had a look at a whole page full of questions tagged <code>ipad-2</code> and virtually every single one of them was not at all specific to the 2nd generation iPad. They should have been tagged <code>ipad</code> instead.</p>\n","OwnerUserId":"9090","LastEditorUserId":"9090","LastEditDate":"2012-03-10T03:35:37.853","LastActivityDate":"2012-03-10T03:35:37.853","CommentCount":"0"},{"Id":"1176","PostTypeId":"1","CreationDate":"2012-03-11T15:56:39.853","Score":"4","ViewCount":"62","Body":"<p>The Tags page, when showing excerpts, automatically removes some key words from the beginning of excerpts (e.g. \"Terminal is\" from <a href=\"https://apple.stackexchange.com/questions/tagged/terminal\" class=\"post-tag\" title=\"show questions tagged &#39;terminal&#39;\" rel=\"tag\">terminal</a>). This mostly works fine, except for two things:</p>\n\n<ul>\n<li><p><strong>Capitalization inconsistency</strong></p>\n\n<p>It does not then capitalize the first remaining word, so some excerpts begin with \"the\" and some \"The.\"</p></li>\n<li><p><strong>Extra deleted text</strong></p>\n\n<p>At least one tag (<a href=\"https://apple.stackexchange.com/questions/tagged/backup\" class=\"post-tag\" title=\"show questions tagged &#39;backup&#39;\" rel=\"tag\">backup</a>) has extra text removed. See the below screenshots.</p></li>\n</ul>\n\n<p>Text displayed on the Tags page:</p>\n\n<p><img src=\"https://i.stack.imgur.com/xD5WM.png\" alt=\"summary on the tag page\"></p>\n\n<p>Text displayed upon hover:</p>\n\n<p><img src=\"https://i.stack.imgur.com/Xa1VS.png\" alt=\"hovertext\"></p>\n","OwnerUserId":"12285","LastEditorUserId":"5472","LastEditDate":"2012-06-12T03:16:11.613","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Tag bug involving auto-chopping of excess words in wiki excerpts","Tags":"<bug><status-bydesign><tags>","AnswerCount":"1","CommentCount":"1","FavoriteCount":"1"},{"Id":"1177","PostTypeId":"2","ParentId":"1114","CreationDate":"2012-03-12T15:35:12.700","Score":"6","Body":"<p>If you have legitimate access to install and run Mountain Lion, then by definition you have a dedicated support area that is <em>highly targeted</em> towards discussion of it without the sorts of arbitrary limits of scope that we (rightly) have here.</p>\n\n<p>Anyone who has a genuine question about ML that is more than curiosity for the purposes of being a Beta Hero at home is either ignoring the most suitable resource which they have paid cold hard cash for, or has managed to grab a copy by <em>other means</em>.</p>\n\n<p>It's all about knowing your audience.  Anyone can buy an iPod, iPods are on topic for community crowd sourced support on an unofficial forum like this.  Likewise, anyone can join the developer program, but that doesn't mean the same rules apply.  The audience is markedly different.  Allowing such Beta questions restricts said questions to a minority portion of the audience, which means that only a tiny proportion of users can have valid input or view for the purpose of answering or even voting, and worse still <em>at the risk of alienating that audience that sees this place as an accessible place to look for help and doesn't want to see a whole load of minimally useful stuff that they don't understand or care about which is likely to become outdated or inappropriate very quickly floating to the top</em>.</p>\n\n<p>I am a member of the developer program, and I wouldn't dream of asking any questions I have about it anywhere other than the official place.  I've paid for that support, I have not only a right to use it, but an expectation to see anything I do ask answered appropriately.  I don't have the same expectation of a free site on the internet, even a quality one like here.</p>\n","OwnerUserId":"9495","LastEditorUserId":"1629","LastEditDate":"2012-04-17T16:56:07.000","LastActivityDate":"2012-04-17T16:56:07.000","CommentCount":"1"},{"Id":"1178","PostTypeId":"1","CreationDate":"2012-03-13T18:28:50.403","Score":"-4","ViewCount":"155","Body":"<p>I am trying to embed a Youtube video into <a href=\"https://apple.stackexchange.com/questions/43251/best-way-to-import-analog-video-vhs-to-mac/43568#43568\">my answer</a>, but I can't seem to get it to work. I've seen it embedded on other sites (see <a href=\"https://gaming.stackexchange.com/a/21642/19031\">this answer</a>). Can the ability to embed Youtube videos be added to Ask Different?</p>\n","OwnerUserId":"7833","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Can we implement Youtube video embedding on Ask Different?","Tags":"<feature-request>","AnswerCount":"3","CommentCount":"11"},{"Id":"1180","PostTypeId":"2","ParentId":"1178","CreationDate":"2012-03-13T23:23:59.177","Score":"12","Body":"<p>Personally, I'm not sure that allowing embedded YouTube videos on Ask Different is a good idea.</p>\n\n<p>I believe that videos are only beneficial under select circumstances, where a video is clearly the best way to communicate an idea.<br>\nI also think that any answer that includes a video should also summarize the contents of the video in text, similar to linking to an external site. This is helpful for searching and SEO, and it also allows people who can't watch a video (at work, e.g.) to still learn from an answer.</p>\n\n<p>That said, you are correct that YouTube embedding has been enabled on the Gaming site (and the music site). Gaming has a very clear use case: walkthroughs, demonstrations, etc. The amount of situations where a video is the best option is considerably lower on Ask Different.</p>\n\n<p><strong>So, for now, I think the current system is good. You can always include a standard link to a YouTube video, or even grab a frame from the video and make that a link. Allowing embedded videos encourages a behavior that I don't want to encourage at the moment.</strong></p>\n\n<p>FWIW, this has been <a href=\"https://meta.stackexchange.com/questions/66397/provide-a-way-to-embed-videos-in-answers\">discussed before</a> on MSO.</p>\n","OwnerUserId":"2220","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2012-03-13T23:23:59.177","CommentCount":"0"},{"Id":"1181","PostTypeId":"1","CreationDate":"2012-03-16T11:32:24.913","Score":"28","ViewCount":"597","Body":"<p><strong>Edit</strong>: The contest has now officially ended. Congrats to everyone who completed the Levels! </p>\n\n<p>Since we had 10 people complete Level 3 (WOW! You guys are awesome), we have to implement the <a href=\"https://apple.meta.stackexchange.com/a/1227/13125\">tie breaker</a>. Here’s how the rankings worked out — the numbers are the combined scores on the top 35 posts each user made during the contest:</p>\n\n<ol>\n<li>224 <a href=\"https://apple.stackexchange.com/users/13414/gentmatt\">gentmatt</a></li>\n<li>177 <a href=\"https://apple.stackexchange.com/users/9495/stuffe\">stuffe</a></li>\n<li>174 <a href=\"https://apple.stackexchange.com/users/4408/mathias-bynens\">Mathias Bynens</a></li>\n<li>168 <a href=\"https://apple.stackexchange.com/users/9388/daniel-l\">Daniel L</a></li>\n<li>167 <a href=\"https://apple.stackexchange.com/users/13/kyle-cronin\">Kyle Cronin</a></li>\n<li>167 <a href=\"https://apple.stackexchange.com/users/8318/jtbandes\">jtbandes</a></li>\n<li>157 <a href=\"https://apple.stackexchange.com/users/3117/adam-eberbach\">Adam Eberbach</a></li>\n<li>151 <a href=\"https://apple.stackexchange.com/users/292/ian-c\">Ian C.</a></li>\n<li>143 <a href=\"https://apple.stackexchange.com/users/219/adam-davis\">Adam Davis</a></li>\n<li>123 <a href=\"https://apple.stackexchange.com/users/218/senseful\">Senseful</a></li>\n</ol>\n\n<p>The winner of the iPad raffle is <a href=\"https://apple.stackexchange.com/users/4160/steve-moser\">Steve Moser</a>!</p>\n\n<p>Great job everyone. Winners will be contacted over the next couple of days.</p>\n\n<hr>\n\n<p>Apple recently announced the revamped and recharged iPad, and they hit stores today. This new iteration of Apple’s tablet features impressive quad core graphics, and state of the art Retina technology for higher def viewing. The new iPad continues to set the standard for elegance in design and advancements in performance and technology. </p>\n\n<p><img src=\"https://i.imgur.com/6lZHE.png\" height=\"255\"></p>\n\n<p>We’re impressed. Are you?</p>\n\n<p>In our corner of the Apple universe, we continue to build a comprehensive resource helping those who dare to ask different. To celebrate the new benchmark in tablet computing, we ordered a few for you, in case to you didn’t have the chance to.</p>\n\n<p>Because we can’t give new iPads to everyone (we wish that we could!), people who participate on Ask Different during the next few weeks to different degrees earn different Apple products. Visit the Ask Different <a href=\"http://thenewipadishere.com/\" rel=\"nofollow noreferrer\">iPad Contest Page</a> for specific details on how these iPads (and iPods) are being given away.</p>\n","OwnerUserId":"13125","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2012-10-13T22:00:51.307","Title":"The new iPad is here - ask different and win one!","Tags":"<discussion><site-promotion><ipad>","AnswerCount":"7","CommentCount":"14","FavoriteCount":"6","ClosedDate":"2014-02-26T18:24:00.463"},{"Id":"1182","PostTypeId":"1","AcceptedAnswerId":"1183","CreationDate":"2012-03-16T15:10:32.303","Score":"4","ViewCount":"65","Body":"<p>Not that it matters, but I was just wondering...</p>\n\n<p>I just got +3 reputation for an upvote. But I always thought an upvote is +10, no?</p>\n\n<p><img src=\"https://i.stack.imgur.com/5VGsT.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"11610","LastEditorUserId":"11610","LastEditDate":"2012-03-16T15:29:10.080","LastActivityDate":"2012-03-16T15:29:10.080","Title":"Upvote results in +3 reputation?","Tags":"<support>","AnswerCount":"1","CommentCount":"6"},{"Id":"1183","PostTypeId":"2","ParentId":"1182","CreationDate":"2012-03-16T15:22:16.783","Score":"4","Body":"<p>In general, up votes on <strong>answers</strong> are worth +10 and up votes on <strong>questions</strong> are worth +5. There are exceptions. There is a daily reputation cap of 200, and if you hit it at the time you were upvoted, you would only receive the score that brings your total up to 200.</p>\n","OwnerUserId":"9388","LastActivityDate":"2012-03-16T15:22:16.783","CommentCount":"3"},{"Id":"1184","PostTypeId":"2","ParentId":"1178","CreationDate":"2012-03-16T17:24:59.710","Score":"6","Body":"<p>We <em>have</em> experimented with <a href=\"https://video.meta.stackexchange.com/questions/190/youtube-and-soundcloud-embedding-is-now-enabled/191#191\">embedded video</a> on a few sites, but I would be very hesitant about enabling it widely unless the site can show a <em>substantial</em> need for it. </p>\n\n<p>One of the big problems with video is that it is not searchable. Remember that <strong>the lifeblood of this site is search,</strong> so every time a video replaces a well-worded post that <em>describes</em> the problem, you have that much less content on the site that can be searched. Videos are, essentially, a black box to the Internet &mdash; they break those mechanisms we rely on to bring people to this site.</p>\n\n<p>Text is the primary means of communicating what we have here to the outside world. For every question or answer that is described \"in video,\" that information becomes obscured behind a black curtain; One less opportunity for people to find the text that describes the solution.</p>\n","OwnerUserId":"3","LastEditorUserId":"-1","LastEditDate":"2017-03-16T17:33:48.760","LastActivityDate":"2012-03-16T17:24:59.710","CommentCount":"3"},{"Id":"1185","PostTypeId":"2","ParentId":"1181","CreationDate":"2012-03-16T20:33:45.117","Score":"2","Body":"<p>Thanks!</p>\n\n<p>Is this contest open to:</p>\n\n<ul>\n<li><p>Moderators elsewhere in the Stack Exchange network? <a href=\"https://money.stackexchange.com/users/3\">(ahem)</a></p></li>\n<li><p>And what about <strong>non-U.S. residents</strong>?</p></li>\n</ul>\n","OwnerUserId":"116","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:25:30.650","LastActivityDate":"2012-03-16T20:33:45.117","CommentCount":"3"},{"Id":"1186","PostTypeId":"1","AcceptedAnswerId":"1321","CreationDate":"2012-03-16T23:31:57.770","Score":"3","ViewCount":"101","Body":"<p>I have wanted to go back to questions that I've cast a close vote on and check up on them. However, I lose track of all the questions. How can I view all my close votes?</p>\n","OwnerUserId":"7833","LastEditorUserId":"9388","LastEditDate":"2012-05-24T20:35:51.337","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Can I view all my close votes somewhere?","Tags":"<feature-request><status-completed><voting>","AnswerCount":"2","CommentCount":"1"},{"Id":"1187","PostTypeId":"2","ParentId":"1181","CreationDate":"2012-03-17T14:47:44.487","Score":"1","Body":"<p>Members who won a previous contest, can they participate in this contest?</p>\n\n<p>And just out of curiosity, which iPad can you win? The WiFi only or the LTE? </p>\n","OwnerUserId":"11610","LastActivityDate":"2012-03-17T14:47:44.487","CommentCount":"1"},{"Id":"1188","PostTypeId":"2","ParentId":"1181","CreationDate":"2012-03-17T17:32:15.757","Score":"3","Body":"<p>I am really excited at how well worded and thought through this contest is. I appreciate the explanation about how the raffle will work and what might happen if more people qualify than prizes are available. I personally dislike open ended raffles where you don't know how long or how many items are intended to be offered as prizes and that cheapens the promotion in my opinion. In this case - having the status update as we ask/answer/share is really making this fun to track progress of everyone.</p>\n\n<p>I have one question. Level one enters you in the raffle. Does level two get you a second entry in the same raffle or perhaps is there a second raffle for just the people that have Level two contributions?</p>\n","OwnerUserId":"5472","LastActivityDate":"2012-03-17T17:32:15.757","CommentCount":"3"},{"Id":"1189","PostTypeId":"1","AcceptedAnswerId":"1289","CreationDate":"2012-03-18T01:15:54.630","Score":"3","ViewCount":"90","Body":"<p>For editing and answering, I want to know: what's the best way to notate a menu item's path? (This also goes for things such as preferences.)</p>\n\n<p>I have seen the following:</p>\n\n<ul>\n<li>Menu > Item</li>\n<li>Menu-> Item</li>\n<li>Menu -> Item</li>\n<li>Menu → Item</li>\n<li><strong>Menu → Item</strong></li>\n<li><code>Menu &gt; Item</code></li>\n<li>Menu » Item</li>\n<li><strong>Menu</strong> » <strong>Item</strong></li>\n</ul>\n\n<p>…and many more. We should really have some standard.</p>\n","OwnerUserId":"12285","LastEditorUserId":"9388","LastEditDate":"2012-03-18T03:38:43.673","LastActivityDate":"2012-04-30T16:32:41.537","Title":"Proper display of menu paths","Tags":"<discussion><formatting>","AnswerCount":"3","CommentCount":"0"},{"Id":"1190","PostTypeId":"2","ParentId":"1189","CreationDate":"2012-03-18T04:06:58.763","Score":"4","Body":"<p>I think we should stay away from the options involving special characters. They're harder to type and some older computers/browsers may have trouble displaying them. A standard involving special characters would be hard to enforce simply because it's more work to type so people are less likely to use it.</p>\n\n<p>I don't think that we should bold all menu paths. I like preserving bold for where emphasis is required. Using it in all menu paths would 'dilute' its meaning in the rest of the document, and it would make it impossible to emphasize a specific path.<br>\nSimilarly, I think that the <code>&lt;code&gt;</code> formatting should be reserved for code or specific parameters.</p>\n\n<p>That leaves the <strong>first, second, and third options</strong>. I would argue that they are all fine: they contain the same information and are equally clear and readable. I prefer the second and third options, but that's just a personal preference.</p>\n\n<p>That said, I think that much of this comes down to personal choice. Like the phrasing of a post, the original poster's 'voice' and preferences should be preserved whenever possible.<br>\nI would say that menu path formatting that does not match the standard is not an acceptable reason for an edit. Even if you're editing a post already, I don't think that changing the menu path formatting should be done except in extreme cases (all menu items in <code>code</code> formatting, or some problematic option that we haven't even considered).</p>\n\n<h3>Short version:</h3>\n\n<p>I propose considering any of the first three options standard. But, don't edit other people's stuff to match the standard unless you've got a good reason.</p>\n","OwnerUserId":"2220","LastActivityDate":"2012-03-18T04:06:58.763","CommentCount":"2"},{"Id":"1192","PostTypeId":"2","ParentId":"1181","CreationDate":"2012-03-18T17:14:39.650","Score":"2","Body":"<p>Wow, this looks great and very generous. However, I am curious about the asterisk: \"What do you get? A new iPad*!\" because I cannot find what that refers to.</p>\n","OwnerUserId":"20319","LastActivityDate":"2012-03-18T17:14:39.650","CommentCount":"2"},{"Id":"1193","PostTypeId":"2","ParentId":"1181","CreationDate":"2012-03-18T17:54:51.570","Score":"1","Body":"<p>I see a contest progress panel on other users' profiles; some are empty, some not. My profile does not show one.  Do I have to do something to make it appear?</p>\n","OwnerUserId":"517","LastActivityDate":"2012-03-18T17:54:51.570","CommentCount":"4"},{"Id":"1194","PostTypeId":"2","ParentId":"1167","CreationDate":"2012-03-18T18:21:38.543","Score":"1","Body":"<p>Apple has shown their cards on how all three generations of the iPad are documented with names when you need to tell them apart.</p>\n\n<p>The official manual lists the iPad as <strong>iPad (3rd generation)</strong> in the <a href=\"http://manuals.info.apple.com/en_US/ipad_user_guide.pdf\" rel=\"nofollow noreferrer\">printed / PDF user's guide</a>. This is the primary consumer facing naming convention since many products get \"the new\" treatment launch in printed, media, advertising and web sales. At some point \"the new\" goes away and we are left with the canonical names.</p>\n\n<p>When you browse the store for iPad docks, the <a href=\"http://store.apple.com/us/product/MC360ZM/A\" rel=\"nofollow noreferrer\">MC360ZM/A</a> dock lists compatibility with the iPad 1st generation and the <a href=\"http://store.apple.com/us/product/MC940ZM/A\" rel=\"nofollow noreferrer\">MC940ZM/A</a> dock with the iPad 2 2nd generation and iPad 3rd generation.</p>\n\n<p><img src=\"https://i.stack.imgur.com/IyyGp.png\" alt=\"enter image description here\"></p>\n\n<p>To complicate things <em>(it can never be too easy, can it?)</em>, <a href=\"http://support.apple.com/manuals/#ipad\" rel=\"nofollow noreferrer\">Apple's support web site for manuals</a> changes this terminology a bit. If you are logged in with an Apple ID and browse a few manuals - both the general ones that address iOS 5.1 on the new iPads and specific ones that address radio spectrum power testing and regulatory compliance - you will build up a slightly different list of iPads - akin to the sales names when you buy them from the online store and names need to differentiate between colors, carriers, and 3G/4G radio capabilities.</p>\n\n<p><img src=\"https://i.stack.imgur.com/fiwTU.png\" alt=\"enter image description here\"></p>\n\n<hr>\n\n<p>Now as to what makes sense here, I see two alternatives - the first being do we try to set precedent and use iPad for all general questions as well as for the current device. The downside there is some re-tagging will be needed and some user confusion will ensue. The benefit is one big tag to keep things together and make people with tag reputation goals and badges more likely to arise (by not segmenting the iPad questions). The other alternative is to leave iPad alone and general and to make up a tag for each model as needed. We can use synonyms to group things (say some use of iPad 2 (2nd generation) WiFi + 3G (Verizon) might be better pointing to iPad 2). This will also have some retagging when people don't tag correctly and some user confusion (but different users will be confused here).</p>\n\n<p>Regardless - it looks like we'll need a tag structure something like:</p>\n\n<ul>\n<li>iPad</li>\n<li>iPad (1st generation)</li>\n<li>iPad 2 <strong><em>or</em></strong> iPad 2 (2nd generation)</li>\n<li>iPad (3rd generation)</li>\n</ul>\n","OwnerUserId":"5472","LastActivityDate":"2012-03-18T18:21:38.543","CommentCount":"3"},{"Id":"1195","PostTypeId":"2","ParentId":"1167","CreationDate":"2012-03-20T10:39:54.860","Score":"-2","Body":"<p>I advocate splitting product names and generations into seperate tag.  <code>iPad</code> <code>Gen3</code> is absolutely clear to me, and the only downside would be having <code>Gen3</code> applicable to multiple products but I don't see that as a large issue as no-one will ever search on a tag like that independently without providing scope via a product name.</p>\n\n<p>It depends on how you see Tags as fitting.  Are they for searching, or for categorising for the purpose of trending in profiles?</p>\n","OwnerUserId":"9495","LastActivityDate":"2012-03-20T10:39:54.860","CommentCount":"2"},{"Id":"1196","PostTypeId":"2","ParentId":"134","CreationDate":"2012-03-21T02:30:36.490","Score":"1","Body":"<p>This isn't originally my suggestion, but the original post isno longer here, and for historical reasons, I think this should be archived.</p>\n\n<p>The tagline/Elevator pitch for the site should be (and, in fact, is)</p>\n\n<h1>Ask Different</h1>\n","OwnerUserId":"9388","LastActivityDate":"2012-03-21T02:30:36.490","CommentCount":"0"},{"Id":"1197","PostTypeId":"1","AcceptedAnswerId":"1200","CreationDate":"2012-03-21T02:39:00.190","Score":"22","ViewCount":"313","Body":"<p>So the <a href=\"https://apple.meta.stackexchange.com/questions/1181/the-new-ipad-is-here-ask-different-and-win-one\">big promotion</a> is getting far more participation than I <strong><em>ever</em></strong> expected was possible. This is a big win, and CHAOS pulled off an amazing thing here. Kudos for all your planning work! Less than a week into the contest, there are already as many people at level 2 as I expected would be there by the <em>end</em> of the competition.</p>\n\n<p>But along with a giant spike in readership, quastion-asking, and question-answering, I worry that we're getting an increase in some less-desirable participation also. Lower quality questions, and attempts to game the system seem slightly less rare than they have been in the past. The addition of stakes higher than badges and reputation points (themselves a powerful motivator) has the potential to bring out an uglier side of our competitive natures. Here be dragons.</p>\n\n<p>While the promotion is bringing in wonderful new participants and dramatically increasing the activity of our current participants, what do we need to do as a community to help ensure that increased quantity doesn't degrade quality or community?</p>\n","OwnerUserId":"9388","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-03-27T12:11:17.763","Title":"How do we keep the exciting promotion from reducing the quality of the site?","Tags":"<discussion><site-promotion>","AnswerCount":"6","CommentCount":"0","FavoriteCount":"3"},{"Id":"1198","PostTypeId":"2","ParentId":"1197","CreationDate":"2012-03-21T10:06:28.177","Score":"5","Body":"<p>I think the promotion is a good thing, and I am calling it a promotion rather than a competition because the competetive element is potentially a bad thing here.  However I have a few misgivings about the format:</p>\n\n<p>\"Realtime Updates\" - This is some really great code, but it's intended purpose has a dark side, and knowing you are X shares away from getting Level 2 etc will just prompt some people to flood their communications channels with links because they know they are close.  Check chat for the reduced number of onebox links and the increase in the personalised links.  I've done this myself, and am not proud.  The fact you can check on the other guys too means you can get too involved trying to beat the others, rather than put out genuine content that would be welcome even without a promotion.  If the idea is to promote being a good citizen, then the winning citizen by definition would have done it anyway, and shouldn't be doing it merely because there's a prize.  Removing the update would potentially stop borderline genuine users from caning the site for 3 weeks then leaving because they won't have a clue if they are caning it in vain or not, whereas a \"better\" user will carry on regardless.</p>\n\n<p>\"New Users\" - Obviously you had a brief when setting this competition up, and you will know what your expected outcomes are and what you wanted to achieve.  No way to know <em>exactly</em> what these things were, but what we seem to have is an influx of people (some new, some previously dormant) throwing up a <em>lot</em> of content.  The \"acheivements\" for want of a better word for getting X answers voted on etc reward quantity without necessarily have any controls of the quality.  If I ruled the world (in my lovely hat) I would like to see the promotion be more tailored to getting people to use the site properly, rather than to use it lots; this should foster the same end result inadvertently anyway.  I know this is difficult, but helpful flags and other badges may be a good way of getting the existing audience to use the site better, which should in turn equate to <em>more</em> at the same time.</p>\n\n<p>\"Tactical voting\" - I'm not saying this has happened, but I am saying when the time comes close to the end, it likely <em>will</em> happen.  Someone with the required 4x6 upvotes will find one get's mysteriously downvoted to 5 votes and rules them out of Level 3.  I'm raising this now so you are prepared for it, I know votes are supposed to be invisible, but you will for sure get a query I feel.  That's not me saying I will do it of course, but it's human nature when a big prize is at stake.  And there's the other side too, people not voting for someone who is close to moving up a level in the competition etc as a way to maintain a gap in the scoring.</p>\n\n<p>\"Shares\" - I've tried to share and point out exactly why I am doing it.  Each time I have put shares out on Twitter I have book ended it with non share tweets about AD and the promotion.  I don't want to link bait my friends, but I do want to turn some of them into users here.  As I mentioned previously, I'm sure a lot of the shares are actually being shared in chat where discussion is pretty busy at the moment.  These shares defeat the intended purpose, as they never leave the site, and are only ever seen by existing users.  Perhaps a better mechanism is to allow a referal scheme  in a future competition.  Having a challenge to introduce 2 new users who get say 250 Rep and 5 selected badges within a month of joining would actually be a way to ensure higher quality inrease in visits that results in tangible benefits.</p>\n\n<p>As I have other thoughts, I may edit them in here.  Overall I am 70% positive on the promotion.  I hope it acheives it's aims, and of course I hope I win an iPad, and further still if I do, I hope I <em>deserved</em> to win on the basis of maintaining very active but more importantly very focussed input to the sites real aims which still stand apart as worthwhile content.  I'll still be here after, as I was here before.  This is not an \"old guard\" (I've only been here what 7 months?) piece of disgruntlement against new users though, I hope that the conversion or \"sticky\" ratio of the more recently active users is increased post promotion.  I would hate to see someone with enough free time simple hammer the site for 3 weeks and then hit the sunset with iPad in hand.</p>\n","OwnerUserId":"9495","LastEditorUserId":"9495","LastEditDate":"2012-03-21T11:12:58.110","LastActivityDate":"2012-03-21T11:12:58.110","CommentCount":"2"},{"Id":"1199","PostTypeId":"2","ParentId":"1197","CreationDate":"2012-03-21T12:13:05.540","Score":"4","Body":"<p>Thank you for posting this. This is almost exactly how I feel, and part of my convo in the chat last night.</p>\n\n<p>I thought about it a little more, and think in some cases, we can even use the current tools and voting to almost regulate it. As in, if a user is just doing 'jeopardy' questions, we should vote accordingly. </p>\n","OwnerUserId":"181","LastActivityDate":"2012-03-21T12:13:05.540","CommentCount":"5"},{"Id":"1200","PostTypeId":"2","ParentId":"1197","CreationDate":"2012-03-21T19:45:05.627","Score":"9","Body":"<p>Thanks for posting this, it definitely warrants a discussion. </p>\n\n<p>Whenever we run a promotion, the goal (in addition to rewarding you for all the hard work you do) is to increase activity on the site by attracting new users or getting current users more engaged. Anything that increases activity carries some risk that the site will see an increase in lower-quality content. Because of that, we always try to run promotions past the moderators to get feedback, and we only run large promotions like this on sites that have a community strong enough to moderate a large influx of content.</p>\n\n<p>In this case, we designed the promotion a little differently than past promotions because we thought it would be more interesting, less competitive, and have better results. Our past promotions were mostly tag contests, where we'd pick a tag and a timeframe and give prizes to the top or most viewed posts. The drawback with that kind of promotion is there can only be 1 or 2 winners, so it causes more competition. Although there are limits to the number of people that can win iPads and iPods in this contest, it's pretty high. That doesn't mean it eliminates all competition, but it does mean that you can cheer people on and vote for their posts without dramatically decreasing your own chances of winning. Because of that, our hope was that people would still be willing to vote other posts up or down when appropriate, as per usual, without concern for whether it would affect their own status in the contest.</p>\n\n<p>The real-time updates were meant to make the promotion more interesting to watch and increase the likelihood that people would participate. It just makes it easier to keep track of things that you can mostly find anyway. Since it’s easy to see where you are, we figured it would make people more likely to come back and try to reach that next level. I see stuffe’s point that it might cause people to flood their communication channels - we tried to reduce this by allowing you to share posts anywhere you want instead of just your own Facebook and Twitter.</p>\n\n<p>This is not a perfect promotion, so I appreciate the discussion and feedback. To some extent, there’s no way to avoid a little bit of competition when prizes are involved. My hope is that most people are on the site because they love Apple and find the Q&amp;A helpful and interesting. The bar for winning this contest is set pretty high, which I think keeps out most people who are just here to win an iPad. Those people will always be around, but we're doing our best to reduce the damage they might do.</p>\n","OwnerUserId":"13125","LastActivityDate":"2012-03-21T19:45:05.627","CommentCount":"4"},{"Id":"1201","PostTypeId":"2","ParentId":"1197","CreationDate":"2012-03-21T20:27:19.933","Score":"9","Body":"<p>I want to expand on my comment to <a href=\"https://apple.meta.stackexchange.com/a/1200/\">Lauren</a>.</p>\n\n<p>Some of my remarks in the chat room of late might be interpreted to mean that I'm against the this contest. This is not true. I am very appreciative of the efforts that Lauren (and whomever else is deserving) put into creating and promoting the contest. I am thankful to Stack Exchange for committing the resources necessary to provide <em>killer</em> prizes like iPads and iPod Touchs. I am hopeful that the exposure that the contest brings will bring new growth and excitement to Ask Different.</p>\n\n<p>I am especially hopeful that a few members of our community who have put forth extraordinary efforts, particularly in the area of providing high quality answers, will be rewarded for their efforts. I know it wasn't the lure of an iPad that motivated them to begin with, but that doesn't mean they can't be rewarded after the fact. And should I be fortunate enough to receive a prize, I won't turn it down. There is a lot of <em>good</em> in this contest and it has brought a lot of life to Ask Different.</p>\n\n<p>What I am <em>against</em> is the effect that the contest is having on our community.  New faces are popping up and posting without taking the time to learn what <strong>Ask Different</strong> is all about. Previously dormant users are rising up and posting multiple questions for which answers are a simple <em>RTFM</em> (or Google search) away. Even some of our long time members are posting questions about which I harbor doubts. Is it a <em>real</em> question? Will an answer actually <em>make a difference?</em> Does the OP really <em>care</em> or is this just to <em>put some points on the scoreboard?</em> The quality that we fight hard to maintain is being eroded and there is something distasteful about the <em>edge</em> that competition brings to our site.</p>\n\n<p>I know that we have the tools do deal with all of these challenges but at times I feel like <a href=\"http://en.wikipedia.org/wiki/Nick_Fury\" rel=\"nofollow noreferrer\">Nick Fury</a> battling <a href=\"http://en.wikipedia.org/wiki/HYDRA\" rel=\"nofollow noreferrer\">HYDRA</a>; <em>Cut off an arm and another grows to take its place.</em></p>\n\n<p>The bottom line is that hanging out on Ask Different has been less pleasant of late. Ironic since my <em>numbers</em> would seemingly indicate I'm spending more time here. Perhaps that's true, but it's just not as enjoyable as it was last week.</p>\n\n<p>As I said to Lauren, this will pass. We'll survive and by discussing our grievances and, most importantly by virtue of <em>business as usual</em>—asking, answering, commenting and voting—we'll emerge a stronger community in the end. Despite the <em>sense of impending doom</em> I may express in my darker moments. </p>\n\n<p><img src=\"https://i.stack.imgur.com/8SlOW.jpg\" alt=\"Keep Calm and Carry On!\"></p>\n\n<p>A special shout-out and thanks to Bmike and Kyle Cronin, who have both talked me down off the ledge this week and to Stuffe and Daniel L for <em>keeping it real</em> for me. You are the best amongst the best. We may disagree on specifics from time to time, but in the end I know we share a common goal. </p>\n","OwnerUserId":"11791","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.967","LastActivityDate":"2012-03-21T20:45:53.803","CommentCount":"2"},{"Id":"1202","PostTypeId":"1","CreationDate":"2012-03-21T21:25:33.223","Score":"14","ViewCount":"97","Body":"<p>In chat today, <a href=\"https://apple.stackexchange.com/users/12285/timothy-mueller-harder\">Timothy</a> mentioned that the tags in oneboxes look a lot like the buttons in Windows XP:</p>\n\n<p><img src=\"https://i.stack.imgur.com/SiyT0.png\" alt=\"Picture of tags in oneboxes\"></p>\n\n<p>Compare to Windows XP button:<br>\n<img src=\"https://i.stack.imgur.com/c7NUw.gif\" alt=\"Windows XP buttons\"></p>\n\n<p>Can we make the oneboxes <em>and</em> the tags on the main site look like the buttons from Lion? Like this:<br>\n<img src=\"https://i.stack.imgur.com/EU7C5.png\" width=\"175\"/><br>\nI personally think that this will add more personality and a more OS X-ish feel to the site.</p>\n","OwnerUserId":"7833","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2013-05-31T21:37:26.397","Title":"Can we make the the tags look like the buttons in Lion?","Tags":"<feature-request><design>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"1203","PostTypeId":"2","ParentId":"1149","CreationDate":"2012-03-22T10:29:12.030","Score":"4","Body":"<p>I noticed the layout for OpenID-based logins is a bit weird (tested on OS X 10.7.3):</p>\n\n<p><img src=\"https://i.imgur.com/IVUQr.png\" alt=\"Screenshot\"></p>\n\n<p>Just a heads up.</p>\n\n<p>Thanks for your work on this wonderful app!</p>\n","OwnerUserId":"4408","LastActivityDate":"2012-03-22T10:29:12.030","CommentCount":"2"},{"Id":"1204","PostTypeId":"1","AcceptedAnswerId":"1205","CreationDate":"2012-03-22T19:28:28.797","Score":"4","ViewCount":"137","Body":"<p>My progress bar shows that I've hit level 2. I've received a notice on the site. However, the number of shares and questions/answers with 2 up votes has gone down. I can understand the Q&amp;A getting downvotes, but how can a link be unshared?</p>\n\n<p>Is something broken?</p>\n","OwnerUserId":"638","LastEditorUserId":"962","LastEditDate":"2012-03-22T20:25:38.937","LastActivityDate":"2012-03-22T20:25:38.937","Title":"Am I at Level 2 or not?","Tags":"<bug><status-bydesign><site-promotion>","AnswerCount":"1","CommentCount":"5","ClosedDate":"2014-02-26T18:23:05.207"},{"Id":"1205","PostTypeId":"2","ParentId":"1204","CreationDate":"2012-03-22T19:43:57.133","Score":"5","Body":"<p>As @balpha, the coder of the contest has <a href=\"http://chat.stackexchange.com/transcript/message/3910467#3910467\">said</a>:</p>\n\n<blockquote>\n  <p>Once a mission is completed, it won't be revoked automatically if the criteria aren't met anymore. We can revoke them manually, but we'll only do that if the mission was achieved only because of serial upvoting or similar issues, but not just because some downvote got you below the threshold again. Chances are that another upvote is going to come in anyway :)</p>\n</blockquote>\n","OwnerUserId":"12285","LastActivityDate":"2012-03-22T19:43:57.133","CommentCount":"2"},{"Id":"1206","PostTypeId":"1","AcceptedAnswerId":"1207","CreationDate":"2012-03-23T09:21:48.880","Score":"0","ViewCount":"120","Body":"<p><strong><a href=\"https://apple.stackexchange.com/q/45386/128\">Is there any indication that Apple/iCloud will offer a “photo collection hosting” service, comparable to Picasa Web Albums?</a></strong></p>\n\n<p>Why this question was down voted two times? I think it is a legitimate question! \nOr is it a bad question, because actually no real answer exists (because nobody know if Apple provides a photo hosting in the future again)?</p>\n","OwnerUserId":"128","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2012-03-27T23:33:44.510","Title":"Why this question was down-voted?","Tags":"<discussion><questions>","AnswerCount":"2","CommentCount":"0"},{"Id":"1207","PostTypeId":"2","ParentId":"1206","CreationDate":"2012-03-23T11:40:38.787","Score":"7","Body":"<p>This is a open-ended question, not based on an actual problem.\nAnswers will rather reflect a debate than come to conclusions.\nThis is not the aim of the stackexchange network and such questions do not fit the Q&amp;A format.</p>\n\n<p>Like the <a href=\"https://apple.stackexchange.com/faq\">FAQ</a> says,</p>\n\n<blockquote>\n  <p>If your motivation for asking the question is “I would like to\n  participate in a discussion about ....\"., then you should not be\n  asking here. However, if your motivation is “I would like others to\n  explain .... to me”, then you are probably OK.</p>\n</blockquote>\n","OwnerUserId":"13414","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2012-03-23T11:40:38.787","CommentCount":"0"},{"Id":"1208","PostTypeId":"1","CreationDate":"2012-03-23T13:06:25.210","Score":"4","ViewCount":"51","Body":"<p>Sharing 10 links is quite a challenge.  I don't want to just spam 10 links to all my networks and hope they click all of them, so I'm trying hard to target just those links that would be very interesting to those groups I participate in.</p>\n\n<p>However, some groups are amenable to getting more than one link a week, and I'd like to see when I hit the 5 shares required for the previous link before sending the new one.</p>\n\n<p>Further, I have to track this across several groups I participate in, and while I can send one link out to one group, wait until my share counter goes up, then send out another link to another group (or the same one) then wait until my share counter goes up, it's terribly inefficient - I'd like to be able to see which shared links have reached five views so I can figure out which group is ready for another link.</p>\n\n<p>I have found a few people I've linked to who thanked me for showing them the site, so I suppose the goal of the contest is working, despite the fact that I'm approaching this methodically rather than organically, which I suppose is better in some ways.</p>\n\n<p>So is there a way to figure out which links have gotten five shares from me?</p>\n\n<p>Is there another way to track this that already exists?</p>\n","OwnerUserId":"219","LastActivityDate":"2012-03-23T13:53:27.803","Title":"Is there a way to track share stats?","Tags":"<feature-request><site-promotion><statistics>","AnswerCount":"1","CommentCount":"0"},{"Id":"1209","PostTypeId":"2","ParentId":"1208","CreationDate":"2012-03-23T13:53:27.803","Score":"4","Body":"<p>If you want to track clicks, you could use a service like <a href=\"https://bitly.com/\" rel=\"nofollow\">bitly</a>. They tell you how many times it was clicked, when it was clicked, etc.</p>\n","OwnerUserId":"13","LastActivityDate":"2012-03-23T13:53:27.803","CommentCount":"1"},{"Id":"1210","PostTypeId":"2","ParentId":"1206","CreationDate":"2012-03-23T17:56:51.253","Score":"3","Body":"<p>The increase in questions of lower quality brought about by the iPad promotion has everone's shields up so the down voting may be more rigorous than it was previously. </p>\n\n<p>You nailed the reason for the down votes of this one—<em>there is no objective answer</em>. Matt's response and the FAQ should fill in the blanks but a <em>litmus test</em> that I sometimes like to apply is that on <strong>Ask Different</strong> we want you to tell us what you <em>know</em>, not what you <em>think</em>.</p>\n\n<p>Granted this test isn't black and white. Some questions do leave room for opinion, and sometimes there are different <em>correct</em> (or at least <em>workable</em>)solutions that might be subject to valid debate. However, the more subjective (or worse still, <em>speculative</em>) a resulting answer is likely to be, the less likely the question will meet the test for <strong>quality</strong>.</p>\n","OwnerUserId":"11791","LastActivityDate":"2012-03-23T17:56:51.253","CommentCount":"0"},{"Id":"1211","PostTypeId":"1","AcceptedAnswerId":"1227","CreationDate":"2012-03-23T19:57:22.777","Score":"5","ViewCount":"238","Body":"<p>It's not so clear from the contest rules:</p>\n\n<blockquote>\n  <p>We can give away a maximum of 25 iPod touch devices and a maximum of 6 new iPads (5 for Level 3, and 1 for the raffle). In the event that more than the maximum number of people complete the Levels, the winners with the highest combined score on their contest posts will be chosen.</p>\n</blockquote>\n\n<p>So will Level 3 winners who don't get an iPad be moved down to Level 2? Or will they <em>only</em> be entered in the raffle?</p>\n","OwnerUserId":"3791","LastEditorUserId":"5472","LastEditDate":"2012-03-25T03:41:37.850","LastActivityDate":"2012-03-29T06:22:15.420","Title":"If there are 6 winners in Level 3, will the one ranked 6 win an iPod?","Tags":"<support><site-promotion>","AnswerCount":"2","CommentCount":"2","ClosedDate":"2014-02-26T18:24:25.557"},{"Id":"1212","PostTypeId":"1","AcceptedAnswerId":"1214","CreationDate":"2012-03-23T20:33:59.657","Score":"1","ViewCount":"87","Body":"<p>I was chatting earlier and noticed dotted lines in between chat messages:\n<img src=\"https://i.stack.imgur.com/vuYI7.png\" alt=\"Lines in chat\"><br>\nWhat do they do?</p>\n","OwnerUserId":"7833","LastActivityDate":"2012-03-23T21:02:48.337","Title":"What are the dotted lines in between chat messages?","Tags":"<discussion><chat>","AnswerCount":"1","CommentCount":"2"},{"Id":"1213","PostTypeId":"2","ParentId":"1211","CreationDate":"2012-03-23T20:37:07.597","Score":"1","Body":"<p>If there are 6 winners in level three, then all six are also in level 2. But since each user is only eligible for one prize, and you get the prize for the highest level you complete, then the top five in level 3 will get ipads, and then the top 25 in level two - minus the 5 that already received the ipad - will get ipod touches.  Everyone in level 2 that didn't get an ipod would then be eligible for the drawing in level one.</p>\n\n<blockquote>\n  <p>Each user is only eligible for one prize. You earn the prize for the highest level you complete.</p>\n</blockquote>\n\n<p>Given the rate that level two is expanding since Wednesday when I started, I expect there will be more than 25 users in that group, and more than 5 users in level 3.</p>\n\n<p>Once you make it into level 2 or 3, you will have to keep working to stay in the top 25 and top 5 respectively to actually get the prize.</p>\n\n<p>Note I'm note a contest organizer or official, but this is my interpretation of the rules.  Would be nice to have Stack Exchange confirm this...</p>\n","OwnerUserId":"219","LastEditorUserId":"219","LastEditDate":"2012-03-24T07:33:57.297","LastActivityDate":"2012-03-24T07:33:57.297","CommentCount":"4"},{"Id":"1214","PostTypeId":"2","ParentId":"1212","CreationDate":"2012-03-23T20:51:29.733","Score":"3","Body":"<p>They appear when that chatroom screen has lost focus at the last message you read before going to another program or chatroom.  When you come back, the line shows you where you left off reading so you don't have to figure out what was said while you were doing something else.</p>\n","OwnerUserId":"219","LastEditorUserId":"219","LastEditDate":"2012-03-23T21:02:48.337","LastActivityDate":"2012-03-23T21:02:48.337","CommentCount":"1"},{"Id":"1215","PostTypeId":"1","AcceptedAnswerId":"1216","CreationDate":"2012-03-24T19:32:48.163","Score":"1","ViewCount":"57","Body":"<p>On the main page there appears to be some \"additional content\" and it looks as though it is related to an iPad.  However, I can't tell for sure because it looks like this:</p>\n\n<p><img src=\"https://i.stack.imgur.com/54SHr.png\" alt=\"Main page view\"></p>\n\n<p>At first, I put it down to the fact that I'm using FF11 on Linux so clearly the \"Ask Different\" website would <em>Look Different</em> since no Apple products were harmed in the viewing of this page.</p>\n\n<p>But then I happened to look at it using Safari Mobile on my iPad and it looked the same.</p>\n\n<p>Is this how it ought to look?  There does appear to be something behind the main question bit - that black semi-circle is certainly suggestive of that fact.  Is the site telling me that I shouldn't use Firefox or Linux?</p>\n","OwnerUserId":"7795","LastEditorUserId":"5472","LastEditDate":"2012-03-26T20:40:31.017","LastActivityDate":"2012-03-26T20:40:31.017","Title":"Strange layout on the main page with the iPad competition (I think)","Tags":"<support><status-bydesign><design><site-promotion>","AnswerCount":"1","CommentCount":"0"},{"Id":"1216","PostTypeId":"2","ParentId":"1215","CreationDate":"2012-03-24T19:36:38.523","Score":"2","Body":"<p>This is intentional, the image is an iPad partially hiding behind the question view. If you click on the iPad you'll see that we're currently holding a contest, where the top contributors can earn iPads.</p>\n","OwnerUserId":"13","LastActivityDate":"2012-03-24T19:36:38.523","CommentCount":"4"},{"Id":"1218","PostTypeId":"1","AcceptedAnswerId":"1219","CreationDate":"2012-03-25T12:27:38.647","Score":"1","ViewCount":"76","Body":"<p>So I woke up this morning and decided to go check on my most popular question with 5 upvotes, <a href=\"https://apple.stackexchange.com/questions/45715/does-ichat-block-content-in-china\">located here</a>. I was hoping for an answer, as it's a question I'd really like answered - it's very interesting to me.</p>\n\n<p>So I opened up the question and lo and behold, it got 2 downvotes and was closed. This is a yes or no question that pertains to the usage of Apple devices in China.</p>\n\n<p>See this part of the unedited question: {bolded for emphasis, original question has no bold}</p>\n\n<blockquote>\n  <p>Example: I send a message to person 1 in China saying 'Down with the\n  government! Tank Man! Tibet! Liu Xiaobo! Tiananmen Square protests of\n  1989!' <strong>Does Person 1 get the message or not?</strong></p>\n</blockquote>\n\n<p>An answer to the question would look something like this:</p>\n\n<h1>No.</h1>\n\n<p>After extensive research and personal testing with my 1500 friends in geographically diverse regions of China who all were using iChat when I saw this question, I have proven this to be a no because the grarblydsquoop servers operated by the Chinese government do not filter iChat messages because iChat messages use the er90i protocol.</p>\n\n<p>In other words: <strong>Why was my question closed and could it please be reopened?</strong></p>\n","OwnerUserId":"6730","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2012-03-25T15:49:53.230","Title":"Why was my question closed?","Tags":"<support><closed-questions>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"1219","PostTypeId":"2","ParentId":"1218","CreationDate":"2012-03-25T15:23:54.743","Score":"3","Body":"<p>Your question is a perfect example of a question that is closed to make it better so it can be reopened.  </p>\n\n<p>Two things conspired to have me flag two of your questions for another moderator to review.</p>\n\n<ol>\n<li>You asked 7 questions in a 10 hour period - most of which were decent, but two seemed bad fits for our Q&amp;A site.</li>\n<li>The one that Daniel closed after agreeing with my flag and <a href=\"https://apple.stackexchange.com/questions/45749/is-the-ios-homescreen-bug-a-bug-or-a-feature\">this one</a></li>\n</ol>\n\n<p>Would you read over the FAQ for the main site on why questions that are a simple yes/no are less desirable (it's in the guide to good subjective / bad subjective) and we want to optimize for questions that have long answers and explain why an answer is yes or no. Please pay attention to the concept of shared space on the home page and drives away attention from other's questions. </p>\n\n<p>Did you read my comment and think about refining the question? Have you done any research how blocking might occur so that someone who knows the answer can decide how best to explain the reality of why a message may or may not get blocked?</p>\n\n<p>Your question here is a good way to start getting feedback, but I would recommend linking the question in the chat room to see if you can get some help from the user base. The users can and will help edit, vote to close or reopen and I'll gladly take a look as soon as its edited to see if it should've reopened. </p>\n\n<p>We will actively close off questions of marginal use to the site just to keep the home page balanced. We want a mix of easy, hard, answered and not answered so sometimes it's bad timing for a marginal question. The good news is close isn't a permanent thing - there will usually be specific feedback as well as this meta to get more info on why / how.</p>\n\n<p>Would you take a pass at either simplifying the question or explaining the research you have done and where your roadblock lies in understanding the iChat blocking idea? An alternate method would be to ask on chat for people to help edit it and/or vote to reopen as is. The community at large can also help on this.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2012-03-25T15:49:53.230","CommentCount":"5"},{"Id":"1220","PostTypeId":"1","AcceptedAnswerId":"1228","CreationDate":"2012-03-25T20:26:16.610","Score":"6","ViewCount":"194","Body":"<p>In the <a href=\"http://thenewipadishere.com/\" rel=\"nofollow\">New iPad Contest</a>, the rules state:</p>\n\n<blockquote>\n  <p>We can give away a maximum of 25 iPod touch devices and a maximum of 6 new iPads (5 for Level 3, and 1 for the raffle). In the event that more than the maximum number of people complete the Levels, the winners with the highest combined score on their contest posts will be chosen.</p>\n</blockquote>\n\n<p>Should more than five users complete Level 3 (a possibility looking more and more likely, despite my prediction that we'd be lucky if a grand total of two people completed the challenge!), how exactly are winners chosen? It says \"highest combined score on their contest posts\", but which posts are contest posts for Level 3 purposes? The first 35 questions asked during the contest? The highest scoring 35 questions asked during the contest? All not closed, not deleted questions and answers from the contest time period?</p>\n","OwnerUserId":"9388","LastEditorUserId":"5472","LastEditDate":"2012-03-25T20:58:36.233","LastActivityDate":"2012-04-01T03:15:06.773","Title":"How, exactly, would winners be determined if more than five users complete Level 3?","Tags":"<discussion><site-promotion><ipad>","AnswerCount":"1","CommentCount":"7","FavoriteCount":"1","ClosedDate":"2014-02-26T18:24:40.090"},{"Id":"1221","PostTypeId":"1","AcceptedAnswerId":"1222","CreationDate":"2012-03-25T23:58:36.577","Score":"1","ViewCount":"42","Body":"<p>A link that I share by copying the URL from the <code>link</code> button looks like </p>\n\n<pre><code>http://apple.stackexchange.com/a/45919/3117\n</code></pre>\n\n<p>but a link I share by clicking the banner-like share to Facebook, twitter etc. buttons looks like </p>\n\n<pre><code>http://apple.stackexchange.com/a/45919/3117?stw=1\n</code></pre>\n\n<p>Not knowing much about the nuts and bolts of how these things work (you should see my attempt at writing PHP recently), are these different for the purposes of the current competition? Does the first link work for Publicist badges etc. but not for the competition, or are they equivalent?</p>\n","OwnerUserId":"3117","LastEditorUserId":"5472","LastEditDate":"2012-03-26T16:54:05.867","LastActivityDate":"2012-03-26T16:54:05.867","Title":"Sharing links, question about which syntax is valid","Tags":"<support><site-promotion>","AnswerCount":"1","CommentCount":"0"},{"Id":"1222","PostTypeId":"2","ParentId":"1221","CreationDate":"2012-03-26T00:03:07.987","Score":"2","Body":"<p>Those two links will do the same thing. The part that tracks who shared the link is your user ID at the end of the link (3117 for you).</p>\n\n<p>The <code>?stw=1</code> at the end is so that Stack Exchange can track which links were posted using the sharing buttons. It doesn't effect the performance of the link.</p>\n\n<p><strong>Both links are equivalent and will count towards badges and contest shares.</strong></p>\n","OwnerUserId":"2220","LastActivityDate":"2012-03-26T00:03:07.987","CommentCount":"1"},{"Id":"1223","PostTypeId":"1","AcceptedAnswerId":"1225","CreationDate":"2012-03-26T03:56:08.957","Score":"-7","ViewCount":"172","Body":"<p>I was browsing AskDifferent and asking questions when out of nowhere I got 3 downvotes in a very very short span of time.</p>\n\n<p>They were on these questions: <a href=\"https://apple.stackexchange.com/questions/45946/does-the-unibody-design-of-the-mb-mbp-actually-help-increase-the-strength-of-t\">Does the &#39;unibody&#39; design of the MB/MBP actually help increase the strength of the MBP/MB?</a>, <a href=\"https://apple.stackexchange.com/questions/45751/which-accents-are-impossible-for-siri\">https://apple.stackexchange.com/questions/45751/which-accents-are-impossible-for-siri</a>, and <a href=\"https://apple.stackexchange.com/questions/45765/do-i-really-need-bonjour-on-windows\">Do I really need Bonjour on Windows?</a>.</p>\n\n<p>Is this suspicious enough for the system to catch him/her? Are these downvotes purely incidental?</p>\n","OwnerUserId":"6730","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2012-04-03T20:49:24.450","Title":"Suspicous downvoting?","Tags":"<support><voting>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"0"},{"Id":"1224","PostTypeId":"2","ParentId":"1223","CreationDate":"2012-03-26T05:10:33.387","Score":"13","Body":"<p>Voting is how the community gives you reputation and how they take it away. You can't keep the ones you like and not the ones you don't.</p>\n\n<p>As moderators, we all are responsible for watching and do regularly monitor all voting, closing and flagging. Furthermore, the system has built in checks should we miss vote swings that accumulate over short and long time periods. Nothing untoward is happening here other than you have asked a rapid succession of questions of dubious use to the site in general. Many are chatty, discussion oriented, and overly broad and subjective. Your questions are getting broad negative reactions for understandable and correct reasons in our judgement.</p>\n\n<p>We will try to close the worst so you can see which ones are not constructive or otherwise not useful to the site in general.</p>\n\n<p>We will leave some of the ones with down votes where others have given some good input. Again - just relax for any vote swings of less than 10 - especially when you are asking 10 or more questions a day. You are singlehandedly pushing other questions off the front page of the site with your volume of questions.</p>\n\n<p>You have asked for up votes and a moderator needed to edit that out of your question and ask you to not ask for votes. Another moderator (me) has asked you to stop complaining about and/or asking people to not down vote your questions.</p>\n\n<p>Please carefully read the FAQ and respond here with any questions you may have on how the site works. Also - have a read of this article on how the overall site likes to ask users to formally take a break when their behavior is disruptive.</p>\n\n<ul>\n<li><a href=\"http://blog.stackoverflow.com/2009/04/a-day-in-the-penalty-box/\">http://blog.stackoverflow.com/2009/04/a-day-in-the-penalty-box/</a></li>\n</ul>\n\n<p>We are trying to be a little extra lenient with the contest in play, but would ask you to self-moderate a bit better so we don't have to keep moderating your contributions to the site. Even if you are not clear on how to make your questions better, a slower pace of asking will reduce the chance your questions accumulate down votes and potential for closure.</p>\n\n<p>I apologize if this is blunt, but the reprimand is for your behavior and not the wide group of voters in this case.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2012-03-26T05:29:09.283","LastActivityDate":"2012-03-26T05:29:09.283","CommentCount":"0"},{"Id":"1225","PostTypeId":"2","ParentId":"1223","CreationDate":"2012-03-26T05:27:46.440","Score":"12","Body":"<p>When a post gets a score of -3, it means that three <em>different</em> people have voted against it. Downvoting is rather rare on this site; if three different people make a point of voting against a post, it is certainly not the work of a single \"cyber-criminal\"; it is the community speaking that a particular post does not belong here.</p>\n\n<p>I speak from experience here: a post of mine got three downvotes earlier this week. While I liked the post, I deleted it; the community had spoken.</p>\n\n<p>If someone votes against a person's posts to go after that person, that is indeed bad for the site. Voting should be about the post, and not about who posted it. But receiving widespread downvotes from many members of the site is the opposite of \"cyber-criminal\" -- it is how the site works. If a post gets downvotes from a range of voters, don't ask what's wrong with the voters; ask <em>yourself</em> what is wrong with the post. If you ask others for help understanding this and people try to explain, don't argue with them; <strong>listen</strong>.</p>\n","OwnerUserId":"9388","LastActivityDate":"2012-03-26T05:27:46.440","CommentCount":"3"},{"Id":"1226","PostTypeId":"2","ParentId":"1181","CreationDate":"2012-03-26T13:48:30.403","Score":"1","Body":"<p>Here's a quick question (3 atually) on the contest:  Let's assume I win an iPad (Yay me!):</p>\n\n<ul>\n<li>Do I get a colour choice?</li>\n<li>What if I already have one, can I request something of equivalent value, maybe Apple Vouchers?</li>\n<li>What if I want a 32Gb one, can I pay the difference?</li>\n</ul>\n\n<p>Thanks!</p>\n","OwnerUserId":"9495","LastActivityDate":"2012-03-26T13:48:30.403","CommentCount":"2"},{"Id":"1227","PostTypeId":"2","ParentId":"1211","CreationDate":"2012-03-26T14:52:26.907","Score":"6","Body":"<p>Yes, if there are more than 5 people in Level 3, the others will get iPod Touches. They will also be entered into the raffle.</p>\n\n<p>To figure out who the \"top 5\" are, we'll look at the posts you made for the contest and figure out the total combined score (so if all 35 of your posts had a score of 6, your combined score would be 35*6 = 210). The 5 who have the highest combined score will get an iPad.</p>\n\n<p>Sorry it wasn't clear before. Make sense now? </p>\n\n<p><strong>Edit</strong>: I've been told some people still have questions, so just to clarify - this is the score that your contest posts have. It's not your reputation or the votes you have cast, only the score on the posts that you have made.</p>\n\n<p>The posts that will count for the tie breaker are the highest-scored posts you made during the contest. For Level 2 that will be the top 20 posts and for Level 3 that will be the top 35 posts (excluding deleted posts, closed questions, and answers to closed questions).</p>\n","OwnerUserId":"13125","LastEditorUserId":"962","LastEditDate":"2012-03-29T06:22:15.420","LastActivityDate":"2012-03-29T06:22:15.420","CommentCount":"9"},{"Id":"1228","PostTypeId":"2","ParentId":"1220","CreationDate":"2012-03-26T16:01:48.040","Score":"2","Body":"<p>Lauren, part of the community development/evangelism team (CHAOS) at Stack Exchange that is running this contest, <a href=\"https://apple.meta.stackexchange.com/a/1227/219\">posted the following clarification</a>:</p>\n\n<blockquote>\n  <p>To figure out who the \"top 5\" are, we'll look at the posts you made for the contest and figure out the total combined score (so if all 35 of your posts had a score of 6, your combined score would be 35*6 = 210). The 5 who have the highest combined score will get an iPad.</p>\n</blockquote>\n","OwnerUserId":"219","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-04-01T03:15:06.773","CommentCount":"1"},{"Id":"1229","PostTypeId":"2","ParentId":"1197","CreationDate":"2012-03-26T16:09:29.700","Score":"1","Body":"<p>Given that the contest has increased the activity of the site considerably, and there are many competitors, it seems that the \"highest combined score\" part of the rules is going to come into play (unless more iPads and iPods magically appear as prizes).</p>\n\n<p>Given Lauren's post here:</p>\n\n<p><a href=\"https://apple.meta.stackexchange.com/questions/1220/how-exactly-would-winners-be-determined-if-more-than-five-users-complete-level\">How, exactly, would winners be determined if more than five users complete Level 3?</a></p>\n\n<p>The strategy of making your 20 or 35 contest entries have very high scores seems to indicate that people will be pushed to improve their existing contest entries, and carefully choose what questions to post and what questions to answer - only those that are likely to be highly voted will get much attention going forward.</p>\n\n<p>Other strategies, such as bumping and promoting your own answers on twitter and elsewhere, will come into play since simply providing more posts isn't going to help those who have already reached the level they intend to compete at.</p>\n","OwnerUserId":"219","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-03-26T16:09:29.700","CommentCount":"0"},{"Id":"1230","PostTypeId":"5","CreationDate":"2012-03-26T17:02:54.123","Score":"0","Body":"<p>Promotion can be as simple as sharing linkgs, writing a blog post or more involved events where a budget or purchasing advertising might be involved.</p>\n\n<p>Feel free to engage the moderators as well as the community here to share your ideas as well as let us know how you found a specific promotion and whether it was effective or not in your personal experience.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2012-03-26T17:02:54.123","LastActivityDate":"2012-03-26T17:02:54.123","CommentCount":"0"},{"Id":"1231","PostTypeId":"4","CreationDate":"2012-03-26T17:02:54.123","Score":"0","Body":"When you wish to promote the main Ask Different site, this is a good place to discuss your ideas and experiences with how we can better spread the word.","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2012-03-26T17:02:54.123","LastActivityDate":"2012-03-26T17:02:54.123","CommentCount":"0"},{"Id":"1232","PostTypeId":"1","AcceptedAnswerId":"1250","CreationDate":"2012-03-26T23:52:41.673","Score":"4","ViewCount":"69","Body":"<p>The <a href=\"http://data.stackexchange.com/apple/queries\" rel=\"nofollow\">Ask Different data</a> on Data Explorer was last updated before the contest opened. Is there a chance it could be updated sooner than next month, so we can worry ourselves sick trying to interpret and test the fine points of the rules? :)</p>\n","OwnerUserId":"8318","LastActivityDate":"2012-04-02T19:09:58.723","Title":"Can we get an early Data Explorer update for Ask Different, for playing with contest data?","Tags":"<support><data-explorer>","AnswerCount":"2","CommentCount":"0"},{"Id":"1233","PostTypeId":"2","ParentId":"1232","CreationDate":"2012-03-27T00:21:05.023","Score":"-1","Body":"<p>It would be interesting as a single point for data, but it wouldn't be that helpful unless it was updated daily for the full next week.  </p>\n\n<p>Besides, those that are really interested in playing the game can just go to each competitor's user page and do the work by hand.</p>\n\n<p>I'm interested in seeing the slope of each's reputation, since that's what will matter by the end of the contest, as both level 2 and 3 will have more winners than prizes.</p>\n\n<p>On the other hand, the stack exchange API would be able to provide that information for the interested programmer...</p>\n","OwnerUserId":"219","LastActivityDate":"2012-03-27T00:21:05.023","CommentCount":"3"},{"Id":"1235","PostTypeId":"2","ParentId":"1197","CreationDate":"2012-03-27T12:11:17.763","Score":"-3","Body":"<p>Here's a great example of tactical voting: <a href=\"https://apple.stackexchange.com/a/46171/3117\">https://apple.stackexchange.com/a/46171/3117</a></p>\n\n<p>Downvote, no comment, although my answer is 100% correct and was posted before any other answer was visible.</p>\n\n<p>I have a very good idea who is responsible and of course it is another person close to reaching level 3. I don't expect any action taken except to note that this <em>is</em> happening and I expect it will only become more common in the next week or so.</p>\n","OwnerUserId":"3117","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2012-03-27T12:11:17.763","CommentCount":"4"},{"Id":"1236","PostTypeId":"1","AcceptedAnswerId":"1237","CreationDate":"2012-03-27T15:18:52.630","Score":"2","ViewCount":"105","Body":"<p>In the explanation of how to participate in the contest, you make several references to \"Share a post\", but you don't explain what that means. What do you mean by that? Share with whom, and how, and where?</p>\n","OwnerDisplayName":"user9290","LastActivityDate":"2012-04-18T02:36:46.423","Title":"With regard to the iPad contest, what do you mean by \"share a post\"?","Tags":"<discussion><support>","AnswerCount":"1","CommentCount":"1"},{"Id":"1237","PostTypeId":"2","ParentId":"1236","CreationDate":"2012-03-27T15:28:27.927","Score":"1","Body":"<p>When someone arrives to this site from a URL that was generated from your logged in session, that counts as one share.</p>\n\n<p>Here is my URL for this here question of yours (with an X prepended to bypass the site's link substitution algorithm)</p>\n\n<p>Xhttp://meta.apple.stackexchange.com/q/1236/5472</p>\n\n<p>From clicking on your users link I see that you're assigned number is 9292 so you might generate a share like</p>\n\n<p>Xhttp://meta.apple.stackexchange.com/q/1236/9292</p>\n\n<p>Post the link to your \"link\" button for the question and we will likely see the /5472 identifies me as the sharer where your user number will be different. The part before that resolves to the question itself with no credit to anyone for sharing. </p>\n","OwnerUserId":"5472","LastEditorUserId":"218","LastEditDate":"2012-04-18T02:36:46.423","LastActivityDate":"2012-04-18T02:36:46.423","CommentCount":"6"},{"Id":"1238","PostTypeId":"1","AcceptedAnswerId":"1244","CreationDate":"2012-03-28T06:35:47.430","Score":"4","ViewCount":"125","Body":"<p>Here’s a screenshot from <a href=\"https://apple.stackexchange.com/users/3117/adam-eberbach\">Adam Eberbach’s profile</a> (not that it matters who it’s from — this is just so you can reproduce the issue):</p>\n\n<p><img src=\"https://i.imgur.com/Op8pT.png\" alt=\"\"></p>\n\n<p>Note that it says “19/20 shares”, even though level 3 is 100% complete. I assume that after completion of level 3, one of the questions/answers Adam shared got deleted or closed. Apparently, this has the side effect of not counting towards the total share count anymore.</p>\n\n<p>Is this a bug or a feature?</p>\n\n<p>And, by extension, if contest questions/answers are deleted/closed, will the votes they gained still be considered in the final count, or not?</p>\n\n<p><strong>Update:</strong> To clarify, I know <a href=\"https://apple.meta.stackexchange.com/a/1205/4408\">completed missions won’t be revoked</a> — I’m just wondering what happens to the total score when one of the questions/answers gets deleted/closed.</p>\n","OwnerUserId":"4408","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2012-03-29T05:58:19.757","Title":"Possible bug in the contest share count","Tags":"<bug><status-bydesign><site-promotion>","AnswerCount":"1","CommentCount":"3","ClosedDate":"2014-02-26T18:25:45.110"},{"Id":"1240","PostTypeId":"1","AcceptedAnswerId":"1241","CreationDate":"2012-03-28T17:40:50.887","Score":"17","ViewCount":"316","Body":"<p>Firstly, I do think the current competition is brilliant, and actively wanted to participate, however I stopped for 2 specific reasons.</p>\n\n<ul>\n<li>Since the start of the competition, an incredible amount of low quality questions has been asked, and in some cases, just the rate at which some users ask questions, it clearly showed it was only being asked to gain votes for the competition.</li>\n<li>Copy and paste of duplicate answer, just to train and gain votes. I have no objection to answer posted at the same time, but like <a href=\"https://apple.stackexchange.com/questions/46471/how-can-i-do-a-dictionary-look-up-without-the-trackpad\">this</a> example, a fairly high rep users posted a duplicate of my answer, sole difference with a screenshot, 2 minutes after mine. To what end?</li>\n<li>I have also noticed a the rate of voting has actively dropped. Which is the opposite of what the competition is trying to encourage.</li>\n</ul>\n\n<p>I find these type of situation extremely demotivating, especially since the bulk of these users generally disappear once the competition is over, and secondly, it becomes a rude game of having to improve an answer for no reason just to try and get a legitimate vote.</p>\n\n<p>The issue for me is not with new users, since they still need to learn the system, however watching established, long term and fairly decent reputation holding users of this site specifically, post some of the most over the top questions, or actively duplicating answers, is really disappointing to see.</p>\n\n<p>I've also seen incidents of users asking for reputation, and other unacceptable methods to try and gain extra votes. </p>\n\n<p>Is this truly the purpose or behaviour SE wants for it's sites? </p>\n\n<p><sub>Please note, there is some users that I am very glad to see in Level 2 and Level 3 that deserve it, and in one or two cases I actively tried to find content to upvote to help them closer to the prize. My issue however is with the percentage of users that will win using some unacceptable methods, leaving some real potential winners demotivated. Also, personally, if there was a way from opting out of the competition, I would, since I am not interested in any prize, either way.</sub></p>\n","OwnerUserId":"58","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2012-04-20T19:48:20.757","Title":"Does the current competition bring out the worst in users?","Tags":"<discussion><site-promotion><reputation>","AnswerCount":"2","CommentCount":"12","FavoriteCount":"1"},{"Id":"1241","PostTypeId":"2","ParentId":"1240","CreationDate":"2012-03-28T18:51:59.297","Score":"6","Body":"<p>These thoughts and more have been actively discussed in Chat for over a week now, so drop in any time if you want to discuss anything further.  Many people are in agreement in many ways, you'll see who by looking at Chat or the existing Meta questions and answers.</p>\n\n<p>I think that you chose an unfortunate example to prove your point, as adding a screenshot can take added time which makes the question take longer to complete.  But I see that the slightest hint of impropriety has got peoples backs up, and there's no reason why you should react any differently.  However, it can be a coincidence, and I myself have come across the exact same scenario <a href=\"https://apple.stackexchange.com/questions/46077/how-to-use-the-new-ipad-3rd-gen-as-a-second-screen/46080#46080\">on this question</a> although I know it to be completely innocent.  Somewhere in Chat this is discussed, and more than once I have suggested that when you get the \"another answer has been posted\" you should just ignore it and carry on with your own.</p>\n\n<p>Also, full disclosure and all, it's just not something @Jaberg would actually do purposefully, and to be frank he has been one of the harshest critics of the competition for the exact same reasons as you - you'd get along well ;)</p>\n","OwnerUserId":"9495","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2012-03-28T18:58:31.623","CommentCount":"3"},{"Id":"1243","PostTypeId":"1","AcceptedAnswerId":"1245","CreationDate":"2012-03-29T02:12:21.063","Score":"3","ViewCount":"179","Body":"<p>I've commented on multiple questions today and have noticed that my comments were deleted.  Unlike closed questions, deleted comments (at least from my privilege level) don't leave a trace.  It sure would be helpful to know why said comments were deleted.  Can a moderator please reach out to me to explain?</p>\n","OwnerUserId":"7001","LastActivityDate":"2012-03-29T14:08:22.287","Title":"Deleted Comments","Tags":"<discussion><comments>","AnswerCount":"1","CommentCount":"2","FavoriteCount":"2"},{"Id":"1244","PostTypeId":"2","ParentId":"1238","CreationDate":"2012-03-29T05:58:12.330","Score":"5","Body":"<p>This is as intended. As I've previously said (you've linked to the quote), once you've finished a mission, we will not revoke that mission again unless the mission has been accomplished by &hellip; less-than-fair means.</p>\n\n<p>The contest site has a (dev-only) list of those users who have accomplished a mission, but <em>according to current stats</em> would not qualify. I look at that list at least once a day to check on it (it currently lists two users, Adam and one Mission 1 winner), and neither of these cases look irregular. So there's no reason to revoke these missions; at some point, the objectives where fulfilled, and thus the mission accomplished.</p>\n\n<p>The profile widget shows a full bar (100%) if the mission is completed, but it doesn't lie about the stats. To be precise (and to comment on speculations about rounding errors), the percentage is deliberately designed to be at 100% <em>if and only if</em> the mission is completed. Having achieved 99.8% of a mission is still 99%, and having achieved a mission but not matching the stats <em>anymore</em> still puts you at 100%.</p>\n","OwnerUserId":"962","LastActivityDate":"2012-03-29T05:58:12.330","CommentCount":"8"},{"Id":"1245","PostTypeId":"2","ParentId":"1243","CreationDate":"2012-03-29T14:08:22.287","Score":"8","Body":"<p>Part of keeping quality high on the site is <strong>making sure that questions and answers are self contained and self explanatory</strong>. That's why we require links to be summarized or excerpted and why we allow anyone to edit posts. The goal is that someone coming from, say Google, should not need to read all of the comments on a question or answer for it to make sense or be useful.</p>\n\n<p>Similarly, we like to make sure that all comments on a post are <strong>useful</strong>, <strong>relevant</strong>, and <strong>necessary</strong>.</p>\n\n<p>To these ends, there are a few main reasons we delete comments.</p>\n\n<hr>\n\n<h2>Unnecessary/Noise</h2>\n\n<p>A comment saying <em>\"Oh my gosh, what an awesome question! I've always wondered this.\"</em> would <strong>better be expressed by an upvote</strong> (or, in extreme cases, a bounty).<br>\nThis type of comment adds nothing. It's safe to assume that the commenter has already upvoted the post, so the comment is unnecessary and can be deleted.</p>\n\n<h2>Obsolete</h2>\n\n<p>If for any reason a comment no longer adds to a post, it can be deleted.</p>\n\n<p>If a comment contains useful information (<em>\"I'm using 10.7.3, btw\"</em>), it should be incorporated into the post as an edit so that the post is self contained. Once the edit has been made, the comment is redundant and can be deleted.</p>\n\n<h2>Long Discussion</h2>\n\n<p>Long comment threads are discouraged. The system automatically steps in and offers to create a chat room if things get too bad, but sometimes long discussions do pop up.</p>\n\n<p>If it appears that the discussions are done, have served their purpose, and are no longer adding to the post, they can be deleted or 'thinned'/abbreviated.</p>\n\n<h2>Rude/Offensive</h2>\n\n<p>I have yet to see a rude or offensive comment that adds any value to a post. Most rude comments are on answers that someone doesn't like: <em>\"What a stupid way to do this! I've been using a Mac for a week and even I know better than this!\"</em>. These comments are mean, and could be better expressed with a downvote.</p>\n\n<p>That's not to say, of course, that a friendly, constructive comment explaining how a post could be improved or why it was downvoted should be deleted. If there is value in the criticism, the comment can stay (but should be edited if it is rude).</p>\n\n<hr>\n\n<p>Almost all comment deletions fall into these categories. If you feel that any of your comments that have been deleted do not, feel free to give me a link to the post where the comment was and I can explain what happened.</p>\n","OwnerUserId":"2220","LastActivityDate":"2012-03-29T14:08:22.287","CommentCount":"0"},{"Id":"1246","PostTypeId":"2","ParentId":"1240","CreationDate":"2012-03-29T16:39:32.553","Score":"2","Body":"<blockquote>\n  <p>Since the start of the competition, an incredible amount of low quality questions has been asked</p>\n</blockquote>\n\n<p>I think some examples are in order.  Yes, we've got more questions, but are they truly low quality?  </p>\n\n<blockquote>\n  <p>in some cases, just the rate at which some users ask questions, it clearly showed it was only being asked to gain votes for the competition.</p>\n</blockquote>\n\n<p>Well, that was one of the main goals of the competition, to generate new content and expand the knowledge base.  I don't think that this point is a bad thing, unless the additional content has a negative effect, as your first point suggests.</p>\n\n<blockquote>\n  <p>Copy and paste of duplicate answer, just to train and gain votes. </p>\n</blockquote>\n\n<p>I've seen duplicate answers, but in each case I saw that they were added within minutes of each other, and since it takes me more than a few minutes to write a post then I see it simply as two people with essentially the same answer.</p>\n\n<p>What I have noticed is that once people see their answer is duplicate, often they'll delete their own unless it's substantially better than the other answer.  This isn't happening here, and while it's not ideal, it's not a bad thing - it's just duplicate information.</p>\n\n<p>balpha gave enough information to show that voting was actually up, so I don't think that's an issue anymore.</p>\n\n<p>So the only issue remaining is whether the new posts are low quality or not.</p>\n\n<p>It has been my experience that a community won't shy away from downvoting low quality posts, and yet I've seen very few questions and answers downvoted.  Either the whole community is accepting them, generally (and it's a big community) or people are being nice to avoid angering people for the contest.</p>\n\n<p>I think this can only be resolved if you bring 5-10 examples of such posts here so we can discuss their merit.</p>\n\n<p>For my part, I have been asking questions I wouldn't normally ask. Many of them could be discovered with 20-30 minutes of research on my part.  However that doesn't make them a bad question, to my way of thinking.  Since only one of my questions was downvoted, I'm assuming the community is fine with them.</p>\n\n<p>I'd suggest people start downvoting and commenting on low quality questions.  If it's a serious problem that needs to be cleaned up, get the community active in calling people out on it.</p>\n\n<p>I'm reminded of the early days of Stack Overflow.  We had a lot of relatively simple questions, but there were two surprising outcomes:</p>\n\n<ol>\n<li>We became the canonical reference from google, and those questions, as simple as they are, draw in thousands of users trying to figure them out themselves.</li>\n<li>We found that sometimes the simple questions had interesting complex answers, and once you got past the surface layer they revealed complexity in subjects many people take for granted.</li>\n</ol>\n\n<p>I don't know that either will apply here, but I wouldn't encourage people to treat simple questions as low quality, and to answer them seriously rather than via simple google search.  Even experts might be surprised at what they find when they dig deep into a seemingly simple question.</p>\n","OwnerUserId":"219","LastEditorUserId":"219","LastEditDate":"2012-03-29T16:49:59.250","LastActivityDate":"2012-03-29T16:49:59.250","CommentCount":"2"},{"Id":"1247","PostTypeId":"1","CreationDate":"2012-03-31T17:21:12.373","Score":"15","ViewCount":"195","Body":"<h1>Current behaviour</h1>\n\n<p>Example: <a href=\"http://x-man-page://8/fsck_cs\" rel=\"nofollow noreferrer\">x-man-page://8/fsck_cs</a> is misinterpreted as an <code>http://</code> URL.</p>\n\n<h1>Proposal</h1>\n\n<p>Allow <code>x-man-page://</code> URLs to be hyperlinked —</p>\n\n<ul>\n<li><a href=\"http://content.wuala.com/contents/grahamperrin/public/2012/04/01/a/example.html\" rel=\"nofollow noreferrer\">examples</a>.</li>\n</ul>\n\n<h2>Motivations</h2>\n\n<p><strong>Appropriateness</strong>. Referring to an <code>http://</code> or <code>https://</code> URL for an online copy of the page may present a manual that is <em>too new</em> or <em>too old</em> for the user's system. Linking to an <code>x-man-page://</code> URL will ensure that the page, read in OS X, is proper for the system.</p>\n\n<p><strong>Ease of use</strong>. The settings used by Terminal in response to these URLs are more immediately user-friendly than, say, entering <code>man grep</code> at the command line. Windows such as those below <strong>respond normally</strong> to the close box, to Command-W, down, up, page down and up keys, scrolling and so on: </p>\n\n<p><img src=\"https://i.stack.imgur.com/5fNOE.png\" alt=\"a screenshot of Terminal using its Man Page settings for intro (1)\"></p>\n\n<p><img src=\"https://i.stack.imgur.com/e86cC.png\" alt=\"a shot of Terminal using its Man Page settings for mdfind (1)\"></p>\n\n<h2>Assumptions</h2>\n\n<p>It will be possible to enable this feature discretely, in <em>apple.stackexchange.com</em> areas alone</p>\n\n<ul>\n<li>other stacks might be less welcoming of link protocols that are operating system-specific.</li>\n</ul>\n\n<p>The reader will use OS X when following a link that is intended to open Terminal.app</p>\n\n<ul>\n<li>for this reason, I chose Ask Different for this meta question.</li>\n</ul>\n\n<p>Questions of a type that might include <code>x-man-page://</code> URLs are not likely to be migrated to any stack other than Ask Different. </p>\n\n<h2>Risks</h2>\n\n<p><strong>Without OS X</strong>, a reader may be confused by links that their system can not handle. Minimise this risk by use of plain english. With the shortening workaround suggested by Kyle, any one of the following examples might be plain enough: </p>\n\n<ul>\n<li><a href=\"http://is.gd/mddiagnose\" rel=\"nofollow noreferrer\">view the manual page for mddiagnose in OS X</a></li>\n<li><a href=\"http://is.gd/mddiagnose\" rel=\"nofollow noreferrer\">view the manual page for mddiagnose in Terminal</a></li>\n<li><a href=\"http://is.gd/mddiagnose\" rel=\"nofollow noreferrer\">view the manual page for mddiagnose in Terminal.app</a></li>\n<li><a href=\"http://is.gd/mddiagnose\" rel=\"nofollow noreferrer\">view the manual page for mddiagnose in Terminal in OS X</a>.</li>\n</ul>\n\n<p><a href=\"https://apple.meta.stackexchange.com/a/1249/8546\"><strong>Verbosity and gobbledy-gook</strong></a>. This exists in some man pages, not all. If a person will be daunted by the content of a page, then he or she might prefer to read that content in a web browser (solutions such as Bwana are given in answers elsewhere). </p>\n\n<p>However: most such content relates to use of Terminal, so I argue that there's value in encouraging <strong>uses that can make Terminal less daunting</strong>. Reading a page that can be scrolled and closed with ease is one such use case.  </p>\n\n<h2>References</h2>\n\n<p><a href=\"https://apple.stackexchange.com/a/24351/8546\">https://apple.stackexchange.com/a/24351/8546</a></p>\n","OwnerUserId":"8546","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-07-04T09:14:20.770","Title":"To ensure that users read proper manual pages: should we allow hyperlinking of x-man-page:// URLs?","Tags":"<feature-request>","AnswerCount":"4","CommentCount":"0","FavoriteCount":"2"},{"Id":"1248","PostTypeId":"2","ParentId":"1247","CreationDate":"2012-03-31T17:25:09.387","Score":"4","Body":"<p>You could use a link shortener to link to the x-man-page URLs, like so:</p>\n\n<p><a href=\"http://is.gd/kP7w5a\" rel=\"nofollow\">x-man-page://8/fsck_cs</a></p>\n","OwnerUserId":"13","LastActivityDate":"2012-03-31T17:25:09.387","CommentCount":"3"},{"Id":"1249","PostTypeId":"2","ParentId":"1247","CreationDate":"2012-04-01T13:48:39.747","Score":"7","Body":"<p>All-in-all I like this idea, but I want to raise one point of concern. Generally speaking, a user who needs <em>help</em> accessing a man page has a high likelihood of being a user who will might be a little freaked out when clicking on a link opens a terminal session and causes pages (and pages and pages) of <em>gobbledy-gook</em> to appear. Discuss.</p>\n","OwnerUserId":"11791","LastActivityDate":"2012-04-01T13:48:39.747","CommentCount":"1"},{"Id":"1250","PostTypeId":"2","ParentId":"1232","CreationDate":"2012-04-02T19:09:58.723","Score":"0","Body":"<p>Can't you use the API? The documentation for the API includes a reasonably user friendly console for you to retrieve data, although the response is in JSON.</p>\n","OwnerUserId":"796","LastActivityDate":"2012-04-02T19:09:58.723","CommentCount":"1"},{"Id":"1254","PostTypeId":"1","AcceptedAnswerId":"1258","CreationDate":"2012-04-03T02:11:45.307","Score":"-1","ViewCount":"136","Body":"<p>I had everything I needed to qualify for Level 2 in the contest - the 20 required questions with 2 upvotes each, the votes, and even the sharing.</p>\n\n<p>I posted a picture on my website with the text \"Ask and answer questions about Macs! Click to see more!\", which my users quickly ate up. They click on <em>anything</em>.</p>\n\n<p>The links were tracked with a URL shortener, which let me see exactly how many clicks I had. After a short amount of time, my quota was filled (I looked at the URL shortener's stats and I saw for each of the 11 {just to be safe} ads, at least 15 clicks on each one). One of my users even signed up and made an account.</p>\n\n<p>Thus, I was feeling pretty confident that my place was secured. Knowing that the site had probably some lag, I wasn't surprised when the share progress bar told me I had 7 - it was 5 a few minutes ago. I knew, thanks to the shortened URLs, that I was in the 'way past safe' category.</p>\n\n<p>This all made it a complete surprise to me that I didn't get into Level Two. See <a href=\"http://thenewipadishere.com/\" rel=\"nofollow\">http://thenewipadishere.com/</a>; as of now, I'm still not listed.</p>\n\n<p>Is it possible for a moderator or someone at Stack Exchange to take a look at the links I posted and investigate whether they should have been counted towards the contest?</p>\n","OwnerUserId":"6730","LastEditorUserId":"2220","LastEditDate":"2012-04-03T03:28:33.923","LastActivityDate":"2012-04-03T14:57:03.707","Title":"Why haven't some of my shares been recorded?","Tags":"<support><site-promotion>","AnswerCount":"3","CommentCount":"10"},{"Id":"1255","PostTypeId":"2","ParentId":"1254","CreationDate":"2012-04-03T03:08:38.533","Score":"1","Body":"<p>Which link style did you use:</p>\n\n<p><code>http://meta.apple.stackexchange.com/q/1254/219</code></p>\n\n<p>or</p>\n\n<p><code>http://meta.apple.stackexchange.com/questions/1254/what-happened-with-the-link-sharing</code></p>\n\n<p>The second type doesn't count, it has to have your user number at the end of the link as with the first style.</p>\n\n<p>If you want to make the contest administrator's jobs easier, provide a list of the URLs you advertised that you believe were clicked at least 5 times.  I imagine this information is still in your URL tracking service.</p>\n","OwnerUserId":"219","LastActivityDate":"2012-04-03T03:08:38.533","CommentCount":"1"},{"Id":"1256","PostTypeId":"2","ParentId":"1254","CreationDate":"2012-04-03T03:26:13.397","Score":"2","Body":"<p>Some things to note:</p>\n\n<ul>\n<li>As mentioned, links must be in the correct format (ending with your\nuser ID, 6730).</li>\n<li>You must have 10 unique links. Posting a link to the same post\nmultiple times can only count towards one share.</li>\n<li>To count as a share, each link (or all links to a specific post\ncombined) must be clicked by at least 5 unique IP addresses. Even if the URL shortener reports that a link has been clicked many times, it's possible that it has been clicked multiple times by the same person.</li>\n<li>I'm not 100% sure, but it's my guess, that links to closed or deleted\nquestions aren't counted.</li>\n</ul>\n\n<p>In general, the link tracking systems here are pretty reliable. They're not a new feature and are used for things other than contests.<br>\nRealistically, it is more likely that the URL shortener is reporting a different metric than Stack Exchange is recording (or misreporting altogether) than it is that Stack Exchange's tracking isn't working.</p>\n\n<p>Moderators have no more access to link information or influence on contest results than you do; Stack Exchange will have to be the ones to investigate further.</p>\n\n<p>Sorry that things aren't working out as expected!</p>\n","OwnerUserId":"2220","LastEditorUserId":"2220","LastEditDate":"2012-04-03T03:31:37.383","LastActivityDate":"2012-04-03T03:31:37.383","CommentCount":"2"},{"Id":"1257","PostTypeId":"2","ParentId":"1181","CreationDate":"2012-04-03T14:54:46.017","Score":"8","Body":"<p>The contest has now officially ended. Congrats to everyone who completed the Levels! Winners will be contacted over the next couple of days.</p>\n","OwnerUserId":"13125","LastActivityDate":"2012-04-03T14:54:46.017","CommentCount":"5"},{"Id":"1258","PostTypeId":"2","ParentId":"1254","CreationDate":"2012-04-03T14:57:03.707","Score":"13","Body":"<p>Your mission progress counts seven out of ten shares; these are the seven posts that meet the sharing requirements:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/17929/how-can-i-disable-animation-when-switching-desktops-in-lion\">How can I disable animation when switching desktops in Lion?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/27274/how-does-imessage-know-that-the-recipient-is-an-ios-5-device\">How does iMessage know that the recipient is an iOS 5 device?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/45715/does-ichat-block-content-in-china\">Does iChat block content in China?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/46046/is-there-a-keyboard-shortcut-to-move-the-position-of-the-dock\">Is there a keyboard shortcut to move the position of the Dock?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/46143/is-it-possible-to-drag-the-dock-around-the-screen\">Is it possible to drag the Dock around the screen?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/46165/can-i-move-the-top-menu-bar\">Can I move the top menu bar?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/46175/can-i-use-adblock-adblock-plus-to-block-ads-in-games-that-are-not-in-a-browser\">Can I use Adblock/Adblock Plus to block ads in games that are not in a browser?</a></li>\n</ul>\n\n<p>To be sure that there's nothing wrong here, I looked at the server access logs, which record <em>all</em> requests to your shared URLs, not just those that eventually counted as a valid referral.</p>\n\n<p>In looking at the logs, I made these two observations about a vast (!) majority of the requests:</p>\n\n<ol>\n<li><p>They came in bunches. The requests didn't come naturally in a \"hey, this looks interesting, I'll check it out\" pattern; instead they look like a \"here's a bunch of links, all of which I shall now click within quick succession, maybe even twice for good measure.\"</p></li>\n<li><p>They either came very obviously from you, or the reqesting IP address belonged to one of these groups:</p>\n\n<ul>\n<li>registered to an institution that you seem to have ties to,</li>\n<li>registered to dedicated hosting providers,</li>\n<li>well-known proxy.</li>\n</ul></li>\n</ol>\n\n<p>I am therefore inclined to consider the assumption that you didn't meet the sharing requirements to be correct.</p>\n","OwnerUserId":"962","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2012-04-03T14:57:03.707","CommentCount":"3"},{"Id":"1259","PostTypeId":"2","ParentId":"1186","CreationDate":"2012-04-04T17:39:59.523","Score":"3","Body":"<h1>Yes,</h1>\n\n<p>you can. There are three different ways to do it.</p>\n\n<h2>Method #1</h2>\n\n<ol>\n<li><p>Earn 10,000 reputation</p></li>\n<li><p>Click the \"review\" tab.</p></li>\n<li><p>Click the \"close\" subtab</p></li>\n</ol>\n\n<p>There you will see all the posts with recent close votes, including those you cast.</p>\n\n<h2>Method #2</h2>\n\n<ol>\n<li><p>Win an election as moderator.</p></li>\n<li><p>Click the \"review\" tab.</p></li>\n<li><p>Click the \"close\" subtab</p></li>\n</ol>\n\n<h2>Method #3</h2>\n\n<ol>\n<li><p>When you cast a close vote, bookmark the page</p></li>\n<li><p>Revisit your bookmarks later to see the status of questions you voted to close.</p></li>\n</ol>\n","OwnerUserId":"9388","LastActivityDate":"2012-04-04T17:39:59.523","CommentCount":"1"},{"Id":"1260","PostTypeId":"1","CreationDate":"2012-04-05T10:21:35.277","Score":"13","ViewCount":"328","Body":"<p>I think, now that the dust has settled and the winners notified from the <a href=\"https://apple.meta.stackexchange.com/questions/1181/the-new-ipad-is-here-ask-different-and-win-one\">recent site-promotion campaign</a>, it would be very useful for the organisers to see our thoughts on it all (and indeed have their say on how they saw it working).  <strong>Note</strong> that this is <strong>not</strong> a chance to complain about individual users/questions/answers/outcomes, but a chance to have your say on <em>what you thought worked really well</em>, and what if <em>anything you think could be changed or improved</em> in any future site promotions.</p>\n\n<p>Please try to keep your answers constructive. If you have anything negative to say, feel free to say it, but try to also make suggestions as to what could be done in future to alleviate your concerns without simply complaining.  Again, let's keep from linking to specific contest <em>content</em>, and talk about the <em>structure</em>.</p>\n","OwnerUserId":"9495","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-04-12T01:07:58.023","Title":"Reflection on the recent Site-Promotion","Tags":"<discussion><site-promotion>","AnswerCount":"8","CommentCount":"1","FavoriteCount":"3"},{"Id":"1261","PostTypeId":"2","ParentId":"1260","CreationDate":"2012-04-05T10:52:28.247","Score":"11","Body":"<h2>Rankings, prize assignments, and competitive behavior</h2>\n\n<p>I have 1 change that I would like to see incorporated into future competitions, and that is essentially having a way of selecting winners that does <em>not</em> result in users directly competing against <em>each other</em>, rather than <em>themselves</em>.  We should be trying to do the best we can achieve, not simply better than next guy.  The benchmark should be where your personal pride and motivation takes you, and not be judged against the next users aims.</p>\n\n<p>I think that the original intent was to get people to promote the use of Ask Different to an expanded audience and increase general participation levels, and initially this happened very well, but towards the end of the competition this resulted in the voting percentages dropping hugely (anecdotaly, at least for the Level 3 users) as users realised that complying with the spirit of the competition might have an affect on their chances of winning the iPads.  This has a knock on affect that latter Q&amp;As were top heavy on answers, often similar answers, and low on votes which <em>could</em> produce the outlook to the new users we were trying to attract that no-one was providing genuinely good answers, which is obviously contrary to the aims of the site in general, never mind the competition.  You can look at pretty much anyones rep curve for the 3 week period and see this marked \"Hump\" affect as the patterns altered during the period.</p>\n\n<p>In order to prevent this, I have 2 recommendations:</p>\n\n<ul>\n<li><p>Provide a greater element of <em>Randomness</em> when selecting winners.  There were 10 Level 3 users, and if the rules had been something like \"The Top Score wins an iPad for being amazing, everyone else is in a raffle to win the remaining 4\" it would have produced odds of 4 in 9 to win an iPad - this is still really really great odds that would inspire people to work hard, and means that there is no difference to coming 2nd or 10th, so long as you worked hard enough to get into that level in the first place.  \"Tactical\" voting would be greatly reduced, as it would not really be possible to affect the result by doing it.</p></li>\n<li><p>Either cut down on the ability to follow other users scores, or go the whole hog and provide the <em>whole</em> story in the contest progress pages.  Looking at the lists (and knowing that there was a <em>big</em> difference between 5th and 6th) made it very tempting to compare your results against other users and use that as a basis for choosing who to selectively fail to vote for.  During the last few hours of the contest it turned out that at least 4 people in the top 10 had written scripts to query the APIs and rank the current contestant scores.  Whilst the data is public, better to either stop it happening (possibly by not <em>explicitely</em> starting the exact tie-break mechanism from the start) or level the playing field and prepare them for everyone up front.</p></li>\n</ul>\n\n<p>Lastly, a big thanks to everyone at SE that helped to organise the thing - We know that @Lauren and @balpha were heavily involved, but I am sure that there are more names behind the doors that also deserve thanks.</p>\n","OwnerUserId":"9495","LastEditorUserId":"8318","LastEditDate":"2012-04-05T18:03:06.833","LastActivityDate":"2012-04-05T18:03:06.833","CommentCount":"4"},{"Id":"1262","PostTypeId":"2","ParentId":"1260","CreationDate":"2012-04-05T13:27:16.277","Score":"2","Body":"<h2>Share links on @StackApple Twitter</h2>\n\n<p>IMHO, the @StackApple Twitter account shouldn’t tweet or retweet a contest entrant’s personalised share links while the contest is still running. This is unfair towards other people who participate in the contest.</p>\n\n<p>Here’s an example of such a tweet: <a href=\"http://twitter.com/stackapple/status/185739657777135616\" rel=\"nofollow\">http://twitter.com/stackapple/status/185739657777135616</a> It links to <code>http://goo.gl/q01yJ</code>, which in turn redirects to <code>http://apple.stackexchange.com/q/46077/11610?stw=1</code>, which is the personalised twitter share link for one of the contest participants.</p>\n\n<p>When tweeting during a promotion whomever is in charge of the twitter account simply needs to ensure that they do not use the linking buttons, or remembers to strip the userID off the end of the URL.</p>\n","OwnerUserId":"4408","LastEditorUserId":"8318","LastEditDate":"2012-04-05T18:00:18.817","LastActivityDate":"2012-04-05T18:00:18.817","CommentCount":"3"},{"Id":"1263","PostTypeId":"2","ParentId":"1260","CreationDate":"2012-04-05T15:23:39.033","Score":"7","Body":"<h2>Score thresholds and post quality</h2>\n\n<p>I love that the metrics to qualify for the higher levels included votes received, votes cast, and shares. Encouraging people to participate across the board is great, and it worked well (especially in the first few weeks).</p>\n\n<p>That said, <strong>I think that increasing the vote thresholds for posts would increase quality.</strong></p>\n\n<p>A score of two isn't very high for a post to receive, especially when people are being motivated to vote more than ever. It is entirely conceivable that a low quality or borderline post could receive a score of two. I would love to see a slightly higher requirement, perhaps around 3 or 4. To keep the contest from getting harder, the required number of posts could be made lower, perhaps so that the total number of votes one was required to receive didn't increase.</p>\n\n<p>Higher thresholds for votes received would make sure that low quality posts didn't contribute to someone's contest qualifications, and it would discourage the behavior of posting something not great in the hopes that it somehow gets a score of two.</p>\n\n<p>Lower quantity requirements would also help quality: people simply wouldn't feel motivated to post in as high volume, which would discourage the \"Well, I'll just post everything I can think of!\" mentality.</p>\n","OwnerUserId":"2220","LastEditorUserId":"8318","LastEditDate":"2012-04-05T18:00:42.093","LastActivityDate":"2012-04-05T18:00:42.093","CommentCount":"0"},{"Id":"1264","PostTypeId":"2","ParentId":"1260","CreationDate":"2012-04-05T17:59:45.073","Score":"4","Body":"<h2>Rule clarifications and tie-breaking</h2>\n\n<p>Some clarifications were made to the contest rules in <a href=\"https://apple.meta.stackexchange.com/questions/1220/how-exactly-would-winners-be-determined-if-more-than-five-users-complete-level\">a meta post</a>. Next time around, if these particular rules still apply, they can simply be added to the initial ruleset to reduce confusion.</p>\n\n<p>And a probably not crucial point: the rules (taking into account the later clarifications) were clear about what happened if more people than prizes were in a given level (the top users in a level, by score on contest posts, would get the prizes) — but they weren't clear on <strong>tie-breaking among the top users in a level</strong>. (<a href=\"https://apple.meta.stackexchange.com/questions/1181/the-new-ipad-is-here-ask-different-and-win-one\">During this contest</a>, there was a two-way tie for 5th place in Level 3 — while probably unusual, it would be nice to see this case explicitly covered in the rules.)</p>\n","OwnerUserId":"8318","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-04-05T21:07:43.933","CommentCount":"1"},{"Id":"1265","PostTypeId":"2","ParentId":"1260","CreationDate":"2012-04-06T13:47:00.167","Score":"6","Body":"<p>This answer is an extension of my thoughts on both of @stuffe's and @NathanGreestein's posts.</p>\n\n<h2>Promotion vs Competition</h2>\n\n<p>Given the ability to take influence on who gets votes or not, any method of achieving goals by votes is likely to result in users competing against each other. </p>\n\n<p>This is not necessarily bad, it can motivate users to multiply their efforts in providing good answers. This only turns the other way if users restrict themselves from voting. (When does this happen?) Therefore, changing the rules must ultimately take away the contestants ability to have that much influence on who wins the prize. A <em>randomization</em> of winners is a good way out of this dilemma.</p>\n\n<p>Consequences: In order for the randomization of winners to work, there needs to be a set of potential winners that is large enough, otherwise the direct competition between contestants remains.\nFuture contests need to have thresholds for levels that are easy enough to reach. If reaching a level is so difficult such that only about as many contestants reach a level as there are prizes for that level, users will still compete against each other and may try to avoid pushing each other up.</p>\n\n<h2>Quality matters</h2>\n\n<p>Do \"low thresholds\" encourage low quality posts?\nThe requirement to achieve thirty-five posts with a score of two did two things: It promoted voting in the beginning of the contest because voting on posts did not directly decrease your own chances of winning - there were simply <em>so many</em> required. However, it also discouraged contestants from putting more effort into their answers for the same reason.</p>\n\n<p>If the minimum requirement to reach a level would require posts with more that two votes, users are pushed to provide answers with greater content. But, at the same time contestants should not be required to achieve too many of such posts because then the threshold to reach a level would be to high and contestants begin to compete against each other.</p>\n\n<h1>Summary</h1>\n\n<p>If you agree with my arguments, you will see that one needs to (partly) <em>randomize the selection of winners</em> and <em>find the right balance</em> between...</p>\n\n<ol>\n<li>...the minimum requirements to reach a level and</li>\n<li>...the maximum requirements to reach a level</li>\n</ol>\n\n<p>If the requirements are low, the randomization of winners works well, voting is generally promoted but more low quality posts emerge as well.</p>\n\n<p>If the requirements are too high, the randomization of winners does not work, voting drops and contestants become rivals.</p>\n","OwnerUserId":"13414","LastEditorUserId":"13414","LastEditDate":"2012-04-06T14:03:17.260","LastActivityDate":"2012-04-06T14:03:17.260","CommentCount":"0"},{"Id":"1266","PostTypeId":"2","ParentId":"1260","CreationDate":"2012-04-07T16:27:41.863","Score":"5","Body":"<p>My answer extends on  that of <a href=\"https://apple.meta.stackexchange.com/a/1265/9388\">@gentmatt</a>, which in turn extends on the answers from <a href=\"https://apple.meta.stackexchange.com/a/1261/9388\">@stuffe</a> and <a href=\"https://apple.meta.stackexchange.com/a/1263/9388\">@NathanGreenstein</a>.</p>\n\n<p>I'm impressed with this community, and how we didn't let crazy incentives destroy our sense of community. The promotion wasn't designed as a competition, and it didn't get competitive until people blew the thresholds out of the water to a degree unanticipated in the design of the promotion. I think we did a good job staying non-evil, but, of course, incentives do matter, so perhaps we can tweak them in any future promotions</p>\n\n<h2>How could we have done this had we known then what we know now?</h2>\n\n<p>In hindsight, I think it turns out that the winning bars should have been higher in terms of quality (more posts with at least 6 or even more votes), perhaps lower in terms of quantity (encouraging a <em>lot</em> of two vote questions/answers maybe isn't a great thing for the site), and shorter in terms of the length of time the promotion runs.</p>\n\n<p>If the winning bar for this one were so high that <a href=\"https://apple.meta.stackexchange.com/users/13414/gentmatt\">only one crazy person</a> were likely to be able to make it there, I suspect it wouldn't have been a competition; it would have been a lot of people cheering him on. But then the promotion wouldn't have drawn in as many people.</p>\n\n<p>I think the idea of some fixed prizes and some randomized is a good thing, but I'd like to see a different mix, with a smoother gradient between the deterministic portion (you <strong>will</strong> win this prize) and the purely stochastic (<strong>anyone</strong> who meets the minimum threshold has an equal chance). No abrupt cutoffs mean no cutthroat competition to be the one right above, and not below, the cutoff, but improved odds for better performance encourages everyone to do their best.</p>\n\n<p>Perhaps something like</p>\n\n<ul>\n<li>the high scorer in the promotion wins an iPad.</li>\n<li>for people who complete <em>x</em> shares and vote at least <em>y</em> times, each question or answer with 8 (10?) or more votes gives you ten tickets in a drawing for one of 5 iPads.</li>\n<li>for people who complete <em>w</em> shares and vote at least <em>z</em> times, each question or answer with 4 (5?) or more votes gives you ten tickets in a drawing for one of 25 iPod Touch devices.</li>\n<li>No one can win more than one prize.</li>\n<li>If fewer than 5/25 people meet some minimum threshold, fewer prizes are given out.</li>\n</ul>\n\n<p>Even better if the random drawing algorithm could be sophisticated enough that if you cast upvote #1-8 for a question or answer that ends up reaching 8 votes, it slightly improves your chances of winning yourself (things that would give you ten tickets give you 11 tickets, for instance) -- wouldn't it be great if we could reward constructive edits and constructive voting, given that they're what makes the site work?</p>\n\n<p>Then, there's still an incentive to vote for quality. There's an incentive to post <strong>good</strong> stuff, and not just anything. And there's a link between merit and success, but some element of chance also.</p>\n\n<p>It's not just luck, but it isn't cutthroat competition, either. Helping along your fellow participants is rewarded, but there's a direct link between posting great things and improving your own chance of winning.</p>\n","OwnerUserId":"9388","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-04-07T16:27:41.863","CommentCount":"0"},{"Id":"1267","PostTypeId":"2","ParentId":"1260","CreationDate":"2012-04-09T16:04:30.890","Score":"3","Body":"<p>Good:</p>\n\n<ul>\n<li>Goals were achievable</li>\n<li>Prizes were guaranteed for the top 30 contestants</li>\n<li>Prizes were substantial (I'm not going to put in hours of effort for a tshirt, but I'll put in a lot of time for an iPod and the possibility of an iPad)</li>\n<li>I really don't like contests where the odds are determined by the number of entrants, but this had a good balance of difficulty and large number of prizes that it was reasonable.  </li>\n</ul>\n\n<p>Improvements:</p>\n\n<ul>\n<li>It sometimes took more than a day to get various clarifications regarding the contest</li>\n<li>Clarifications that were made occurred on a number of posts, and it appears that those who hung out in chat had somewhat of a better grasp on the contest than those relying solely on the contest rules and meta posts.  I don't know that any clarifications were made in chat, but perhaps some were.</li>\n<li>While I applaud simple rules, and while I understand no one believed the tie-breaker would be needed, it was obvious that some were confused as to how exactly the tie-breaker would be computed (specifically which posts counted) and that this confusion persisted until nearly the end of the contest.  I had stopped contributing posts because I thought that the first 35 posts that reached 2+ were locked in - so this misunderstanding resulted in me contributing less in order to improve my final contest score, until I finally understood it was the top 35 posts during the contest. Such misunderstandings, if not corrected early in the contest, can work against the point of the contest.</li>\n<li>As an outsider coming in primarily to compete in the contest, I was surprised at how easy it was to compete, and how the contest was not biased towards regular contributors.  It doesn't need to overtly balance towards regular contributors, and part of the contest is to bring in new regular users, but perhaps the rules can be set up so that those who \"live\" here find it easier to compete.</li>\n<li>The mix between random and guaranteed awards was imbalanced.  15% of the prizes went to the drawing, and 85% to the higher levels.  For those who knew they could get into the higher levels without difficulty it's not an issue, but if I was at all unsure, then I wouldn't have participated even to reach the lowest level.  I think it would have been better to have something like 1 ipad and 5 ipods for the level one drawing.</li>\n<li>I generally agree with the others that each level should be drawn - otherwise you should simply do away with the levels altogether.  Once you have a \"bucket\" where you are either present or not, sub-ranking within the bucket is more complex and leaves the system open to more gaming.</li>\n<li>If you don't want to do a drawing inside each bucket, then consider downplaying the buckets, and using \"contest points\" instead.  Each 2+ post gives you 1 point per upvote, each share gives you 1 point for every 5 people who click on it, each day you spend all 35 votes you get another point, etc.  Then everyone can see where they are in the rankings on a daily basis, and know exactly what they need to do in order to be in the top 5 for the ipad, or top 30 for the ipod.  You can still have a minimum participation requirement that needs to be fulfilled before you're eligible for each level - the bucket is still there - it's just not emphasized.  I'm not a big fan of this as it adds complexity, but it allows contest administrators to finely tune the balance between the different parts of the contest (posts/shares, for instance) and encourages users to continue to contribute beyond the minimum.</li>\n<li>Part of the contest, at the end, depended on one's ability to write a script to determine one's ranking.  Either provide that information up front, or use a random draw so the playing field is level on a non-programming site.  I could understand this being part of the contest for a programming site, but it doesn't make sense on other sites.</li>\n</ul>\n","OwnerUserId":"219","LastActivityDate":"2012-04-09T16:04:30.890","CommentCount":"0"},{"Id":"1268","PostTypeId":"2","ParentId":"1119","CreationDate":"2012-04-10T04:13:37.123","Score":"3","Body":"<p>If Apple provides a public area for discussion of an Apple product, then Ask Different should not close or delete questions about that product. </p>\n\n<p><a href=\"https://discussions.apple.com/community/mac_os/messages_beta\" rel=\"nofollow\">Messages Beta: Mac OS &amp; System Software: Apple Support Communities</a></p>\n\n<ul>\n<li>the current license, EA0842 (2012-01-20) (<a href=\"http://www.wuala.com/%23%23Apple-support/members/grahamperrin/2012/04/10/a/\" rel=\"nofollow\">temporary copy</a>) does not restrict discussion.</li>\n</ul>\n\n<p><a href=\"https://discussions.apple.com/community/iphone/using_iphone\" rel=\"nofollow\">Using iPhone: iPhone: Apple Support Communities</a> </p>\n\n<ul>\n<li><a href=\"http://support.apple.com/kb/HT4992\" rel=\"nofollow\">iPhone 4S: About Siri</a> (modified 2012-03-07), <a href=\"http://support.apple.com/kb/TS4079\" rel=\"nofollow\">iPhone 4S: Troubleshooting Siri</a> (modified 2012-03-13), <a href=\"http://www.apple.com/iphone/features/\" rel=\"nofollow\">http://www.apple.com/iphone/features/</a> and other pages in the <code>apple.com</code> domain currently state that Siri is available in beta only on iPhone 4S.</li>\n</ul>\n","OwnerUserId":"8546","LastEditorUserId":"8546","LastEditDate":"2012-04-10T12:02:23.130","LastActivityDate":"2012-04-10T12:02:23.130","CommentCount":"2"},{"Id":"1269","PostTypeId":"2","ParentId":"121","CreationDate":"2012-04-10T05:28:16.670","Score":"0","Body":"<h1>Tag synonym: <a href=\"https://apple.stackexchange.com/questions/tagged/beta\" class=\"post-tag\" title=\"show questions tagged &#39;beta&#39;\" rel=\"tag\">beta</a></h1>\n\n<h2>Background</h2>\n\n<p><a href=\"https://apple.meta.stackexchange.com/a/1121/8546\">In answer</a> to a very good meta question <a href=\"https://apple.meta.stackexchange.com/q/1119/8546\">Despite the general rule to not answer questions about beta products, should we allow Messages on OSX and Siri on iPhone 4S questions?</a> we have the suggestion of tags such as:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/messages-beta\" class=\"post-tag\" title=\"show questions tagged &#39;messages-beta&#39;\" rel=\"tag\">messages-beta</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/siri-beta\" class=\"post-tag\" title=\"show questions tagged &#39;siri-beta&#39;\" rel=\"tag\">siri-beta</a></li>\n</ul>\n\n<p>I would prefer: </p>\n\n<ul>\n<li>a single <strong>tag</strong> <a href=\"https://apple.stackexchange.com/questions/tagged/pre-release\" class=\"post-tag\" title=\"show questions tagged &#39;pre-release&#39;\" rel=\"tag\">pre-release</a> — for voting purposes, there's a <a href=\"https://apple.meta.stackexchange.com/a/1270/8546\">separate answer</a></li>\n<li>plus probably a <strong>tag synonym</strong>, <a href=\"https://apple.stackexchange.com/questions/tagged/beta\" class=\"post-tag\" title=\"show questions tagged &#39;beta&#39;\" rel=\"tag\">beta</a>. </li>\n</ul>\n\n<p>As used by Apple, expressions <em>pre-release</em> and <em>beta</em> are <strong>not</strong> synonymous, but I don't wish to complicate this answer. Specifically: let's not get too hung up on users', developers' and Apple's interpretations of those expressions; for <strong>simplicity</strong> it may be desirable to treat them as synonymous. </p>\n\n<h2>Related</h2>\n\n<p><a href=\"https://apple.meta.stackexchange.com/q/573/8546\">Update to FAQ regarding beta and pre-release software - Ask Different Meta</a></p>\n","OwnerUserId":"8546","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-04-10T06:16:34.363","CommentCount":"0"},{"Id":"1270","PostTypeId":"2","ParentId":"121","CreationDate":"2012-04-10T05:37:39.810","Score":"0","Body":"<h1>Tag: <a href=\"https://apple.stackexchange.com/questions/tagged/pre-release\" class=\"post-tag\" title=\"show questions tagged &#39;pre-release&#39;\" rel=\"tag\">pre-release</a></h1>\n\n<p>Compare with a slightly different answer to this question </p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/a/1269/8546\">Tag synonym: beta</a></li>\n</ul>\n\n<p>Of the two expressions, <em>pre-release</em> seems to be used more commonly by Apple. </p>\n\n<h2>Examples</h2>\n\n<p>I imagine combinations of tags such as: </p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/pre-release\" class=\"post-tag\" title=\"show questions tagged &#39;pre-release&#39;\" rel=\"tag\">pre-release</a> <a href=\"https://apple.stackexchange.com/questions/tagged/messages\" class=\"post-tag\" title=\"show questions tagged &#39;messages&#39;\" rel=\"tag\">messages</a> <a href=\"https://apple.stackexchange.com/questions/tagged/osx\" class=\"post-tag\" title=\"show questions tagged &#39;osx&#39;\" rel=\"tag\">osx</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/pre-release\" class=\"post-tag\" title=\"show questions tagged &#39;pre-release&#39;\" rel=\"tag\">pre-release</a> <a href=\"https://apple.stackexchange.com/questions/tagged/siri\" class=\"post-tag\" title=\"show questions tagged &#39;siri&#39;\" rel=\"tag\">siri</a> <a href=\"https://apple.stackexchange.com/questions/tagged/ios\" class=\"post-tag\" title=\"show questions tagged &#39;ios&#39;\" rel=\"tag\">ios</a></li>\n</ul>\n\n<h3>Hint</h3>\n\n<p>Please refrain from voting on this answer until after you have considered <a href=\"https://apple.meta.stackexchange.com/q/1119/8546\">this meta question</a>. Questions relating to <em>some</em> types of pre-release software might be allowed in Ask Different. </p>\n","OwnerUserId":"8546","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-04-10T06:21:01.457","CommentCount":"1"},{"Id":"1271","PostTypeId":"1","CreationDate":"2012-04-10T10:34:04.553","Score":"15","ViewCount":"197","Body":"<p>On the recent <a href=\"http://www.thenewipadishere.com\" rel=\"nofollow\">site-promotion page</a> was the following nugget: </p>\n\n<blockquote>\n  <p>everyone who completes Level 1: Use Different and beyond will have\n  their gravatars honored in the hall of Ask Different inquisitors page.</p>\n</blockquote>\n\n<p>What/Where is this located, or is this just the contest page itself?</p>\n","OwnerUserId":"9495","LastEditorUserId":"9388","LastEditDate":"2012-04-24T15:10:29.990","LastActivityDate":"2012-04-30T20:44:40.853","Title":"What/Where is the hall of Ask Different inquisitors page?","Tags":"<discussion><support><site-promotion>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"5"},{"Id":"1272","PostTypeId":"1","AcceptedAnswerId":"1273","CreationDate":"2012-04-11T11:20:56.393","Score":"3","ViewCount":"79","Body":"<p>For editing purposes, is there a way to resize the images on this website without saving them to your computer, resize them an upload them again? </p>\n\n<p>I've played with some x and y coordinates, but with no luck... </p>\n","OwnerUserId":"11610","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Resize images programmatically","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"1273","PostTypeId":"2","ParentId":"1272","CreationDate":"2012-04-11T11:50:55.187","Score":"3","Body":"<p>Yes - I believe changing the embed from <code>![]</code> to <code>&lt;img&gt;</code> and specifying size x and y works to keep the original image intact yet display a smaller version. I have asked for this to be automated, but it doesn't appear to be getting many up votes. (it's a long question - not so sharp - perhaps it's time to edit it down and ask on the main meta site)</p>\n\n<p><a href=\"https://apple.meta.stackexchange.com/questions/884\">Pixelpalooza - Requesting a feature to normalize sizing of portrait iOS screen images by default (not just for landscape images)</a></p>\n\n<p>So in the mean time, you can edit a post and place <code>&lt;img ... width=\"300\" /&gt;</code> and use the <a href=\"https://meta.stackexchange.com/questions/1777/what-html-tags-are-allowed-on-stack-exchange-sites\">strict subset</a> of html that is allowed. You can always summon this list from the blue help icon when editing.</p>\n\n<p><img src=\"https://i.stack.imgur.com/kKADD.png\" alt=\"HTML editing help\"></p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2012-04-11T12:37:52.197","CommentCount":"2"},{"Id":"1274","PostTypeId":"1","CreationDate":"2012-04-11T14:58:33.110","Score":"2","ViewCount":"86","Body":"<p>I am doing an academic research regarding professional communities and I want to validate the outcomes of using motivational factors and one of them is the usage of contests like the iPad contest.</p>\n\n<p><strong>How can I obtain access to such information?</strong></p>\n\n<p>Here are some of the things I'm trying to find answers to (you don't need to answer them)</p>\n\n<ul>\n<li>Is motivation lost after contest? Does it modify the overall trend and if it does in which way?</li>\n<li>To which extend is the quality of the contributions affected by the contest? Do we start getting \"spam\"?</li>\n<li>Can we do a cost-benefit analysis on motivational contest? If so how? While computing the cost would be easy, how can we count the results in money?</li>\n<li>What percent of the increased traffic is from new audience? While it’s obvious that motivating people to share it will increase the overall site visibility. It would be interesting to see if there is a link between the increase in traffic and the creation of new accounts. This would help up identify if the „quality“ of the new audience, as the increase in traffic is not a target.</li>\n</ul>\n\n<p>Quantitative</p>\n\n<ul>\n<li>visits/week</li>\n<li>new questions/week</li>\n<li>new answers/week</li>\n<li>new accounts/week</li>\n</ul>\n\n<p>Note: at this moment I consider the week as optimum, as it should minimise the seasonality  and still be small enough to deal with changes due to different events (like a contest). </p>\n","OwnerUserId":"1916","LastEditorUserId":"5472","LastEditDate":"2012-04-20T20:22:08.313","LastActivityDate":"2012-07-04T00:40:37.483","Title":"How can I get more detailed statistics on site usage?","Tags":"<support><status-bydesign>","AnswerCount":"1","CommentCount":"2","FavoriteCount":"2"},{"Id":"1275","PostTypeId":"2","ParentId":"1260","CreationDate":"2012-04-12T01:07:58.023","Score":"2","Body":"<p>What if, for tie-breaker purposes only, votes up or down from other competitors at the same level simply did not count? They count to get you into the level but they do not count as tiebreaker votes. </p>\n\n<p>This would not harm anyone's eligibility for a prize and if there was no tiebreaker would not affect anything. It has a downside in that legitimate and disinterested appreciation or otherwise from peers will not be counted as tiebreaker votes- but like a judge who has interest in an entity in court, recusal may be the lesser evil. It does allow votes to be cast in the out-of-competition sense without effect on the competition. </p>\n\n<p>And it also maintains the suspense in chat next time, as nobody's script can tell just who cast the votes and so nobody knows the final outcome until official results appear >:-)</p>\n","OwnerUserId":"3117","LastActivityDate":"2012-04-12T01:07:58.023","CommentCount":"1"},{"Id":"1276","PostTypeId":"2","ParentId":"121","CreationDate":"2012-04-13T19:54:32.890","Score":"-2","Body":"<p><strong><em>Hyphenated Tags Must be Outlawed</em></strong></p>\n\n<p>Read on...</p>\n\n<p><strong>Tags is an indexed-sequential search, not random access</strong></p>\n\n<p>I.E. The tag filters on a major idea. It is supposed to be a quick narrowing of possibilities with a high likelihood of picking up specifics I'm looking for (assuming they exist in the first place, of course). At that point the brain takes over looking in detail at the search results. </p>\n\n<p>As we \"engineer\" specificity into our tagging system we move toward the idea of a single query, <em>a single tag to find exactly what I'm looking for</em>. I assert that this bad, anti-tagish. Let's just use SQL for crying out loud.</p>\n\n<p><strong>Are hyphenated tag names transitive?</strong></p>\n\n<p>I see <a href=\"https://apple.stackexchange.com/questions/tagged/ipod-applications\" class=\"post-tag\" title=\"show questions tagged &#39;ipod-applications&#39;\" rel=\"tag\">ipod-applications</a> as different from <a href=\"https://apple.stackexchange.com/questions/tagged/applications-ipod\" class=\"post-tag\" title=\"show questions tagged &#39;applications-ipod&#39;\" rel=\"tag\">applications-ipod</a>.</p>\n\n<p>In the first case I'm \"looking for ipod stuff\" and in the latter I'm looking for \"application stuff\". How I think about my search matters.</p>\n\n<p>What is the results implication of including both hyphened-versions? Who knows how the hell the tags were used when at least 4 tags may be involved here! I don't want to know - and I don't have to know if we ban hyphen-tags.</p>\n\n<p><strong>Major points of tagging goodness are:</strong></p>\n\n<ul>\n<li>Very little time spent constructing the query.</li>\n<li>There are no semantics &amp; syntax to know about - including <em>implied or assumed</em> semantics of hyphenated tags.</li>\n<li>1-off tag proliferation makes tracking favorites impossible.</li>\n<li><p>Specificity is gotten by using multiple tags - and it's syntax free</p></li>\n<li><p>A broadly cast net so I don't waste my time looking for stuff that was filtered out by too much tag specificity</p></li>\n<li>There is a gross assumption that the searcher knows (a) how to search a rendered web page and (b) search with tag/literal-text in the first place.</li>\n</ul>\n\n<p><strong>Hyphenated tags should be outlawed</strong></p>\n\n<p>We must not corrupt the tag space. I can easily search for <a href=\"https://apple.stackexchange.com/questions/tagged/applications\" class=\"post-tag\" title=\"show questions tagged &#39;applications&#39;\" rel=\"tag\">applications</a> <a href=\"https://apple.stackexchange.com/questions/tagged/ipod\" class=\"post-tag\" title=\"show questions tagged &#39;ipod&#39;\" rel=\"tag\">ipod</a> without having to worry if I just ruined my search by including (or not!) <a href=\"https://apple.stackexchange.com/questions/tagged/ipod-applications\" class=\"post-tag\" title=\"show questions tagged &#39;ipod-applications&#39;\" rel=\"tag\">ipod-applications</a> or vice versa or vice-and-versa.</p>\n\n<p>I would make exceptions, for example <a href=\"https://apple.stackexchange.com/questions/tagged/macbook-pro\" class=\"post-tag\" title=\"show questions tagged &#39;macbook-pro&#39;\" rel=\"tag\">macbook-pro</a> because this cannot mean \"macbook or macbook pro\". I prefer it to <a href=\"https://apple.stackexchange.com/questions/tagged/macbookpro\" class=\"post-tag\" title=\"show questions tagged &#39;macbookpro&#39;\" rel=\"tag\">macbookpro</a>, but would defer if it is confusing or non-hyphenation were enforced @ creation time.</p>\n\n<p><strong>Other Examples</strong></p>\n\n<ul>\n<li>this: <a href=\"https://apple.stackexchange.com/questions/tagged/safari\" class=\"post-tag\" title=\"show questions tagged &#39;safari&#39;\" rel=\"tag\">safari</a><a href=\"https://apple.stackexchange.com/questions/tagged/version4\" class=\"post-tag\" title=\"show questions tagged &#39;version4&#39;\" rel=\"tag\">version4</a> not this: <a href=\"https://apple.stackexchange.com/questions/tagged/safari-4\" class=\"post-tag\" title=\"show questions tagged &#39;safari-4&#39;\" rel=\"tag\">safari-4</a></li>\n<li>this: <a href=\"https://apple.stackexchange.com/questions/tagged/iphone\" class=\"post-tag\" title=\"show questions tagged &#39;iphone&#39;\" rel=\"tag\">iphone</a><a href=\"https://apple.stackexchange.com/questions/tagged/3g\" class=\"post-tag\" title=\"show questions tagged &#39;3g&#39;\" rel=\"tag\">3g</a> not this: <a href=\"https://apple.stackexchange.com/questions/tagged/iphone-3g\" class=\"post-tag\" title=\"show questions tagged &#39;iphone-3g&#39;\" rel=\"tag\">iphone-3g</a></li>\n<li>this: <a href=\"https://apple.stackexchange.com/questions/tagged/software\" class=\"post-tag\" title=\"show questions tagged &#39;software&#39;\" rel=\"tag\">software</a><a href=\"https://apple.stackexchange.com/questions/tagged/recommendation\" class=\"post-tag\" title=\"show questions tagged &#39;recommendation&#39;\" rel=\"tag\">recommendation</a> not this:\n<a href=\"https://apple.stackexchange.com/questions/tagged/software-recommendation\" class=\"post-tag\" title=\"show questions tagged &#39;software-recommendation&#39;\" rel=\"tag\">software-recommendation</a></li>\n<li>this: <a href=\"https://apple.stackexchange.com/questions/tagged/hardware\" class=\"post-tag\" title=\"show questions tagged &#39;hardware&#39;\" rel=\"tag\">hardware</a><a href=\"https://apple.stackexchange.com/questions/tagged/recommendation\" class=\"post-tag\" title=\"show questions tagged &#39;recommendation&#39;\" rel=\"tag\">recommendation</a> not this:\n<a href=\"https://apple.stackexchange.com/questions/tagged/hardware-recommendation\" class=\"post-tag\" title=\"show questions tagged &#39;hardware-recommendation&#39;\" rel=\"tag\">hardware-recommendation</a></li>\n<li>this: <a href=\"https://apple.stackexchange.com/questions/tagged/os9\" class=\"post-tag\" title=\"show questions tagged &#39;os9&#39;\" rel=\"tag\">os9</a><a href=\"https://apple.stackexchange.com/questions/tagged/xcode\" class=\"post-tag\" title=\"show questions tagged &#39;xcode&#39;\" rel=\"tag\">xcode</a><a href=\"https://apple.stackexchange.com/questions/tagged/version3\" class=\"post-tag\" title=\"show questions tagged &#39;version3&#39;\" rel=\"tag\">version3</a> not this: <a href=\"https://apple.stackexchange.com/questions/tagged/os9-xcode\" class=\"post-tag\" title=\"show questions tagged &#39;os9-xcode&#39;\" rel=\"tag\">os9-xcode</a><a href=\"https://apple.stackexchange.com/questions/tagged/os9\" class=\"post-tag\" title=\"show questions tagged &#39;os9&#39;\" rel=\"tag\">os9</a><a href=\"https://apple.stackexchange.com/questions/tagged/xcode-1\" class=\"post-tag\" title=\"show questions tagged &#39;xcode-1&#39;\" rel=\"tag\">xcode-1</a><a href=\"https://apple.stackexchange.com/questions/tagged/xcode-2\" class=\"post-tag\" title=\"show questions tagged &#39;xcode-2&#39;\" rel=\"tag\">xcode-2</a><a href=\"https://apple.stackexchange.com/questions/tagged/xcode-3\" class=\"post-tag\" title=\"show questions tagged &#39;xcode-3&#39;\" rel=\"tag\">xcode-3</a><a href=\"https://apple.stackexchange.com/questions/tagged/xcode\" class=\"post-tag\" title=\"show questions tagged &#39;xcode&#39;\" rel=\"tag\">xcode</a> <a href=\"https://apple.stackexchange.com/questions/tagged/os8-xcode\" class=\"post-tag\" title=\"show questions tagged &#39;os8-xcode&#39;\" rel=\"tag\">os8-xcode</a> ...</li>\n</ul>\n\n<p>You should quickly see several things:</p>\n\n<ul>\n<li>Tags become reusable. You can \"recommend\" or \"version\" on anything!</li>\n<li>Tags are meant to identify general concepts. Combining tags gives sufficient, flexible specificity.</li>\n<li>Excellent cross reference flexibility</li>\n<li>There are no \"shades of meaning\" in a tag, therefore any given tag, or combination of tags, is more likely to hit on what I'm looking for.</li>\n<li>In a hyphenated-tag rich environment you must ask yourself \"What fraken tags did I miss because there are so many that I <em>know</em> I did not find just the right \"synonym\" tag!!</li>\n<li>Hyphen-tagging quickly degenerates into hyper inflation of tags, tags-per-question, and tags-per-query. AND ironically, significantly increasing the probability that you will not, indeed cannot, find what you're looking for.</li>\n</ul>\n","OwnerUserId":"19602","LastEditorUserId":"19602","LastEditDate":"2012-04-13T20:49:49.360","LastActivityDate":"2012-04-13T20:49:49.360","CommentCount":"2"},{"Id":"1279","PostTypeId":"2","ParentId":"1274","CreationDate":"2012-04-20T20:21:43.447","Score":"1","Body":"<p>The stack exchange employees do track many aspects of site traffic, statistics and usage, but do not make details as granular as you specify public. They do occasionally blog aggregate data from time to time on other sites (but I don't recall one addressing Ask Different directly.) </p>\n\n<p>The best thing I can think of is for you to look at the public data that is made available and see if your research can make use of it. The <a href=\"http://www.quantcast.com/apple.stackexchange.com\" rel=\"nofollow\">public quantcast data about this site</a> might be a good place to start.</p>\n\n<p>There is a contact us link at the bottom of each site, so it might be worth shooting off an email to the owners in case they are entertaining requests for access to some manner of data. </p>\n\n<p>I hope this helps you even though it's not anything you can use today for research.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2012-05-04T23:33:29.050","LastActivityDate":"2012-05-04T23:33:29.050","CommentCount":"0"},{"Id":"1280","PostTypeId":"1","AcceptedAnswerId":"1281","CreationDate":"2012-04-22T15:50:17.830","Score":"8","ViewCount":"147","Body":"<p>What was (or at least at the time appeared to be) a <a href=\"https://apple.stackexchange.com/a/48412/4395\">correct answer</a> to a <a href=\"https://apple.stackexchange.com/q/30977/4395\">question of mine</a> is now (possibly due to software changes by Apple) no longer resolves my question. I've already accepted this answer as the correct one. How should I handle the fact that what it suggests no longer works? </p>\n\n<p>Should I un-accept it? Is that sufficient? </p>\n","OwnerUserId":"4395","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2012-04-23T18:52:51.880","Title":"How should I handle an accepted answer that's no longer \"correct\"?","Tags":"<discussion><accepted-answer>","AnswerCount":"2","CommentCount":"2","FavoriteCount":"3"},{"Id":"1281","PostTypeId":"2","ParentId":"1280","CreationDate":"2012-04-22T16:47:14.217","Score":"7","Body":"<p>Two things work very well.</p>\n\n<p>1) Edit the question to remain historically significant - answer at time. You can edit the answer if needed or just comment that this is no longer true.</p>\n\n<p>1a) If the basic need is still there, re-ask the new question and link the two explaining how the old question isn't the answer since X, Y, and Z have changed.</p>\n\n<p>2) Edit / comment the question to indicate how old answers are not relevant with new X arriving.</p>\n\n<p>So - here are the guiding principles as I see them.</p>\n\n<ul>\n<li>preserve value and votes on an old question - the more popular the old question, the more inclined I am to just leave it and move on (option 1).</li>\n<li>edit / comment to add commentary when things change and old content is stale and needs further explanations.</li>\n</ul>\n\n<p>It's really your choice - neither is wrong to choose. The only wrong move is to allow the incorrect content to sit without at least a comment explaining the new circumstances. Again, you don't <em>have</em> to do even that, but from a \"how should it be handled\" ideal situation - always addressing things that need help is the correct answer.</p>\n","OwnerUserId":"5472","LastEditorUserId":"1629","LastEditDate":"2012-04-23T18:52:51.880","LastActivityDate":"2012-04-23T18:52:51.880","CommentCount":"1"},{"Id":"1282","PostTypeId":"2","ParentId":"683","CreationDate":"2012-04-22T18:41:18.647","Score":"33","Body":"<p>Looking at this question and answer:</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/20505/add-characters-to-the-press-and-hold-character-picker-in-os-x-lion\">How to add characters to the press and hold character picker in OS X Lion?</a></p>\n\n<p>I managed to amend the automated replacement options when you press and hold a key down, and made this:</p>\n\n<p><img src=\"https://i.stack.imgur.com/imUf7.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"9495","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2012-04-22T18:41:18.647","CommentCount":"5"},{"Id":"1284","PostTypeId":"2","ParentId":"1280","CreationDate":"2012-04-23T17:23:12.130","Score":"1","Body":"<p>I would say that if your question and the posted answer remain accurate for some context, but not the latest context, keep it as the accepted answer, and edit the question to indicate the limited context. For instance, if you asked \"Can I run apps so they take up the full screen\" under Leopard, the answer, in general was \"No, there is no generic full-screen mode.\" Lion comes out, and now there is. Your question and its answer are still useful for someone running Lion, so edit the question to indicate \"prior to OS X 10.7, can I run apps so they take up the full screen.\"</p>\n\n<p>For released, versioned software, this strikes me as far and away the most appropriate way to go. On the other hand, in your case, the software you describe is an online service; the fact that something worked or did not work in previous versions is sadly not helpful, as the current behavior of the system applies to all users. In this case, the answer is no longer correct. Were it me, I would not un-accept until a more current answer arrives to replace it, but I would point out in a comment the changing circumstances, and perhaps edit the original question also.</p>\n","OwnerUserId":"9388","LastActivityDate":"2012-04-23T17:23:12.130","CommentCount":"0"},{"Id":"1285","PostTypeId":"1","CreationDate":"2012-04-26T02:55:49.613","Score":"-1","ViewCount":"85","Body":"<p>Should OS version (E.g. 10.7.3) be included on all standard Operating System questions for future reference? As Operating Systems release updates and/or New Operating systems are released all together, multiple changes occur that may nullify previous answers. By making it mandatory to include the full version on any standard OS question we could ensure the integrity of the answers on apple.stackexchange.com as well as provide opportunities for new answers when updates and new Operating Systems are released.</p>\n","OwnerUserId":"21790","LastEditorUserId":"21790","LastEditDate":"2012-04-26T13:52:13.777","LastActivityDate":"2012-04-26T13:52:13.777","Title":"Should OS version be included on OS specific questions?","Tags":"<discussion><support><feature-request><answers><osx>","AnswerCount":"2","CommentCount":"3","FavoriteCount":"1"},{"Id":"1286","PostTypeId":"2","ParentId":"1285","CreationDate":"2012-04-26T03:43:11.617","Score":"4","Body":"<p>This is a modified version of <a href=\"https://apple.meta.stackexchange.com/a/1144/2220\">my answer</a> on <a href=\"https://apple.meta.stackexchange.com/questions/1141/i-think-system-specifications-should-show-as-signature/1144#1144\">I think system specifications should show as signature?</a>.</p>\n\n<p>I've seen similar systems implemented on other sites (like the Apple Discussions).</p>\n\n<p>The current system is to specify the OS in the body of the question and/or in a tag. I think that way works pretty well; it gives users an easy way to include the info and gives us an easy way to organize things.</p>\n\n<p>The idea of making people know and tell us their OS is good, but I don't think it would work well on Ask Different.</p>\n\n<p>(Note: I'm assuming we would require this information for questions tagged with any of the OS tags.)</p>\n\n<ul>\n<li><p><strong>Detailed OS info isn't always necessary.</strong> This would force people to include info even when it isn't necessary (not all questions tagged <a href=\"https://apple.stackexchange.com/questions/tagged/osx\" class=\"post-tag\" title=\"show questions tagged &#39;osx&#39;\" rel=\"tag\">osx</a> need a version specified).</p></li>\n<li><p><strong>Dedicated OS info would frequently be redundant.</strong> We'd run the risk of causing redundancy by requiring people to specify their OS version if they have already specified it in the body of their question or in a tag.</p></li>\n</ul>\n\n<p>I don't think that adding system info separately is the right path to take.</p>\n\n<p>What I would like to see, though, is another 'reminder' item shown while posting a question that tells people to be sure to include all relevant hardware and software information.</p>\n\n<p>Of course people wouldn't always follow it, but commenting and asking for info is easy, and people generally respond to it.</p>\n","OwnerUserId":"2220","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-04-26T03:43:11.617","CommentCount":"5"},{"Id":"1287","PostTypeId":"2","ParentId":"1285","CreationDate":"2012-04-26T04:13:36.323","Score":"3","Body":"<p>Different iterations of iOS and Mac OS X have more in common than they have differences. While OS versions are sometimes very relevant to the answer to a program, frequently they are not. I see no reason whatsoever to require questions to be more specific than necessary.</p>\n\n<p>It is not rare for a question to omit important information. Occasionally, that missing information is the operating system. But this seems like a solution in search of a problem that our community, for the most part, does not have.</p>\n","OwnerUserId":"9388","LastActivityDate":"2012-04-26T04:13:36.323","CommentCount":"7"},{"Id":"1288","PostTypeId":"2","ParentId":"1119","CreationDate":"2012-04-27T02:15:11.917","Score":"0","Body":"<p>Some Apple beta software is covered by NDA.  Discussion in open public forums of stuff under NDA should probably be discouraged.</p>\n\n<p>Siri use on an iPhone 4s is not, to my knowledge, covered by any sort of NDA.</p>\n","OwnerUserId":"512","LastActivityDate":"2012-04-27T02:15:11.917","CommentCount":"0"},{"Id":"1289","PostTypeId":"2","ParentId":"1189","CreationDate":"2012-04-29T12:47:03.623","Score":"6","Body":"<p>Apple's <a href=\"http://developer.apple.com/library/mac/documentation/userexperience/conceptual/APStyleGuide/APSG_2009.pdf\" rel=\"nofollow\">Style Guide</a> (page 116) uses this method:</p>\n\n<blockquote>\n  <p><em>Pull-down menus:</em>  Note hyphenation. A pull-down menu is a menu in the\n  menu bar.  When you give instructions for choosing an item from a\n  pull-down menu (a menu in  the menu bar), use the style shown here. </p>\n  \n  <ul>\n  <li>Choose [menu] > [item] > [submenu item]</li>\n  <li>Choose Edit > Find > Find Next</li>\n  <li>Choose File > Save As.</li>\n  </ul>\n</blockquote>\n\n<p>I don't think it should be a rule, but such a guideline would be helpful for new users and would increase the consistency/legibility  of the site. There's a good reason to have style guides.</p>\n","OwnerUserId":"21985","LastEditorUserId":"13414","LastEditDate":"2012-04-30T16:32:41.537","LastActivityDate":"2012-04-30T16:32:41.537","CommentCount":"2"},{"Id":"1290","PostTypeId":"2","ParentId":"1189","CreationDate":"2012-04-30T03:50:04.197","Score":"0","Body":"<p>I would personally say that using:</p>\n\n<blockquote>\n  <p>Menu > Submenu</p>\n</blockquote>\n\n<p>would be best for simplicity and easy of use.</p>\n","OwnerUserId":"7833","LastActivityDate":"2012-04-30T03:50:04.197","CommentCount":"0"},{"Id":"1291","PostTypeId":"2","ParentId":"1271","CreationDate":"2012-04-30T17:09:36.440","Score":"2","Body":"<p>The hall is the main landing page as far as I can tell.</p>\n\n<p><a href=\"http://www.thenewipadishere.com/\" rel=\"nofollow\">http://www.thenewipadishere.com/</a></p>\n\n<p>Stack Exchange bought that domain and it's still up, so <a href=\"http://en.wikipedia.org/wiki/Q.E.D.\" rel=\"nofollow\">Q.E.D.</a> or perhaps QEF?</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2012-04-30T20:44:40.853","LastActivityDate":"2012-04-30T20:44:40.853","CommentCount":"3"},{"Id":"1292","PostTypeId":"1","AcceptedAnswerId":"1293","CreationDate":"2012-05-01T14:56:12.967","Score":"3","ViewCount":"30","Body":"<p>A question was submitted with a choosen set of tags by the originator\nof the question.</p>\n\n<p>When writing an answer, it became clear to me that the question would\nreceive a much appropriate set of answers with another tag\n(ex.: <code>networking</code> → <code>networking</code> <code>security</code>).</p>\n\n<p>How may I edit the set of tags of:</p>\n\n<ul>\n<li>my submitted questions,</li>\n<li>other's questions?</li>\n</ul>\n","OwnerUserId":"22003","LastEditorUserId":"22003","LastEditDate":"2012-05-03T06:45:54.350","LastActivityDate":"2012-05-03T06:45:54.350","Title":"When to edit the tag list of a question?","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"1293","PostTypeId":"2","ParentId":"1292","CreationDate":"2012-05-01T15:48:34.847","Score":"4","Body":"<p>Yes - the site design is for everyone to suggest edits.</p>\n\n<p>The how is simple - click the edit button and you will have a window to make changes. There is context based help explaining how to edit and how to work the tools.</p>\n\n<p>Once you've proposed an edit, it goes into a queue. There is a review process where people that haven't gained the reputation to make solitary edits require someone else to green light the edits.</p>\n\n<p>You will find the chat room a great place to link to questions for learning how to edit as well as gaining confidence that someone will approve them.</p>\n\n<p>For now - jump in and propose some edits you feel will make the site better and see how they are received. Like anything, start slow and build up your confidence about what works and what doesn't. As you gain reputation, the site will link you to the guides on how to edit - but for now as a new user, just try a few and we'll see how it goes.</p>\n\n<hr>\n\n<p>The only time I've seen edits be problematic is when there is back and forth where two people have differing tastes or when someone makes a lot of edits in a short time - driving the other changed content from the recent activity tab.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2012-05-01T15:54:56.243","LastActivityDate":"2012-05-01T15:54:56.243","CommentCount":"1"},{"Id":"1294","PostTypeId":"2","ParentId":"1119","CreationDate":"2012-05-03T21:11:49.223","Score":"0","Body":"<p>If a person walks into a store and purchases an iPhone 4S, that person is buying a device that has Siri installed (assuming they use it in a region that Siri supports).  </p>\n\n<p>Regardless of how the company labels the service, it is a public, sanctioned product for mass consumption.  Whether Apple has the capacity to support the masses, and therefore label the service as \"beta\", is merely a way for them to set expectations that it will not be problem-free and may not be available for support personnel to troubleshoot.</p>\n\n<p>The Messages app is slightly different, in that it is a new method to interact with an already public service.  It's distribution method differs, as it needs to be manually installed, and is not included in a product out of the box.  Again, I believe that Apple is only limiting their expectations and guarantees of quality and service.</p>\n\n<p>Clearly, Siri and Messages should be valid topics.</p>\n","OwnerUserId":"21856","LastActivityDate":"2012-05-03T21:11:49.223","CommentCount":"0"},{"Id":"1296","PostTypeId":"1","AcceptedAnswerId":"1297","CreationDate":"2012-05-07T04:19:15.127","Score":"2","ViewCount":"37","Body":"<p>I have insufficient rep to create a tag.  I'd like the Nook tag to be attached to <a href=\"https://apple.stackexchange.com/questions/50625/nook-comics-on-ipad\">this question</a>.  Thanks in advance.</p>\n","OwnerUserId":"15819","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2012-05-07T17:32:16.430","Title":"Can someone create a Nook tag?","Tags":"<support><status-completed><tags>","AnswerCount":"1","CommentCount":"4"},{"Id":"1297","PostTypeId":"2","ParentId":"1296","CreationDate":"2012-05-07T04:52:31.087","Score":"0","Body":"<p>I've <a href=\"https://apple.stackexchange.com/posts/50625/revisions\">edited your question</a> to add <a href=\"https://apple.stackexchange.com/questions/tagged/nook\" class=\"post-tag\" title=\"show questions tagged &#39;nook&#39;\" rel=\"tag\">nook</a> to the tags.</p>\n","OwnerUserId":"7833","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2012-05-07T15:58:58.987","CommentCount":"6"},{"Id":"1298","PostTypeId":"1","AcceptedAnswerId":"1299","CreationDate":"2012-05-08T20:55:27.517","Score":"8","ViewCount":"144","Body":"<p>Sadly, first I don't have the expertise to prove what I found is indeed a bug and secondly I really don't know how to report them to Apple and rather try to find a solution to my problem(s) instead of trying to figure out how to do so for Apple, what Apple should do for me (i.e. providing me with an easy way / instructions to report bugs!).</p>\n\n<p>So the title says it already: <strong>Can I post a question related to</strong> an issue that is clearly not supposed to happen and of which I assume can't be solved by a simple answer?</p>\n\n<p>Additionally I wonder when / if it is OK to use the \"wording\" and the tag <a href=\"https://apple.stackexchange.com/questions/tagged/bug\" class=\"post-tag\" title=\"show questions tagged &#39;bug&#39;\" rel=\"tag\">bug</a> at all? <strong>What are the Stack Exchange or Ask Different community guidelines for using it?</strong></p>\n","OwnerUserId":"5799","LastEditorUserId":"7833","LastEditDate":"2012-05-09T05:16:38.900","LastActivityDate":"2012-06-04T04:29:54.093","Title":"Can one post (assumed) OS bugs and questions about it on Ask Different?","Tags":"<discussion>","AnswerCount":"3","CommentCount":"0"},{"Id":"1299","PostTypeId":"2","ParentId":"1298","CreationDate":"2012-05-09T05:24:53.680","Score":"3","Body":"<p>You can submit feedback and bug reports to Apple via their <a href=\"http://www.apple.com/feedback/\" rel=\"nofollow noreferrer\">feedback page.</a> Additionally, bug reports can also be sent <a href=\"https://developer.apple.com/bugreporter/\" rel=\"nofollow noreferrer\">the Apple developer bug report page.</a> (requires a free Apple developer account, does not require the $99/year paid account).</p>\n\n<blockquote>\n  <p>Can I post a question related to an issue that is clearly not supposed to happen and of which I assume can't be solved by a simple answer?</p>\n</blockquote>\n\n<p>If it can't be solved by a simple answer, I would say, no, don't ask the question. If you look at the <a href=\"https://apple.stackexchange.com/questions/tagged/bug\" class=\"post-tag\" title=\"show questions tagged &#39;bug&#39;\" rel=\"tag\">bug</a> tag excerpt, you'll see: </p>\n\n<blockquote>\n  <p>This tag will be used in discussions identifying potential bugs and seeking ways to circumvent or correct them.</p>\n</blockquote>\n\n<p>(I know this is a bit of circular reasoning, as the meta site is supposed to influence the main site, not vice versa, but in this case, I think the current status of this is fine and shouldn't be changed.)<br>\nSo, using the existing excerpt, I would say that questions that doesn't have an answer that will \"circumvent or correct [the bugs],\" do not have a place here on Ask Different. Questions that don't really have an answer don't have value down the road. Bugs especially don't add value to the site, as software is constantly changing and will more than likely not be applicable a year or two down the road.</p>\n\n<p><strong>TL;DR:</strong> Questions about bugs that don't have an answer should not be asked.</p>\n","OwnerUserId":"7833","LastActivityDate":"2012-05-09T05:24:53.680","CommentCount":"6"},{"Id":"1300","PostTypeId":"2","ParentId":"1298","CreationDate":"2012-05-09T15:56:56.287","Score":"3","Body":"<p>We like good questions that are objective or are of the good subjective sort. That is the overriding criteria for whether a question should be asked. We also like clear questions that invite a paragraph-length answer that will be of use to the worldwide population.</p>\n\n<p>Q: Is clicking on X in Y after update 10.7.3 is applied a bug?</p>\n\n<p>This hypothetical question invites two potential answers: yes and no. It's something we generally wouldn't encourage on the site. That doesn't mean someone can not come in with an awesome long involved answer that explains what changed and why people need to know about how they can work around this bug.  A good answer can in almost all cases save a bad question from deletion, but that doesn't mean the question as originally asked is necessarily a good question. </p>\n\n<p>A better question explains why a bug might be noticed or detected and sometimes even show some research that invites a better answer. </p>\n\n<p>Some guidelines:</p>\n\n<ul>\n<li>state the facts and don't rant about the bug (or worse, try to turn it into an editorial about why Apple is so bad or do programmers are so bad or why you're so clever )</li>\n<li>explain how you've isolated the bug and why you think it's a bug (do some research and actually show the research you've done in the wording of the question)</li>\n<li>be clear whether you're looking for troubleshooting advice or are looking for an objective answer to your specific problem</li>\n</ul>\n\n<p>As long as the question is more about using a Mac and less about a short window of time where there's a bug that gets resolved quickly, questions about buggy software can be of benefit to the site and worth keeping around. </p>\n","OwnerUserId":"5472","LastActivityDate":"2012-05-09T15:56:56.287","CommentCount":"1"},{"Id":"1301","PostTypeId":"1","CreationDate":"2012-05-09T16:29:14.360","Score":"1","ViewCount":"105","Body":"<p>I guess I haven't found the right search terms to find this on my own, so I figured I ask. </p>\n\n<p>Is there a forum or something out there where people who are going to WWDC trade information? Stuff like trip advice, informal birds-of-a-feather sessions, parties, etc. Or does all that kind of coordination happen over Twitter these days?</p>\n","OwnerUserId":"22606","OwnerDisplayName":"infinitetape","LastEditorUserId":"5472","LastEditDate":"2012-05-13T02:02:57.050","LastActivityDate":"2012-05-13T02:02:57.050","Title":"Forum or list for WWDC attendees?","Tags":"<discussion><wwdc>","AnswerCount":"2","CommentCount":"2"},{"Id":"1302","PostTypeId":"2","ParentId":"1301","CreationDate":"2012-05-09T16:34:50.670","Score":"2","Body":"<p>I'd be happy to open a chat room for people to discuss WWDC and share links and stories. If it gets too crowded, we can make others. Would that suit your desires to have a conversation and share WWDC plans?</p>\n","OwnerUserId":"5472","LastActivityDate":"2012-05-09T16:34:50.670","CommentCount":"0"},{"Id":"1303","PostTypeId":"2","ParentId":"1301","CreationDate":"2012-05-09T21:15:16.403","Score":"1","Body":"<p>All WWDC attendees should have access to Apple's Developer Forums.  Some discussion seems to take place there.</p>\n","OwnerUserId":"512","LastActivityDate":"2012-05-09T21:15:16.403","CommentCount":"1"},{"Id":"1305","PostTypeId":"1","CreationDate":"2012-05-11T13:41:53.147","Score":"4","ViewCount":"36","Body":"<p>I had a question about what happens to my apps if the development program is not extended.</p>\n\n<p>Then my question was voted down and closed since this was not the place to ask this question according to the FAQ of this site.</p>\n\n<p>But where should questions like these be asked?\nI also think that the answer of this question should be included in the FAQ of askdifferent.</p>\n\n<p>I've read <a href=\"https://apple.meta.stackexchange.com/questions/213/should-questions-about-the-developers-side-of-the-app-store-be-considered-on-or\">this</a> question on meta askDifferent but that question is more about if the question is on topic or not.</p>\n","OwnerUserId":"6859","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-05-11T21:00:01.227","Title":"where should questions about the developer program be asked?","Tags":"<support><questions><itunes-connect><site-scope>","AnswerCount":"1","CommentCount":"3"},{"Id":"1306","PostTypeId":"2","ParentId":"1305","CreationDate":"2012-05-11T15:02:19.593","Score":"2","Body":"<p>This site is the place where questions about using Apple products and all apple programs <strong><em>except for iTunes Connect</em></strong>.</p>\n\n<p>I personally want to build consensus (if there is actual consensus) to broaden that scope to allow iTunes connect questions <a href=\"https://apple.stackexchange.com/questions/51084/iphone-app-now-is-pending-contract-will-it-be-removed-from-the-itunes-store\">like the one you asked</a>.</p>\n\n<p>Your question isn't complicated, is covered in Apple's FAQ that isn't something under NDA (although much of the mechanics of developing is under NDA - and most developers do not hang out here).</p>\n\n<p>The only place I see for you to ask this topic currently is on Stack Overflow - but again, it's not a great fit in my eyes. I believe they prefer hard programming questions - not soft program and policy questions.</p>\n\n<hr>\n\n<p>In any event - as a developer, you have email, phone and web support from Apple - so even if your account has lapsed, you can sign up for a free tier of access and still have a point to ask them about the mechanics of the program.</p>\n\n<p>Please do weigh in on the discussion over here and in the chat room if you want to change things here (either for or against changing the FAQ)</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/213/should-questions-about-the-developers-side-of-the-app-store-be-considered-on-or\">Should questions about the developer&#39;s side of the app store be considered on or off topic?</a></li>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/1038/what-would-happen-if-we-expanded-the-scope-of-this-site-to-include-itunes-connec\">Should we expand site scope to include iTunes Connect?</a></li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2012-05-11T15:02:19.593","CommentCount":"2"},{"Id":"1307","PostTypeId":"2","ParentId":"213","CreationDate":"2012-05-11T16:00:52.247","Score":"0","Body":"<p>So I've read that there were a few proposals creating a sister site covering these kind of questions. But they are never opened because they don't want to create a sister site on area51 because this site is already there and others putting SO as alternative.</p>\n\n<p>Then I'm back on this site with a question about developing apps and It's not welcome here :-)</p>\n\n<p>So back to SO but it seams to global for me. </p>\n\n<p>I do agree that creating al sorts of small sites is too much.\nLike drupal has his own site, questions about drupal are sometimes ported to the drupal site while the response on SO is better.\nand then there is also programming which also could be merged with SO IMHO.</p>\n\n<p>I guess what I'm trying to say is that it is too unclear where to post a question and getting down votes on those questions isn't a way to welcome new users...</p>\n\n<p>I'm fine with posting a question on a different site to keep it all clean, but it seams odd to allow some sister sites and disallow others. I vote for one format for all sites so all is clear and confusion avoided. Even if that means disappointing some users.</p>\n\n<p>As a side note I must admit that the \"apple\" stackexchange site triggered me to post my development question.</p>\n\n<p>Why not let developers use this site as well? 'normal' users can unfollow the developer tag and even get support of developers hanging out here with 'user' questions?</p>\n","OwnerUserId":"6859","LastActivityDate":"2012-05-11T16:00:52.247","CommentCount":"1"},{"Id":"1308","PostTypeId":"5","CreationDate":"2012-05-11T21:01:12.630","Score":"0","Body":"<p>I suppose we can have questions about meta scope as well so anything about the scope of the FAQ should endeavor to use this tag.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2012-05-11T21:01:12.630","LastActivityDate":"2012-05-11T21:01:12.630","CommentCount":"0"},{"Id":"1309","PostTypeId":"4","CreationDate":"2012-05-11T21:01:12.630","Score":"0","Body":"Questions which relate to the scope of topics which the FAQ for the main site considers on and off-topic.","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2012-05-11T21:01:12.630","LastActivityDate":"2012-05-11T21:01:12.630","CommentCount":"0"},{"Id":"1310","PostTypeId":"5","CreationDate":"2012-05-11T21:04:07.353","Score":"0","Body":"<p><a href=\"http://itunesconnect.apple.com\" rel=\"nofollow\">http://itunesconnect.apple.com</a> is the primary source for iTunes connect information. Use care to not discuss things that are only available under NDA. If in doubt - ask first at the official <a href=\"https://developer.apple.com/devforums/\" rel=\"nofollow\">Apple Developer Forums</a> that are run by Apple and explicitly allow NDA topics to be discussed and answered by Apple and other developers.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2012-05-11T21:18:23.873","LastActivityDate":"2012-05-11T21:18:23.873","CommentCount":"0"},{"Id":"1311","PostTypeId":"4","CreationDate":"2012-05-11T21:04:07.353","Score":"0","Body":"The program run by Apple whereby developers, music labels and artists as well as iAd producers and Book authors enter into a business relationship with Apple for the purpose of selling content through Apple's digital storefronts.","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2012-05-11T21:04:07.353","LastActivityDate":"2012-05-11T21:04:07.353","CommentCount":"0"},{"Id":"1312","PostTypeId":"2","ParentId":"1176","CreationDate":"2012-05-13T01:44:46.293","Score":"1","Body":"<p>This is an intentional feature and not simply a bug. </p>\n\n<p>The reasons for it are enumerated here (as well as the regex used to neuter presumably excessively wordy tag summaries):</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/82700/new-tags-page-mangles-tag-wiki-excerpts\">New tags page mangles tag wiki excerpts</a></li>\n</ul>\n\n<p>In summary, this looks like a design compromise to fit a portion of the text within the available space.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2012-06-12T03:15:59.667","CommentCount":"2"},{"Id":"1313","PostTypeId":"2","ParentId":"1038","CreationDate":"2012-05-13T11:47:24.470","Score":"8","Body":"<p>I really don't think this should be a grey area, or \"muddy waters\". </p>\n\n<ul>\n<li>iTunes Connect is an Apple Service.</li>\n<li>The site definition includes \"other Apple products or services\"</li>\n</ul>\n\n<p>Therefore it already fits in the definition of this site. </p>\n\n<p>The problem is someone has added an exception to the definition. I don't see anywhere the community deciding on that exception. So why is it there?</p>\n\n<p>iTunes Connect is just as much an Apple service as iCloud.com is.</p>\n","OwnerUserId":"796","LastActivityDate":"2012-05-13T11:47:24.470","CommentCount":"2"},{"Id":"1314","PostTypeId":"1","CreationDate":"2012-05-13T13:21:00.510","Score":"1","ViewCount":"253","Body":"<p><strong>Context:</strong> This post follows the guidelines <a href=\"https://meta.stackexchange.com/questions/132282/how-can-i-get-stack-exchange-to-send-me-to-a-conference\">placed here (link)</a> for StackExchange conference attendance sponsorship.</p>\n\n<p>I got an email on friday from Apple that I've been awarded an <a href=\"https://developer.apple.com/wwdc/scholarships/\" rel=\"nofollow noreferrer\">Apple WWDC Student Scholarship.</a> (The WWDC student scholarship is essentially just a free conference ticket. Scholarships were offered to student developers ages 13 and up.) I'm going to San Francisco for the event. Yay! I'd like to get a StackExchange sponsorship to cover airfare and hotel stay if possible.</p>\n\n<ul>\n<li><p><strong><em>Who</strong> is going?</em></p>\n\n<p>I'm going.</p></li>\n<li><p><strong><em>What</strong> conference is it, and what will you be doing there, besides attending?</em></p>\n\n<p>WWDC is Apple's annual developer conference. Typically, Apple announces updates to iOS and Mac OS and occasionally some other cool things. I'll be just attending, unless you consider being awesome \"doing something\", cuz I'll be doing that to. If the community approves, I'll also be promoting AskDifferent.</p></li>\n<li><p><strong><em>When</strong>  is the conference running? We need at least a month’s lead time to help you get your approval. If you’re under or near that before posting, you might want to think about next year instead.</em></p>\n\n<p>The conference runs in just about a month from now, from June 11th through the 15th, 2012. It might be a bit late, but I only found out about the scholarship on Friday.</p></li>\n<li><p><strong><em>Where</strong>  is the conference located and how do you intend to get there?</em></p>\n\n<p>The conference is Moscone West in San Francisco, California. I'm in New York City so I plan to fly out. My iPhone doesn't have teleportation built in - yet. </p>\n\n<p>\"Siri, take me to Moscone West at -\" </p>\n\n<p>\"I know where Moscone West is, thank you. Please adjust your helmet and tell me when you're ready to go.\"</p></li>\n<li><p><strong><em>Why</strong> should the community approve you to go to this sponsorship? More importantly, why should the community approve going to this specific conference? Basically, what will you do to bring this learning back to the community?</em></p>\n\n<p>I'm a long time member of the StackExchange network. I've been active on StackOverflow for over two years. I've got 11 gold badges including fanatic. I was among those awarded the first batch of AskDifferent Swag. I also won an iPod in the recent new iPad contest. So, yea, I participate.</p>\n\n<p>I've met with Lauren and Seth at StackExchange HQ in the New York and brought back swag to my class in college, and promoted English.SE there. (Thanks guys, that was awesome.) I'm constantly pushing StackExchange to friends, classmates, coworkers and more. This would be another opportunity to do that. </p>\n\n<p>WWDC is chock full of Apple and that's the exact audience of this site. It would be an opportunity to bring more experts users to one of the best Apple websites on the internet. I love speaking and meeting people. StackExchange is something that I can get excited about, and I will do my best, if approved, to promote AskDifferent at WWDC.</p>\n\n<p>Again, my ticket is already paid for by Apple. A StackExchange sponsorship would cover airfare (around $500 or so) and hotel stay. (Although I'm looking into another option which would eliminate the hotel costs altogether.) </p></li>\n</ul>\n\n<p><strong>edit:</strong></p>\n\n<p>I've been developing <a href=\"http://apps.mosheberman.com\" rel=\"nofollow noreferrer\">apps</a> for over 2 years now. Most of my work is geared to the Jewish community, but I've got <a href=\"http://itunes.apple.com/us/app/nippon/id415518235?mt=8\" rel=\"nofollow noreferrer\">a game</a> on the store and <a href=\"http://blog.mosheberman.com/meet-team-moflotz/\" rel=\"nofollow noreferrer\">I'm working on an RPG</a> as well. </p>\n","OwnerUserId":"638","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2012-05-14T14:18:10.727","Title":"WWDC - Sponsorship Proposal","Tags":"<discussion><site-promotion>","AnswerCount":"0","CommentCount":"5","FavoriteCount":"1"},{"Id":"1315","PostTypeId":"2","ParentId":"1038","CreationDate":"2012-05-13T13:30:12.260","Score":"1","Body":"<p>Yes, iTunes Connect should be on topic both here and on Web Apps.</p>\n\n<p>While all of the answers here are technically correct, there's another option:</p>\n\n<p>See <a href=\"http://area51.stackexchange.com/proposals/30702/app-stores\">this proposal (link)</a>, which would encompass iTunes Connect and (<em>shudder</em>) Google Play, and other similar services. </p>\n\n<p><strong>Edit:</strong></p>\n\n<p><a href=\"https://stackoverflow.com/questions/10635046/to-receive-money-from-apple-developer-i-need-multi-currency-bank-account\">This question</a> seems off topic on AskDifferent, but would be on topic on App Stores.</p>\n","OwnerUserId":"638","LastEditorUserId":"-1","LastEditDate":"2017-05-23T12:40:12.040","LastActivityDate":"2012-05-17T11:44:07.807","CommentCount":"2"},{"Id":"1316","PostTypeId":"2","ParentId":"654","CreationDate":"2012-05-17T14:45:28.703","Score":"8","Body":"<p>Update: we were able to find and acquire the twitter handle <a href=\"https://twitter.com/#!/askdifferent\" rel=\"nofollow\">@askdifferent</a>! From now on, we will be using @askdifferent instead of @stackapple, so remember that if you want to @ reply or mention us. </p>\n\n<p>Psst - if you don't follow @askdifferent already, feel free to do so :-)</p>\n","OwnerUserId":"13125","LastActivityDate":"2012-05-17T14:45:28.703","CommentCount":"1"},{"Id":"1317","PostTypeId":"1","AcceptedAnswerId":"1320","CreationDate":"2012-05-17T18:34:38.153","Score":"2","ViewCount":"78","Body":"<p>I was collecting some stats on tags and wanted to share them with the group. There are about 230 questions currently (out of 16,000 total questions) that relate to Microsoft Office.</p>\n\n<p>The MS-Office tag might make a good landing point for all questions relating to that software suite.</p>\n\n<p><img src=\"https://i.stack.imgur.com/VKUFg.png\" alt=\"enter image description here\"></p>\n\n<p>If we merged these small topics and left synonyms so that someone that wanted to ask a <a href=\"https://apple.stackexchange.com/questions/tagged/ms-word\" class=\"post-tag\" title=\"show questions tagged &#39;ms-word&#39;\" rel=\"tag\">ms-word</a> (or <a href=\"https://apple.stackexchange.com/questions/tagged/word\" class=\"post-tag\" title=\"show questions tagged &#39;word&#39;\" rel=\"tag\">word</a>) question, it wouldn't start again, but get lumped under Office. The benefit of having more questions using less tags is that <a href=\"https://apple.meta.stackexchange.com/questions/1048/how-are-tag-badges-chosen\">the people answering a category of questions get recognized more rapidly</a>.</p>\n\n<p><a href=\"https://apple.stackexchange.com/tags/ms-office/topusers\">https://apple.stackexchange.com/tags/ms-office/topusers</a></p>\n\n<p>The downside is of course that larger tags lack specificity.</p>\n\n<p>The only downside I can see is that we would lose the distinction of each product and people that are interested in following just Excel questions would not be able to sift out the rest of the questions easily. Yes, they could use an RSS feed for the search term - and the question will undoubtedly have the word Excel (or Powerpoint, Entourage, etc...) embedded in them so searchers will always find just the question they want regardless of how it's tagged.</p>\n\n<p>Here are the current followers of these tags:</p>\n\n<p><img src=\"https://i.stack.imgur.com/54ysC.png\" alt=\"enter image description here\"></p>\n\n<p>At present, it seems that the downside is small and the upside is larger, but I don't want to initiate a merging if everyone would rather wait this out and sees a benefit to the site of keeping these tags distinct.</p>\n\n<p>So, if you have a Yes or No opinion, please start that answer and discussion below:</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2012-05-23T22:08:49.620","Title":"Proposal to merge MS Office tags to better surface experts in that field","Tags":"<discussion><status-completed><tags>","AnswerCount":"1","CommentCount":"3","FavoriteCount":"1"},{"Id":"1318","PostTypeId":"1","CreationDate":"2012-05-18T02:50:00.880","Score":"3","ViewCount":"169","Body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"https://apple.meta.stackexchange.com/questions/286/ask-different-really-surely-ask-apple\">Ask Different, really? Surely Ask Apple</a>  </p>\n</blockquote>\n\n\n\n<p>I'm using a Mac right now to post this. And I'm not \"different\".</p>\n\n<p>So why is this site called \"Ask Different\"?  In my opinion, it kind of sounds like you think Mac users are somehow \"different\", and this is alienating, in a way.</p>\n\n<p>Plus what if the Mac user market shot up to 25% over a few years, for some weird reason?  Would we be \"asking different\" then, or \"asking mainstream?\"</p>\n\n<p>I just don't think it's nice to call Mac users \"Different\".  Different from what? The mainstream?  Do you have to highlight it this way?  May be viewed as <em>marginally</em> offensive. </p>\n","OwnerUserId":"22958","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-05-18T03:13:35.687","Title":"Why is this site called \"ask different\"?","Tags":"<discussion><site-promotion>","AnswerCount":"1","CommentCount":"0","ClosedDate":"2012-05-18T03:40:13.063"},{"Id":"1319","PostTypeId":"2","ParentId":"1318","CreationDate":"2012-05-18T03:13:35.687","Score":"10","Body":"<p>Ask Different is a play on the <a href=\"http://en.wikipedia.org/wiki/Think_different\" rel=\"nofollow noreferrer\">Think Different</a> ad campaign that Apple ran in the '90s.</p>\n\n<p><img src=\"https://i.stack.imgur.com/nX47O.png\" alt=\"enter image description here\"></p>\n\n<p>The Ask part just represents one of the site's core functions, asking.</p>\n\n<p>The goal is in no way to label Apple users as somehow different; it's just a bit of nostalgia.</p>\n","OwnerUserId":"2220","LastActivityDate":"2012-05-18T03:13:35.687","CommentCount":"2"},{"Id":"1320","PostTypeId":"2","ParentId":"1317","CreationDate":"2012-05-19T06:39:36.253","Score":"1","Body":"<p>In theory, I could see people who are experts in Word/Excel/PowerPoint having significant non-overlap with people who are experts in Outlook/Entourage.</p>\n\n<p>In practice, given the small number of followers for any of these tags, I suspect merging the tags as synonyms for a common ms-office tag should offer appropriate granularity for the users we do have.</p>\n\n<p>I would reiterate my belief (if I say it often enough, does that make it true?) that tags are primarily intended as neither informational labels nor search keywords, but specifically as filter terms. If there are this few posts conning the tags and they are followed by this few readers, we don't need this level of granularity.</p>\n\n<h2>Merge.</h2>\n","OwnerUserId":"9388","LastActivityDate":"2012-05-19T06:39:36.253","CommentCount":"4"},{"Id":"1321","PostTypeId":"2","ParentId":"1186","CreationDate":"2012-05-21T22:10:19.110","Score":"4","Body":"<p>This feature <a href=\"https://meta.stackexchange.com/questions/40451/add-a-voted-to-close-activity-event-somewhere-on-the-user-profile-page/130382#130382\">has been added</a> under the votes tab. If you go to your profile page, and click \"votes\", then \"closure\", you can see the close votes you've cast. The URL will look something like this, but it will only work for your profile:</p>\n\n<pre><code>http://apple.stackexchange.com/users/7833/daviesgeek?tab=votes&amp;sort=closure\n</code></pre>\n","OwnerUserId":"7833","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2012-05-21T23:20:39.243","CommentCount":"2"},{"Id":"1322","PostTypeId":"1","AcceptedAnswerId":"1323","CreationDate":"2012-05-22T16:01:11.013","Score":"3","ViewCount":"32","Body":"<p>I asked a question and accepted an answer the same day. Why does the question show the start a bounty link?</p>\n\n<p><img src=\"https://i.stack.imgur.com/4V5v8.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"4413","LastEditorUserId":"9388","LastEditDate":"2012-05-23T14:55:53.843","LastActivityDate":"2012-05-23T14:55:53.843","Title":"Why does my question have the Create a Bounty link even though I accepted an answer?","Tags":"<support><status-bydesign><bounty>","AnswerCount":"1","CommentCount":"0"},{"Id":"1323","PostTypeId":"2","ParentId":"1322","CreationDate":"2012-05-22T16:11:29.580","Score":"3","Body":"<p>It's simple. The site is for anyone to promote your question and anyone (you included) can always put a bounty on a question.</p>\n\n<p>Bounties can be issued to reward a particularly good answer, to invite a better, more complete, better documented, or more generalized answer even if the question has been answered correctly, or to encourage more people to look at the question if you want to be sure the accepted answer really is correct.</p>\n\n<p>I use it often to bring attention to a question where the wrong answer is selected. </p>\n\n<p>The site wide design is to always allow a bounty on questions once it's passed the initial waiting period to be answered without a bounty.</p>\n","OwnerUserId":"5472","LastEditorUserId":"9388","LastEditDate":"2012-05-23T14:55:41.957","LastActivityDate":"2012-05-23T14:55:41.957","CommentCount":"0"},{"Id":"1324","PostTypeId":"1","CreationDate":"2012-05-28T21:11:11.777","Score":"15","ViewCount":"95","Body":"<p>The how-to and copy-and-paste codes for entering keyboard symbols is <a href=\"https://meta.stackexchange.com/questions/26207/how-can-i-format-as-keyboard-keys\">scattered</a> <a href=\"https://apple.meta.stackexchange.com/q/193/21703\">around</a> AD <a href=\"https://apple.meta.stackexchange.com/a/210/21703\">meta</a> but it is something that comes up a lot and is very helpful, particularly when using an iPad. </p>\n\n<p>Can we please get these answers consolidated and added to the <a href=\"https://apple.stackexchange.com/editing-help\">full page Markdown help</a>?  If not the full info itself, then at least links to it, like was done for <a href=\"https://meta.stackexchange.com/q/1777/183358\">inline HTML</a>.  </p>\n\n<p>I know that technically <code>&lt;kbd&gt;</code> is HTML but obviously not a lot of people know it, so just using it as an example of inline HTML is not enough. </p>\n","OwnerUserId":"21703","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Please update the Markdown help to include how to enter keyboard symbols","Tags":"<feature-request>","AnswerCount":"1","CommentCount":"2","FavoriteCount":"2"},{"Id":"1325","PostTypeId":"2","ParentId":"390","CreationDate":"2012-05-29T00:44:14.827","Score":"7","Body":"<p>I am very much in favor of creating a syntax like <kbd>Command ⌘</kbd>+ <kbd>Option ⌥</kbd> + <kbd>I</kbd> as it would solve a number of problems. As an iPad user I'm also in favor of an iPad friendly tool bar button. </p>\n\n<p>How has this request languished for so long?</p>\n","OwnerUserId":"21703","LastEditorUserId":"7833","LastEditDate":"2012-05-29T18:59:17.597","LastActivityDate":"2012-05-29T18:59:17.597","CommentCount":"1"},{"Id":"1327","PostTypeId":"2","ParentId":"1298","CreationDate":"2012-06-04T04:29:54.093","Score":"1","Body":"<p>Just state the facts:</p>\n\n<p>\"When I tried to X, I expected to get Y, but instead I got Z.</p>\n\n<p>Here's my setup: <strong><em>_</em>___</strong>\"</p>\n","OwnerUserId":"711","LastActivityDate":"2012-06-04T04:29:54.093","CommentCount":"0"},{"Id":"1328","PostTypeId":"2","ParentId":"971","CreationDate":"2012-06-08T06:04:51.140","Score":"2","Body":"<p>I have just added this capability to my website. You can read all of the details <a href=\"https://meta.stackexchange.com/a/135045/142114\">here</a>.</p>\n\n<p>Basically the process goes something like this:</p>\n\n<ol>\n<li>Register for an account on my website.</li>\n<li>Connect your new account to your Stack Exchange profile.</li>\n<li>Authorize my website to access your inbox.</li>\n<li>Receive a custom RSS feed URL that contains the contents of your inbox.</li>\n</ol>\n","OwnerUserId":"1121","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2012-06-08T06:04:51.140","CommentCount":"0"},{"Id":"1329","PostTypeId":"1","AcceptedAnswerId":"1330","CreationDate":"2012-06-12T11:45:03.073","Score":"6","ViewCount":"32","Body":"<p>I've noticed a user who has every quality of being a Spam-bot. I know you can flag questions, but can you flag users as well? The user in this case, <a href=\"https://apple.stackexchange.com/users/23893/edward\">edward</a>, keeps spamming and filling up the discussion board...  </p>\n\n<p>How can I get in touch with a moderator (by message or chat,...) to make sure edward won't spam anymore?</p>\n","OwnerUserId":"11610","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2012-06-12T12:14:11.763","Title":"How to report spam-user","Tags":"<feature-request><status-bydesign>","AnswerCount":"1","CommentCount":"0"},{"Id":"1330","PostTypeId":"2","ParentId":"1329","CreationDate":"2012-06-12T12:13:51.843","Score":"4","Body":"<p>In general, if you flag several posts by the same user, a moderator will likely notice the pattern and investigate. We often can be quite perceptive when things are amiss. Flags are quite helpful, and that would usually be sufficient (as it was in this case).</p>\n\n<p>If, however, you find that does not work for some reason because there is a larger or more complex question about the site, a new question asked on meta (like this one) shows up in our inboxes to draw our attention to it.</p>\n\n<p>In other words, the two things you did (flag and meta post, in that order) are ways to accomplish what you hoped to accomplish.</p>\n","OwnerUserId":"9388","LastActivityDate":"2012-06-12T12:13:51.843","CommentCount":"1"},{"Id":"1331","PostTypeId":"1","AcceptedAnswerId":"1332","CreationDate":"2012-06-12T13:06:06.333","Score":"24","ViewCount":"2664","Body":"<p>Apple generally pre-announces its latest and greatest operating system, and seeded copies to developers, but the operating system is not yet shipping to the general public. This can last for months and often causes confusion when some questions get closed and others do not.</p>\n\n<p>Are questions about any upcoming releases within the scope of the site at this point in time? For an example of a question that was closed as off topic for Ask Different see <a href=\"https://apple.stackexchange.com/questions/53453/do-not-disturb-vs-silent-switch\">this question</a>.</p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-07-23T22:57:56.567","Title":"Can I ask about not-yet-publicly released OS?","Tags":"<discussion><faq>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"3"},{"Id":"1332","PostTypeId":"2","ParentId":"1331","CreationDate":"2012-06-12T14:36:44.150","Score":"26","Body":"<p><strong><em>Please do not</em></strong> <em>unless you ask on chat or flag for a moderator.</em> We would rather help edit it if you have any doubts if it will be on-topic. The reasons why are listed below, but if your question revolves around speculation or items that will be clear the day after launch, please hold these questions until the experts can answer them with authority and on the record. </p>\n\n<p><a href=\"https://apple.meta.stackexchange.com/a/1115/9388\">Kyle Cronin's answer about Mountain Lion</a> seems to apply fully here to questions about other pending versions as well.</p>\n\n<p>While it is possible that there is a question about [generic future OS] that would be appropriate for this site, the overwhelming majority of [generic future OS] questions will be closed because</p>\n\n<ol>\n<li><p>[generic future OS] is not yet a shipping product, and as such, its features may change before it ships. Any questions answered about the <em>current</em> state of [generic future OS] could easily not be accurate by the time the product ships. As such, these questions are <strong>too localized</strong>.</p></li>\n<li><p>Questions about what features it <em>will</em> contain in the future when it is released are speculative; no one knows (not even Apple engineers) what the final shipping version of the product will be. So questions asking about what features <em>will be</em> in the final version are <strong>not a real question</strong> that can be answered.</p></li>\n<li><p>Questions about the specifics of [generic future OS] are in most cases unanswerable except by people who have signed a <strong>Non-disclosure Agreement</strong>. Both the answerer and the site could get into trouble if we allow answers to be posted here that violate such an agreement.</p></li>\n<li><p>The small set of questions that ask about publicly available information tend to be both localized in time (not relevant once the product actually ships) and lend themselves to a very short answer. Questions like \"Has Apple publicly announced a timeline for the next version of iOS?\" do not violate an NDA, but really lend themselves to a one-sentence answer; these are not the sorts of questions we want to encourage on this site.</p></li>\n</ol>\n\n<p>While questions will be considered on a case-by-case basis, I find it unlikely that any [generic future OS] questions posted in the near future will remain open on the site. If you have a counterexample of a question that invites a long answer, is likely to be stable even after the software is complete, and can be answered without risking violating an NDA, I'd love to hear about it, but I remain skeptical that a good question will emerge.</p>\n","OwnerUserId":"9388","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-07-11T04:12:38.577","CommentCount":"9"},{"Id":"1333","PostTypeId":"1","CreationDate":"2012-06-13T17:34:34.553","Score":"3","ViewCount":"137","Body":"<p>Our official name has recently been upgraded to Ask Different (instead of Apple). This is something we've been <a href=\"https://apple.meta.stackexchange.com/questions/433/please-change-name-of-site-from-apple-to-ask-different\">hoping for</a> for a long time, and I'm thrilled that it's happened. I don't want this post to come across as complain-y or ungrateful, it's just a little detail I noticed and wanted to mention.</p>\n\n<p>The change seems to have propagated throughout the site and network now: we're Ask Different in the site's title, the SE sites list, the newsletter, etc.</p>\n\n<p>However, in some places (like the <a href=\"https://apple.stackexchange.com/about\">about page</a>), the name is displayed as 'Ask Different - Stack Exchange'.</p>\n\n<p>This sounds weird to me: Apple - Stack Exchange made sense because 'Apple' was not the site's brand; we were part of the Stack Exchange brand. Now that we officially have the distinct brand 'Ask Different', keeping SE on the end seems a little messy and unnecessary (even without '-SE' it's still clear that we're part of the SE network).</p>\n\n<p>SE's David Fullerton mirrored this observation in his <a href=\"https://gaming.meta.stackexchange.com/questions/4237/a-new-name-for-gaming-stack-exchange\">original post</a> on Arqade:</p>\n\n<blockquote>\n  <p>About the only thing we can agree on right now is that “XXXXX Stack Exchange” is not a brand -- it’s too long, descriptive, and forgettable.</p>\n</blockquote>\n\n<p>I've noticed this on Arqade as well: they are 'Arqade - Stack Exchange' in some places, not just 'Arqade'. Wasn't this one of the reasons (a small one, but a reason nonetheless) for the change in the first place?</p>\n\n<p><strong>Personally, I'm in favor of removing the ' - Stack Exchange' from the end of 'Ask Different'.<br>\nThoughts?</strong></p>\n","OwnerUserId":"2220","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2012-07-14T04:40:56.197","Title":"Should we keep ' - Stack Exchange' at the end of our name?","Tags":"<discussion><site-name>","AnswerCount":"1","CommentCount":"3","FavoriteCount":"1"},{"Id":"1334","PostTypeId":"2","ParentId":"1333","CreationDate":"2012-06-13T21:22:19.807","Score":"3","Body":"<p><img src=\"https://i.stack.imgur.com/5ryxG.png\" alt=\"Stack Overflow x3\"></p>\n\n<p>Enough said?</p>\n","OwnerUserId":"1346","LastActivityDate":"2012-06-13T21:22:19.807","CommentCount":"2"},{"Id":"1335","PostTypeId":"1","CreationDate":"2012-06-14T09:49:12.797","Score":"0","ViewCount":"169","Body":"<p>I have the new iPad WiFi + 4G 16gb purchased in the UK, and the model on the back is A1430, yet in the OS it refers to MD366B. When I download the iOS 5.1 IPSW file, it refers to iPad3,3_5.1.1_9B206_Restore, so this is an iPad3,3 for OS purposes.</p>\n\n<p>I've seen on several websites discussing OS revisions that there are 3 versions of the iPad 3, the WiFi only, WiFi + CDMA (or sometimes Verizon), and WiFi + GSM (or sometimes AT&amp;T).</p>\n\n<p>They talk about the GSM version being either 3,2 or 3,3. I assume this is a mistake on the sites.</p>\n\n<p>So what is the best way to refer to the models, and why are there 3? Hardware model, iOS model, and IPSW model.</p>\n","OwnerUserId":"17832","LastActivityDate":"2012-06-14T10:07:51.713","Title":"iOS model designations?","Tags":"<discussion><ipad><ios>","AnswerCount":"1","CommentCount":"0"},{"Id":"1336","PostTypeId":"2","ParentId":"1335","CreationDate":"2012-06-14T10:07:51.713","Score":"2","Body":"<p>Personally I would refer to them via the general model information:</p>\n\n<ul>\n<li>iPad 3 Wi-Fi Only</li>\n<li>iPad 3 CDMA</li>\n<li>iPad 3 GSM</li>\n</ul>\n\n<p>Distinct enough, no?</p>\n\n<p>Information about the region+carrier only if relevant.</p>\n","OwnerUserId":"1346","LastActivityDate":"2012-06-14T10:07:51.713","CommentCount":"3"},{"Id":"1337","PostTypeId":"1","CreationDate":"2012-06-14T16:22:55.377","Score":"4","ViewCount":"119","Body":"<p>I have a specific question I'm wondering how to handle now that all the MobileMe changes are about to fade into history this June when MobileMe goes away:</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/14049/is-it-possible-to-use-back-to-my-mac-dns-or-routing-information-from-the-command\">Is it possible to use Back To My Mac DNS or routing information from the command line?</a></p>\n\n<p>As you can see in this particular case - the right answer is shifting, so it's up to me (the OP) to see the new answer and select it. (assuming I want this to be about iCloud and the current Back To My Mac). </p>\n\n<p><em>I'm inclined to ask a new question specifically about Lion's iCloud BTMM - and leave this question alone as historical reference.</em></p>\n\n<p>Is this a good idea in general - leave decent enough questions alone and ask a new iCloud question or would it be better to try to keep evolving questions as a first inclination on the site?</p>\n\n<p><sub><em>(and yes, I know that finding a general rule is hard since there are always exceptions, but I'm interested in people's experience on other sites to see if we want to tend to handle these one way or another)</em></sub></p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2012-06-15T23:14:36.733","Title":"How do we want to handle MobileMe questions? (In general)","Tags":"<discussion>","AnswerCount":"2","CommentCount":"4"},{"Id":"1338","PostTypeId":"2","ParentId":"1337","CreationDate":"2012-06-15T04:35:51.657","Score":"3","Body":"<p>We want our questions and answers to be timeless, and the fact that a question will produce answers that are likely to be of use only in a small window of time is grounds for closing things as \"too localized\". At the same time, the grass withers and the flowers fade. Sic transit gloria mundi. Things can change, and our answers, well-intended to be timeless, become relics of a bygone age.</p>\n\n<p>I'd treat this in two different categories.</p>\n\n<p>In cases where the right answer in the past was to document that \"it can't be done,\" but changes to the available technology make it possible to accomplish the task, I'd certainly consider replacing the acceptance of the unhelpful but true (at the time) documentation of a non-solution with an acceptance of a new solution that actually solves the problem.</p>\n\n<p>On the other hand, if a question has a well-documented answer that worked great, but circumstances change to the old answer is no longer valid, I'd think the best way to handle this is with an edit to the question to indicate that the question was asked in a particular era. Ask the question again in the modern era, and perhaps even link to the new question from the old one, but don't wipe out the documentation of the old way of doing things. It smacks too much of Orwell's <em>1984</em> to revise our answers every time circumstances change. Oceanea was at war with Eastasia. Oceania had always been at war with Eastasia.</p>\n\n<p>Those are my opinions. If you don't like 'em, I have others.</p>\n","OwnerUserId":"9388","LastActivityDate":"2012-06-15T04:35:51.657","CommentCount":"0"},{"Id":"1339","PostTypeId":"2","ParentId":"1337","CreationDate":"2012-06-15T23:14:36.733","Score":"1","Body":"<p>I agree with Daniel's thoughts, but I think we should consider actually closing (not deleting) the out-of-date questions once new ones have been asked to replace them.</p>\n\n<p>That would preserve the content on the site so that the we don't lose good contributions, and allow voting to continue so the people who provided answers that were good when posted can still be rewarded for their work. Closing would also prevent people from thinking that the problems were still unsolved and trying to answer. Finally, I think I remember reading that closed questions are ranked lower in search results.</p>\n\n<p>Effectively, the old content would be kept but wouldn't get in the way of the new content.</p>\n","OwnerUserId":"2220","LastActivityDate":"2012-06-15T23:14:36.733","CommentCount":"0"},{"Id":"1340","PostTypeId":"1","AcceptedAnswerId":"1341","CreationDate":"2012-06-18T19:41:10.390","Score":"8","ViewCount":"157","Body":"<p>I wrote a brief answer to <a href=\"https://apple.stackexchange.com/questions/54064/permission-denied-error-when-copying-to-usr-local-bin\">this question</a>, and almost immediately got a message attached to the answer, saying</p>\n\n<blockquote>\n  <p>We're looking for long answers that provide some explanation and\n  context. Don't just give a one-line answer: please explain <em>why</em> you're\n  recommending it as a solution. Answers that don't explain anything\n  will be deleted. See <a href=\"http://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/\">Good Subjective, Bad Subjective</a> for more\n  information.</p>\n</blockquote>\n\n<p>I didn't have the time right then to write a paragraph explaining what <code>sudo</code> does, so rather than have a moderator delete my answer, I deleted it myself. Some twenty minutes later, another equally short and non-explanatory answer appeared and was accepted.</p>\n\n<p>This episode is no big deal to me – it only took me moments to write my answer, and if someone else gets a few points of reputation for answering the question, I couldn't care less. But I am puzzled and curious: The message seems like a canned message. Does the software post such messages automatically, or does some moderator push a button to make it happen? Also, I don't see the relevance of the <a href=\"http://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/\">Good Subjective, Bad Subjective</a> article to a criticism concerning either shortness or lack of explanations. Whatever might be wrong with my answer, <em>subjective</em> is not it!</p>\n","OwnerUserId":"4941","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-12-29T00:06:41.753","Title":"When is an answer too short?","Tags":"<discussion>","AnswerCount":"2","CommentCount":"0"},{"Id":"1341","PostTypeId":"2","ParentId":"1340","CreationDate":"2012-06-18T19:56:07.907","Score":"3","Body":"<p>Your answer was flagged as being \"low quality\". In responding to the flag as a moderator, I disagreed that it was low quality (it was correct and on-target), but it did have plenty of room for improvement, so I responded to the flag by attaching the post notification inviting more explanation. The flag was automated. My response was human, but it was from a rather limited set of menu choices. While \"subjective\" is indeed not the issue at hand, the article linked does have some suggestions about how to improve upon short posts.</p>\n\n<p>In the future, you don't need to think of that as an invitation to delete your post. If you or someone else come back and expand your answer, that is a wonderful thing. If no one does over the course of a few months, we will try to come back and either delete or improve such posts, but there really is a window here, and while you are welcome to improve the post yourself, it isn't all up to you. If you start a good answer, someone else can extend it. If you delete it, it is no longer there for the community to build on.</p>\n\n<p>The language of the standard notification is perhaps more threatening than I'd like it to be, but we moderators can't change it; it's standardized system-wide.</p>\n\n<p>I thought your answer was a great start; I attached the post notification to encourage either you or someone else to improve on it by explaining more.</p>\n\n<p>I'm sorry this situation worked out the way it did. I was trying to send the message \"good start, but we'd love to see more here.\"</p>\n","OwnerUserId":"9388","LastActivityDate":"2012-06-18T19:56:07.907","CommentCount":"2"},{"Id":"1342","PostTypeId":"1","AcceptedAnswerId":"1343","CreationDate":"2012-06-19T15:57:00.690","Score":"4","ViewCount":"60","Body":"<p>Next to comments there are two options - one is to flag it, the other is an up arrow (\"this is a great comment\"). Other then letting users know which comments are valuable, do  the up arrows \"votes\" have any other role?</p>\n","OwnerUserId":"18917","LastEditorUserId":"9388","LastEditDate":"2012-06-19T21:27:35.983","LastActivityDate":"2012-06-19T21:27:55.857","Title":"Great Comment \"votes\"","Tags":"<discussion>","AnswerCount":"1","CommentCount":"2","FavoriteCount":"1"},{"Id":"1343","PostTypeId":"2","ParentId":"1342","CreationDate":"2012-06-19T19:38:52.397","Score":"2","Body":"<p>The only other function they serve is that, in cases where a question or answer has many comments, and the displayed list is abridged and the <strong>Add/Show x More Comments</strong> link appears, up votes are used to determine which contents remain displayed while others are hidden.</p>\n\n<p>Beyond that, it has no other mechanical effect, other than providing a visual indicator to other users that some number of people thought a given comment was worthy of additional attention in some way.</p>\n","OwnerUserId":"43","LastEditorUserId":"9388","LastEditDate":"2012-06-19T21:27:55.857","LastActivityDate":"2012-06-19T21:27:55.857","CommentCount":"0"},{"Id":"1344","PostTypeId":"2","ParentId":"1324","CreationDate":"2012-06-21T16:15:59.197","Score":"1","Body":"<p>I don't think that a <em>Markdown</em> help page is an appropriate place for teaching users about HTML tags, however obscure they may be.</p>\n\n<p>I see three options:</p>\n\n<ul>\n<li>Don't provide a Markdown help page. Provide an <em>editing</em> help page that covers both Markdown and HTML.</li>\n<li>Provide a discoverable <a href=\"https://apple.meta.stackexchange.com/questions/390/editor-button-or-shortcut-for-kbd-tag\">editor button</a> for inserting the <code>&lt;kbd&gt;</code> tag.</li>\n<li>Polish and link more prominently to an <a href=\"https://meta.stackexchange.com/questions/1777/what-html-tags-are-allowed-on-stack-exchange-sites\">HTML help page</a>.</li>\n</ul>\n","OwnerUserId":"6408","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2012-06-21T16:23:30.573","CommentCount":"0"},{"Id":"1345","PostTypeId":"1","CreationDate":"2012-06-24T13:50:55.233","Score":"-1","ViewCount":"230","Body":"<p>The current name of the site - \"Ask Different\" doesn't make sense for most of people except of some people who remember history of Apple campaigns.</p>\n\n<p>When I first time have seen the reference to the site, I decided, that it's like miscelenious, and didn't understand, why apple related questions do not have designated site. I've spend  an hour finding and reading different discussions about how/why the name was chosen( including  <a href=\"https://apple.meta.stackexchange.com/questions/205/official-site-title/\">Official Site Title</a>, <a href=\"https://apple.meta.stackexchange.com/questions/9/domain-name-suggestions/\">Domain name suggestions</a>, <a href=\"https://apple.meta.stackexchange.com/questions/134/write-an-elevator-pitch-tagline\">Write an Elevator Pitch / Tagline</a> )</p>\n\n<p>They didn't convinced me that the name is obvious for most of users.</p>\n\n<p>On <a href=\"http://stackexchange.com/sites\">http://stackexchange.com/sites</a> page most site names are self- explanatory, except of Ask Different ( and StackOverflow itself). \nIt shows just \"Ask Different\" and a meaningless for me sign. User has to select the box to see subtitle, explaining what the site is about.</p>\n\n<p>There is currently no explanation of the name on <a href=\"https://apple.stackexchange.com/about\">https://apple.stackexchange.com/about</a> neither on <a href=\"https://apple.stackexchange.com/faq\">https://apple.stackexchange.com/faq</a>.</p>\n\n<p> (Can the  explanation be added, if rename of the site will be postponed/ not implemented?)</p>\n\n<p>I am fully agree with reasons  described in</p>\n\n<p><a href=\"https://apple.meta.stackexchange.com/questions/286/ask-different-really-surely-ask-apple\">Ask Different, really? Surely Ask Apple</a>, why the current name is incorrect.</p>\n\n<p>However the suggested name \"Ask Apple\" was not good, because the site does not a support from Apple company.</p>\n\n<p>I am suggesting  to rename the site  as \"Apple User \" (similar to Super User). I understand that it's sounds like a major change, but re-branding often a good thing. It was wise to leave URL unchanged, when change of the name was done.<a href=\"https://apple.meta.stackexchange.com/questions/433/please-change-name-of-site-from-apple-to-ask-different\">Please change name of site from &quot;Apple&quot; to &quot;Ask Different&quot;</a>.</p>\n\n<p>When voting for my suggestion, please consider that the name should be meaningful for thousands of new users, not only for people, who familiar with the current site and Apple history.</p>\n\n<p>Name is confusing for NEW members, for people, who do search or wants to ask the first Apple related question and don't know, that Apple related site exist. I agree, that once I learn the purpose of the site, i can accept the name. But this learning exercise for every new person could be easily avoided just by having more intuitive name. </p>\n\n<p>My suggestion is to folow KISS principle, avoid extra step of translation (in particular for new users) that Different means Apple.</p>\n","OwnerUserId":"24285","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2013-03-10T20:41:49.580","Title":"​Rename the site as Apple User","Tags":"<discussion><site-name>","AnswerCount":"3","CommentCount":"12","FavoriteCount":"2"},{"Id":"1346","PostTypeId":"1","CreationDate":"2012-06-24T22:58:05.333","Score":"8","ViewCount":"62","Body":"<p>In our logo, the description of Ask Different is \"Answers for your Apple questions\" -- a concise and fairly accurate description of the site.</p>\n\n<p>At <a href=\"http://stackexchange.com/sites\">http://stackexchange.com/sites</a>, our site is described as \"Q&amp;A for power users of Apple hardware and software.\" While Q&amp;A for power users are certainly a part of what our site is about, we make a point of welcoming reasonably researched questions from all levels of users, not just power users.</p>\n\n<p>Could the tagline at <a href=\"http://stackexchange.com/sites\">http://stackexchange.com/sites</a> either match the logo, so the branding \"Answers for your Apple questions\" is consistent across mentions of the site (probably the best option) or at least the word \"power\" be dropped, so it reads \"Q&amp;A for users of Apple hardware and software\"? We don't want to scare off non-power users. They are welcome here, and the tagline should reflect that.</p>\n","OwnerUserId":"9388","LastEditorUserId":"9388","LastEditDate":"2012-06-24T23:16:17.127","LastActivityDate":"2012-06-26T16:36:45.277","Title":"Can we delete the word \"power\" from the tagline at stackexchange.com/sites?","Tags":"<feature-request>","AnswerCount":"2","CommentCount":"0"},{"Id":"1348","PostTypeId":"2","ParentId":"1346","CreationDate":"2012-06-24T23:20:28.880","Score":"7","Body":"<p>I could get behind that. We have all sorts of great dialog in the <a href=\"https://apple.stackexchange.com/faq\">faq</a> explaining what questions we love and power isn't anywhere on that list. </p>\n\n<p>We also eliminate tags like <a href=\"https://apple.stackexchange.com/questions/tagged/beginner\" class=\"post-tag\" title=\"show questions tagged &#39;beginner&#39;\" rel=\"tag\">beginner</a> or <a href=\"https://apple.stackexchange.com/questions/tagged/expert\" class=\"post-tag\" title=\"show questions tagged &#39;expert&#39;\" rel=\"tag\">expert</a> so deleting any adjective qualifying the users of the site seems like a good signal to send. </p>\n\n<p>We should be the site for good questions about using Apple products. Full stop. </p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2012-06-24T23:21:26.880","CommentCount":"0"},{"Id":"1349","PostTypeId":"2","ParentId":"1345","CreationDate":"2012-06-25T10:03:48.250","Score":"4","Body":"<p>I apologize for continuing to stir the pot (... kind of), but here's why I figure that the suggestion of the new name is silly:</p>\n\n<p>Programming User<br>\nAdmin User<br>\nSuper User<br>\nAndroid User<br>\nApple User<br>\nParent User (User Parenting?)<br>\nMath User<br>\nDatabase User<br>\nGame Player<br>\nUbuntu User<br>\nEnglish Speaker<br>\nWordpress User</p>\n\n<p>That's pretty much what I feel the chain of logic being employed here, is, and it's really nonsensical. Not to even mention that the name Super User doesn't come from etymology similar to \"Power User\", the name Super User comes from the unix command <code>su</code> which escalates your privileges to root, the \"super user\" of the system.</p>\n\n<p>The name Super User was a cute play on words that iconifies talented (unix) system administrators. I'm sure there are plenty of Windows users, admins, etc., in the world that miss the point of the joke ENTIRELY, but that's ok. Windows questions to the extent their FAQ describes are still completely on-topic and relevant for Super User.</p>\n","OwnerUserId":"1346","LastActivityDate":"2012-06-25T10:03:48.250","CommentCount":"4"},{"Id":"1350","PostTypeId":"2","ParentId":"1346","CreationDate":"2012-06-26T16:36:45.277","Score":"4","Body":"<p>I fully agree, on a number of levels.  Firstly, Apple is more than just the computer company it once was when many of our users became, well, users.  </p>\n\n<p>Really these days, especially when you consider both unit shipment and profit figures, it's a consumer electronics company, the iOS stuff is the bulk of Apple's market these days, and as I've mentioned on another Meta comment, I don't see 'power user' as an appropriate tag for any of those devices.</p>\n\n<p>So whilst we get a number of <a href=\"https://apple.stackexchange.com/q/21435/9495\">difficult</a> OS X specific questions, which many of our users love to answer, we also get a whole heap of what I will generously called \"<a href=\"https://apple.stackexchange.com/q/54710/9495\">modestly difficult</a>\" questions to answer as well.</p>\n\n<p>The key point I am trying to make is that we are here for the person who can't understand how to change tracks on his iPod Shuffle as well as for the guy who is attempting to write an Applescript that makes the tea for him.</p>\n\n<p>I would go further and remove references to hardware and software.  I'd like the thing to read much cleaner, and simpler, and be something like \"Q&amp;A for users of Apple products\" without attempting to judge the relative skill levels of users.</p>\n","OwnerUserId":"9495","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2012-06-26T16:36:45.277","CommentCount":"0"},{"Id":"1351","PostTypeId":"2","ParentId":"1345","CreationDate":"2012-06-26T17:21:12.437","Score":"12","Body":"<p>I wanted to step in and just say \"Hi\" and thanks for making a suggestion. I've read your post three times and I don't know what to make of it.</p>\n\n<p>Mostly - it's \"I don't like the name since it made my experience here bad at first\".</p>\n\n<p>Setting aside the mechanics of the branding as an idea gets implemented all across the site in hundreds of places (which would affect how a change once there were consensus might take place) and the <a href=\"http://www.apple.com/legal/trademark/appletmlist.html\" rel=\"nofollow noreferrer\">legal trademark</a> issues (that would likely quash your request outright even if everyone wanted this change) that make it hard to name a large site Apple whatever in relation to the company.</p>\n\n<p>I'm missing the details from your journey and scratching my head how the current name was bad for your experience. (or a different name would make it better).</p>\n\n<p>We get new users three ways by far:</p>\n\n<ol>\n<li>They have a problem and google it - the search engines work marvelously to index this site.</li>\n<li>Someone posts a link to twitter, facebook, a blog that provides all the context needed to know this place is for Apple questions.</li>\n<li>Serendipity in clicking a link from the Main </li>\n</ol>\n\n<p>All of them see this:</p>\n\n<p><img src=\"https://i.stack.imgur.com/FjGFX.png\" alt=\"Ask Different home page\"></p>\n\n<p>Based on the problems I see helping new users get used to the site, I would say we already have problems where people find the site and come here for \"HELP! My [iPhone contacts are gone|Mac won't boot|iCloud is storming], what now, HELP FAST PLEASE?\" type user support questions that are more about triage / troubleshooting / consumer education. We're shooting for a bit more than a site of \"here's the support article covering your situation\" so making it both easy to join and having enough support to educate is a hard thing to make \"one size fits all\".</p>\n\n<p>If you changed that big \"Ask Different\" to \"Apple\", my inclination would be to think we would have more confusion about what the site's goals and focus. The name we have says, this isn't <a href=\"https://discussions.apple.com/index.jspa\" rel=\"nofollow noreferrer\">Apple Support Communities</a> but instead literally something different.</p>\n\n<p>Having been around stack exchange a bit - the site overall (and our little corner of it) is moving away from the internal use of Apple (despite the URL remaining) and towards the Ask Different name and branding. I'm not saying this is right for everyone, just be aware that the momentum currently is towards more \"Ask Different\" and <a href=\"http://blog.stackoverflow.com/2012/06/welcome-to-the-arqade/\">branding of sites with made up names</a> that is both a homophone and a clever play on letters.</p>\n\n<hr>\n\n<p>So - back to your suggestion to rename the site. Would you perhaps add an answer here explaining some more of what you were trying to do and how a name change would help? It's clearly a suggestion that goes against the grain, but let's bang it around and see if the plusses could outweigh the negatives. I'd love to hear criticism of the new user process in the event we can shape things or make it easier to get new users to ask great questions or benefit the most from the content here - no matter how we get there. Oh - be ready to get lots of votes up and down, but they don't affect your reputation on the main site so do expect people to vote down questions and answers that they disagree with. (Meta is a bit different in this manner and scope than the main site)</p>\n\n<p>As it stands, I appreciate the benefits that having a name/brand distinct from Apple bring to the site and the community.</p>\n","OwnerUserId":"5472","LastActivityDate":"2012-06-26T17:21:12.437","CommentCount":"0"},{"Id":"1352","PostTypeId":"1","AcceptedAnswerId":"1354","CreationDate":"2012-06-27T03:41:22.590","Score":"10","ViewCount":"323","Body":"<p><a href=\"http://askdifferent.com\">http://askdifferent.com</a> is registered, but it redirects to <a href=\"http://apple.stackexchange.com\">http://apple.stackexchange.com</a> instead. Why is that?</p>\n","OwnerUserId":"23852","LastActivityDate":"2012-06-27T04:02:08.340","Title":"Why isn't askdifferent.com used?","Tags":"<discussion>","AnswerCount":"2","CommentCount":"1"},{"Id":"1353","PostTypeId":"2","ParentId":"1352","CreationDate":"2012-06-27T03:52:45.683","Score":"2","Body":"<p>I believe the canonical sites that are not on the trilogy (and the newly promoted arquade) all are intended to be branded with the stack exchange name for several reasons.</p>\n\n<ul>\n<li>less work (there are like 82 sites all told)</li>\n<li>better cohesiveness in search engine eyes as well as overall site traffic</li>\n<li>less cost for software / naming that goes by domain</li>\n</ul>\n\n<p>Search on the <a href=\"https://meta.stackoverflow.com/\">main meta</a> and here for more of the back story...</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T09:16:27.723","LastActivityDate":"2012-06-27T03:52:45.683","CommentCount":"2"},{"Id":"1354","PostTypeId":"2","ParentId":"1352","CreationDate":"2012-06-27T04:02:08.340","Score":"6","Body":"<p>All of the non-trilogy sites use .SE domains. In a <a href=\"http://blog.stackoverflow.com/2012/06/welcome-to-the-arqade/\">post</a> on the SO blog, these reasons are listed (emphasis mine):</p>\n\n<blockquote>\n  <p>There are a lot of benefits to being associated with the Stack\n  Exchange network! That’s why Arqade, Ask Different, and Seasoned\n  Advice (among others) all redirect to a ___.stackexchange.com\n  subdomain, even though they have their own brands.  <strong>For one, search\n  rank is improved for our entire network.  Additionally, many people\n  recognize Stack Exchange as a brand, and might be more likely to visit\n  some of the smaller sites because of that.</strong></p>\n</blockquote>\n\n<p>That said, I don't think that having the established, uniquely-branded sites on their in domains would necessarily be a bad idea.</p>\n\n<p>Also see:<br>\n<a href=\"https://apple.meta.stackexchange.com/questions/308/new-domain-redirection-vs-new-location\">New Domain: Redirection vs New Location</a><br>\n<a href=\"https://apple.meta.stackexchange.com/questions/433/please-change-name-of-site-from-apple-to-ask-different\">Please change name of site from &quot;Apple&quot; to &quot;Ask Different&quot;</a></p>\n","OwnerUserId":"2220","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2012-06-27T04:02:08.340","CommentCount":"4"},{"Id":"1356","PostTypeId":"1","AcceptedAnswerId":"1357","CreationDate":"2012-06-29T19:24:42.753","Score":"7","ViewCount":"74","Body":"<p>Is it a flower? Indian symbol? I know that Jobs was a hippie in the 70s so maybe it comes from that times. Don't get me wrong, to me it looks like a svastika on steroids. But I am looking forward for some official meaning from you guys.</p>\n","OwnerUserId":"24634","OwnerDisplayName":"Derfder","LastActivityDate":"2012-06-30T05:04:55.883","Title":"What does the logo for AskDifferent and the symbol for command stand for?","Tags":"<discussion><design>","AnswerCount":"1","CommentCount":"2"},{"Id":"1357","PostTypeId":"2","ParentId":"1356","CreationDate":"2012-06-29T19:35:17.793","Score":"10","Body":"<p>Its origin is the Saint John's Arms (or the Bowen knot) has been used throughout history in many Scandinavian countries. In Sweden it is used on maps to denote special places of interest.</p>\n\n<p>When working on the Macintosh, Steve Jobs wasn't happy with using the Apple logo throughout the UI to indicate modifier keys, so the team around Andy Hertzfeld and Susan Kare came up with this. You can read this story here: <a href=\"http://www.folklore.org/StoryView.py?project=Macintosh&amp;story=Swedish_Campground.txt\" rel=\"nofollow\">Swedish Campground</a> or in more detail on <a href=\"http://en.wikipedia.org/wiki/Command_key\" rel=\"nofollow\">Wikipedia</a>.</p>\n","OwnerUserId":"24129","OwnerDisplayName":"kremalicious","LastActivityDate":"2012-06-29T20:31:35.340","CommentCount":"3"},{"Id":"1358","PostTypeId":"1","CreationDate":"2012-06-30T21:24:32.233","Score":"19","ViewCount":"255","Body":"<p>As the question/answer editor currently stands, <kbd>⌘</kbd><kbd>H</kbd> inserts <code>## Heading ##</code>.</p>\n\n<p>I often want to use the Hide shortcut while editing, so is there any way I could disable it? Otherwise, would people mind if we changed it for everyone?</p>\n","OwnerUserId":"12285","LastEditorUserId":"12285","LastEditDate":"2012-07-05T04:16:07.720","LastActivityDate":"2013-08-01T12:54:04.113","Title":"Can we disable the ⌘H \"Heading\" shortcut?","Tags":"<discussion><feature-request><editor>","AnswerCount":"2","CommentCount":"10","FavoriteCount":"1"}]