[{"Id":"683","PostTypeId":"1","CreationDate":"2011-08-10T00:55:52.633","Score":"57","ViewCount":"1084","Body":"<p>It would be easy and useful to put the most-commonly-used keyboard shortcut characters (such as ⌃⌥⇧⌘⎋⏏⌫↑⇡↖⇞⇥, and perhaps others — see <a href=\"http://pastie.org/4011\" rel=\"nofollow\">here</a> for a list, which you can also place at <code>~/Library/Key Bindings/DefaultKeyBinding.dict</code> to type these characters easily) somewhere on the page (perhaps in the editing help, or discreetly in the footer?) so people could copy and paste them when writing questions/answers if they don't have an easy way to type them.</p>\n","OwnerUserId":"8318","LastEditorUserId":"8318","LastEditDate":"2012-04-03T14:22:57.163","LastActivityDate":"2012-07-26T19:53:37.030","Title":"Put the ⌃⌥⇧⌘⎋⏏⌫↑⇡↖⇞⇥ characters somewhere for people to copy/paste","Tags":"<feature-request><editing>","AnswerCount":"6","CommentCount":"5","FavoriteCount":"23"},{"Id":"684","PostTypeId":"1","AcceptedAnswerId":"685","CreationDate":"2011-08-10T02:42:26.213","Score":"6","ViewCount":"84","Body":"<p>This question is a reaction to a hint in a comment on an answer of mine <a href=\"https://apple.meta.stackexchange.com/questions/638/is-the-pale-blue-of-texts-on-white-pale-blue-and-beige-backgrounds-too-pale/671#671\">on this thread</a>.</p>\n\n<p>I'm a new user, and have been surprised not to find any explanation (in the FAQ, for example) of the significance of the blue background which some questions display with. The comment referred to suggests that popularity is a possible consideration, but I would appreciate a definitive explanation.</p>\n","OwnerUserId":"9340","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2011-08-10T09:13:49.813","Title":"What is the significance of the blue background on some questions?","Tags":"<support><design>","AnswerCount":"1","CommentCount":"1","FavoriteCount":"1"},{"Id":"685","PostTypeId":"2","ParentId":"684","CreationDate":"2011-08-10T09:13:49.813","Score":"5","Body":"<p>The blue background is placed in those questions that are tagged with tags you have selected as favorites. One of my tag favorites is <code>xcode</code> and any question that was tagged with <code>xcode</code> appears with the blue background. It is a way to help you find those questions that are more relevant to your specific interests.</p>\n","OwnerUserId":"212","LastActivityDate":"2011-08-10T09:13:49.813","CommentCount":"3"},{"Id":"686","PostTypeId":"2","ParentId":"638","CreationDate":"2011-08-10T16:19:01.013","Score":"0","Body":"<p>I always prefer better (ie <strong>more</strong>) contrast.</p>\n\n<p>See also Contrast Rebellion:\n<a href=\"http://contrastrebellion.com/\" rel=\"nofollow\">http://contrastrebellion.com/</a></p>\n","OwnerUserId":"9611","LastActivityDate":"2011-08-10T16:19:01.013","CommentCount":"0"},{"Id":"688","PostTypeId":"2","ParentId":"681","CreationDate":"2011-08-10T17:13:50.147","Score":"8","Body":"<p>I took your ad and cranked up the awesome:</p>\n\n<p><img src=\"https://i.stack.imgur.com/0rRIf.gif\" alt=\"enter image description here\"></p>\n","OwnerUserId":"13","LastActivityDate":"2011-08-10T17:13:50.147","CommentCount":"9"},{"Id":"690","PostTypeId":"2","ParentId":"683","CreationDate":"2011-08-10T20:14:06.190","Score":"13","Body":"<p>I would love some implementations of this but only if it was clutter free.</p>\n\n<p>To avoid overload, perhaps only the symbols that appear as menu items of major apps would be available?</p>\n\n<p>The menu bar uses these icons respectively - so it's clear users might need these</p>\n\n<ul>\n<li>Finder: ⌃ ⌥ ⇧ ⌘ ⎋ ↑</li>\n<li>Safari: adds two more ↓ and  ⇥</li>\n</ul>\n\n<p>I'd leave all the rest out - although a strong case can be made for eject and power symbols since every mac has one or the other in the top right. </p>\n\n<p>The list of icons you made is too large for my taste - but I'd rather have too much than nothing at all. Lion does make the special characters feature very easy - but not all our users are on that OS. I can't speak for Linux or Windows users as I don't know how easy the tools for clipping are. I do know that the iPad isn't as easy as you have to either enable the emoji board or bookmark a web app like <a href=\"http://mrgan.com/gb/\" rel=\"nofollow noreferrer\">GlyphBoard</a> and multitask /copy / multitask/ paste your way into these characters.</p>\n\n<p>The Markdown Editing Help menu seems an ideal implementation of this. <img src=\"https://i.stack.imgur.com/zAoy8.png\" alt=\"enter image description here\"></p>\n\n<p>It could ride the coattails of that UI to begin with. It should be fairly trivial to add in a table to the right of HTML - to the left of \"advanced help\" and drop in a small table that educates users of the current icons in use here.</p>\n\n<p>You could place a few characters in the normal drop down - and have a fuller set when you are in the help mode - just like you get basic lists from the toolbar icon, but get advanced nesting help when you look at it with the markdown overlay. </p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2011-08-12T16:40:12.233","LastActivityDate":"2011-08-12T16:40:12.233","CommentCount":"0"},{"Id":"691","PostTypeId":"1","CreationDate":"2011-08-11T11:32:24.823","Score":"2","ViewCount":"41","Body":"<p>In tagging <a href=\"https://apple.stackexchange.com/questions/21447/what-is-the-difference-between-the-variant-language-dictionaries-in-os-x\">this question</a>, I was surprised that the language tag was described as being for programming language rather than human language. However, of all the questions using the language tag, <a href=\"https://apple.stackexchange.com/questions/14663/two-macbook-pros-display-my-webpage-differently\">only one</a> is related to programming language. The rest all are related to human language.</p>\n\n<p>Any objections to changing the meaning of the language tag to be human language?</p>\n","OwnerUserId":"144","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2011-08-11T22:11:59.137","Title":"Change the language tag to mean human language?","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"1"},{"Id":"693","PostTypeId":"2","ParentId":"691","CreationDate":"2011-08-11T22:11:59.137","Score":"1","Body":"<p>Yes, as you have done, I would simply remove the one oddball usage and standardize on what it seems to be used for in practice.</p>\n","OwnerUserId":"101","LastActivityDate":"2011-08-11T22:11:59.137","CommentCount":"3"},{"Id":"694","PostTypeId":"2","ParentId":"642","CreationDate":"2011-08-12T11:04:24.610","Score":"1","Body":"<p>This is indeed very generous. I sadly am not going to quite get to 1000 (only been a member for three weeks!) but it is great that you are rewarding people's involvement on the site this way.</p>\n","OwnerUserId":"8394","LastActivityDate":"2011-08-12T11:04:24.610","CommentCount":"1"},{"Id":"697","PostTypeId":"1","AcceptedAnswerId":"698","CreationDate":"2011-08-12T21:08:37.380","Score":"22","ViewCount":"655","Body":"<p>ok, the title is a little bit aggressive.</p>\n\n<p>I'm relatively new here, but the examples of 'community wiki' that I've seen so far seem to be actively detrimental to the web site.  For example, the 'What Lion bugs irritate you the most?' thread takes lots of good questions and answers that could (should?) be individually placed on the main page and effectively hides them in a single thread.  Sure, it's possible that everyone who posts in that thread <em>also</em> posts their question separately, but I don't think that really happens.</p>\n\n<p>I'm here because this site <em>isn't</em> your typical forum with it's endless rants and raves but rather concentrates on the meat of questions and answers.  I'm saddened to see anything that takes away from that wonderful design.</p>\n","OwnerUserId":"9252","LastActivityDate":"2011-11-02T01:52:24.563","Title":"How to kill off 'community wiki' entries","Tags":"<discussion>","AnswerCount":"4","CommentCount":"2","FavoriteCount":"3"},{"Id":"698","PostTypeId":"2","ParentId":"697","CreationDate":"2011-08-12T23:57:44.633","Score":"20","Body":"<blockquote>\n  <p>I'm relatively new here</p>\n</blockquote>\n\n<p>Maybe so, but you figured it out a lot faster than most. These \"let's throw everything into one big pot and see what floats to the top!\" questions <em>do</em> actively subvert the very goals these sites were built to achieve!</p>\n\n<p>So what can you do? In order:</p>\n\n<ol>\n<li>Leave a comment noting that these would be easier to find as separate Q&amp;A</li>\n<li>Down-vote</li>\n<li>Flag for moderator attention </li>\n<li>(once you have the necessary reputation) Vote to close.</li>\n<li>(once the question is closed and you have a bit more rep) Vote to delete.</li>\n</ol>\n\n<p>FWIW, the primary purpose of Community Wiki is to encourage collaborative editing by removing the \"first author gets all the points\" aspect (and allowing lower-rep users to contribute). There's absolutely nothing wrong with that... However, if you see a question with many answers where all are CW, that's a <em>warning:</em> either a moderator, or the system itself is telling us that this Q&amp;A could use a lot less <em>answering</em> and a lot more <em>editing!</em></p>\n","OwnerUserId":"4604","LastEditorUserId":"4604","LastEditDate":"2011-08-13T00:07:06.180","LastActivityDate":"2011-08-13T00:07:06.180","CommentCount":"2"},{"Id":"699","PostTypeId":"2","ParentId":"697","CreationDate":"2011-08-13T01:55:31.323","Score":"5","Body":"<p>Back when Stack Overflow was first started, the Community Wiki feature that was initially created to add a wiki-like aspect to some questions was co-opted for use with poll-like questions, and questions where it didn't make sense for the author to receive reputation from them.</p>\n\n<p>I've always liked these questions and felt them to be an important part of building and maintaining a healthy community here, but I do agree that, if left unchecked, the site would quickly fill up with people abusing them. However, I think that we've maintained a pretty good balance here on Ask Different - we don't allow too many to be created, and the ones that are usually are informative and maintained. There are some that do fall through the cracks, sure, but I think that by and large they're more beneficial than detrimental.</p>\n\n<p>One example of a benefit is with the recent <a href=\"https://apple.stackexchange.com/questions/17759/what-tiny-thing-in-lion-makes-you-smile-or-has-caught-you-off-guard\">What tiny thing in Lion makes you smile or caught you off guard?</a> question, it was linked to on Reddit, Hacker News, and Twitter, and several other sites and brought a considerable amount of traffic to our site. This is very hard to do with a 'typical' question because they're usually of limited scope and of interest to a relatively small group of people. In order to get the network effect with a question, it needs to be one with a much broader appeal, and these tend to skew towards those that are of the Community Wiki style.</p>\n\n<p>Finally, I think that the popularity of these questions may make it appear that there are more of them than there are, so here are some numbers:</p>\n\n<ul>\n<li>Total number of questions: <a href=\"https://apple.stackexchange.com/questions\">6,778</a></li>\n<li>Number of Community Wiki questions: <a href=\"https://apple.stackexchange.com/search?q=is%3Aquestion+wiki%3A1\">73</a> (1%)</li>\n<li>Number of Community Wiki questions with at least 1K views: <a href=\"https://apple.stackexchange.com/search?q=is%3Aquestion+wiki%3A1+views%3A1000&amp;submit=search\">12</a> (0.2%)</li>\n<li>Number of Community Wiki questions with at least 10 votes: <a href=\"https://apple.stackexchange.com/search?q=is%3Aquestion+wiki%3A1+votes%3A10&amp;submit=search\">17</a> (0.25%)</li>\n<li>Number of Community Wiki questions with at least 10 answers: 23 (0.3%)</li>\n</ul>\n\n<p>So yes, I will concede that the questions, in general, don't really fit in with the rest of the site. But for the ones we do have we try to keep the quality high and the quantity low, and I think that eliminating them altogether would be a mistake.</p>\n","OwnerUserId":"13","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2011-08-13T02:25:05.720","CommentCount":"2"},{"Id":"700","PostTypeId":"1","AcceptedAnswerId":"701","CreationDate":"2011-08-13T05:23:20.970","Score":"1","ViewCount":"47","Body":"<p>I flagged <a href=\"https://apple.stackexchange.com/questions/21576/highlighting-color-nstableview-cocoa\">this question</a> as being off-topic, and later I noticed that the same question had been <a href=\"https://stackoverflow.com/questions/7038060/highlighting-color-nstableview-cocoa\">cross-posted to Stack Overflow</a>. I then added a comment to the Ask Different question stating it was a cross-post:</p>\n\n<p><img src=\"https://i.stack.imgur.com/DD91b.png\" alt=\"enter image description here\"></p>\n\n<p>Even with this comment, the question ended up being migrated to Stack Overflow, resulting in a duplicate there:</p>\n\n<ul>\n<li>Original cross-post on Stack Overflow: <a href=\"https://stackoverflow.com/questions/7038060/highlighting-color-nstableview-cocoa\">https://stackoverflow.com/questions/7038060/highlighting-color-nstableview-cocoa</a></li>\n<li>Migrated question from Ask Different, resulting in a duplicate question on Stack Overflow: <a href=\"https://stackoverflow.com/questions/7038709/change-highlighting-color-in-nstableview-in-cocoa\">https://stackoverflow.com/questions/7038709/change-highlighting-color-in-nstableview-in-cocoa</a></li>\n</ul>\n\n<p>Is there some other workflow that’d make it more obvious to Ask Different moderators that a question is a cross-post and shouldn’t be migrated at all?</p>\n","OwnerUserId":"5077","LastEditorUserId":"-1","LastEditDate":"2017-05-23T11:33:34.410","LastActivityDate":"2011-08-13T05:27:43.877","Title":"Don’t migrate cross-posts","Tags":"<discussion><migration>","AnswerCount":"1","CommentCount":"0"},{"Id":"701","PostTypeId":"2","ParentId":"700","CreationDate":"2011-08-13T05:27:43.877","Score":"3","Body":"<p>In this case, it was a matter of crossed signals. I loaded the page before you posted your comment, you posted the comment, and then I migrated it (8 seconds later) without knowing about the duplicate. And unfortunately, there's no way to un-migrate from this end - it has to be dealt with on Stack Overflow.</p>\n\n<p>If I see that there's a cross-post on another site I won't migrate. The issue here was that I didn't see it and it clearly was a programming question, so I just moved it over.</p>\n","OwnerUserId":"13","LastActivityDate":"2011-08-13T05:27:43.877","CommentCount":"4"},{"Id":"702","PostTypeId":"2","ParentId":"390","CreationDate":"2011-08-13T13:54:31.697","Score":"20","Body":"<p>I'm a big proponent of this being added - especially after trying to use the site exclusively for a few days on the iPad.</p>\n\n<p>Arguments against:</p>\n\n<ul>\n<li>Another icon in the edit bar adds clutter or bumps something still widely used.</li>\n<li>Those that don't like seeing <kbd>⌘</kbd> might oppose tools that encourage use of the <code>&lt;kbd&gt;</code> tag.</li>\n<li>The formatting of these disrupt paragraphs just like an image embed can.</li>\n</ul>\n\n<p>Arguments for:</p>\n\n<ul>\n<li>The iPad keyboard is way less efficient to get to &lt; and / than a physical keyboard.\n\n<ul>\n<li>Keying <kbd>S</kbd> takes <strong>12 presses</strong> on a real keyboard (i suppose 5 of those are shift \"letters\" but it is one action to make the letter not two taps like on the iPad)</li>\n<li>Keying <kbd>S</kbd> takes <strong>25 presses</strong> on an iOS keyboard (try it yourself right now... <em>I bet you'll mess up the / and have to use a few more taps than the most efficient way about half the time you try this</em>)</li>\n</ul></li>\n<li>It makes discovery of and use of that tag easier for new users.</li>\n<li>It makes the site look professional and matches <a href=\"http://developer.apple.com/library/mac/documentation/userexperience/conceptual/APStyleGuide/APSG_2009.pdf\" rel=\"nofollow noreferrer\">Apple's style of documenting key presses</a>. (See the following pages of the 2009 version of the style document: 41, 100-101 especially read pages 100 through 101 for the difference between order, using - vs +, and more) </li>\n<li>It makes it easier non-native level english readers to understand in a flash that the answer calls for a specific key to be pressed.</li>\n<li>AutoCorrect on iOS and now Mac OS X futzes with these non-dictionary tags making automation more important to avoid incorrect tags.</li>\n</ul>\n\n<hr>\n\n<p>Here's where my opinion really gets aired - I realize and like that it's not a universally shared opinion :-)</p>\n\n<p>I would like to be lazy and have the toolbar help me add key caps markup syntax easier to type.</p>\n\n<p>&lt; kbd > and &lt; /kbd > could be added just like block quote and code sample. </p>\n\n<p>Are there any stats on how often these tags get used on Ask Different? What percentage/count of users has ever used X tag might be interesting to compare. Also - what percentage/count of questions have used said tags.</p>\n\n<p>Perhaps no-one is using &lt; kbd > except for me?</p>\n\n<p>I think the style guide is a bit harsh on how bad these are in practice - so I'll add an answer there in defense of how easily people new to mac can see <kbd>option</kbd> + <kbd>command</kbd> +<kbd>P</kbd> +<kbd>R</kbd> intuitively means you hold them all down together.</p>\n\n<p>Specifically, the confusion over naming of keys is due to Apple changing their symbols over time, people remembering the old way, and the fact that keyboards are different around the world as well as on Windows / Mac. </p>\n\n<p>The other confusion is the difference between the silkscreened mask on the keyboard doesn't match the menu shortcuts. For example, all macs now use <kbd>▲</kbd> and <kbd>▼</kbd> printed on the keyboard, but if you look in the Bookmarks menu of safari, you will see the characters drawn as ↑ and ↓</p>\n\n<p><img src=\"https://i.stack.imgur.com/AolZ9.png\" alt=\"enter image description here\"></p>\n\n<p>Blaming the key cap <code>&lt;kbd&gt;</code> format for these problems is a red herring - the confusion exists whether you spell out command or use ⌘, whether it's an up arrow or an up triangle. We as a community have to deal with that confusion either way. Why not automate the formatting so people can pay attention to the message - making answers here match what mac users have had in their language for describing key presses for years.</p>\n\n<p>I am of a strong opinion that when used properly, these tags make the site look professional and better match the documentation that Apple provides. I would want to encourage people to know it's possible and make it easier to select a word like option and automate wrapping it.</p>\n\n<p>Geting to the &lt; > and / are tedious alone on iOS and autocorrect needs to be beat into submission which makes it even harder to get that edit done while mobile.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2012-04-27T16:38:54.653","LastActivityDate":"2012-04-27T16:38:54.653","CommentCount":"5"},{"Id":"703","PostTypeId":"1","AcceptedAnswerId":"707","CreationDate":"2011-08-13T19:26:51.567","Score":"3","ViewCount":"49","Body":"<p>Is is possible to connect the SE chat to iChat? I am not always on SE, but I am on iChat a fair amount.</p>\n","OwnerUserId":"7833","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Connect iChat to SE Chat","Tags":"<support>","AnswerCount":"1","CommentCount":"1"},{"Id":"704","PostTypeId":"1","CreationDate":"2011-08-14T02:03:58.943","Score":"3","ViewCount":"81","Body":"<p>Suggesting tag synonyms requires 2500 reputation which seems REALLY steep for something so basic. It's strange because there is a badge for 3 such suggestions yet it's only considered a <em>bronze</em> badge.</p>\n","OwnerUserId":"8320","LastActivityDate":"2011-08-14T02:25:20.500","Title":"2500 reputation is a high requirement for just suggest tag synonyms","Tags":"<discussion><reputation><tags>","AnswerCount":"1","CommentCount":"1"},{"Id":"705","PostTypeId":"2","ParentId":"704","CreationDate":"2011-08-14T02:25:20.500","Score":"4","Body":"<p>2500 may seem high now, but 2 or 3 years from now, I assure you -- it won't.</p>\n\n<p>The limit is there to ensure that truly <em>experienced</em> users are coordinating on the tags, which are the primary organizational system on the site.</p>\n\n<p>It's OK if only a few users and the moderators are making these decisions now; as the site grows, more people will gain the privilege and can contribute to the process.</p>\n","OwnerUserId":"101","LastActivityDate":"2011-08-14T02:25:20.500","CommentCount":"2"},{"Id":"707","PostTypeId":"2","ParentId":"703","CreationDate":"2011-08-14T07:01:29.710","Score":"2","Body":"<p>SO Chat is custom-built, so it doesn't work with any other services.</p>\n\n<p>However, given that the SO crowd consists of programmers, several projects have been proposed/begun to allow more functionality: </p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/82840/so-chat-plugin-for-pidgin\">SO (chat) Plugin for Pidgin</a></li>\n<li><a href=\"https://meta.stackexchange.com/questions/57316/offer-an-xmpp-method-for-chat\">Offer an XMPP method for chat</a></li>\n<li><a href=\"https://meta.stackexchange.com/questions/59760/irc-access-for-the-chat/\">IRC access for the chat?</a></li>\n</ul>\n\n<p>Unfortunately, none seem to have had much action lately, so I don't know the current status of any of them—but something along these lines will be your best bet.</p>\n","OwnerUserId":"351","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2011-08-14T07:01:29.710","CommentCount":"1"},{"Id":"709","PostTypeId":"1","CreationDate":"2011-08-14T23:16:28.787","Score":"4","ViewCount":"149","Body":"<p>I just beefed up the <a href=\"https://apple.stackexchange.com/questions/tagged/email\" class=\"post-tag\" title=\"show questions tagged &#39;email&#39;\" rel=\"tag\">email</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/mail.app\" class=\"post-tag\" title=\"show questions tagged &#39;mail.app&#39;\" rel=\"tag\">mail.app</a> descriptions as well as edited the few questions that had been tagged with mail.</p>\n\n<p>I've proposed mail be a synonym of email.</p>\n\n<p>If you are curious - only 2 of the mail questions related to iOS - they already had some flavor of iOS and the email tag. About 5 questions tagged only mail were for mail.app, but more than 75% of the mail tags were redundant and already tagged email and the mail.app tag was not needed for those questions.</p>\n\n<p>Comments, suggestions?</p>\n\n<p>Time to vote on <a href=\"https://apple.stackexchange.com/tags/synonyms\">https://apple.stackexchange.com/tags/synonyms</a> if you like or dislike this synonym. </p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2011-08-15T10:29:10.973","Title":"Killing the mail tag - Is it time?","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"710","PostTypeId":"2","ParentId":"681","CreationDate":"2011-08-15T00:10:51.880","Score":"10","Body":"<p>I'm not a graphic designer; I'm one of those people who knows Photoshop but probably shouldn't be allowed to use it. Anyway, here goes:</p>\n\n<p><img src=\"https://i.stack.imgur.com/sfG5e.png\" alt=\"desc\"></p>\n\n<p>I'm open to any kind of ideas/suggestions you may have; just add a comment!</p>\n\n<p><strong>Edit:</strong> I've updated the wording as requested, and the Ask Different logo should look a bit cleaner. You can see the old version <a href=\"https://i.stack.imgur.com/RE0Ea.png\" rel=\"nofollow noreferrer\">here</a>.</p>\n","OwnerUserId":"2220","LastEditorUserId":"2220","LastEditDate":"2011-08-15T17:16:02.860","LastActivityDate":"2011-08-15T17:16:02.860","CommentCount":"4"},{"Id":"711","PostTypeId":"2","ParentId":"709","CreationDate":"2011-08-15T00:51:14.400","Score":"2","Body":"<p>Hm, my initial reaction was to rename email to mail, as the latter seems to be the word Apple prefers to use. However, as \"mail\" can also be used to mean \"Mail.app\" or \"iOS Mail\" I agree that it makes sense to force people to disambiguate, otherwise the tag itself is worthless. Whether that can be accomplished by making the tag wiki clear that \"mail\" is about \"email\" or whether we should set up the synonym mail -> email or even if we should just ban \"mail\" altogether, I don't know.</p>\n","OwnerUserId":"13","LastActivityDate":"2011-08-15T00:51:14.400","CommentCount":"4"},{"Id":"713","PostTypeId":"2","ParentId":"681","CreationDate":"2011-08-15T14:24:15.697","Score":"2","Body":"<p>In thinking of making an advert, I find I'm not at all clear how this will work within the guidelines to avoid self promotion on SE. We have a great site here with low promotion and I don't think any of the devs will in any way be crossing this line - but thinking this out will ensure clarity in ensuring unwelcome sorts of promotion are still clear to all. </p>\n\n<p>Has this been spelled out yet (or are there any guidelines if this is being done as an experiment knowing it goes into the gray area and how much latitude will be allowed to test this idea out)?</p>\n\n<p>Where will the interaction between Apple.SE users and StackOverflow users happen? </p>\n\n<p>There will be numerous questions from the Apple.SE users on:</p>\n\n<ul>\n<li>configuration profiles</li>\n<li>side loading apps in iTunes / Xcode / Server Profile Manager / iPhone Utility</li>\n<li>console error messages</li>\n<li>beta builds (developers tend to want to get testers for the new products)</li>\n</ul>\n\n<p>Will they use a tag and participate on SO ? \nWill they participate here (or a new Area 51 site)?</p>\n\n<p>Will they be asked to take their discussions elsewhere - just letting this be an introduction service. </p>\n\n<p>It's hard to know what copy I would craft - not knowing more about how things are going to work.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2011-08-29T17:35:33.847","LastActivityDate":"2011-08-29T17:35:33.847","CommentCount":"3"},{"Id":"714","PostTypeId":"2","ParentId":"681","CreationDate":"2011-08-15T15:05:53.950","Score":"3","Body":"<p>How about something like a code stub used for unit testing.</p>\n\n<p><img src=\"https://i.stack.imgur.com/bYgct.jpg\" alt=\"enter image description here\"></p>\n\n<p>This might appeal to the people that write code.</p>\n\n<p>I didn't fix the obvious bad gradient choice that makes the text aliasing look awful (I just took a cheap screen shot in Xcode rather than coloring the text properly in keynote).</p>\n\n<p>I would probably put the Ask Different logo on the left before the ...we text.</p>\n","OwnerUserId":"5472","LastActivityDate":"2011-08-15T15:05:53.950","CommentCount":"0"},{"Id":"715","PostTypeId":"1","CreationDate":"2011-08-15T22:52:54.590","Score":"1","ViewCount":"43","Body":"<p>In Google Chrome (stable) I noticed the following bug in <a href=\"https://apple.stackexchange.com/users/9918/proales\">a user profile</a> with a negative answer score:</p>\n\n<p><img src=\"https://i.stack.imgur.com/mUW40.png\" alt=\"screenshot\"></p>\n\n<p>The bug does not occur in Firefox.</p>\n","OwnerUserId":"1674","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-11-02T07:40:01.010","Title":"Layout bug in user profile for answers with a negative score (Chrome)","Tags":"<bug><status-norepro><design>","AnswerCount":"1","CommentCount":"0"},{"Id":"716","PostTypeId":"2","ParentId":"683","CreationDate":"2011-08-16T05:44:20.397","Score":"6","Body":"<p>I've put them into characters' favorites table. They are accessible to me in any app via <br><kbd>⌘</kbd>+<kbd>⌥</kbd>+<kbd>T</kbd>.</p>\n\n<p>And yes, I did copy those symbols to the <strong>clipboard</strong> by double-clicking on them.</p>\n\n<p><img src=\"https://i.stack.imgur.com/oUaba.jpg\" alt=\"enter image description here\"></p>\n","OwnerUserId":"14","LastEditorUserId":"13414","LastEditDate":"2012-07-26T19:53:37.030","LastActivityDate":"2012-07-26T19:53:37.030","CommentCount":"2"},{"Id":"717","PostTypeId":"2","ParentId":"589","CreationDate":"2011-08-16T12:40:28.567","Score":"1","Body":"<p>I think its  by design that a question cannot be shared in two sites and be answered, but if that can be done, it would ease the problems when there arises a question that is cross-domain which requires expertise from 2 or more different fields of experts, or could be redirected to stackoverflow.com or any other common site.</p>\n","OwnerUserId":"1976","LastActivityDate":"2011-08-16T12:40:28.567","CommentCount":"0"},{"Id":"718","PostTypeId":"1","AcceptedAnswerId":"720","CreationDate":"2011-08-16T16:34:43.843","Score":"3","ViewCount":"83","Body":"<p>When offering a Bounty, the points are immediately removed from your reputation score.  It's like they are put in escrow in some purgatory until they are either awarded or the time is up.  Would it not be better for them to remain shown against a users total, and removed only when they have been awarded?  I can't imagine why it's done this way, particularly as for new users it could result in loss of privilege if offering your first bounty dips you back under the threshold?</p>\n","OwnerUserId":"9495","LastEditorUserId":"212","LastEditDate":"2011-08-16T16:41:44.900","LastActivityDate":"2011-08-16T16:48:11.520","Title":"Reputation Points & Bounty Payments","Tags":"<discussion><bounty>","AnswerCount":"2","CommentCount":"3"},{"Id":"719","PostTypeId":"2","ParentId":"718","CreationDate":"2011-08-16T16:46:22.643","Score":"2","Body":"<p>I'm willing to bet that behavior is by design. As you point out, you lose points through a bounty one way or another. An immediate withdrawal from their account once the bounty is posted should cause people to think twice about their question so that they don't spend their points on anything frivolous.</p>\n\n<p>In this context, reputation is truly a form of currency and therefore should be treated with the same respect.</p>\n","OwnerUserId":"212","LastActivityDate":"2011-08-16T16:46:22.643","CommentCount":"0"},{"Id":"720","PostTypeId":"2","ParentId":"718","CreationDate":"2011-08-16T16:48:11.520","Score":"6","Body":"<p>I believe that there is a reason behind the current behavior. The reason, put simply, is to discourage abuse of the system.</p>\n\n<p>Imagine this scenario:  </p>\n\n<ul>\n<li>Someone offers a bounty on a question. They lose no rep yet.</li>\n<li>The bounty encourages people to answer.</li>\n<li>Someone correctly answers the question.</li>\n<li>The asker, wanting to save some rep, decides to pretend that the answer didn't work and not award the bounty.</li>\n</ul>\n\n<p>So, this could allow the asker to get an answer because of the bounty, but not 'pay' the promised amount.</p>\n\n<p>Now, with the current system, the asker loses their rep right away and it's put to the side until it is awarded. There's no way that the asker can regain or avoid losing their rep.<br>\nNow, when someone correctly answers the question, the asker has no reason not to award the bounty.</p>\n\n<p>Note that there is already a system in place to help stop abuse of the bounty system: If the bounty is not awarded, the highest-voted new answer with 2 or more upvotes is automatically awarded half the bounty.<br>\nHowever, I don't think that this system would be sufficient on its own.</p>\n","OwnerUserId":"2220","LastActivityDate":"2011-08-16T16:48:11.520","CommentCount":"7"},{"Id":"722","PostTypeId":"1","AcceptedAnswerId":"1102","CreationDate":"2011-08-17T07:43:09.683","Score":"9","ViewCount":"94","Body":"<p>I suspect some CSS rule is being incorrectly applied to the \"new\" feature notifier.</p>\n\n<p>I'm talking about the \"new\" block that appears when a new navigation or other site element is added. It showed up most recently on the main site when the blog link was added.</p>\n\n<p><img src=\"https://i.stack.imgur.com/NSkNu.png\" alt=\"It&#39;s NEW!\"></p>\n\n<p>The e is nearly solid, and the rest of the text just looks... off. Any ideas why?</p>\n\n<p>Additionally, as provided by @stuffe, As well as being blocky, it's not aligned to the text baseline.</p>\n\n<p><img src=\"https://i.stack.imgur.com/ITuJx.jpg\" alt=\"Text baseline example\"></p>\n","OwnerUserId":"1346","LastEditorUserId":"5472","LastEditDate":"2013-09-26T17:03:45.030","LastActivityDate":"2013-09-26T17:03:45.030","Title":"Why is the \"new\" label so hard to read?","Tags":"<bug><status-completed><design>","AnswerCount":"1","CommentCount":"8","FavoriteCount":"1"},{"Id":"723","PostTypeId":"1","AcceptedAnswerId":"2229","CreationDate":"2011-08-17T15:42:51.943","Score":"3","ViewCount":"86","Body":"<p>When I switch between Main and Meta within the same browser, the layout changes slightly, most noticable when viewing my reputation scores, where the icons move over further to the right on the main screen, and the drop down arrows are truncated as it their DIV was not large enough to accomodate the icon, ir is misaligned vertically.  I have tried to show this in the following screen grab edit - the top one is Meta, the bottom one is Main.</p>\n\n<p><img src=\"https://i.stack.imgur.com/Oehc4.jpg\" alt=\"enter image description here\"></p>\n","OwnerUserId":"9495","LastEditorUserId":"17358","LastEditDate":"2014-10-06T21:47:18.573","LastActivityDate":"2014-10-06T21:49:23.350","Title":"Is the CSS different between Main and Meta?","Tags":"<bug><status-completed><design>","AnswerCount":"1","CommentCount":"2"},{"Id":"725","PostTypeId":"1","CreationDate":"2011-08-17T21:33:07.303","Score":"25","ViewCount":"252","Body":"<p><img src=\"https://i.stack.imgur.com/SSRdv.jpg\" alt=\"enter image description here\"></p>\n\n<h2>On August 17, 2010, exactly one year ago today, Ask Different (then called Apple) launched into private beta.</h2>\n\n<p><strong>In the past year we’ve seen phenomenal growth. We now have:</strong></p>\n\n<ul>\n<li>7k questions</li>\n<li>13.5k answers</li>\n<li>9k users</li>\n<li>13.5k visits per day (average)</li>\n</ul>\n\n<p>I just wanted to say a big “thanks” to everyone that has helped us get here today, from the people that believed in the potential of this site when it was only an <a href=\"http://area51.stackexchange.com/proposals/151/apple\">Area 51 proposal</a>, to those early adopters that helped make our private and public betas successful, culminating in our launch as a full, permanent part of Stack Exchange earlier this year, to <a href=\"https://apple.stackexchange.com/users/6/jin\">Jin</a>, our site designer who perfectly captured the balance between Apple’s and Stack Exchange’s design aesthetic, and finally to our loyal users, who have been tirelessly helping to answer nearly any question thrown their way.</p>\n\n<h3>Here’s to many years to come!</h3>\n\n<p>p.s. - you early adopters should start to see your <a href=\"https://apple.stackexchange.com/badges/52/yearling\">yearling</a> badges soon!</p>\n","OwnerUserId":"13","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2011-08-18T12:13:19.530","Title":"Ask Different turns one year old","Tags":"<discussion>","AnswerCount":"1","CommentCount":"12","FavoriteCount":"6"},{"Id":"727","PostTypeId":"2","ParentId":"725","CreationDate":"2011-08-18T12:13:19.530","Score":"8","Body":"<p>Kyle--</p>\n\n<p>I just want to say congratulations on founding what has turned out to be an absolutely wonderful site, one that I feel follows Stack Exchange's ideals. I know we are all proud to help carry this site from beta to live, but you should be more so for having having the foresight and gumption to get everything started. Thank you for your lasting (and hopefully permanent) contribution to the Apple community as a whole.</p>\n\n<p>I look forward to working with you, the mods, and the community on the continued growth of the site.</p>\n\n<p>We rule.</p>\n\n<p>Philip Regan ♦</p>\n","OwnerUserId":"212","LastActivityDate":"2011-08-18T12:13:19.530","CommentCount":"2","CommunityOwnedDate":"2011-08-18T12:13:19.530"},{"Id":"728","PostTypeId":"2","ParentId":"88","CreationDate":"2011-08-19T07:58:40.617","Score":"0","Body":"<h1>For those who are relatively new to the sites</h1>\n\n<p>The link to Ask Different Chat is in the right hand column of Ask Different:</p>\n\n<ul>\n<li>sometimes visible without scrolling down</li>\n<li>sometimes out of sight (beneath advertisements).</li>\n</ul>\n\n<p>The link to Ask Different Chat is sometimes <a href=\"https://apple.meta.stackexchange.com/q/729/8546\"><strong>missing</strong> from the right hand column of Ask Different meta</a>. </p>\n\n<p>To switch from Ask Different meta to Ask Different: </p>\n\n<ul>\n<li>click <code>main</code></li>\n</ul>\n\n<p>Alongside <code>main</code> for Ask Different, the <code>chat</code> is <strong>not</strong> Ask Different Chat. </p>\n","OwnerUserId":"8546","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2011-08-19T08:34:55.657","CommentCount":"0"},{"Id":"729","PostTypeId":"1","AcceptedAnswerId":"732","CreationDate":"2011-08-19T08:33:14.630","Score":"1","ViewCount":"60","Body":"<p>In <a href=\"https://apple.meta.stackexchange.com/questions/88/apple-chat-room/728#728\">an answer</a> to <strong>Apple Chat Room</strong>: </p>\n\n<blockquote>\n  <p>The link to Ask Different Chat is sometimes <strong>missing</strong> from the right hand column of Ask Different meta.</p>\n</blockquote>\n\n<p><img src=\"https://i.stack.imgur.com/Kl5mf.jpg\" alt=\"enter image description here\"></p>\n\n<p>In the meta page to the left of that screenshot: </p>\n\n<ul>\n<li>no link. </li>\n</ul>\n\n<p>Reloading the pages does not resolve the inconsistency. I'll upload a movie to the following folder: </p>\n\n<ul>\n<li><a href=\"http://www.wuala.com/%23%23Apple-support/members/grahamperrin/2011/08/19/a/\" rel=\"nofollow noreferrer\">http://www.wuala.com/%23%23Apple-support/members/grahamperrin/2011/08/19/a/</a></li>\n</ul>\n\n<p>Please, is the randomness by design? Or is there some other explanation?</p>\n\n<p>Whatever the reason: the inconsistency around a key feature is disorienting, smells a little buggy.</p>\n","OwnerUserId":"8546","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.967","LastActivityDate":"2011-08-19T15:41:06.407","Title":"Why is the link to Ask Different Chat sometimes missing from Ask Different meta?","Tags":"<bug><status-bydesign><design>","AnswerCount":"1","CommentCount":"0"},{"Id":"730","PostTypeId":"1","CreationDate":"2011-08-19T08:41:45.943","Score":"2","ViewCount":"54","Body":"<p><img src=\"https://i.stack.imgur.com/GZx2l.png\" alt=\"screenshot drawing attention to the problem\"></p>\n\n<p>The black number partly within, partly without a dark red circle is illegible to me. </p>\n","OwnerUserId":"8546","LastEditorUserId":"962","LastEditDate":"2012-01-31T10:47:38.467","LastActivityDate":"2012-03-01T11:43:43.133","Title":"the number of inform moderator flags remaining can not be read","Tags":"<bug><status-completed><design>","AnswerCount":"1","CommentCount":"2"},{"Id":"732","PostTypeId":"2","ParentId":"729","CreationDate":"2011-08-19T15:40:59.997","Score":"2","Body":"<p>The sidebar ad will not appear on questions until questions have more than 1 answer.</p>\n\n<p>This is to</p>\n\n<ul>\n<li><p>focus on the question</p></li>\n<li><p>prevent the sidebar from becoming absurdly tall, much taller than the central area of the page itself</p></li>\n</ul>\n","OwnerUserId":"101","LastActivityDate":"2011-08-19T15:40:59.997","CommentCount":"2"},{"Id":"733","PostTypeId":"2","ParentId":"624","CreationDate":"2011-08-19T17:17:27.433","Score":"2","Body":"<p><a href=\"http://decknetwork.net/\" rel=\"nofollow\">http://decknetwork.net/</a> might be more expensive than finding individual blogs for ad placement - perhaps you can have one buy there in wide rotation and select a few of the individual sites for a weekly spot.</p>\n\n<p>It's top notch / fairly exclusive in my opinion.</p>\n","OwnerUserId":"5472","LastActivityDate":"2011-08-19T17:17:27.433","CommentCount":"0"},{"Id":"734","PostTypeId":"2","ParentId":"624","CreationDate":"2011-08-19T17:20:46.523","Score":"1","Body":"<p>Ric Ford on <a href=\"http://macintouch.com\" rel=\"nofollow\">http://macintouch.com</a> has been covering Apple since the mid 90's and I'd put him up with <a href=\"http://tidbits.com\" rel=\"nofollow\">TidBITS</a> which started in the late 80's for having a large proportion of people that have been around apple for quite some time.</p>\n\n<p><a href=\"http://www.macintouch.com/advertising.html\" rel=\"nofollow\">http://www.macintouch.com/advertising.html</a></p>\n","OwnerUserId":"5472","LastActivityDate":"2011-08-19T17:20:46.523","CommentCount":"0"},{"Id":"735","PostTypeId":"2","ParentId":"697","CreationDate":"2011-08-20T04:50:19.927","Score":"9","Body":"<p>We have provided some additional guidance at the blog:</p>\n\n<p><a href=\"http://blog.stackoverflow.com/2011/08/the-future-of-community-wiki/\">http://blog.stackoverflow.com/2011/08/the-future-of-community-wiki/</a></p>\n\n<p>TL;DR version</p>\n\n<blockquote>\n  <p>Most of the time, you should be asking yourself “How can I improve this post so that community wiki isn’t needed?” Community wiki is like a cheese knife: it is a specialized tool to be used sparingly, and only in very specific circumstances.</p>\n</blockquote>\n","OwnerUserId":"101","LastActivityDate":"2011-08-20T04:50:19.927","CommentCount":"0"},{"Id":"736","PostTypeId":"2","ParentId":"505","CreationDate":"2011-08-20T04:58:18.000","Score":"3","Body":"<p>We have provided some additional guidance at the blog:</p>\n\n<p><a href=\"http://blog.stackoverflow.com/2011/08/the-future-of-community-wiki/\">http://blog.stackoverflow.com/2011/08/the-future-of-community-wiki/</a></p>\n\n<p>TL;DR version</p>\n\n<blockquote>\n  <p>Most of the time, you should be asking yourself “How can I improve this post so that community wiki isn’t needed?” Community wiki is like a cheese knife: it is a specialized tool to be used sparingly, and only in very specific circumstances.  </p>\n</blockquote>\n","OwnerUserId":"101","LastActivityDate":"2011-08-20T04:58:18.000","CommentCount":"0"},{"Id":"737","PostTypeId":"1","CreationDate":"2011-08-22T10:28:20.427","Score":"1","ViewCount":"110","Body":"<p>After performing a search in the search bar the search terms remain in the bar.  If you click in the bar to change the search terms, the first character you type is inserted where you clicked but the cursor then moves to the end of the line and anything you type goes here instead.  </p>\n\n<p>Firefox 3.6.18 on Windows XP Pro SP3</p>\n\n<p>Instructions to reproduce:  </p>\n\n<ul>\n<li>Type search term 'break key'  </li>\n<li>Hit Enter  </li>\n<li>Page of results loads with 'break key' still in search box  </li>\n<li>Click mouse in front of the 'b' in 'break' and start to type 'macbook'  </li>\n<li>'m' appears in front of 'break key' making 'mbreak key' and then the search box expands  </li>\n<li>cursor moves to the end of the search string 'mbreak key' resulting in 'mbreak keyacbook'</li>\n</ul>\n","OwnerUserId":"2812","LastEditorUserId":"2812","LastEditDate":"2011-08-22T12:50:26.537","LastActivityDate":"2011-08-22T12:50:26.537","Title":"Bug with expanding search bar","Tags":"<bug><status-norepro>","AnswerCount":"1","CommentCount":"3"},{"Id":"738","PostTypeId":"2","ParentId":"737","CreationDate":"2011-08-22T10:58:59.243","Score":"1","Body":"<p>No repro in Chrome. What browser?</p>\n\n<p>Can you provide exact repro steps, down to enumerating every click and keypress in the order that you performed them?</p>\n\n<p>Also note that you can use the BIG ASS SEARCH BOX(tm) here:</p>\n\n<p><img src=\"https://i.stack.imgur.com/eGTun.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"101","LastActivityDate":"2011-08-22T10:58:59.243","CommentCount":"1"},{"Id":"739","PostTypeId":"1","CreationDate":"2011-08-22T17:42:52.777","Score":"1","ViewCount":"54","Body":"<p>I tried flagging a few posts using the iPhone 4 / Mobile interface, and the layout far exceeds the screen size. </p>\n\n<p>The initial box for flagging and closing looks good and survives a portrait to landscape switch well. The bug happens when choosing \"exact duplicate\" and the text input box exceeds the bounds of the screen. </p>\n\n<p>This makes it very difficult to operate the buttons and provide a link to the dupe.  My attempts to pinch / zoom or scale my way out of this failed. Rotating the device to landscape helped a little, but it was still not very workable.</p>\n\n<p><img src=\"https://i.stack.imgur.com/XD69U.png\" alt=\"portrait layout\"></p>\n\n<p><img src=\"https://i.stack.imgur.com/9pYOz.png\" alt=\"landscape layout\"></p>\n\n<p>Mobile Safari on iOS 4.3.5 - no jailbreaks, no betas.</p>\n","OwnerUserId":"5472","LastEditorUserId":"2","LastEditDate":"2011-08-25T00:48:22.210","LastActivityDate":"2011-08-25T00:48:41.227","Title":"Flagging layout for mobile (iPhone 4) is challenging to use","Tags":"<bug><status-completed><mobile><flagging>","AnswerCount":"1","CommentCount":"0"},{"Id":"741","PostTypeId":"2","ParentId":"664","CreationDate":"2011-08-23T08:26:49.953","Score":"0","Body":"<p>In the Stack Exchange blog: </p>\n\n<p><a href=\"http://blog.stackoverflow.com/2010/11/dr-strangedupe-or-how-i-learned-to-stop-worrying-and-love-duplication/\">Dr. Strangedupe: Or, How I Learned to Stop Worrying And Love Duplication</a> (Jeff Atwood, November 2010)</p>\n\n<p>For someone (like me) who traditionally worries about duplication, it's a refreshing read. </p>\n\n<hr>\n\n<p>For link purposes, in Ask Different meta: </p>\n\n<p><a href=\"https://apple.meta.stackexchange.com/q/42/8546\">Should we duplicate some of the most Apple releated popular questions from other SE sites?</a> (August 2010)</p>\n","OwnerUserId":"8546","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2011-08-23T08:26:49.953","CommentCount":"0"},{"Id":"742","PostTypeId":"2","ParentId":"739","CreationDate":"2011-08-25T00:48:41.227","Score":"2","Body":"<p>A fix for this will go out with the next build.</p>\n\n<p>Silly fixed width got carried over from the desktop site.</p>\n","OwnerUserId":"2","LastActivityDate":"2011-08-25T00:48:41.227","CommentCount":"4"},{"Id":"743","PostTypeId":"1","AcceptedAnswerId":"744","CreationDate":"2011-08-27T14:20:35.630","Score":"8","ViewCount":"145","Body":"<p>Can I ask a question in the main site to users about their best quote or memories from <strong><em>Steve Jobs</em></strong>. This would be way off-topic from the approved list of topics in the site. </p>\n\n<p>I wanted to double check since we are talking about <strong><em>Steve Jobs</em></strong> here :) </p>\n","OwnerUserId":"1976","LastActivityDate":"2011-08-27T14:44:12.367","Title":"Can I ask this question related to Steve Jobs in the main site?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"744","PostTypeId":"2","ParentId":"743","CreationDate":"2011-08-27T14:44:12.367","Score":"15","Body":"<h2>Main Site:</h2>\n\n<p>This question isn't really asking a question about Apple hardware and software, so it's inherently off-topic.</p>\n\n<p>What's more, it would have to be a Community Wiki since there is no one 'right answer'.<br>\nThe current attitude about CW is generally against (see <a href=\"https://apple.meta.stackexchange.com/questions/697/how-to-kill-off-community-wiki-entries\">How to kill off 'community wiki' entries</a> and <a href=\"http://blog.stackoverflow.com/2011/08/the-future-of-community-wiki/\">The future of community wiki</a>).</p>\n\n<p>Since this wouldn't be a particularly educational CW, nor relevant to the core of this site (questions about Apple hardware and software), I personally don't think it should be posted on the main site.</p>\n\n<h2>Meta Site:</h2>\n\n<p>Since this isn't, in any way, a question about the main site itself, it should not be posted on Meta.</p>\n\n<h2>Other Option:</h2>\n\n<p>I think that this would be  an interesting post. However, I don't believe that it would be a good fit for our Q&amp;A site.</p>\n\n<p>If you're interested in getting the Ask Different community to discuss Steve Jobs, I think your best option is to <strong>create a chat room for it</strong>.<br>\nChat rooms have much looser scope than the rest of the site, and are especially designed for discussion.</p>\n","OwnerUserId":"2220","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2011-08-27T14:44:12.367","CommentCount":"1"},{"Id":"745","PostTypeId":"2","ParentId":"34","CreationDate":"2011-08-27T23:40:35.143","Score":"0","Body":"<p>Even though this is an old question - I wanted to chime in with a new answer after seeing this happen several times in the last 4 months.</p>\n\n<p>The current best practice would be to decide if the question is of lasting value answered in the unique point of view of the other site compared to here.</p>\n\n<p>Temporarily set aside the \"not having an answer\" and imagine the questions a year later assuming both questions now have good answers. If there really only is one question with one answer, then flag it asking for it to be migrated to the site where you feel it should best live. </p>\n\n<p>A great question could be asked and phrased differently and then get different great answers on server fault and here (for example). If that's the case, do ask the specially crafted / targeted question here as well. </p>\n\n<p>Don't forget you can promote that unanswered question on chat here, by using bounty there, asking on chat there how to improve it or sharing a link on twitter to your unanswered question. </p>\n","OwnerUserId":"5472","LastActivityDate":"2011-08-27T23:40:35.143","CommentCount":"0"},{"Id":"746","PostTypeId":"1","AcceptedAnswerId":"748","CreationDate":"2011-08-28T06:35:15.047","Score":"1","ViewCount":"44","Body":"<p>How do you upload animated GIFs to a post? I was trying to, but it told me \n<br /><code>\"Failed to upload image; the format is not supported\"</code></p>\n\n<p>So, are they not supported, or am I just exporting the GIF wrong?</p>\n","OwnerUserId":"7833","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Uploading animated GIFS","Tags":"<discussion><images>","AnswerCount":"1","CommentCount":"0"},{"Id":"747","PostTypeId":"1","AcceptedAnswerId":"749","CreationDate":"2011-08-28T06:43:01.467","Score":"5","ViewCount":"113","Body":"<p>I've heard \"OP\" used on several SE sites. I <strong>think</strong> it refers to the person asking the question. Is that right? Where do those abbreviations come from? Is there a specific FAQ type page that contains a list of these abbreviations?</p>\n","OwnerUserId":"7833","LastActivityDate":"2011-08-28T08:59:28.340","Title":"What is \"the OP\"?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"748","PostTypeId":"2","ParentId":"746","CreationDate":"2011-08-28T08:56:34.613","Score":"3","Body":"<p>It definitely works; see here:</p>\n\n<p><a href=\"https://meta.stackexchange.com/questions/104046/inbox-message-count-animation-too-slow/104176#104176\">Inbox message count animation too slow</a></p>\n\n<p>So presumably the format of your image is somehow incorrect.</p>\n","OwnerUserId":"101","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2011-08-28T08:56:34.613","CommentCount":"1"},{"Id":"749","PostTypeId":"2","ParentId":"747","CreationDate":"2011-08-28T08:59:28.340","Score":"10","Body":"<p><a href=\"http://en.wikipedia.org/wiki/Internet_forum#Thread\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Internet_forum#Thread</a></p>\n\n<blockquote>\n  <p>A thread (sometimes called a topic) is a collection of posts, usually displayed from oldest to latest, although this is typically configurable: options for newest to oldest and for a threaded view (a tree-like view applying logical reply structure before chronological order) can be available. <strong>A thread is defined by a title, an additional description that may summarize the intended discussion, and an opening or original post (common abbreviation OP, which can also mean original poster) which opens whatever dialogue or makes whatever announcement the poster wished.</strong> A thread can contain any number of posts, including multiple posts from the same members, even if they are one after the other.</p>\n</blockquote>\n","OwnerUserId":"101","LastActivityDate":"2011-08-28T08:59:28.340","CommentCount":"4"},{"Id":"750","PostTypeId":"1","AcceptedAnswerId":"751","CreationDate":"2011-08-28T12:41:33.823","Score":"1","ViewCount":"43","Body":"<p>I can see that my reputation in Apple stack exchange site and meta sites are out of sync right now. Is there a known problem or is this the expected behavior ?</p>\n","OwnerUserId":"1976","LastEditorUserId":"884","LastEditDate":"2011-08-28T18:15:45.913","LastActivityDate":"2011-08-28T18:15:45.913","Title":"reputation in Meta and Main sites out of sync?","Tags":"<bug><status-bydesign><reputation>","AnswerCount":"1","CommentCount":"0"},{"Id":"751","PostTypeId":"2","ParentId":"750","CreationDate":"2011-08-28T14:06:40.097","Score":"2","Body":"<p>There's a small delay between when they update. Check back in a few minutes and it should be fine.</p>\n","OwnerUserId":"2220","LastActivityDate":"2011-08-28T14:06:40.097","CommentCount":"1"},{"Id":"752","PostTypeId":"1","CreationDate":"2011-08-30T05:08:38.413","Score":"3","ViewCount":"66","Body":"<p>Is the the theme to wmd specific to Apple Stackexchange? Where can I find the details. I really like the colouring and how there is syntax help built in.</p>\n","OwnerUserId":"10493","LastActivityDate":"2011-08-30T20:46:18.287","Title":"Is the copy of WMD (markdown editor) custom to Apple Stackexchange?","Tags":"<support>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"753","PostTypeId":"2","ParentId":"752","CreationDate":"2011-08-30T20:46:18.287","Score":"3","Body":"<p>The CSS design of the editor is specific to Ask Different. All of the functionality, such as the syntax help being right in there, can be found on all Stack Exchange sites. It's all a matter of laying the site's unique design theme on top of the editor.</p>\n\n<p>Some sites <em>do</em> have a functional change, namely to swap the \"Code Formatting\" button for something that is more often used, but these are rather rare in comparison.</p>\n","OwnerUserId":"8994","LastActivityDate":"2011-08-30T20:46:18.287","CommentCount":"0"},{"Id":"754","PostTypeId":"1","AcceptedAnswerId":"755","CreationDate":"2011-08-30T22:20:43.943","Score":"1","ViewCount":"36","Body":"<p>How long do I have to wait before the \"Start bounty\" button appears on one of my questions? I have a question that hasn't been answered yet and I would like to put a bounty on it, but the button hasn't shown up yet? Are there other rules that apply to when the bounty button appears?</p>\n","OwnerUserId":"7833","LastActivityDate":"2014-04-23T08:48:43.713","Title":"What are the rules/time-limits to adding a bounty to your question?","Tags":"<support><bounty>","AnswerCount":"2","CommentCount":"0"},{"Id":"755","PostTypeId":"2","ParentId":"754","CreationDate":"2011-08-30T22:33:57.773","Score":"5","Body":"<p>From <a href=\"https://apple.stackexchange.com/faq#bounty\">the FAQ</a>:</p>\n\n<blockquote>\n  <p>There are a few other rules around bounties:</p>\n  \n  <ul>\n  <li>Questions must be at least 2 days old to be eligible for a bounty.</li>\n  <li>Users must have at least 75 reputation to offer a bounty.</li>\n  <li><strong>There can only be 1 active bounty</strong> per question and <strong>per user</strong> at any given time.</li>\n  <li>Once initiated, the bounty period lasts 7 days.</li>\n  <li>After starting a bounty, you must wait 1 day before awarding it.</li>\n  <li>If you do not award your bounty within 7 days, the highest voted answer created after the bounty started with at least 2 upvotes will be awarded half the bounty amount.</li>\n  </ul>\n</blockquote>\n","OwnerUserId":"13","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2011-08-30T23:03:42.343","CommentCount":"6"},{"Id":"756","PostTypeId":"1","CreationDate":"2011-08-31T06:34:01.413","Score":"14","ViewCount":"118","Body":"<p><strong>Feature Request</strong>: Add editor buttons for symbols common to the subject being discussed.</p>\n\n<p>In the case of the Apple Stack Exchange, I wish to suggest some buttons for the editor to insert the common keys and symbols used by the Apple platforms. This would mainly be the modifier keys that Mac OS and Mac OS X make extensive use of, as well as perhaps a few other symbols common to computer keyboards.</p>\n\n<ul>\n<li><code>Key</code>: <code>Symbol</code> - <code>Unicode Symbol Name</code></li>\n<li>Command Key: ⌘ - Place of Interest Sign</li>\n<li>Shift Key: ⇧ - Upwards Right Arrow</li>\n<li>Option Key: ⌥ - Option Key</li>\n<li>Alt Key: ⎇ - Alternative Key Symbol</li>\n<li>Return Key: ⏎ - Return Symbol</li>\n<li>Delete Key: ⌫ - Erase to the Left</li>\n<li>Escape Key: ⎋ - Broken Circle</li>\n<li>Eject Key: ⏏ - Eject Symbol</li>\n<li>Control Key: ^ - Circumflex Accent (included for completeness)</li>\n<li>Tab Key: ⇥ - Rightwards Arrow to Bar</li>\n<li>Up Arrow: ↑ - Upwards Arrow</li>\n<li>Right Arrow: → - Rightwards Arrow</li>\n<li>Left Arrow: ← - Leftwards Arrow</li>\n<li>Down Arrow: ↓ - Downwards Arrow</li>\n</ul>\n\n<p>This would allow users to enter the correct symbol for a key function without having to remember it's name (how many names have you heard ⌘ referred to?) and not have to hunt through a unicode table to find it.</p>\n\n<p>If I were to answer a question like \"What are the common keyboard commands in Mac OS X\" I could quickly answer:</p>\n\n<ul>\n<li><kbd>⌘O</kbd> - Open</li>\n<li><kbd>⌘W</kbd> - Close</li>\n<li><kbd>⌘Q</kbd> - Quit</li>\n<li><kbd>⌘Z</kbd> - Undo</li>\n<li><kbd>⌘X</kbd> - Cut</li>\n<li><kbd>⌘C</kbd> - Copy</li>\n<li><kbd>⌘V</kbd> - Paste</li>\n<li><kbd>⌘A</kbd> - Select All</li>\n<li><kbd>⌘?</kbd> - Get help</li>\n<li><kbd>⌘,</kbd> - Preferences</li>\n</ul>\n\n<p>Or if asked \"How do I close all tabs but the one I am on (Safari)\"</p>\n\n<blockquote>\n  <p>Just hit <kbd>⌘⌥W</kbd> to close all tabs other that the current tab in a window.</p>\n</blockquote>\n\n<p>This could also help with a question like \"How do I type an Umlaut on a Mac?\"</p>\n\n<blockquote>\n  <p>To add and umlaut, press <kbd>⌥U</kbd>+<kbd>u</kbd> (or any letter supporting one, ä, ï, ë, ö, ü, Ü, etc).</p>\n</blockquote>\n","OwnerUserId":"6255","LastEditorUserId":"6255","LastEditDate":"2011-09-08T22:34:56.710","LastActivityDate":"2011-09-08T22:34:56.710","Title":"Feature Request: Add editor buttons for symbols common to the subject","Tags":"<feature-request><editing><user-interface>","AnswerCount":"0","CommentCount":"5","FavoriteCount":"2"},{"Id":"757","PostTypeId":"1","AcceptedAnswerId":"779","CreationDate":"2011-08-31T16:59:28.963","Score":"3","ViewCount":"68","Body":"<p>How does reviewing new posts give you more flagging weight? When I was looking at the badges, I noticed the \"Deputy\" badge = \"Achieved a flag weight of 500 by reviewing and flagging appropriately\" Does this mean you by reviewing new posts you will gain flagging weight, or you go to the posts and flag them, and gain flagging weight from that?</p>\n","OwnerUserId":"7833","LastActivityDate":"2011-09-11T13:24:59.263","Title":"How does reviewing give you more flagging weight?","Tags":"<support><flagging>","AnswerCount":"2","CommentCount":"0"},{"Id":"758","PostTypeId":"2","ParentId":"757","CreationDate":"2011-08-31T17:19:39.387","Score":"3","Body":"<p>If a moderator flag is deemed to have merit, your flag weight will go up. If a moderator flag is deemed not to have merit (or if we determine that no action is needed) your flag weight will go down. I believe it's mostly linear, with an asymptotic approach towards 750.</p>\n\n<p>Using review is a way to find posts that need moderator attention (and thus, can be flagged appropriately)</p>\n","OwnerUserId":"13","LastEditorUserId":"13","LastEditDate":"2011-09-05T18:59:19.877","LastActivityDate":"2011-09-05T18:59:19.877","CommentCount":"8"},{"Id":"759","PostTypeId":"1","AcceptedAnswerId":"760","CreationDate":"2011-09-02T18:00:32.537","Score":"0","ViewCount":"43","Body":"<p>I've noticed that there have been a couple of announcements on meta (<a href=\"https://apple.meta.stackexchange.com/questions/606/who-is-this-character-with-the-and-the-running-around-editing-all-these-post\">Abby's announcement</a>) Is is possible to start an announcements section in meta? Or just a tag for announcements? I know there's the blog, but the posts don't show up on Ask Different.</p>\n","OwnerUserId":"7833","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2011-09-05T23:23:01.360","Title":"Is is possible to start an announcements section in meta?","Tags":"<feature-request>","AnswerCount":"1","CommentCount":"0"},{"Id":"760","PostTypeId":"2","ParentId":"759","CreationDate":"2011-09-02T18:08:18.557","Score":"6","Body":"<p>In general, any \"announcement\" type question will be just a <a href=\"/questions/tagged/discussion\" class=\"post-tag required-tag\" title=\"show questions tagged 'discussion'\" rel=\"tag\">discussion</a> post. Given the level of activity usually prevalent in them, they often solidify their presence on the Meta Sidebar ad you get on the main site, for the duration that they are important. It's the list on the right that starts off with \"Visit Meta\".</p>\n\n<p>If it is exceptionally important or expects to be such for a while, there is a moderator-only tag <a href=\"/questions/tagged/featured\" class=\"post-tag moderator-tag\" title=\"show questions tagged 'featured'\" rel=\"tag\">featured</a>. This locks the post to being at the top of the Meta Sidebar ad on the main site as long as the tag stays (which is at least 2 weeks). If there is a big announcement that's important that people should see, this will be used.</p>\n","OwnerUserId":"8994","LastActivityDate":"2011-09-02T18:08:18.557","CommentCount":"1"},{"Id":"761","PostTypeId":"1","CreationDate":"2011-09-03T21:24:56.750","Score":"1","ViewCount":"21","Body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"https://apple.meta.stackexchange.com/questions/684/what-is-the-significance-of-the-blue-background-on-some-questions\">What is the significance of the blue background on some questions?</a>  </p>\n</blockquote>\n\n\n\n<p>Why are some posts \"highlighted\" blue on the main page?\n<img src=\"https://i.stack.imgur.com/tExhX.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"7833","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.967","LastActivityDate":"2011-09-03T21:24:56.750","Title":"Why are some posts \"highlighted\"?","Tags":"<support>","AnswerCount":"0","CommentCount":"0","ClosedDate":"2011-09-03T21:54:02.950"},{"Id":"762","PostTypeId":"1","CreationDate":"2011-09-05T07:17:27.370","Score":"1","ViewCount":"20","Body":"<p>I eventually solved my own problem after I put up a bounty and now don't know what to do to cancel it or give it to myself.</p>\n\n<p>Here's the post: <a href=\"https://apple.stackexchange.com/questions/21573/how-can-i-initiate-a-modem-connection-from-the-command-line/23691#23691\">How can I initiate a modem connection from the command line?</a></p>\n","OwnerUserId":"9765","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2011-09-05T10:02:38.163","Title":"What should I do if I answer my own question I put a bounty on?","Tags":"<support><bounty>","AnswerCount":"1","CommentCount":"0"},{"Id":"763","PostTypeId":"2","ParentId":"762","CreationDate":"2011-09-05T10:02:38.163","Score":"1","Body":"<p>Ask, but typically not through here, instead just flag it for moderation.</p>\n\n<p>I have removed the bounty and it got automagically refunded to you.</p>\n","OwnerUserId":"212","LastActivityDate":"2011-09-05T10:02:38.163","CommentCount":"0"},{"Id":"765","PostTypeId":"1","AcceptedAnswerId":"766","CreationDate":"2011-09-05T20:07:23.470","Score":"1","ViewCount":"23","Body":"<p>I have quite a few posts, but my problem is that the oldest posts show first. Can I order my posts so the newest ones show up first? Or is that not possible? If it isn't possible, can this be added?</p>\n","OwnerUserId":"7833","LastActivityDate":"2011-09-05T20:14:17.207","Title":"Is is possible to order my posts by recency?","Tags":"<support><profile-page>","AnswerCount":"1","CommentCount":"4"},{"Id":"766","PostTypeId":"2","ParentId":"765","CreationDate":"2011-09-05T20:14:17.207","Score":"3","Body":"<p>You should see buttons that let you do this.<br>\nTry clicking <code>recent</code>.</p>\n\n<p><img src=\"https://i.stack.imgur.com/FK2nN.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"2220","LastActivityDate":"2011-09-05T20:14:17.207","CommentCount":"3"},{"Id":"767","PostTypeId":"1","AcceptedAnswerId":"778","CreationDate":"2011-09-05T21:15:00.063","Score":"0","ViewCount":"68","Body":"<p>Would it be helpful to add a polling feature to Ask Different? I was talking to Nathan Greenstein in the chat room about web browser shares among Mac users, which led me to post this. I am not sure how useful it would be to have a feature like this. If you downvote this post could you <strong>please</strong> let me know why you downvoted it. It's helpful to have feedback as to why you think a feature request isn't a good idea.</p>\n","OwnerUserId":"7833","LastEditorUserId":"13","LastEditDate":"2011-09-05T23:23:09.380","LastActivityDate":"2011-09-11T13:13:04.150","Title":"Polling feature","Tags":"<feature-request>","AnswerCount":"1","CommentCount":"4"},{"Id":"769","PostTypeId":"1","CreationDate":"2011-09-06T17:01:25.857","Score":"7","ViewCount":"65","Body":"<p>I asked this question on Ask Different:</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/23798/what-will-i-miss-from-windows\">https://apple.stackexchange.com/questions/23798/what-will-i-miss-from-windows</a></p>\n\n<p>It was closed as not constructive by a moderator:</p>\n\n<blockquote>\n  <p>This question is not a good fit to our Q&amp;A format. We expect answers to generally involve <strong>facts, references, or specific expertise</strong>; this question will likely solicit opinion, debate, arguments, polling, or extended discussion.</p>\n</blockquote>\n\n<p>I realize the point of closing certain questions that are broad and solicit a lot of opinion or debate. Besides a few \"me too\" answers at the bottom, and the one horrible \"viruses\" answer, there was <strong>a lot</strong> of good answers to this question.</p>\n\n<p>The reason I am asking is because those good answers, specifically the one I accepted, would be <strong>absolutely beneficial</strong> to Windows power users that are considering a switch to a Mac.</p>\n\n<p>So, I am concerned if this question will eventually disappear, and this great info from a few users will be lost and of no benefit to future users. The reason I asked the question, was because there wasn't any other questions that covered the topic except this one: <a href=\"https://apple.stackexchange.com/questions/998/good-resources-for-those-transitioning-to-mac-os-x-from-windows\">Good resources for those transitioning to Mac OS X from Windows</a>. However, the highest voted answer on this question just links to the beginner Mac video tutorials on Apple's site. Hardly the type of useful information that a power user would be looking for. The good answers on my question included valuable information that I had been unable to find from any other source.</p>\n\n<p>And was this question really not constructive, or did it just suffer because of <a href=\"https://apple.stackexchange.com/questions/23798/what-will-i-miss-from-windows/23805#23805\">a few overzealous users that <strong>had</strong> to get their .02 in</a>? I tried to make it as specific as possible, so that there wouldn't be a lot of general debate and opinion, but that people would answer with <strong>facts, references, or specific expertise</strong> using both platforms.</p>\n","OwnerUserId":"10520","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2011-09-11T13:05:17.607","Title":"If a question was closed, will it eventually be deleted?","Tags":"<discussion><guideline>","AnswerCount":"2","CommentCount":"0"},{"Id":"770","PostTypeId":"2","ParentId":"769","CreationDate":"2011-09-06T17:49:25.617","Score":"4","Body":"<p>To address the question in the title, your question will not get deleted unless specifically done so by a moderator.</p>\n\n<p>I closed the question for two reasons. The first is in the reason I selected, specifically...</p>\n\n<blockquote>\n  <p>\"this question will likely solicit opinion, debate, arguments,\n  polling, or extended discussion\"</p>\n</blockquote>\n\n<p>The question was clearly subjective (asking for people's individual opinions) and in quick order enabled the virus and culture debates, neither of which end well. That type of discussion has no place here (and in the Stack Exchange format in general). Normally, I would have deleted it, but since it received both answers and votes, I simply closed it.</p>\n\n<p>The second is because this is the type of community wiki question that acts as a black hole for what could more than likely be individual questions to be asked. The accepted answer contained at least a couple of topical points that would have been more useful to the community as questions. Rather than listing what will be \"missed\", these really should be asked along the lines of \"I used to [insert favorite Windows function here]. What is an equivalent in Mac OS X?\" The question wasn't necessarily a true collaborative effort, but rather it was just a polling question.</p>\n\n<p>Please see Grace Note's post on the blog for a more detailed explanation about how community wiki is supposed to work: <a href=\"http://blog.stackoverflow.com/2011/08/the-future-of-community-wiki/\">The Future of Community Wiki</a>.</p>\n","OwnerUserId":"212","LastEditorUserId":"101","LastEditDate":"2011-09-09T19:35:56.037","LastActivityDate":"2011-09-09T19:35:56.037","CommentCount":"1"},{"Id":"771","PostTypeId":"1","AcceptedAnswerId":"773","CreationDate":"2011-09-07T21:30:38.983","Score":"4","ViewCount":"56","Body":"<p>I've noticed on pages like <a href=\"https://apple.stackexchange.com/questions/24378/is-it-save-to-delete-my-first-project-rcproject-file-in-the-imovie-projects-f\">this one</a> or <a href=\"https://apple.stackexchange.com/questions/24415/legality-of-itunes-sharing\">this one</a> that the person asking the question has a message stating \"x% accept rate\", but on other pages like <a href=\"https://apple.stackexchange.com/questions/24409/startup-items-no-longer-load-in-lion\">this one</a> or <a href=\"https://apple.stackexchange.com/questions/24376/preview-often-does-not-allow-import-from-ipad\">this one</a> there is no such message. What determines whether the accept rate is posted?</p>\n","OwnerUserId":"9388","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2011-09-08T19:12:15.930","Title":"Why do some users have a \"x% accept rate\" displayed by their name when they ask a question and others don't?","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"772","PostTypeId":"2","ParentId":"666","CreationDate":"2011-09-07T23:09:00.217","Score":"1","Body":"<p>I would be interested in writing. I don't know how much time I will have. I also am not very good at coming up with topics, so if people would give me topics to write about, I will hopefully be able to write. Don't count on me writing a lot of posts. If I could have a list of topics to write on, I will slowly work on writing articles for them. \nMy idea would be to write several posts at one time, then queue them, so they don't all go out at the same time. Hopefully.</p>\n","OwnerUserId":"7833","LastActivityDate":"2011-09-07T23:09:00.217","CommentCount":"0"},{"Id":"773","PostTypeId":"2","ParentId":"771","CreationDate":"2011-09-08T19:12:15.930","Score":"3","Body":"<p>The site wants to wait until enough of a sample is present.</p>\n\n<p><a href=\"http://blog.stackoverflow.com/2009/08/new-question-asker-features/\">The official criteria of accept rate display</a> is a little involved, but basically you need a few quality questions (after some question types are filtered out) before it shows your rate.</p>\n","OwnerUserId":"5472","LastActivityDate":"2011-09-08T19:12:15.930","CommentCount":"1"},{"Id":"775","PostTypeId":"2","ParentId":"661","CreationDate":"2011-09-11T01:55:21.823","Score":"3","Body":"<p>I did! My swag arrived a short while ago. Thanks to the whole team for making StackExchange into an awesome places for an awesome community!</p>\n\n<p><strong>EDIT:</strong></p>\n\n<p>Here's some photos. (I forgot to tag a photo of the \"unboxing\", and I was too lazy to take off the tee shirt, so there's two photos instead of one with everything in it.)</p>\n\n<p><img src=\"https://i.stack.imgur.com/gLNWo.jpg\" alt=\"Apple.SE Tee shirt\">\n<img src=\"https://i.stack.imgur.com/Zy5e3.jpg\" alt=\"Apple.SE swag\"></p>\n\n<p><strong><em>Thanks so much!</em></strong></p>\n","OwnerUserId":"638","LastEditorUserId":"638","LastEditDate":"2011-09-11T02:02:01.520","LastActivityDate":"2011-09-11T02:02:01.520","CommentCount":"2"},{"Id":"776","PostTypeId":"1","AcceptedAnswerId":"780","CreationDate":"2011-09-11T12:47:41.710","Score":"3","ViewCount":"41","Body":"<p>On Stack Overflow, a version tag (e.g. \"c#-4.0\") is used when the question is about a feature specific for that version.<br>\nIs the same true for the OS tags used on <em>Ask Different</em>, or should I use the OS tags only to report the OS I am using?</p>\n","OwnerUserId":"3598","LastActivityDate":"2011-09-11T14:46:52.643","Title":"When should I use the tag for the OS version?","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"777","PostTypeId":"2","ParentId":"769","CreationDate":"2011-09-11T13:05:17.607","Score":"0","Body":"<p>Closed questions are eventually deleted, but that is not automatic, and requires a moderator that deletes the question, or three 10k users who vote to delete the question.</p>\n\n<p>Generally speaking, questions that are off-topic, not constructive, not a real question, or too localized are deleted; questions that duplicate another question are deleted if the  questions use very similar titles, and are phrased in the same way.<br>\nIt is up to the moderators of a site, and to 10k users, to decide when a closed question is deleted; what I reported is what generally happens, but that can change from site to site. Probably, SE sites with a higher quantity of questions are the ones where the questions are easily deleted, while in SE sites with less questions that happens less frequently.</p>\n","OwnerUserId":"3598","LastActivityDate":"2011-09-11T13:05:17.607","CommentCount":"0"},{"Id":"778","PostTypeId":"2","ParentId":"767","CreationDate":"2011-09-11T13:13:04.150","Score":"4","Body":"<p>None of the SE sites is going to support poll questions. The FAQ of every SE sites reports  that you should not ask subjective questions where every answer is equally valid, which is essentially what poll questions are.</p>\n\n<p>To notice that the purpose of the CW questions have been changed and, as reported in <a href=\"http://blog.stackoverflow.com/2011/08/the-future-of-community-wiki/\">The Future of Community Wiki</a>:</p>\n\n<blockquote>\n  <p>If a question is valuable enough that you believe it belongs on the site, chances are you don’t need it to be community wiki! We welcome all contributions which improve the quality of a site and advertise its greatness to the rest of the world. If you allow a certain class of questions, but only under the stipulation that no one can earn reputation from them, you've strongly discouraged these sorts of questions. People aren't going to put in nearly as much effort to ask them.</p>\n  \n  <p>Instead, strive for quality. If you're unsure a certain question class belongs on the site, don't tolerate the worst examples — demand that these questions be awesome.</p>\n</blockquote>\n","OwnerUserId":"3598","LastActivityDate":"2011-09-11T13:13:04.150","CommentCount":"0"},{"Id":"779","PostTypeId":"2","ParentId":"757","CreationDate":"2011-09-11T13:24:59.263","Score":"2","Body":"<p>The badge description you reported says, \"Achieved a flag weight of 500 by reviewing <strong>and flagging</strong> appropriately.\"<br>\nYour flag weight is the weight associated with your flags; the higher your flag weight is, the higher priority your flags have. The only way to increase it is to have your flags marked as helpful from a moderator; this means you correctly flagged a post, and your future flags should have the priority over the flags done from who keeps to inappropriately flag posts.</p>\n\n<p>The description says, \"reviewing and flagging\" as you need to review posts, in order to flag them. You don't flag a post without even reading it; even in the case somebody else has already flagged a post, and tells you that, you should always read the post to decide if the post really needs to be flagged.</p>\n\n<p>The flag weight should not be of any concert for normal users, as what the flag weight does is simply to order the flags that appear to the moderators.</p>\n","OwnerUserId":"3598","LastActivityDate":"2011-09-11T13:24:59.263","CommentCount":"0"},{"Id":"780","PostTypeId":"2","ParentId":"776","CreationDate":"2011-09-11T14:29:06.417","Score":"5","Body":"<p>Our version-specific OS tags use the 'big cat' name of the OS release.</p>\n\n<pre><code>10.4 -&gt; tiger  \n10.5 -&gt; leopard  \n10.6 -&gt; snow-leopard  \n10.7 -&gt; lion\n</code></pre>\n\n<p><strong>Use one of these when you have a question that's OS-specific.<br>\nWhen your question is not OS-specific, use the generic <code>osx</code> tag.</strong></p>\n\n<p><strong>Tags should not be used just to tell us what version of the OS you're using; add that to the question itself.</strong></p>\n\n<p>Examples:</p>\n\n<p><em>\"How can I rename Desktops in Lion?\"</em><br>\nDesktops (Spaces) changed a lot in Lion; this is a very Lion-specific question.<br>\n[lion]</p>\n\n<p><em>\"Error when connecting to my Mac with SSH\"</em><br>\nThis is a general troubleshooting question. While it may be useful to know the OS, it isn't a question specifically about that OS.<br>\n[osx], version info in the question.</p>\n","OwnerUserId":"2220","LastEditorUserId":"2220","LastEditDate":"2011-09-11T14:46:52.643","LastActivityDate":"2011-09-11T14:46:52.643","CommentCount":"2"},{"Id":"781","PostTypeId":"2","ParentId":"666","CreationDate":"2011-09-12T03:11:32.300","Score":"2","Body":"<p>I'd have enough spare time to contribute once a month at least. I'd like to be able to pick up article ideas from a pool and research / write about them, and leave the editing / steering to others.</p>\n","OwnerUserId":"1267","LastActivityDate":"2011-09-12T03:11:32.300","CommentCount":"0"},{"Id":"782","PostTypeId":"2","ParentId":"666","CreationDate":"2011-09-12T17:06:08.467","Score":"3","Body":"<p>I think I could contribute one or two specific blog posts about my experience here and my ideas about helping users and answering questions. I think of myself as an \"outsider\" and might have an \"outside the box\" point of view that some people might appreciate.</p>\n\n<p>In addition to being a technical support guy, I'm a grant writer, technical writer, copywriter, and I used to be a professional music journalist. Rest assured that I write well and wouldn't require much editing. In fact, while I'm at it, I would be willing to act as editor for other peoples' blog posts.</p>\n\n<p>Although I post something on Ask Different almost daily, I do not read Ask Different Meta very often and I don't go into the chat page very often either. So if anybody would like to discuss with me what I might contribute, how, and when, please write to me directly at wheat@wheatwilliams.com.</p>\n","OwnerDisplayName":"user9290","LastActivityDate":"2011-09-12T17:06:08.467","CommentCount":"0"},{"Id":"783","PostTypeId":"1","CreationDate":"2011-09-12T20:49:35.113","Score":"24","ViewCount":"311","Body":"<p>Ask Different seems to be one of the larger and more popular SE sites, yet the voting is on par with some of the smallest in-beta sites. Other than the hyper-popular \"your favorite tip/trick\" type question, it looks like most questions get between 0-3 votes and seems like answers get that as well. Even many accepted answers seem to only 1 or 2 votes.</p>\n\n<p>Is there a way to encourage people to vote more often to encourage better answers and more competition among answers?</p>\n","OwnerUserId":"10155","LastEditorUserId":"1346","LastEditDate":"2011-09-12T21:52:12.097","LastActivityDate":"2012-01-31T12:01:55.417","Title":"Why does Ask Different have such a low voting percentage?","Tags":"<discussion><voting>","AnswerCount":"7","CommentCount":"6","FavoriteCount":"1"},{"Id":"784","PostTypeId":"2","ParentId":"783","CreationDate":"2011-09-12T22:05:42.927","Score":"5","Body":"<p>One standing problem comes to mind;</p>\n\n<p>I honestly feel that too little expertise visits this site. One of many reasons for this is that it's all cooped up in Super User. The subject matter of Ask Different and Super User overlaps, at least with regard to Desktops, and there are many many more users over there.</p>\n\n<p>I need not say that plenty of talent exists here, but they are too few in number to reach the scope of as many questions we get, not for lack of trying.</p>\n\n<p>There is a standing issue on this topic. Apple questions about Desktop functions (as opposed to iOS) will remain on Super User, because they are not off topic. Users do often vote/flag to move any/all Apple questions to Ask Different, and iOS questions are automatically (iOS, like Android/WebOS/Windows Phone 7, are all off-topic at Super User).</p>\n\n<p>For a number of reasons; rep, history, etc. Too many users remain at Super User. Questions have moved there (and once to Server Fault, for a OS X Server question) because there was no suitable answer here on Ask Different.</p>\n","OwnerUserId":"1346","LastActivityDate":"2011-09-12T22:05:42.927","CommentCount":"11"},{"Id":"785","PostTypeId":"2","ParentId":"754","CreationDate":"2011-09-13T15:14:37.570","Score":"1","Body":"<p>Adding to what reported by Kyle Cronin, <a href=\"https://meta.stackexchange.com/questions/54315/why-cant-a-user-have-simultaneous-bounties-any-more/104813#104813\">users can now have a maximum of 3 active bounties</a> at any given time. There still the limit of one bounty per question, but you can have three bounties on three different questions, where nobody else offered a bounty already.</p>\n\n<p>The <a href=\"https://apple.stackexchange.com/faq#bounty\">FAQ</a> has been changed to reflect this.</p>\n","OwnerUserId":"3598","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2011-09-13T15:14:37.570","CommentCount":"0"},{"Id":"786","PostTypeId":"2","ParentId":"783","CreationDate":"2011-09-14T01:25:18.237","Score":"5","Body":"<p>Remember that voting requires 15 rep, though users with 1 rep can accept answers on their questions.</p>\n\n<p>If you want to encourage voting, remember that voting starts at home! </p>\n\n<ul>\n<li><p><a href=\"http://blog.stackoverflow.com/2010/10/vote-early-vote-often/\">http://blog.stackoverflow.com/2010/10/vote-early-vote-often/</a></p></li>\n<li><p><a href=\"https://apple.stackexchange.com/users?tab=voters\">https://apple.stackexchange.com/users?tab=voters</a></p></li>\n</ul>\n\n<p>Don't forget questions either; you get a max of 40 votes per day if you vote on at least 10 questions too:</p>\n\n<p><a href=\"http://blog.stackoverflow.com/2011/05/vote-for-this-question-or-the-kitten-gets-it/\">http://blog.stackoverflow.com/2011/05/vote-for-this-question-or-the-kitten-gets-it/</a></p>\n","OwnerUserId":"101","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2011-09-14T01:25:18.237","CommentCount":"0"},{"Id":"787","PostTypeId":"2","ParentId":"565","CreationDate":"2011-09-14T07:33:19.560","Score":"2","Body":"<p>My package just arrived in the mail yesterday, and I've already had to fight off coworkers trying to steal the pens and stickers. Thanks guys, this is fantastic!</p>\n","OwnerUserId":"77","LastActivityDate":"2011-09-14T07:33:19.560","CommentCount":"0"},{"Id":"788","PostTypeId":"1","CreationDate":"2011-09-14T21:14:46.753","Score":"4","ViewCount":"51","Body":"<p><a href=\"https://apple.stackexchange.com/questions/25044/replace-iphone-3g-home-button-without-removing-glass-digitizer\">This</a> is a question about Apple hardware. It would be great if users could get answers to questions like this. But does the question require sufficiently different expertise from the sort of questions that make up almost all the rest of the posts here that it would be unlikely to get good answers, or does that matter?</p>\n","OwnerUserId":"9388","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2011-09-15T20:19:22.340","Title":"Are physical hardware repair/modification questions on topic? Should they be?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"789","PostTypeId":"2","ParentId":"783","CreationDate":"2011-09-14T23:30:01.073","Score":"5","Body":"<p>I consider myself a Mac expert in general, and I'm often not inclined to answer for a variety of reasons. The \"very basic, marginally researched, often duplicates\" stuff @bmike said is one. Some of that is new-user laziness, and I don't know what can be done on that.</p>\n\n<p>The super-tweaky \"How do I do this incredibly arcane thing in Terminal\" questions put me off, because I'm not a command-line guy. Related are the answers that unnecessarily recommend a command-line approach (the \"I've got a hammer called Terminal, and I shall use it to strike every nail\" approach). I think those command-line Q's and A's tend to put off most Mac users, who have no interest in using Terminal, <em>ever in their lives</em>. I don't mean to offend you Terminal jockeys, really. But my 27 years of Mac experience tells me that people generally become Mac users because they don't want to deal with that kind of stuff.</p>\n\n<p>There are certainly questions over on SuperUser that should be over here on Ask Different. That's an issue that I think is in SE employee's bailiwick (no, I'm not speaking for Dori here). I feel there is some cherry-picking of questions by the mods there, and they are holding onto questions that would find a good home here. </p>\n\n<p>By the way, I've only started doing the \"vote questions up that I answer\" thing on a regular basis recently, partly because it seemed to me that it was a kind of logrolling, and I wasn't clear that it was not only permitted, but encouraged behavior.</p>\n","OwnerUserId":"3352","LastActivityDate":"2011-09-14T23:30:01.073","CommentCount":"6"},{"Id":"790","PostTypeId":"1","CreationDate":"2011-09-15T06:55:11.740","Score":"3","ViewCount":"30","Body":"<p>I logged in early on <em>Ask Different</em>, and I have got a message about the expiration of the bounty I offered. When I clicked on the question link, I noticed the question was reporting the bounty would expire one day earlier.</p>\n\n<p><img src=\"https://i.stack.imgur.com/qm2lv.png\" alt=\"screenshot\"></p>\n\n<p><img src=\"https://i.stack.imgur.com/F1wFO.png\" alt=\"screenshot\"></p>\n","OwnerUserId":"3598","LastEditorUserId":"3598","LastEditDate":"2011-09-15T09:56:25.403","LastActivityDate":"2011-09-15T09:56:25.403","Title":"The bounty expiration shown in the notification message is different from the expiration shown in the question","Tags":"<support><bounty><notifications>","AnswerCount":"1","CommentCount":"0"},{"Id":"791","PostTypeId":"2","ParentId":"790","CreationDate":"2011-09-15T08:07:34.333","Score":"3","Body":"<p>In two days your question will cease to be promoted as a bounty question. However, you are given an extra day to select your bounty answer before one is selected automatically.</p>\n","OwnerUserId":"13","LastActivityDate":"2011-09-15T08:07:34.333","CommentCount":"3"},{"Id":"792","PostTypeId":"2","ParentId":"788","CreationDate":"2011-09-15T17:27:09.047","Score":"2","Body":"<p>My take is they absolutely are on topic (and should be as well).</p>\n\n<p>1) This site explicitly is about apple services - one of which is Apple's repair service. The average user might reasonably ask some basic question about how to understand the makings of the product so as to weigh their options.</p>\n\n<p>2) Apple hardware is totally on topic. This user has a specific, definite problem they are seeking so solve and it involves iOS hardware.</p>\n\n<p>If you take the long view - six months from now - having an unanswered question that is good, clear and on-topic isn't really a problem. I have found great questions to answer that have been here for 8 months or more. It's up to the OP to promote the question, be patient or flag it to move if another site has a better shot at asking.</p>\n\n<p>In this case - I happened to know the answer - but even if I didn't - there are many people here who have had their phone break and could share their experiences. Some may have done a glass repair and could share their triumph or tale of woe. In the end - the OP was able to realize paying for a local tech was worth the money to minimize his risk / time to DIY.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2011-09-15T20:19:22.340","LastActivityDate":"2011-09-15T20:19:22.340","CommentCount":"5"},{"Id":"793","PostTypeId":"1","AcceptedAnswerId":"794","CreationDate":"2011-09-15T17:41:34.503","Score":"1","ViewCount":"40","Body":"<p>I was looking on the <a href=\"https://apple.stackexchange.com/users\">AD users page</a> and noticed that my reputation is at 501.\n<img src=\"https://i.stack.imgur.com/RW1Pp.png\" alt=\"AD user page: daviesgeek\"></p>\n\n<p>My actual reputation is at 1.2K</p>\n\n<p><img src=\"https://i.stack.imgur.com/2zzgT.png\" alt=\"Actual reputation of daviesgeek\"></p>\n\n<p>Is this a bug, or is reputation on the users page supposed to be delayed?</p>\n","OwnerUserId":"7833","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2011-09-16T16:29:53.347","Title":"Reputation on the users page","Tags":"<support><reputation>","AnswerCount":"2","CommentCount":"0"},{"Id":"794","PostTypeId":"2","ParentId":"793","CreationDate":"2011-09-15T17:54:53.580","Score":"5","Body":"<p>If you look on the right of the users page, you'll see something very similar to:</p>\n\n<p><img src=\"https://i.stack.imgur.com/jBV5C.png\" alt=\"snapshot of users page\"></p>\n\n<p>Notice the <em>week</em>, <em>month</em>, <em>quarter</em>, <em>year</em>, and <em>all</em> filters.  The rep shown is the amount of rep you've earned during the duration selected.  This is too highlight users that are earning rep now, not a hypothetical someone who earned rep a year ago and hasn't returned since.</p>\n","OwnerUserId":"884","LastActivityDate":"2011-09-15T17:54:53.580","CommentCount":"1"},{"Id":"795","PostTypeId":"2","ParentId":"793","CreationDate":"2011-09-16T11:04:01.617","Score":"1","Body":"<p>I interpreted 501 as your UID. Although it could also be an indicator that you wear Levi's jeans, are part of the 501st Legion, live in Arkansas, or have very poor credit. </p>\n\n<p>Joking aside, it's probably a bug/feature.</p>\n","OwnerUserId":"10139","LastEditorUserId":"10139","LastEditDate":"2011-09-16T16:29:53.347","LastActivityDate":"2011-09-16T16:29:53.347","CommentCount":"1"},{"Id":"796","PostTypeId":"2","ParentId":"783","CreationDate":"2011-09-16T20:49:32.523","Score":"7","Body":"<p>Part of the problem as I see it is being stuck in a \"low-vote\" trap. If good answers tend to get 1 or 2 votes, people won't vote them up after that. Same with good questions. It requires some consistency in trying to set new standards for good with questions and answers getting 10+ votes if they are well researched and presented.</p>\n\n<p>It is really frustrating for new people stopping by (including me) to take the top to write out an answer and get no feedback, sometimes not even from original poster who never bothers to check back.</p>\n\n<p>And I agree with trying to cull the low quality questions, some days it seems as if over 25-50% of the questions could be answered with a simple google search.</p>\n","OwnerUserId":"10155","LastActivityDate":"2011-09-16T20:49:32.523","CommentCount":"1"},{"Id":"797","PostTypeId":"1","AcceptedAnswerId":"801","CreationDate":"2011-09-17T11:25:10.240","Score":"1","ViewCount":"52","Body":"<p>The bug in this question: <a href=\"https://apple.meta.stackexchange.com/questions/327/visual-bug-in-not-the-answer-youre-looking-for-text\">Visual Bug in “Not the answer you're looking for […]” text.</a></p>\n\n<p>… is there again, but slightly different:</p>\n\n<p><img src=\"https://i.stack.imgur.com/V7hKG.png\" alt=\"enter image description here\"></p>\n\n<p>Chrome 15 on OS X, reproduced on Firefox as well.</p>\n","OwnerUserId":"611","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2011-09-19T06:17:31.153","Title":"Formatting bug for \"Would you like to have …\"","Tags":"<bug><status-completed><design><style>","AnswerCount":"1","CommentCount":"1"},{"Id":"798","PostTypeId":"1","AcceptedAnswerId":"800","CreationDate":"2011-09-17T13:52:32.150","Score":"6","ViewCount":"123","Body":"<p>THe FAQ makes it clear that prerelease software requiring an NDA is off-topic for the site. But not all pre-release software requires an NDA. Is pre-release software that doesn't require an NDA an allowable topic?</p>\n\n<p>For example, <a href=\"https://apple.stackexchange.com/questions/24982/installing-windows-8-preview-on-a-mac\">Installing Windows 8 Preview on a Mac?</a> was closed as off topic, but at <a href=\"http://msdn.microsoft.com/en-us/windows/apps/br229516\" rel=\"nofollow noreferrer\">http://msdn.microsoft.com/en-us/windows/apps/br229516</a>, one can download the Windows 8 preview without any NDA.</p>\n","OwnerUserId":"9388","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2011-09-17T14:05:28.850","Title":"Pre-release software that doesn't require an NDA","Tags":"<discussion><prerelease>","AnswerCount":"2","CommentCount":"1","FavoriteCount":"1"},{"Id":"799","PostTypeId":"2","ParentId":"798","CreationDate":"2011-09-17T13:57:26.173","Score":"5","Body":"<p>Here's my view on this:</p>\n\n<p>The reason to disallow questions about prerelease software <strong>is not the NDA</strong>. It's not our job to enforce that. If users want to break their NDAs that's their choice.</p>\n\n<p>Rather, the reason that I think we shouldn't allow these questions is that many of them are simply <strong>too localized</strong>.<br>\nThings change very quickly with prerelease software, so a question and answer that work today are likely to be broken, or not even relevant, tomorrow.</p>\n\n<p>I'm in favor of updating the FAQs to block all questions about prerelease software, not just those under NDA.</p>\n","OwnerUserId":"2220","LastActivityDate":"2011-09-17T13:57:26.173","CommentCount":"2"},{"Id":"800","PostTypeId":"2","ParentId":"798","CreationDate":"2011-09-17T14:05:28.850","Score":"1","Body":"<p>Some pre-release software is transient and likely too localized a question because it will too-soon become obsolete. Other times, software languishes for years in pre-release form. (Google's perpetual betas are one example; many open-source projects also exhibit these symptoms). A question about a developer preview that will in days or months be superseded by an official release likely should be off-topic, I'd think. But I'd hate for this rule to keep us from being able to answer questions about any beta software, or stable but slowly developing solutions to real problems people might develop.</p>\n\n<p>This isn't a clear bright line, which is unfortunate, but I do think it's an important distinction.</p>\n","OwnerUserId":"9388","LastActivityDate":"2011-09-17T14:05:28.850","CommentCount":"7"},{"Id":"801","PostTypeId":"2","ParentId":"797","CreationDate":"2011-09-18T05:04:42.957","Score":"3","Body":"<p>This will be fixed in the next deployment.</p>\n","OwnerUserId":"6","LastActivityDate":"2011-09-18T05:04:42.957","CommentCount":"0"},{"Id":"803","PostTypeId":"1","CreationDate":"2011-09-19T14:17:59.160","Score":"8","ViewCount":"113","Body":"<p>I'm noticing a new trend regarding posting software prices alongside their titles.  I'm not sure how it started, or where it came from, but why in Jobs' name would we want to do this??  </p>\n\n<p>Prices are constantly changing, and it makes the site look irrelevant and obsolete quicker than just about any other trend I've seen.  People use different formatting, and lets not even get into the problems associated with USD vs EUR vs Yen, etc.</p>\n\n<p>I see no need for this considering the convention is to provide a link to the software developers page anyway, which would contain the most up to date pricing.</p>\n\n<p>Can we please stop this before it permeates too many threads?</p>\n","OwnerUserId":"26","LastActivityDate":"2011-12-07T22:57:46.610","Title":"Why are we including prices in software suggestions?","Tags":"<discussion>","AnswerCount":"2","CommentCount":"4","FavoriteCount":"1"},{"Id":"804","PostTypeId":"2","ParentId":"803","CreationDate":"2011-09-19T14:21:57.987","Score":"2","Body":"<p>This is unenforceable. Deleting the prices would require us to review every single answer to every product-related question. Given everything else that goes on around here with the moderator flags, this is a niche problem that would be nice to manage but doesn't harm the site overall.</p>\n\n<p><strong>UPDATE per comment:</strong>\nIf the high-rep community members are willing to step up and update or delete prices from answers, the mods (or at least I will be) more than happy to approve any edits the community agrees upon. </p>\n\n<p>Otherwise, nice to manage is vastly different than actually managing it. Back to my original point, I don't see prices in answers as being all that significant relative to the other issues that crop up on a regular basis, so this isn't anything that I will actively address except to approve others' edits.</p>\n","OwnerUserId":"212","LastEditorUserId":"212","LastEditDate":"2011-09-19T15:50:24.973","LastActivityDate":"2011-09-19T15:50:24.973","CommentCount":"3"},{"Id":"805","PostTypeId":"1","CreationDate":"2011-09-20T04:21:33.257","Score":"0","ViewCount":"97","Body":"<p>I was wondering what the accept rate really means. I know what it does, but what can be inferred from a low/high acceptance rate? Is it good or bad to have a low accept rate?</p>\n","OwnerUserId":"7833","LastActivityDate":"2011-09-20T04:21:33.257","Title":"Is it good to have a low acceptance rate?","Tags":"<discussion>","AnswerCount":"0","CommentCount":"3"},{"Id":"806","PostTypeId":"1","AcceptedAnswerId":"807","CreationDate":"2011-09-20T04:29:30.923","Score":"0","ViewCount":"64","Body":"<p>Both in chat and when posting comments, an autocomplete box shows up for users.\n<img src=\"https://i.stack.imgur.com/oKzhS.png\" alt=\"Autocomplete users\"><br>\nCan this be made so you can select the user using the up arrow key, then the right/left arrows? So, let's take the example above. I push the up arrow to highlight \"memilanuk\", then the right arrow key to highlight \"mankoff\", and press Enter to select \"mankoff\". I hope this makes sense...but could it be implemented? I find it somewhat annoying that I have to use the mouse to select the name.</p>\n","OwnerUserId":"7833","LastEditorUserId":"962","LastEditDate":"2011-09-20T06:14:57.573","LastActivityDate":"2011-09-20T06:14:57.573","Title":"Can the username autocomplete be keyboard accessible?","Tags":"<support><chat>","AnswerCount":"1","CommentCount":"1"},{"Id":"807","PostTypeId":"2","ParentId":"806","CreationDate":"2011-09-20T06:13:59.023","Score":"3","Body":"<p>You don't have to use the mouse. You can use the Tab key to cycle to the list (or Shift-Tab to cycle backwards).</p>\n","OwnerUserId":"962","LastActivityDate":"2011-09-20T06:13:59.023","CommentCount":"0"},{"Id":"808","PostTypeId":"2","ParentId":"563","CreationDate":"2011-09-20T08:32:42.283","Score":"2","Body":"<p>OK, moderators have officially been mailed the form to obtain the cards. Stay tuned!</p>\n","OwnerUserId":"101","LastActivityDate":"2011-09-20T08:32:42.283","CommentCount":"2"},{"Id":"809","PostTypeId":"1","AcceptedAnswerId":"810","CreationDate":"2011-09-22T12:52:14.187","Score":"4","ViewCount":"66","Body":"<p>In the flagging dialog box, there is a way to indicate that an answer is not really an answer, but actually a comment.</p>\n\n<p>What about the reverse case? Are flags encouraged that indicate that a comment is actually an answer to the problem? If we read comments that actually propose a solution to the problem, should we flag them as \"not a comment\" for a moderator to reclassify as an answer?</p>\n","OwnerUserId":"9388","LastEditorUserId":"10139","LastEditDate":"2011-09-23T04:02:35.927","LastActivityDate":"2011-09-23T04:02:35.927","Title":"Answers that are really comments/comments that are really answers","Tags":"<support><answers><comments>","AnswerCount":"1","CommentCount":"0"},{"Id":"810","PostTypeId":"2","ParentId":"809","CreationDate":"2011-09-22T13:10:53.350","Score":"3","Body":"<blockquote>\n  <p>Are flags encouraged that indicate that a comment is actually an\n  answer to the problem?</p>\n</blockquote>\n\n<p>Sure, but it would be faster to simply <code>@</code> the commenter and tell them to make their comment an answer. That's what we would do; it is all we <em>can</em> do, per my answer to your second question.</p>\n\n<blockquote>\n  <p>If we read comments that actually propose a solution to the problem,\n  should we flag them as \"not a comment\" for a moderator to reclassify\n  as an answer?</p>\n</blockquote>\n\n<p>We do not have the ability to switch comments to answers; we can only switch answers to comments (and I've done that a fair number of times). All we can do in that case is simply <code>@</code> the commenter to ask them to add their comment as an answer. Veterans of Stack Exchange typically oblige, but people new to the culture typically don't and we are stuck.</p>\n","OwnerUserId":"212","LastActivityDate":"2011-09-22T13:10:53.350","CommentCount":"2"},{"Id":"811","PostTypeId":"1","CreationDate":"2011-09-24T08:01:21.837","Score":"8","ViewCount":"384","Body":"<p>A few days ago Stack Exchange set up a blog for Ask Different at <a href=\"http://apple.blogoverflow.com/\" rel=\"nofollow noreferrer\">http://apple.blogoverflow.com/</a>, and we're looking for contributors! The topic set is the same as Ask Different - reviews, comparisons, and how-tos with <a href=\"https://apple.stackexchange.com/faq#questions\">Apple hardware/software, etc</a>. You can also write posts about Ask Different itself - how to ask a good question, how to use site features, and featuring excellent questions or answers from the site. And if you have a great idea of something to contribute that I haven't listed, just let us know and we'll let you know if it's something we can put up.</p>\n\n<p>If you haven't already, I suggest looking at the <a href=\"http://blogoverflow.com/\" rel=\"nofollow noreferrer\">other Stack Exchange community blogs</a> to get a sense for what the blog will be like, and to get ideas for potential content to post.</p>\n\n<p>The primary means of communication is our chat room, which is open to the public:</p>\n\n<p><a href=\"http://chat.stackexchange.com/rooms/1408/ask-different-blog\">http://chat.stackexchange.com/rooms/1408/ask-different-blog</a></p>\n\n<p>If this sounds like something you'd be interested in contributing to, either selectively or on a regular schedule, or even if you're just curious and want to know more, please just drop a line either here or in the chat room and we'll get you hooked up with a contributor account on the blog and give you access to our Trello planning board.</p>\n\n<p>Let's make it awesome!</p>\n","OwnerUserId":"13","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2011-12-08T19:25:42.227","Title":"The Ask Different Blog is looking for contributors","Tags":"<discussion><blog>","AnswerCount":"7","CommentCount":"4","FavoriteCount":"3"},{"Id":"812","PostTypeId":"2","ParentId":"455","CreationDate":"2011-09-24T14:28:58.223","Score":"10","Body":"<p><a href=\"https://apple.meta.stackexchange.com/questions/811/the-ask-different-blog-is-looking-for-contributors\"><img src=\"https://i.imgur.com/iPssx.png\" alt=\"Contribute to the Ask Different Blog!\"></a></p>\n","OwnerUserId":"2220","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2011-09-24T19:18:30.747","CommentCount":"0","CommunityOwnedDate":"2011-09-24T14:28:58.223"},{"Id":"813","PostTypeId":"1","CreationDate":"2011-09-24T19:34:04.007","Score":"8","ViewCount":"156","Body":"<p>On the close question dialog we can only close as off topic to meta.askdifferent can we please have some other options - The main missing one is stackoverflow.</p>\n\n<p>I have asked this <a href=\"https://apple.meta.stackexchange.com/questions/266/closing-question-as-should-be-on-other-se-site\">before</a> but was told that we would get some choices when we got out of beta but this has not happened. Also the suggested solution then was to flag for a moderator but as in this <a href=\"https://apple.stackexchange.com/questions/23153/developing-user-interface-programs-with-python-in-xcode\">question</a> even if the moderator thinks it should be on SO the question is just closed.</p>\n\n<p>This has also been asked and approved <a href=\"https://apple.meta.stackexchange.com/questions/658/which-sites-should-be-in-our-primary-migration-paths\">here</a> is this going to happen?</p>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2012-12-30T19:33:05.860","Title":"Can we have StackOverflow added as a site we can migrate questions to","Tags":"<feature-request><status-bydesign>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"1"},{"Id":"814","PostTypeId":"1","AcceptedAnswerId":"816","CreationDate":"2011-09-24T22:50:49.417","Score":"0","ViewCount":"89","Body":"<p>Is there are way to merge and re-award points to the first answer? If there isn't, I would like to recommend a way to merge answers that are the same (or nearly identical) and to award the points to the original (oldest) answer. It's not fair to the person who responded first when the second (newer) response gets the up-votes and the answers are no different. </p>\n","OwnerUserId":"10139","LastEditorUserId":"10139","LastEditDate":"2011-09-28T07:45:16.230","LastActivityDate":"2011-09-28T07:45:16.230","Title":"Answers that are the same, and newer one gets up-voted?","Tags":"<discussion><answers>","AnswerCount":"2","CommentCount":"0"},{"Id":"815","PostTypeId":"2","ParentId":"814","CreationDate":"2011-09-25T11:38:50.677","Score":"3","Body":"<p>If the community votes for one answer over another, then that's just going to happen. Whenever <em>I</em>, personally, see two answers that are identical, I vote for the answer that is given by the person with the lower reputation; others will see the situation differently. I see where you're coming from, but that is just the way the system works with people involved. I don't think the mods should step in and \"fix\" things like this. Just keep plugging away at it.</p>\n","OwnerUserId":"212","LastActivityDate":"2011-09-25T11:38:50.677","CommentCount":"2"},{"Id":"816","PostTypeId":"2","ParentId":"814","CreationDate":"2011-09-25T16:55:35.763","Score":"4","Body":"<p>Part of the problem is that it appears to the community that the answers were posted at the same time. Since times are displayed as \"19 hours ago\", it looks like your answer and the other one came from the same time.<br>\nYes, you can hover over that to see the exact time, but many people don't know how/don't bother to do this.</p>\n\n<p>This means that people upvote answers based on the one they like better. If one has something to make it a little nicer than the other, that one will get votes (even if it was posted later than the other).</p>\n\n<p>This is compounded by the fact that answers with upvotes float to the top. That means that some people will go to the question, see the answer with upvotes because it's at the top, and upvote it. They may never see the other answer because it hasn't floated to the top, or they may just decide to upvote the one that already has upvotes.</p>\n\n<p>Bottom line, there's not a lot you can do about it. The only way to go is to make sure your answers are so high-quality that people will upvote yours over others!</p>\n","OwnerUserId":"2220","LastActivityDate":"2011-09-25T16:55:35.763","CommentCount":"2"},{"Id":"817","PostTypeId":"2","ParentId":"813","CreationDate":"2011-09-26T13:25:58.773","Score":"1","Body":"<p>Diamond mods can migrate questions to sites not on that list.  They (hopefully) only do this in consultation with the receiving site's moderators unless it's a very obvious case, a very high-quality question, and they've checked for duplicates.</p>\n\n<p>We (SE) will <em>not</em> approve migration paths willy-nilly.  The hard truth is that too often, users migrate questions to sites where a duplicate already exists or where the question isn't actually on-topic.  Additionally, there's a tendency to migrate garbage questions that <em>should</em> be closed as a way to get rid of them without risking hurting the asker's feeling by closing -- thus simply moving problems around so someone else has to deal with them.</p>\n\n<p>Migration paths are <em>only</em> created when there is a history of many good migrations having happened between site A and site B.</p>\n\n<p>If your moderators <em>and</em> the SO moderators think the question belongs on SO, it will make it there (perhaps slowly, as the mods need to find one another online to discuss it).</p>\n","OwnerUserId":"7690","LastActivityDate":"2011-09-26T13:25:58.773","CommentCount":"2"},{"Id":"818","PostTypeId":"1","AcceptedAnswerId":"820","CreationDate":"2011-09-28T01:50:22.627","Score":"1","ViewCount":"49","Body":"<p>Links in the \"X people chatting\" box and related questions section fade away to an obscure color on mouseover, as if they don't want to be clicked.</p>\n\n<p><img src=\"https://img.skitch.com/20110928-cqmj4mmy92ck5hgbjk5eqj7cw5.png\" /></p>\n\n<p><img src=\"https://img.skitch.com/20110928-fjb49b2cxf3bm38shk851dja5i.png\" /></p>\n\n<p>Perhaps a leftover from <a href=\"https://apple.meta.stackexchange.com/questions/460/some-design-changes\">the old 2-tone background design</a>?</p>\n\n<p>I'm on Google Chrome 14.0 / Safari 5.1, Mac OS X 10.7.1.</p>\n","OwnerUserId":"3961","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2011-10-02T17:29:34.407","Title":"Some links on meta fade away on mouseover","Tags":"<bug><status-completed><design>","AnswerCount":"1","CommentCount":"0"},{"Id":"819","PostTypeId":"2","ParentId":"811","CreationDate":"2011-09-28T15:48:34.800","Score":"2","Body":"<p>I'd be willing to write some posts about audio production and/or software development on the Mac. Could keep the audio production posts to GarageBand if people want to play along, or go in to Logic Studio...</p>\n","OwnerUserId":"292","LastActivityDate":"2011-09-28T15:48:34.800","CommentCount":"2"},{"Id":"820","PostTypeId":"2","ParentId":"818","CreationDate":"2011-09-28T16:55:37.230","Score":"1","Body":"<p>The fix will be in the next deployment.</p>\n","OwnerUserId":"6","LastActivityDate":"2011-09-28T16:55:37.230","CommentCount":"1"},{"Id":"821","PostTypeId":"2","ParentId":"783","CreationDate":"2011-09-30T20:48:17.443","Score":"1","Body":"<p>I've seen a few comments which could have been answers.  When I see these in future I'll leave a reply comment suggesting the comment be turned into an answer, and offering a +1.</p>\n\n<p>It might be useful to start commenting and voting on more questions - \"+1 for <em>example example example</em>\" which should encourage voting and let people see what kind of thing gets voted on.</p>\n\n<p>That should really only be a short term thing, just to get the voting started.</p>\n","OwnerUserId":"9611","LastActivityDate":"2011-09-30T20:48:17.443","CommentCount":"1"},{"Id":"822","PostTypeId":"2","ParentId":"811","CreationDate":"2011-09-30T21:50:57.133","Score":"4","Body":"<p>I would love it if someone could write a \"VOTE EARLY, VOTE OFTEN\" style post.  </p>\n","OwnerUserId":"9611","LastActivityDate":"2011-09-30T21:50:57.133","CommentCount":"2"},{"Id":"825","PostTypeId":"1","AcceptedAnswerId":"826","CreationDate":"2011-10-04T23:43:09.933","Score":"4","ViewCount":"85","Body":"<p>We've established that beta software is off topic until it is released, but what about hardware? For instance, are iPhone 4S questions off limits until Apple actually ships them?</p>\n","OwnerUserId":"9388","LastActivityDate":"2011-10-04T23:52:11.803","Title":"Announced but not yet released products","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"826","PostTypeId":"2","ParentId":"825","CreationDate":"2011-10-04T23:52:11.803","Score":"2","Body":"<blockquote>\n  <p>...are iPhone 4S questions off limits until Apple actually ships them?</p>\n</blockquote>\n\n<p>Now that it has been announced, I think that makes it on-topic. Apple has a nice product page to pull some answers from (though any question might get closed as being easily answerable via the page). </p>\n\n<p>As to the quality of that answers you are going to get, that's something else completely since it hasn't been shipped and no one has it in their hands yet.</p>\n","OwnerUserId":"212","LastActivityDate":"2011-10-04T23:52:11.803","CommentCount":"9"},{"Id":"827","PostTypeId":"1","CreationDate":"2011-10-05T03:05:16.420","Score":"4","ViewCount":"80","Body":"<p><a href=\"http://www.mactech.com/\" rel=\"nofollow\">MacTech</a> runs a <a href=\"http://www.mactech.com/conference/about\" rel=\"nofollow\">conference</a> next month, and we have been invited to potentially participate. Basically, we want to put together some kind of small event that will let the people at the conference spend 15-20 minutes really engaging with the users on the site. We have had two ideas so far:</p>\n\n<ul>\n<li><p>We could run a sort of \"Stump the Programmer\" style game that would be played at the MacTech Conference next month. Individuals would ask questions in the Ask Different chat, where a pre-planned group of awesome Ask Different users would already be congregating. The chat room's task is then to wow the crowd back at the conference with their skill and know-how by finding great answers quickly. </p></li>\n<li><p>The other idea is similar in that it would have an organized, coordinated chat effort, but it would involve some kind of competition between the chat team(s) and the in-person team(s) at the conference. </p></li>\n</ul>\n\n<p>What do you guys think of these ideas? Are these coordinated chat efforts something you would be interested in? What other ideas do you have in terms of ways we can integrate with MacTech?</p>\n","OwnerUserId":"7749","LastActivityDate":"2011-10-05T20:15:52.553","Title":"What should we do with MacTech?","Tags":"<discussion><site-promotion>","AnswerCount":"1","CommentCount":"4","ClosedDate":"2011-10-13T17:14:28.290"},{"Id":"828","PostTypeId":"1","AcceptedAnswerId":"829","CreationDate":"2011-10-05T04:24:46.120","Score":"0","ViewCount":"51","Body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"https://apple.meta.stackexchange.com/questions/825/announced-but-not-yet-released-products\">Announced but not yet released products</a>  </p>\n</blockquote>\n\n\n\n<p>Simple enough, yet nuanced. Since future-tech is off-topic, but Siri is a hot topic, is it on-topic or off?</p>\n\n<p>Here's my reasons why it is on-topic:</p>\n\n<ul>\n<li>This is going to be asked in the near future as people are ready for the launch of 4S. </li>\n<li>The web (or this site) needs a good canonical answer.</li>\n<li>It may drive traffic here.</li>\n<li>It will be asked again (so says my experience).</li>\n</ul>\n\n<p>So, even though the 4S and iOS 5 isn't here yet, is asking what Siri is and how do you pronounce it, etc., on-topic?</p>\n","OwnerUserId":"2202","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2011-10-05T08:08:02.143","Title":"Since future-tech is offtopic, but Siri is a hot topic, is it on topic or off?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0","ClosedDate":"2011-10-05T12:27:17.207"},{"Id":"829","PostTypeId":"2","ParentId":"828","CreationDate":"2011-10-05T04:25:46.397","Score":"1","Body":"<p>Since the software and the phones are announced and will be shipping next week, it's OK for people to start asking questions about them.</p>\n","OwnerUserId":"13","LastActivityDate":"2011-10-05T04:25:46.397","CommentCount":"0"},{"Id":"830","PostTypeId":"1","AcceptedAnswerId":"833","CreationDate":"2011-10-05T08:04:05.333","Score":"4","ViewCount":"42","Body":"<p>While obviously these links are only available to those with sufficient privileges on the blog;</p>\n\n<p><img src=\"https://i.stack.imgur.com/s9rbl.png\" alt=\"BlogOverflow post screenshot\"></p>\n\n<p>I suspect the first Edit is a stray, because the trailing \" | Edit\" looks much better. Especially considering the otherwise-leading date information on this line.</p>\n","OwnerUserId":"1346","LastEditorUserId":"884","LastEditDate":"2011-10-05T21:24:22.050","LastActivityDate":"2012-02-03T00:08:29.673","Title":"Two edit links on the blog's post-meta line in single-post view","Tags":"<bug><status-completed><blog>","AnswerCount":"1","CommentCount":"3"},{"Id":"831","PostTypeId":"1","AcceptedAnswerId":"1008","CreationDate":"2011-10-05T12:28:16.813","Score":"13","ViewCount":"109","Body":"<p>I tried to create an iPhone 4S (iphone-4s) tag, but the system won't let me. I think it's a pluralization blocker (iMacs vs iMac). I was excited, because I've never created a tag before. </p>\n\n<p>Can this one be allowed? It's obviously the right tag for the upcoming hardware, and y'all have decided posts about the 4S are on-topic now.</p>\n","OwnerUserId":"9388","LastEditorUserId":"101","LastEditDate":"2012-01-21T11:30:45.093","LastActivityDate":"2012-01-21T11:31:02.613","Title":"Could we allow the creation of [iphone-4s] tag?","Tags":"<support><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"832","PostTypeId":"2","ParentId":"827","CreationDate":"2011-10-05T20:15:52.553","Score":"3","Body":"<p>I'm a bit skeptical of anything that relies on our chat being active at any particular time, and it would be a <em>lot</em> of pressure if we were expected to \"wow the crowd\" at being able to find answers quickly, especially in front of a crowd of \"IT and developer professionals\". Yikes.</p>\n\n<p>Honestly, I don't know what we should do. My only thought is we should send two or three people from SE and/or the community to put together a little presentation about the site, with an open invitation at the end to ask questions and post answers on the site. That way people can evaluate the site individually.</p>\n","OwnerUserId":"13","LastActivityDate":"2011-10-05T20:15:52.553","CommentCount":"0"},{"Id":"833","PostTypeId":"2","ParentId":"830","CreationDate":"2011-10-05T21:24:09.180","Score":"1","Body":"<p>Thanks for pointing this out.  I just deployed a fix.</p>\n","OwnerUserId":"884","LastActivityDate":"2011-10-05T21:24:09.180","CommentCount":"1"},{"Id":"835","PostTypeId":"1","AcceptedAnswerId":"841","CreationDate":"2011-10-05T23:16:32.633","Score":"3","ViewCount":"74","Body":"<p>On Ask Different, content in a <code>&lt;pre&gt;</code> element that is wider than the box will cause the box to scroll (CSS <code>overflow-x: scroll;</code>).</p>\n\n<p>On the Ask Different Blog, that doesn't happen. The too-wide content just overflows out of the box:</p>\n\n<p><img src=\"https://i.stack.imgur.com/DMzVt.png\" alt=\"enter image description here\"></p>\n\n<p>You can see the problem live on <a href=\"http://apple.blogoverflow.com/2011/10/applescript-sales-tax-calculator-variables-operations-and-comments/\" rel=\"nofollow noreferrer\">this blog post</a>.</p>\n\n<p>Adding <code>overflow-x: scroll;</code> to the <code>&lt;pre&gt;</code> fixes the issue; could one of the people with access to the theme make this tweak?</p>\n","OwnerUserId":"2220","LastEditorUserId":"6","LastEditDate":"2011-10-06T02:35:50.473","LastActivityDate":"2011-10-06T02:35:50.473","Title":"<pre> elements on blog don't scroll for overflow-x","Tags":"<bug><status-completed><design><blog>","AnswerCount":"1","CommentCount":"2"},{"Id":"836","PostTypeId":"1","CreationDate":"2011-10-05T23:20:10.397","Score":"0","ViewCount":"67","Body":"<p>There are times when it would be very useful to be able to use custom CSS for a blog post.</p>\n\n<p>Under the blog's Dashboard-> Appearance-> Stack Exchange Options, I see a <code>CSS Folder</code> option. Does that mean that the administrators can add CSS?</p>\n\n<p>If so, how can we access that folder?<br>\nIf not, is there a way we can work things out so that this is possible?</p>\n\n<p>Some use cases for this:</p>\n\n<ul>\n<li>We want to add some global styling that isn't part of the theme (think podcast player, App Store links, etc.)</li>\n<li>We want to do a one-off thing for a particular post that's more complex than the theme offers (think two side-by-side images, some huge text, or something colorful).</li>\n<li>We need to put a quick bug fix or patch in place so that we can get a post out (this would just be temporary until SE can deploy a fix).</li>\n</ul>\n\n<p><strong>Update:</strong></p>\n\n<p>I've tested and found that I can include some inline styles (<code>&lt;span style=\"color: green;\"&gt;hello world&lt;/span&gt;</code> works).<br>\nBut, it appears that this styling is subject to a whitelist (<code>overflow-x: scroll;</code> is stripped).<br>\nInline styles, of course, also don't allow us to make our own classes to reuse (think stuff we do a lot, like podcast guests' photos, a potential inline audio player, etc).</p>\n","OwnerUserId":"2220","LastEditorUserId":"2220","LastEditDate":"2011-10-06T22:40:01.227","LastActivityDate":"2012-01-05T00:27:58.773","Title":"Can Ask Different Blog administrators add custom CSS?","Tags":"<support><blog>","AnswerCount":"1","CommentCount":"0"},{"Id":"837","PostTypeId":"1","AcceptedAnswerId":"840","CreationDate":"2011-10-05T23:54:07.967","Score":"26","ViewCount":"390","Body":"<p>Can we add a banner on Ask Different in memory of Steve Jobs? RIP.</p>\n\n<p><img src=\"https://i.stack.imgur.com/u0O8g.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"638","LastEditorUserId":"7833","LastEditDate":"2012-05-29T19:01:11.400","LastActivityDate":"2012-05-29T19:01:11.400","Title":"Can we get a banner in memory of Steve Jobs on Ask Different?","Tags":"<feature-request><status-completed>","AnswerCount":"1","CommentCount":"0"},{"Id":"839","PostTypeId":"2","ParentId":"836","CreationDate":"2011-10-06T00:46:59.973","Score":"1","Body":"<p>No, there is not a means for this to be done via the ui.  That option is part of our custom theme, but it isn't for enabling css to be changed by admins.</p>\n\n<p>I'm not seeing a need to open this up.  I'd want to see a compelling case calling for it.</p>\n","OwnerUserId":"884","LastActivityDate":"2011-10-06T00:46:59.973","CommentCount":"1"},{"Id":"840","PostTypeId":"2","ParentId":"837","CreationDate":"2011-10-06T00:52:53.343","Score":"13","Body":"<p>I've posted a banner</p>\n\n<blockquote>\n  <p>Steve Jobs <a href=\"http://apple.com/stevejobs\" rel=\"nofollow\">passed away</a> on October 5th, 2011. Rest in peace.</p>\n</blockquote>\n\n<p>I'm open to suggestions on the wording/links.</p>\n","OwnerUserId":"2220","LastEditorUserId":"1346","LastEditDate":"2011-10-06T00:53:29.080","LastActivityDate":"2011-10-06T00:53:29.080","CommentCount":"8"},{"Id":"841","PostTypeId":"2","ParentId":"835","CreationDate":"2011-10-06T02:35:43.703","Score":"3","Body":"<p>The fix is live. Please hard refresh.</p>\n","OwnerUserId":"6","LastActivityDate":"2011-10-06T02:35:43.703","CommentCount":"0"},{"Id":"843","PostTypeId":"1","AcceptedAnswerId":"844","CreationDate":"2011-10-06T03:10:29.703","Score":"1","ViewCount":"125","Body":"<p><img src=\"https://i.stack.imgur.com/UNKPH.png\" alt=\"New bar\"></p>\n\n<p>Is this supposed to be here? It doesn't fit with the colour scheme of Ask Different, and it appeared recently, without warning or explanation (that I could find).</p>\n","OwnerUserId":"8690","LastEditorUserId":"884","LastEditDate":"2011-10-06T03:32:54.947","LastActivityDate":"2011-10-06T03:32:54.947","Title":"Is this supposed to look different?","Tags":"<support><design>","AnswerCount":"1","CommentCount":"5"},{"Id":"844","PostTypeId":"2","ParentId":"843","CreationDate":"2011-10-06T03:20:14.007","Score":"4","Body":"<p>It's the colors of the original Apple Logo: </p>\n\n<p><img src=\"https://i.stack.imgur.com/eVZlf.jpg\" alt=\"Apple Logo\"></p>\n\n<p>It appeared with the update to the site design that added the \"Steve Jobs passed away on October 5th, 2011. Rest in peace.\" line to the top.</p>\n","OwnerUserId":"7340","LastActivityDate":"2011-10-06T03:20:14.007","CommentCount":"2"},{"Id":"845","PostTypeId":"2","ParentId":"811","CreationDate":"2011-10-06T05:27:49.920","Score":"2","Body":"<p>I would like to contribute by reviewing iOS apps, if you think that's in scope for the blog.</p>\n","OwnerUserId":"7340","LastActivityDate":"2011-10-06T05:27:49.920","CommentCount":"3"},{"Id":"848","PostTypeId":"1","CreationDate":"2011-10-07T23:24:18.010","Score":"4","ViewCount":"37","Body":"<p>I just asked a question and noticed what I think is a bug.</p>\n\n<p>When you view a question that you have asked, you see the \"Know someone who can answer...\" message at the bottom, as well as the \"Would you like to have responses sent to you...\" message. You also see the \"Answer Your Question\" button.</p>\n\n<p><img src=\"https://i.stack.imgur.com/O34Ai.png\" alt=\"enter image description here\"></p>\n\n<p>The bug is that the button is displayed kinda-sorta on the same line as the \"Would you like to have\" message.<br>\nI assume that those are meant to be on different lines (as they are on other sites).</p>\n","OwnerUserId":"2220","LastEditorUserId":"5472","LastEditDate":"2013-09-26T21:07:54.283","LastActivityDate":"2013-09-26T21:07:54.283","Title":"Visual bug when viewing your own questions","Tags":"<bug><status-completed><design>","AnswerCount":"1","CommentCount":"1"},{"Id":"849","PostTypeId":"1","AcceptedAnswerId":"851","CreationDate":"2011-10-08T00:48:45.590","Score":"1","ViewCount":"72","Body":"<p>Im unsure about the appropriateness of questions about the origin of product names or other designations. For example I can't see the distinction between these questions: </p>\n\n<ul>\n<li><p><a href=\"https://apple.stackexchange.com/q/3313/4395\">What does the &quot;i&quot; in Apple product names mean?</a></p></li>\n<li><p><a href=\"https://apple.stackexchange.com/q/26837/4395\">Is there an official policy behind the &#39;S&#39; in &#39;iPhone 4S&#39; and &#39;iPhone 3GS&#39;?</a></p></li>\n</ul>\n\n<p>yet they were handled very differently, one was well received and the other was closed as being \"not constructive\".</p>\n\n<p>Is either appropriate? </p>\n","OwnerUserId":"4395","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2011-10-08T06:57:04.713","Title":"Are product designation or naming questions appropriate here?","Tags":"<discussion><questions>","AnswerCount":"2","CommentCount":"0"},{"Id":"850","PostTypeId":"2","ParentId":"849","CreationDate":"2011-10-08T01:42:54.633","Score":"3","Body":"<p>I closed your iPhone question because of the discussion that came below it in the comments. By the time I got there, behind the scenes it was flagged three times and five mods—even some from community management—looked at it. It came on the day of Steve Jobs' death, emotions were still raw, and the overall discussion—public and private—was quickly diverting away from the original topic with one of the early comments. I don't like closing questions, but better safe than sorry.</p>\n\n<p>As for the question itself, it is, at least at this point, unanswerable without a citation, and therefore would be considered not constructive. The question you linked to before has multiple citations in the answers, but Apple has become a lot more quiet over the past several years about the naming standards of their products. It's an interesting question, even if only a footnote in Apple canon, but not one that is going to get much in the way of a quality answer these days that the SE sites strive to achieve.</p>\n\n<p>One unsolicited piece of advice that I will give is that what happened to you is has happened to even the best of us here, and to please keep on engaging the community. People will vote the way that they want, but the moderators have pretty clear guidelines as to what to do and you stumbled into a bit of a grey area, more on the murkier side of things. If anything, you found a new boundary for the community and that is always a good thing. </p>\n\n<p>I say, carry on as you were and welcome to the site.</p>\n","OwnerUserId":"212","LastActivityDate":"2011-10-08T01:42:54.633","CommentCount":"4"},{"Id":"851","PostTypeId":"2","ParentId":"849","CreationDate":"2011-10-08T06:57:04.713","Score":"2","Body":"<p>Yes, the two questions were handled differently, for a good reason.</p>\n\n<ul>\n<li><h2><a href=\"https://apple.stackexchange.com/questions/3313/what-does-the-i-in-apple-product-names-mean/3315#3315\"><strong>What does the “i” in Apple product names mean?</strong></a></h2>\n\n<p>has an accepted answer that says:</p>\n\n<blockquote>\n  <h3>Apple declared the “i” in iMac to stand for “Internet”</h3>\n</blockquote>\n\n<p>and included a citation for that statement. </p>\n\n<p>In short: <strong>it was possible to give an accurate referenced answer to the question.</strong></p></li>\n<li><h2><a href=\"https://apple.stackexchange.com/questions/26837/is-there-an-official-policy-behind-the-s-in-iphone-4s-and-iphone-3gs\"><strong>Is there an official policy behind the 'S' in 'iPhone 4S' and 'iPhone 3GS'?</strong></a></h2>\n\n<p>Let's start by looking at Stack Exchange policy, as given in <a href=\"http://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/\">Good Subjective, Bad Subjective</a> and <a href=\"http://blog.stackoverflow.com/2011/01/real-questions-have-answers/\">Real Questions Have Answers</a>:</p>\n\n<blockquote>\n  <p>Constructive subjective questions:</p>\n  \n  <ol>\n  <li>inspire answers that explain “why” and “how”.</li>\n  <li>tend to have long, not short, answers.</li>\n  <li>have a constructive, fair, and impartial tone.</li>\n  <li>invite sharing experiences over opinions.</li>\n  <li>insist that opinion be backed up with facts and references.</li>\n  <li>are more than just mindless social fun.</li>\n  </ol>\n  \n  <p>…</p>\n</blockquote>\n\n<p><strong>How many of those are true about this question?</strong> Personally, I count zero.</p>\n\n<p>Next, look at <a href=\"https://apple.stackexchange.com/faq#dontask\"><strong>this site's FAQ</strong></a>:</p>\n\n<blockquote>\n  <h3>What kind of questions should I not ask here?</h3>\n  \n  <p>You should only ask practical, answerable questions based on actual problems that you face. Chatty, open-ended questions diminish the usefulness of our site and push other questions off the front page.</p>\n</blockquote>\n\n<ul>\n<li>Is the question practical? <strong>No</strong></li>\n<li>Is the question answerable?  <strong>No</strong></li>\n<li>Is the question based on an actual problem you face?  <strong>No</strong></li>\n</ul>\n\n<p>End result: <strong>This question is subjective, non-constructive, meaningless, and unanswerable—so it shouldn't be here.</strong></p></li>\n</ul>\n\n<p>If, at some future point, Apple <em>did</em> publicly release an official policy, it would <em>then</em> be an answerable question. But until then? Close it.</p>\n","OwnerUserId":"351","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2011-10-08T06:57:04.713","CommentCount":"1"},{"Id":"852","PostTypeId":"1","AcceptedAnswerId":"853","CreationDate":"2011-10-09T17:44:20.137","Score":"3","ViewCount":"54","Body":"<p>Several days ago, I <a href=\"https://apple.stackexchange.com/q/27062\">successfully suggested an edit to a tag wiki</a>, yet for some reason I haven't earned the bronze <a href=\"https://apple.stackexchange.com/badges/53/tag-editor\">tag editor</a> badge. Does anyone know why not?</p>\n","OwnerUserId":"9388","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2011-10-13T13:06:02.960","Title":"I successfully suggested an edit to a tag wiki. Why no [tag editor] bronze badge?","Tags":"<bug><status-bydesign><badges>","AnswerCount":"1","CommentCount":"0"},{"Id":"853","PostTypeId":"2","ParentId":"852","CreationDate":"2011-10-09T23:40:24.260","Score":"2","Body":"<p>To get the badge you need to not only edit the summary, but also edit the full article on that tag. It's the big box under the summary that you left empty. </p>\n\n<p>In this spot you would put a fuller description of it, in this case perhaps the changes from iPhone 4 to iPhone 4S</p>\n\n<p><img src=\"https://i.stack.imgur.com/g3hAo.png\" alt=\"\"></p>\n","OwnerUserId":"6509","LastActivityDate":"2011-10-09T23:40:24.260","CommentCount":"2"},{"Id":"854","PostTypeId":"1","AcceptedAnswerId":"1014","CreationDate":"2011-10-10T03:11:21.363","Score":"2","ViewCount":"40","Body":"<p>When viewing the <a href=\"http://apple.blogoverflow.com\" rel=\"nofollow\">Ask Different blog</a> when logged in, the Dashboard/Navigation bar is visible. On page load, the profile tab (the tab with your name on it) opens until you move your mouse. It's a bit distracting, and I'm fairly certain it's not supposed to happen.</p>\n\n<p>I recorded a quick video demonstrating the issue:<br>\n<a href=\"http://www.youtube.com/watch?v=hJoxt7M41SA\" rel=\"nofollow\">http://www.youtube.com/watch?v=hJoxt7M41SA</a></p>\n\n<p>Upon further examination, it appears to be happening on the main page, and a single blog post page. It does <em>not</em> happen on \"pages\" (like, <a href=\"http://apple.blogoverflow.com/for-podcast-guests/\" rel=\"nofollow\">for podcast guests</a>), nor the archive/about page.</p>\n","OwnerUserId":"1346","LastEditorUserId":"884","LastEditDate":"2012-01-24T00:10:32.337","LastActivityDate":"2012-01-24T00:10:32.337","Title":"Profile Menubar Tab Opens Automatically","Tags":"<bug><status-completed><blog>","AnswerCount":"1","CommentCount":"1"},{"Id":"855","PostTypeId":"2","ParentId":"811","CreationDate":"2011-10-10T08:28:40.140","Score":"4","Body":"<p>I'd be willing to review a couple of utility apps that make my \"Mac-life\" a lot easier, feel free to hook me up.</p>\n","OwnerUserId":"6376","LastActivityDate":"2011-10-10T08:28:40.140","CommentCount":"3"},{"Id":"856","PostTypeId":"1","AcceptedAnswerId":"857","CreationDate":"2011-10-11T02:59:43.377","Score":"4","ViewCount":"78","Body":"<p>In <i><a href=\"https://apple.stackexchange.com/questions/27205/selective-sharing-of-public\">this question</a></i> a user has answered the question twice; is this acceptable, or should the answers be combined?</p>\n","OwnerUserId":"8690","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2011-10-11T03:41:25.233","Title":"Is it acceptable for a user to have multiple answers for the same question?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"857","PostTypeId":"2","ParentId":"856","CreationDate":"2011-10-11T03:41:25.233","Score":"4","Body":"<p>I'd say usually it's a good idea to answer once. The software allows multiple answers (the \"Add answer\" button turns into a \"Add another answer\", and suggests combining, but permits a second answer to be posted. There are certainly multiple examples of questions with multiple answers (sometime I should revise this and include links, but I won't right now). But this question poses a case that is far from ideal, I would agree.</p>\n\n<p>In the case you linked to, there are multiple questions asked in one question post. I answered twice because I was hoping the question would be split into two, and I'd move one of my answers to the second question. But since then I've been in dialog with the OP, and now I think the best solution is to revise the question, and then revise one answer (and delete the other). But we haven't done that yet.</p>\n","OwnerUserId":"9388","LastActivityDate":"2011-10-11T03:41:25.233","CommentCount":"1"},{"Id":"858","PostTypeId":"1","CreationDate":"2011-10-12T20:36:31.907","Score":"14","ViewCount":"331","Body":"<p>Now that iOS 5 is shipping, there will be zillions of iPhone, iPad, and iPod Touch users upgrading, and they'll have lots of questions. And since all those questions will be new, Ask Different will have as good a shot at having the best answer than any of those, you know, competitive sites. Essentially, this is a great time to recruit new members!</p>\n\n<p>What can you do to help?</p>\n\n<p>As you install and learn iOS 5, whenever you have questions, no matter how silly, ask them here. You're not the only one having that question. Millions of other people will, too. Ask them even if you think you're going to be able to find the answer yourself... and if you do find the answer, go ahead and answer it yourself.</p>\n\n<p>When answering iOS 5 questions, do everything you can to overkill it. Don't just answer with a hyperlink to some other discussion group somewhere. Write a detailed, step-by-step, ultra-clear guide with screenshots and examples. Help us have the best possible answer to the common problems and questions people have with iOS 5.</p>\n\n<p>If a question comes in that is unclear, badly written, badly formatted, or in bad English, edit it into shape. We've always encouraged edits that improve spelling, grammar, and clarity. Make every question into a full sentence.</p>\n\n<p>This is a great opportunity to build up a body of answers to common iOS 5 questions that will be super-popular in the coming weeks as the rest of the iPhone universe upgrades. Those questions will bring in lots of traffic from search engines and if Ask Different continues to have great answers like we have in the past, we stand a chance of attracting some great new users who will add value for years to come.</p>\n\n<p>(If this post looks familiar, it's because it's nearly identical to <a href=\"https://apple.meta.stackexchange.com/questions/589/now-that-lion-is-out-help-promote-ask-different\">the one Joel posted</a> when Lion first came out. The rule still applies! Let's do it!)</p>\n","OwnerUserId":"7749","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2011-10-12T20:39:03.373","Title":"Now that iOS 5 is out, help promote Ask Different","Tags":"<discussion>","AnswerCount":"0","CommentCount":"0","ClosedDate":"2013-06-02T00:15:17.990"},{"Id":"859","PostTypeId":"1","AcceptedAnswerId":"860","CreationDate":"2011-10-13T22:54:45.467","Score":"13","ViewCount":"250","Body":"<p>So what's the difference (assuming i'm asking an apple related question)?</p>\n","OwnerUserId":"6439","LastEditorUserId":"37797","LastEditDate":"2014-06-01T11:05:17.607","LastActivityDate":"2014-06-01T11:05:17.607","Title":"When should I ask here, and when should I ask at Super User?","Tags":"<discussion><site-scope><questions><asking-questions>","AnswerCount":"3","CommentCount":"1","FavoriteCount":"1"},{"Id":"860","PostTypeId":"2","ParentId":"859","CreationDate":"2011-10-13T23:02:47.220","Score":"7","Body":"<p>If it's a Mac question, you may ask on whichever site you prefer. If it's not a Mac question, or if it involves other Apple devices with your Mac, you should ask it here.</p>\n","OwnerUserId":"13","LastActivityDate":"2011-10-13T23:02:47.220","CommentCount":"1"},{"Id":"862","PostTypeId":"1","AcceptedAnswerId":"866","CreationDate":"2011-10-16T03:27:14.317","Score":"6","ViewCount":"71","Body":"<p>I am unable to post a question because \"it does not meet our quality standards\":</p>\n\n<p><img src=\"https://i.stack.imgur.com/MMuXc.png\" alt=\"It does not meet our quality standards\"></p>\n\n<p>Where can I learn about said standards? I see no mention of them in the FAQ.</p>\n","OwnerUserId":"6408","LastActivityDate":"2014-04-23T08:48:43.713","Title":"What are this site's quality standards?","Tags":"<support><asking-questions>","AnswerCount":"2","CommentCount":"0"},{"Id":"863","PostTypeId":"2","ParentId":"862","CreationDate":"2011-10-16T03:30:05.833","Score":"4","Body":"<p>My guess is that the system is rejecting your question because it's too short. Explain why you want to delete your contacts, if you have your contacts set to sync to your computer or an internet service, etc. Also of use is to tell us what you've already tried and what didn't work.</p>\n","OwnerUserId":"13","LastActivityDate":"2011-10-16T03:30:05.833","CommentCount":"0"},{"Id":"864","PostTypeId":"1","AcceptedAnswerId":"867","CreationDate":"2011-10-16T08:34:42.080","Score":"0","ViewCount":"56","Body":"<p>I've occasionally stumbled into Q&amp;A's that have more than 1 answer and an accepted answer, but the accepted answer isn't on top of the answer list.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/26601/ipad-calculator-app\">iPad calculator app</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/21817/lion-keeps-reindexing-spotlight-why\">Why does Spotlight keep reindexing my system after updating to Lion?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/15351/ipad-2-cannot-connect-to-home-wifi-network\">iPad 2 cannot connect to home wifi network</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/8668/why-are-applications-like-adobe-fireworks-and-appcelerator-titanium-crashing-o\">Why are applications (like Adobe Fireworks and Appcelerator Titanium) crashing on startup?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/11855/how-can-i-enable-internet-sharing-without-using-the-gui-or-applescript\">How can I enable Internet sharing without using the GUI or AppleScript?</a></li>\n</ul>\n\n<p>Here's a screenshot with Chrome &amp; Lion:</p>\n\n<p><img src=\"https://i.stack.imgur.com/an3BW.png\" alt=\"enter image description here\"></p>\n\n<p>Is this a feature or a bug?</p>\n\n<p><strong>Yes, I have answers sorted by \"active\"</strong>. But usually accepted answer overrides it; for example, these list the answers with accepted on top:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/20085/does-the-oleophobic-effect-of-the-iphone-screen-wear-off-over-time\">Does the oleophobic effect of the iPhone screen wear off over time?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/8806/is-there-a-way-to-stream-video-to-an-apple-tv-without-itunes\">Is there a way to stream video to an Apple TV without iTunes?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/18857/is-screen-zoom-broken-in-lion\">Is screen zoom broken in Lion?</a></li>\n</ul>\n","OwnerUserId":"1453","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2011-10-18T08:32:33.097","Title":"Accepted answers sometimes are not above all the other answers","Tags":"<support>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"866","PostTypeId":"2","ParentId":"862","CreationDate":"2011-10-16T12:51:01.347","Score":"3","Body":"<p>From the <strong><a href=\"https://meta.stackexchange.com/questions/7931/faq-for-stack-exchange-sites\">Community FAQ</a></strong></p>\n\n<h3><a href=\"https://meta.stackexchange.com/questions/92074/what-can-i-do-when-getting-it-does-not-meet-our-quality-standards/92075#92075\">What can I do when getting “It does not meet our quality standards”?</a></h3>\n\n<blockquote>\n  <blockquote>\n    <p>Make sure your question has</p>\n    \n    <ul>\n    <li>a clear title</li>\n    <li>a reasonable explanation of what your question is, sharing your research on the matter</li>\n    <li>correct use of English and actual sentences</li>\n    </ul>\n    \n    <p>If your question is so brief that it could be looked up in a dictionary or reference book/site trivially, it might not be a good fit on our network. (source: Jeff)</p>\n  </blockquote>\n  \n  <p>Exact details about the algorithm are not being released by the team.</p>\n</blockquote>\n\n<p>Answer provided by <a href=\"https://meta.stackoverflow.com/users/131713/popular-demand\">Popular Demand</a>.</p>\n\n<hr>\n\n<p><a href=\"https://apple.meta.stackexchange.com/questions/862/what-are-this-sites-quality-standards/863#863\">Kyle Cronin's answer</a> includes some good practical examples on how to improve your specific question.</p>\n","OwnerUserId":"1453","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2011-10-16T12:51:01.347","CommentCount":"1"},{"Id":"867","PostTypeId":"2","ParentId":"864","CreationDate":"2011-10-17T06:56:55.597","Score":"2","Body":"<p>Self answers do not follow the accepted answers is always on top rule. They are sorted as per normal. Only answers you accept from someone else will always be on top.</p>\n","OwnerUserId":"58","LastActivityDate":"2011-10-17T06:56:55.597","CommentCount":"1"},{"Id":"868","PostTypeId":"1","AcceptedAnswerId":"869","CreationDate":"2011-10-17T19:45:59.633","Score":"3","ViewCount":"73","Body":"<p>I asked a question on AskDifferent and someone replied to it by deleting it. I got 2 notifications that my question has been answered but now that I've logged in to the site, I cannot see those comments as the question has been deleted.</p>\n\n<p>How am I supposed to even know the reason of the deletion if I cannot view the comments, find out who deleted by question or look at the question?</p>\n\n<p>It's sad that someone just deleted the question without me even being able to look at the reasons why my question was wrong.</p>\n\n<p>Can someone tell me how to see those comments??</p>\n","OwnerUserId":"7345","LastEditorUserId":"7833","LastEditDate":"2012-01-07T20:14:47.940","LastActivityDate":"2012-01-07T20:14:47.940","Title":"How can I view comments on deleted Questions?","Tags":"<discussion><deleted-questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"869","PostTypeId":"2","ParentId":"868","CreationDate":"2011-10-17T20:48:24.693","Score":"5","Body":"<p>I deleted your question. You left the access keys to a website in the code. They were deleted, but that simply moves the keys into the history, they don't get completely removed. Since there is no way for me delete a specific version of a question entirely, the entire question got deleted.</p>\n\n<p>You may repost the question but without the access keys. Next time please take time to sanitize your code before posting it.</p>\n","OwnerUserId":"212","LastActivityDate":"2011-10-17T20:48:24.693","CommentCount":"5"},{"Id":"870","PostTypeId":"2","ParentId":"568","CreationDate":"2011-10-19T16:04:28.413","Score":"1","Body":"<p>I would be happy to help too! I really enjoy video editing. I use iMovie (not that much anymore), FCE 4, iDVD, and have used DVDSP some. \nAnd I would love to get a copy of FCPX because I don't have multi-cam editing on FCE (something which Apple has promised will come out in spring 2012)</p>\n","OwnerUserId":"7833","LastActivityDate":"2011-10-19T16:04:28.413","CommentCount":"0"},{"Id":"871","PostTypeId":"2","ParentId":"811","CreationDate":"2011-10-19T16:34:01.743","Score":"0","Body":"<p>I can write, but not too often (school...) as long as I have a topic to write about. I don't have Lion, and I don't have an iOS device, so I'm somewhat limited in what I can write about.</p>\n","OwnerUserId":"7833","LastActivityDate":"2011-10-19T16:34:01.743","CommentCount":"1"},{"Id":"874","PostTypeId":"1","AcceptedAnswerId":"876","CreationDate":"2011-10-20T05:37:38.820","Score":"1","ViewCount":"88","Body":"<p>Why can't you @reply more than one user? It seems like I should be able to @reply at least two users. I've run into this problem several times now. Is there a reason why you can only @reply one user?</p>\n","OwnerUserId":"7833","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Why can't you @reply more than one user?","Tags":"<discussion>","AnswerCount":"2","CommentCount":"0"},{"Id":"875","PostTypeId":"2","ParentId":"874","CreationDate":"2011-10-20T13:25:58.317","Score":"2","Body":"<p>From <a href=\"https://meta.stackexchange.com/questions/43019/how-do-comment-replies-work\">this</a> Meta SO answer</p>\n\n<blockquote>\n  <p>You can explicitly notify one (1) other commenter or editor, by using @name, where name is the username with all spaces removed.</p>\n</blockquote>\n\n<p>It contains most of the details behind the system, however the short answer is that it is related to the lack of display names, and it was really a system put in place as an afterthought, since it is not a defining feature of SE. </p>\n","OwnerUserId":"58","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2011-10-20T13:25:58.317","CommentCount":"0"},{"Id":"876","PostTypeId":"2","ParentId":"874","CreationDate":"2011-10-20T15:38:14.027","Score":"3","Body":"<p>This would be useful on occasion, I can't deny...</p>\n\n<p>But the <em>rationale</em> is simply that comments aren't meant for tangential discussion. The author of the post you're commenting on is always notified, regardless of whether he's \"@-replied\" to explicitly in a comment. Responding to one of these comments requires only a single @-reply. Allowing comments to notify multiple people could result in obnoxious behavior or harassment.</p>\n\n<p>As Diago notes, this has been discussed several times over on MetaSO - <a href=\"https://meta.stackexchange.com/questions/45273/allow-more-than-one-name-notification-per-comment\">this is a good example</a>. </p>\n\n<p>It's worth contrasting the design of comment @-notifications with those of <a href=\"http://chat.stackexchange.com/\">chat</a>, where you <em>can</em> notify multiple users in a single message:</p>\n\n<ul>\n<li>Comments always notify the post-author, regardless of @... Chat messages appear to anyone in the room.</li>\n<li>Comments can @-notify anyone who has ever commented / edited the post... Chat messages can notify anyone who has been in the room <em>recently</em>.</li>\n<li>Comment notifications persist in your global SE inbox... Chat notifications produce a small indicator <em>within chat</em>, with an entry in the SE inbox only if you don't respond.</li>\n<li>You can only leave one comment every 15 seconds... You can post multiple chat messages within that timespan.</li>\n</ul>\n\n<p>In short, chat messages will only notify people who are probably expecting them, having recently joined a chat room for the purpose of chatting. Comments might notify people who've long ago forgotten about the topic. Making it easier to mass-notify multiple users via comments has a much larger \"harassment\" potential.</p>\n","OwnerUserId":"4604","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2011-10-20T15:38:14.027","CommentCount":"8"},{"Id":"877","PostTypeId":"2","ParentId":"783","CreationDate":"2011-10-20T22:20:14.257","Score":"1","Body":"<p>As a brand new user I have definitely felt there is less voting activity here than I expected. I thought that with all the attention around Apple products right now that any decent questions would get a lot of attention and votes.</p>\n\n<p>I asked a question that I think is pretty relevant to many of users, is not obvious in documentation, and is very answerable by somebody who uses the feature more than I do:</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/28457/exactly-what-are-the-limitations-of-geofenced-reminders-in-ios5\">Exactly what are the limitations of geofenced reminders?</a></p>\n\n<p>For a while it sat with no votes, though over time it is slowly collecting a few. I guess my assumption is that a lot of people just use this as a resource and don't feel like they owe something to the community. Hard to determine/fix that though - and maybe it is too early for me to know...</p>\n\n<p>Another surprise is that nobody has answered the question quickly. On another (private) stackexchange site I use any time somebody posts a question that could be answered in a straight forward way by doing a bit of testing - people pounce on it for the opportunity to gain rep!</p>\n","OwnerUserId":"12418","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2011-10-21T16:00:50.993","CommentCount":"0"},{"Id":"878","PostTypeId":"1","CreationDate":"2011-10-21T19:39:38.790","Score":"0","ViewCount":"104","Body":"<p><a href=\"https://apple.stackexchange.com/questions/28470/what-are-some-of-your-favorite-plugins-for-quicksilver\">This question</a> was closed due to not having a wide enough audience. I personally think that it should be reopened, as many people do use Quicksilver. What are your thoughts?</p>\n","OwnerUserId":"7833","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2011-10-28T20:47:41.387","Title":"Considering reopening this question","Tags":"<discussion><closed-questions>","AnswerCount":"2","CommentCount":"1"},{"Id":"879","PostTypeId":"2","ParentId":"878","CreationDate":"2011-10-21T21:25:15.613","Score":"1","Body":"<p>I agree with Nathan. Although Apple.SE is very relaxed regarding the list rule, making one for every application out there is simply overkill, and to be honest, will most likely chase regulars away that want to answer high quality questions and find lists a distraction. </p>\n\n<p><em>FYI: This is what happened on SU and why we killed lists completely</em></p>\n\n<p>As far as QuickSilver goes, it has been badly maintained and there has been great replacements out there like Alfred and LaunchBar, so do we know start a list for every one of these when there is already quite a few google-able resources out there that does have list of valuable plugins?</p>\n\n<p>Do we really want to use list to get Google traffic which is simply just going to have users post questions to create more lists?</p>\n\n<p><sub><strong>Dislaimer</strong></sub></p>\n\n<p><sub>I am extremely anti-list and personally feel it's an abuse of the SE system and principles to allow them. I will therefore admit this answer is biased.</sub></p>\n","OwnerUserId":"58","LastActivityDate":"2011-10-21T21:25:15.613","CommentCount":"1"},{"Id":"880","PostTypeId":"1","CreationDate":"2011-10-22T05:58:57.007","Score":"-1","ViewCount":"87","Body":"<p>I had problems with my iOS device, because it was running on iOS 5 Beta 7 and the device became unusable as the Beta expired. I had no idea what to do with it and how to restore it to normal mode, so naturally I turned to Apple SE for help and asked my question. </p>\n\n<p>The question was quickly closed as not appropriate because of the following: </p>\n\n<pre><code> Welcome to Ask Different! Questions about pre release software are off topic for this site. Please take a look at the FAQs for more info. \n</code></pre>\n\n<p>I think the problem itself is a real problem that causes problems to iOS users. I find really disheartening these rules. They are discouraging me from asking questions related to apple. I feel that this rule is somehow in conflict with the sole purpose of the site. </p>\n","OwnerUserId":"132","LastActivityDate":"2011-10-22T06:55:02.217","Title":"Discussion of Beta software is against the FAQ","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"881","PostTypeId":"2","ParentId":"880","CreationDate":"2011-10-22T06:55:02.217","Score":"3","Body":"<p>Actually your question was meant to be closed as a duplicate since it was asked earlier already, and that question was left open with the same warning.</p>\n\n<p>The reason we do not allow questions around Beta software, specifically with regard to Apple, is due to the fact that all Apple Beta Software is under a strict NDA that every developer has to agree to when joining the program. Allowing one opens up a whole new set of issues. Also since Apple.SE is a public site, the last thing we need is Apple coming down on the site for allowing NDA material to be publicly released.</p>\n\n<p>I have to be honest, since you brought it up and as a Apple Dev myself, how is it that registered developers are not aware that Betas expire, since every one of the iOS 5 betas did, nor that they were not aware that the GM was released more then 2 weeks ago and almost a week before the public received it to the devs? It bring the legitimacy of the question, in question, on that point alone. This <code>problem</code> will only occur when your a registered Apple Developer or you happened to get a copy of the IPSW of the beta through illegal means, and the latter we do not support, nor should we.</p>\n\n<p>I don't see how this rule is in conflict with the purpose on the site, since there is already more then 95% of question <strong>not related to beta software</strong>?</p>\n","OwnerUserId":"58","LastActivityDate":"2011-10-22T06:55:02.217","CommentCount":"3"},{"Id":"882","PostTypeId":"1","CreationDate":"2011-10-23T15:25:14.613","Score":"7","ViewCount":"111","Body":"<p>Sometimes users (especially new ones) post several good, substantive questions in a single post. This leads to all sorts of chaos with regard to the answers, and we have the one-question-per-question-post rule to prohibit this. But particularly when there are two good questions in the post, the tools currently available seem unfortunate. Either the question could be edited to delete one of the questions, or the question could be closed and the OP could be asked to submit the questions separately. Particularly with new posters, they seem more likely to go away than to do that. And then we lose out on good questions.</p>\n\n<p>Is there any way moderators could have the power to split a post into multiple posts, each attributed to the OP? That way we wouldn't have to lose good questions, but the answers could be kept in order also.</p>\n","OwnerUserId":"9388","LastActivityDate":"2011-11-04T17:02:04.950","Title":"Enforcing one-question-per-question","Tags":"<discussion><feature-request><moderation>","AnswerCount":"2","CommentCount":"0"},{"Id":"883","PostTypeId":"2","ParentId":"882","CreationDate":"2011-10-25T16:21:39.497","Score":"4","Body":"<p>Flag these questions ( but only if you can't edit it yourself )</p>\n\n<p>Post them to the chat room if you'd like editing help or a second opinion. </p>\n\n<p>Edit them mercilessly. (but kindly - leave a comment that you want the one true question to ring out and let the questioner know they can surely re-edit or ask again)</p>\n\n<p>Attacking this is tough. Especially when you want to be kind to a new person, not assume you know what they have spoken, don't want to change their meaning.</p>\n\n<p>But - the edit system allows them to revert things, tune your tune-up, and generally encourages everyone to step up and edit or at least flag it.</p>\n\n<p>I think the tools are there if we all start using them. Have you seen a question where flagging or editing wasn't the appropriate way to handle this sort of generality?</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2011-11-04T17:02:04.950","LastActivityDate":"2011-11-04T17:02:04.950","CommentCount":"3"},{"Id":"884","PostTypeId":"1","CreationDate":"2011-10-25T16:51:53.893","Score":"6","ViewCount":"76","Body":"<p>I often find myself not uploading a screen capture from my iPhone since the default size of a retina sized picture is quite large.</p>\n\n<p><img src=\"https://i.stack.imgur.com/hTT83.jpg\" alt=\"iPhone 4 portrait screen capture\"></p>\n\n<p>In landscape it would be quite intimidating if the system didn't already scale it down...\n<img src=\"https://i.stack.imgur.com/QHuOH.jpg\" alt=\"iPhone 4 landscape screen capture\"></p>\n\n<p>Would it be possible to get the system to automatically tweak images uploaded to this site that match these exact iOS pixel sizes by default?</p>\n\n<p>It would be best if the non retina devices looked like retina devices.</p>\n\n<p>Optionally, you could add some text to the post so advanced users that <em>really</em> wanted the raw image size could over-rule it if you worried about that in practice?</p>\n\n<p>This question shows how in practice, some editorial time is being taken to implement this in a less than standard way. <a href=\"https://apple.stackexchange.com/users/1346/vxjasonxv\">Jason</a> has done a marvelous job of curating the pictures here, but perhaps a designer's eye could tweak or bless his choice of 200 pixels and assist everyone who uploads iOS standard screen shots so they all look the same on the site.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/27761/what-tiny-thing-in-ios-5-makes-you-smile-or-has-caught-you-off-guard\">What tiny thing in iOS 5 makes you smile, or has caught you off guard?</a></li>\n</ul>\n\n<p>Super bonus points for a cool breakout function similar to how the 1k user's get a bigger view on a mouse over event, but perhaps that's asking for too much.</p>\n\n<p>Here are the iPad sizes for comparison...</p>\n\n<p><img src=\"https://i.stack.imgur.com/fJpCf.jpg\" alt=\"iPad portrait screen capture\"></p>\n\n<p><img src=\"https://i.stack.imgur.com/mg6QB.jpg\" alt=\"iPad landscape screen capture\"></p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2011-10-28T23:12:00.973","Title":"Pixelpalooza - Requesting a feature to normalize sizing of portrait iOS screen images by default (not just for landscape images)","Tags":"<feature-request>","AnswerCount":"1","CommentCount":"1"},{"Id":"885","PostTypeId":"2","ParentId":"878","CreationDate":"2011-10-25T17:36:47.610","Score":"3","Body":"<p>I also think that question should be closed / deleted.</p>\n\n<p>I don't see how the question as asked makes good use of this site.</p>\n\n<p>Why not edit the wikipedia entry for that software to list the great plugins?</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Quicksilver_(software)\" rel=\"nofollow noreferrer\">http://en.wikipedia.org/wiki/Quicksilver_(software)</a></p>\n\n<p>Once that was done, you could add it to the <a href=\"https://apple.stackexchange.com/questions/tagged/quicksilver\">quicksilver tag wiki</a> for more information on that software.</p>\n\n<p>In the mean time, it's OK to ask really specific questions that show how awesome some plug-ins can be. Maybe try one or two questions and see if the answers are voted highly.</p>\n\n<p>Don't rush to ask all manner of leading questions, but if there is one or two killer plug-ins that you can't do in Launchbar, why not ask and then later answer that question here on the site?</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2011-10-27T18:05:18.490","CommentCount":"0"},{"Id":"886","PostTypeId":"1","AcceptedAnswerId":"895","CreationDate":"2011-10-26T07:40:06.280","Score":"4","ViewCount":"100","Body":"<p>We are getting more and more questions about iCloud, and if you go through the <a href=\"https://apple.stackexchange.com/questions/tagged/icloud\" class=\"post-tag\" title=\"show questions tagged &#39;icloud&#39;\" rel=\"tag\">icloud</a> you will find a lot of them relate to people misunderstanding iCloud and how it works, including backup.</p>\n\n<p>On SU we handle these by creating a canonical question which we can use to close all these questions and not have to repeat the answers.</p>\n\n<p>(I have answered a few of these and I often copy and paste from my previous answers)</p>\n\n<p>Thoughts? Ideas? Should we do it?</p>\n","OwnerUserId":"58","LastActivityDate":"2011-10-30T04:14:59.647","Title":"Should we create a canonical iCloud Q&A question?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"3"},{"Id":"887","PostTypeId":"1","CreationDate":"2011-10-27T13:10:27.863","Score":"8","ViewCount":"121","Body":"<p>I noticed lately a lot of \"which Mac is the best for...\" questions.</p>\n\n<p>Here is a list, and I practically only used the <a href=\"https://apple.stackexchange.com/questions/tagged/development\" class=\"post-tag\" title=\"show questions tagged &#39;development&#39;\" rel=\"tag\">development</a> tag:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/29377/which-macbook-pro-configuration-is-best-suitable-for-iphone-ipad-app-development\">Which MacBook Pro configuration is best suitable for Iphone/Ipad App development?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/3295/what-are-good-specs-for-a-macbook-to-develop-on-ios-with\">What are minimum specs for a MacBook to develop iOS apps?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/29245/best-performance-macbook-for-xcode\">https://apple.stackexchange.com/questions/29245/best-performance-macbook-for-xcode</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/28493/is-a-macbook-pro-good-enough-for-software-development-or-is-an-imac-a-better-opt\">https://apple.stackexchange.com/questions/28493/is-a-macbook-pro-good-enough-for-software-development-or-is-an-imac-a-better-opt</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/3365/should-i-get-a-macbook-air-or-pro-for-ruby-on-rails-development-while-traveling\">https://apple.stackexchange.com/questions/3365/should-i-get-a-macbook-air-or-pro-for-ruby-on-rails-development-while-traveling</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/6650/is-the-white-macbook-suitable-for-software-development\">Is the white MacBook suitable for software development?</a></li>\n</ul>\n\n<p>Some of them are closed, a lot still open. </p>\n\n<p>So we should either <strong>close them</strong> all - in the end, they kind of belong to the <em>shopping</em>-style question - or, like Diago suggested for the iCloud questions, have a <strong>canonical question</strong>, with each MacBook and their specs as a separate answer, so we can close the other questions as a duplicate of this one.</p>\n\n<p>My opinion would be to simply close them, but let's see what the community has to say about this.</p>\n","OwnerUserId":"90","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2011-10-28T23:01:40.270","Title":"Should we forbid all \"Which Mac is the best for...\" questions?","Tags":"<discussion><voting>","AnswerCount":"3","CommentCount":"0"},{"Id":"888","PostTypeId":"2","ParentId":"887","CreationDate":"2011-10-27T16:21:42.720","Score":"5","Body":"<p>I do like the idea of a canonical question for this one. That way, most can be closed as duplicates, and those whose authors think the canonical question doesn't answer their question can provide more information to distinguish what makes their case different. Then, if their case is different but not too localized, they can be reopened.</p>\n","OwnerUserId":"9388","LastActivityDate":"2011-10-27T16:21:42.720","CommentCount":"0"},{"Id":"889","PostTypeId":"2","ParentId":"887","CreationDate":"2011-10-27T17:08:49.620","Score":"2","Body":"<p>I would say no - don't close them unless they clearly are bad questions.</p>\n\n<p>I was personally dissapointed that the \"http://apple.stackexchange.com/questions/29377/which-macbook-pro-configuration-is-best-suitable-for-iphone-ipad-app-development\" question got closed and will try to fix it and get it undeleted.</p>\n\n<p>Even when the question is worded poorly (many of these are) and narrowly (the OP obviously is in the process of asking), I think there is a kernel of very important knowledge that is purely objective and should be questioned here to let people provide good technical answers.</p>\n\n<p>Specifically, to develop iOS you have three major tasks:</p>\n\n<ul>\n<li>initial design and layout of the app</li>\n<li>coding and unit tests</li>\n<li>running the iOS simulator</li>\n<li>debugging and support</li>\n</ul>\n\n<p>Portable macs have specific constraints that make the \"design / layout\" and \"simulator\" aspects of development problematic. Specifically, the iOS simulator wants to use 368 by 716 pixels for non retina devices, 690 by 994 pixels for retina devices and 765 by 994 for iPad simulation.</p>\n\n<p>This really limits the effective use of say an 11 inch air unless you will have a monitor when you need to do the \"design/layout\" or want to edit code and read bug reports on the same screen as the simulator is running if you won't debug your code on an actual device and use the Mac's screen to do the dev half of the work.</p>\n\n<hr>\n\n<p>So - the existing tools (flag, close, edit) work well to close questions that are vague, similar or exact duplicate or don't talk about objective Q/A. </p>\n\n<p>Any hardware recommendation question is prone to uncertainty / fragmentation based on the asker and answer's personal interpretation of:</p>\n\n<ol>\n<li>cost ($4k for professional tools is a pittance if you forego $400k for an education. On the other hand, $4k for something that won't make you money for 6-16 months is a lot to spend on <em>anything</em>)</li>\n<li>time (students/learners vs professionals)</li>\n<li>expertise</li>\n<li>timing (do you try to time your purchase or just buy knowing macs hold their resale and you can always get most of your money back if you want a new mac in 3 months time)</li>\n</ol>\n\n<p>When these issues are mixed with a technical discussion, the quality of the question seems to devolve rapidly and I don't think a ban will be any more effective than current mod tools.</p>\n\n<p>Thoughts?</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2011-10-27T19:42:15.310","LastActivityDate":"2011-10-27T19:42:15.310","CommentCount":"1"},{"Id":"890","PostTypeId":"1","CreationDate":"2011-10-27T18:07:32.167","Score":"10","ViewCount":"160","Body":"<p>My computer hardware and/or software is not working the way I want it to.</p>\n\n<p>What information should I be sure to include in a post on Ask Different in order to enable people provide helpful answers that might address my problems?</p>\n","OwnerUserId":"9388","OwnerDisplayName":"Daniel","LastEditorUserId":"13","LastEditDate":"2011-10-27T18:25:18.963","LastActivityDate":"2011-10-28T16:34:10.397","Title":"Help! My computer doesn't work","Tags":"<discussion><faq>","AnswerCount":"1","CommentCount":"1","CommunityOwnedDate":"2011-10-27T18:25:23.847"},{"Id":"891","PostTypeId":"2","ParentId":"890","CreationDate":"2011-10-27T21:06:03.180","Score":"8","Body":"<p>You should include the computer type (MacBook Pro, iMac, Mac Pro, PowerBook, iBook, Quadra, Performa, etc.). Please include the screen size if it has a built-in screen. </p>\n\n<p>Also include either the model identifier (MacBookPro8,2; iMac3,4) or the release specifier (Early-2011 MacBook Pro, Late-2009 iMac). You can get the former from System Profiler (System Information in Lion) by choosing \"About This Mac\" from the Apple menu, then clicking the \"More Info…\" button. (On Lion, you may also have to click the \"System Report…\" button in the next window as well.) The latter can be obtained from <a href=\"http://support.apple.com\" rel=\"nofollow\">Apple's support website</a> or <a href=\"http://mactracker.ca\" rel=\"nofollow\">Mactracker</a>.</p>\n\n<p>Unless the question is obviously completely hardware-related (which it almost never is), include your version of Mac OS. You can get this from the \"About This Mac\" window.</p>\n\n<p>Please also include anything that's related to the matter at hand. If you're running out of hard drive space, how big is the drive? If your computer is slow, how many programs are you running at once? You get the idea. </p>\n\n<p>Anything more specific than this is out of the scope of this answer, but be ready to answer questions about other parts of your hardware or software setup as needed. If you don't know how to get the answer, just ask and we'll be happy to guide you through that.</p>\n","OwnerUserId":"1629","LastEditorUserId":"1629","LastEditDate":"2011-10-28T16:34:10.397","LastActivityDate":"2011-10-28T16:34:10.397","CommentCount":"0","CommunityOwnedDate":"2011-10-27T21:06:03.180"},{"Id":"892","PostTypeId":"1","AcceptedAnswerId":"893","CreationDate":"2011-10-28T21:38:12.710","Score":"1","ViewCount":"40","Body":"<p>Is is possible to revise/delete moderator flags? I flagged something yesterday that I should have added a note to instead of just flagging with the canonical flags. If it's not possible, can this be added as a feature?</p>\n","OwnerUserId":"7833","LastActivityDate":"2011-10-28T22:52:01.933","Title":"Revise/delete moderator flags","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"893","PostTypeId":"2","ParentId":"892","CreationDate":"2011-10-28T22:52:01.933","Score":"2","Body":"<p>I don't think this is possible, and I'm not sure there's a need for it. I use the flagged reason as a guide, but I always look at the original post and see what needs to be done. About the only thing that really helps is if the question is a duplicate, the flagger provides the duplicate in the flag or in the comments on the question.</p>\n","OwnerUserId":"13","LastActivityDate":"2011-10-28T22:52:01.933","CommentCount":"0"},{"Id":"894","PostTypeId":"2","ParentId":"887","CreationDate":"2011-10-28T23:01:40.270","Score":"0","Body":"<p>I favor having a canonical question for them, but until one is created I think that the questions can remain open, provided they aren't duplicates.</p>\n","OwnerUserId":"13","LastActivityDate":"2011-10-28T23:01:40.270","CommentCount":"0"},{"Id":"895","PostTypeId":"2","ParentId":"886","CreationDate":"2011-10-28T23:04:03.073","Score":"4","Body":"<p>This might be a good idea for certain components of iCloud, but I think that doing one question for iCloud as a whole might be sub-optimal as iCloud isn't really a single thing but a collection of separate cloud-based services.</p>\n\n<p>So having a canonical question for mail, contacts, and calendar might be nice, and a separate one for documents, and a separate one for App Store and iBookstore, and one for iTunes, etc. might be the best approach.</p>\n","OwnerUserId":"13","LastEditorUserId":"13","LastEditDate":"2011-10-30T04:14:59.647","LastActivityDate":"2011-10-30T04:14:59.647","CommentCount":"0"},{"Id":"896","PostTypeId":"2","ParentId":"884","CreationDate":"2011-10-28T23:12:00.973","Score":"2","Body":"<p>Having iPhone screenshots be 200px wide was my solution, and I chose it because I needed to show 3 screenshots side-by-side. I appreciate Jason maintaining the question and making sure that all the other screenshots were the same size for uniformity. If we want to 'bless' that as the recommended size that iPhone screenshots, and by 'bless' I mean 'recommend', then I'm on board with that.</p>\n\n<p>As far as getting this built into the site itself, it might be nice but I don't think SE does per-site modifications that often. The best we could probably hope for is some custom JS that does it client-side like MathJax does on the Math, TeX, and other sites.</p>\n","OwnerUserId":"13","LastActivityDate":"2011-10-28T23:12:00.973","CommentCount":"0"},{"Id":"897","PostTypeId":"2","ParentId":"882","CreationDate":"2011-10-28T23:19:45.130","Score":"5","Body":"<p>You also have to distinguish between multiple questions and followup questions preemptively asked. For example, I usually ask questions like \"What does X mean? If it means Y, what do I do? If it means Z, what do I do?\". That form is OK, because it's stemming from a single primary question.</p>\n\n<p>On the other hand, questions that aren't correlated should be edited. As it's impossible to split the question in the engine, my approach has been to keep the first question and remove the rest of them, and leave a comment requesting that they re-ask their other questions as separate questions.</p>\n\n<p>This is not something that only moderators can do - anyone can suggest or make an edit removing the other questions, and the threshold for commenting is similarly very low. So flag them if you must, but I would be thrilled to see members of the community taking care of this kind of stuff themselves. This is not a matter of laziness, but the simple fact is that moderators don't scale, the community does.</p>\n","OwnerUserId":"13","LastEditorUserId":"13","LastEditDate":"2011-10-28T23:28:29.517","LastActivityDate":"2011-10-28T23:28:29.517","CommentCount":"1"},{"Id":"898","PostTypeId":"1","AcceptedAnswerId":"900","CreationDate":"2011-10-30T18:40:12.100","Score":"5","ViewCount":"241","Body":"<p>I'm an Indie Mac Developer with several apps, most of which are fairly technical or even developer- or web-developer-targeted. </p>\n\n<p>I'd love to have a StackExchange-style forum available for my users to post support questions that I (and the community) can answer.</p>\n\n<p>I'm not sure whether I would ideally:</p>\n\n<blockquote>\n  <p>A) have my own white-labelled StackExchange site, or</p>\n  \n  <p>B) just use an existing StackExchange site like AskDifferent</p>\n</blockquote>\n\n<p>I realize that option A above is probably not available to me (but please correct me if I'm wrong). But again, option B may actually be just as good for me and my users, or maybe even <em>better</em>.</p>\n\n<p>So: </p>\n\n<ol>\n<li><p>Is this an appropriate use of AskDifferent? Am I allowed to direct the users of my Mac Apps here to post their support questions (which, again, are likely to be fairly technical in nature for my developer-focused apps)?</p></li>\n<li><p>Is some other StackExchange site more appropriate for this? SuperUser?</p></li>\n</ol>\n\n<p>One final note:</p>\n\n<p>I noticed that the AskDifferent FAQ states that:</p>\n\n<blockquote>\n  <p>and [Ask Different] is <strong>not</strong> about ...</p>\n  \n  <ul>\n  <li>programming, with the exception of AppleScript and Automator</li>\n  </ul>\n</blockquote>\n\n<p>Please note that the app I'm most interested in providing support for here is basically \"Automator for the web\" and is implemented using AppleScript. </p>\n\n<p>It's called Fake:</p>\n\n<p><a href=\"http://fakeapp.com\" rel=\"nofollow\">http://fakeapp.com</a></p>\n","OwnerUserId":"2716","LastEditorUserId":"2716","LastEditDate":"2011-10-30T19:40:35.507","LastActivityDate":"2011-10-31T09:10:07.490","Title":"I'm an indie Mac app developer, can I use AskDifferent as a support forum?","Tags":"<support><osx>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"899","PostTypeId":"2","ParentId":"697","CreationDate":"2011-10-31T09:02:36.610","Score":"4","Body":"<p><strong>TL;DR Version</strong></p>\n\n<p>I have to admit, coming from SU where these questions were killed off early on (causing huge issues with the users, and even losing some because of it) the site survived and is still growing well without them.</p>\n\n<p>Up until recently, I have been quite accepting of Apple.SE having a very lenient stance against these questions, however recent events have made me realize that it is going to burn Apple.SE in the long run.</p>\n\n<p>Personally, I had planned to get very involved with Apple.SE going forward, however, my motivation has been significantly reduced as the quality of questions has dropped. It is unfortunate to see a CW question cap someone out on rep before the CW flag is hit, and some good quality answers, posted at the same, time getting no votes or views. </p>\n\n<p>I have lost interest in Apple.SE quickly, and doubt that I will be even remotely as active as before, since trying to increase the quality on the site sometimes feels one sided when this issue is raised, and honestly, it's raised often. </p>\n\n<p><strong>Non TL;DR Version</strong></p>\n\n<p>Kill them and kill them quickly. It is going to make the road to success harder in the long run, and effectively drive away some users that could have added value. This point has been proven over and over again on other sites, and the traffic it is driving to this site is causing more damage than good.</p>\n","OwnerUserId":"58","LastEditorUserId":"4604","LastEditDate":"2011-11-02T01:52:24.563","LastActivityDate":"2011-11-02T01:52:24.563","CommentCount":"1"},{"Id":"900","PostTypeId":"2","ParentId":"898","CreationDate":"2011-10-31T09:10:07.490","Score":"5","Body":"<p>Answer to A:</p>\n\n<p>SE is not available for private use, except in extremely big corporate environments at an extremely big price, which to date I am not aware of any, nor has SE announced any.</p>\n\n<p>Answer to B:</p>\n\n<p>StackOverflow recently did a big support rollout with Facebook for developers, but the size of Facebook and the amount of Facebook Developer questions motivated and supported the move.</p>\n\n<p>In general, using an existing SE site as a support forum for a particular product, is a <strong>bad</strong> idea. Unless the site is already building a lot of questions for that particular product, and to a point where it has a tag for it, the long term sustainability for this is not that great.</p>\n\n<p>Some SE sites, for example Web Apps, quickly had the community up in arms because when Trello was launched, it's FAQ gave the impression that Web Apps was a support structure for Trello, and they had to heavily adjust their thinking and FAQ to make it clear that it's not. </p>\n\n<p>I suggest you become an active part of the community, and if questions around your product comes up, feel free to answer and be visible, but don't use an public SE site as some sort of official Support systems for you product. Rather look at other tools for that specific purpose.</p>\n","OwnerUserId":"58","LastActivityDate":"2011-10-31T09:10:07.490","CommentCount":"0"},{"Id":"901","PostTypeId":"1","CreationDate":"2011-11-03T12:09:57.433","Score":"6","ViewCount":"55","Body":"<p>Just noticed that the colour of the text displayed on the search results page does not show the search query very clearly until the search box is re-selected.</p>\n\n<p><strong>Blank search box waiting for a query:</strong></p>\n\n<p><img src=\"https://i.stack.imgur.com/hbQaH.png\" alt=\"Blank search box waiting for query\"></p>\n\n<p><strong>Non-selected search box on results page:</strong></p>\n\n<p><img src=\"https://i.stack.imgur.com/GI8jI.png\" alt=\"Non-selected search box on results page\"></p>\n\n<p><strong>Selected search box on results page</strong></p>\n\n<p><img src=\"https://i.stack.imgur.com/qvjJf.png\" alt=\"Selected search box on results page\"></p>\n\n<p>Perhaps the 2nd image (non-selected search box on results page) could at least be made to look like the placeholder text in the 1st image (blank search box), as it is often useful to view and edit a search query to improve results. If users are to be discouraged from editing a query using the top-right search box (and instead it is intended that they modify their query in the search box in the centre of the page above the results) perhaps the top-right search box should revert to just having place-holder text ready to accept a new query. </p>\n\n<p>(Using Safari 5.1.1 on OS-X 10.7.2)</p>\n","OwnerUserId":"2491","LastEditorUserId":"6","LastEditDate":"2012-01-26T16:37:56.497","LastActivityDate":"2012-01-26T16:37:56.497","Title":"Search box text colour","Tags":"<bug><status-completed><design>","AnswerCount":"1","CommentCount":"1"},{"Id":"903","PostTypeId":"1","CreationDate":"2011-11-04T19:17:22.660","Score":"12","ViewCount":"190","Body":"<p>Jason had a nice comment in the chat room and I'd like to see if there is enough common interest to start killing these unanswerable questions off.</p>\n\n<p><a href=\"https://apple.stackexchange.com/q/5435/5472\">Got any tips or tricks for Terminal in Mac OS X?</a></p>\n\n<p>This question specifically has no answer. Software can do anything our minds can describe and with tools as mature as the Lion terminal with commands like <code>open</code> and <code>pbpaste</code> and pipe etc.... there are really an unlimited number of cool things that you can do in terminal.</p>\n\n<p>What is the practical problem trying to be solved here? What is the \"answer\".</p>\n\n<p>I think we could pick one question like this and close it with a comment that although it contains great information - it's not in the one Q one A format and encourage people to craft a good question for each specific answer that needs to be copied over. If someone else sees the question before the asker gets a chance to answer - so much the better. In a short amount of time, imagine how many great questions could be around by \"mining\" these loose form collections for the best tidbits. </p>\n\n<p>Can this site curate great questions from ones like this?</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Should we try to start killing off the community poll questions with this one?","Tags":"<discussion><community-wiki>","AnswerCount":"5","CommentCount":"4","FavoriteCount":"2"},{"Id":"904","PostTypeId":"2","ParentId":"903","CreationDate":"2011-11-05T22:56:24.517","Score":"-1","Body":"<p>I'm new on Apple.SE, but I see nothing wrong with such questions on StackOverflow. Why do you want to kill it? Does it clog something up? The community clearly likes it; upvotes imply support. And surely you want the community to stay and bond through questions like that.</p>\n\n<p>If it were voted into the negative then I suppose... But this one clearly doesn't warrant that kind of response, in my opinion.</p>\n","OwnerUserId":"13280","LastActivityDate":"2011-11-05T22:56:24.517","CommentCount":"2"},{"Id":"905","PostTypeId":"2","ParentId":"903","CreationDate":"2011-11-06T08:34:24.800","Score":"0","Body":"<p>I actually kind of like these questions (or rather the answers). The key benefit for me is that they contain a lot of interesting stuff in one place, especially a lot of things I would never have searched for explicitly but are good to know. And for some of them it would be quite difficult to come up with specific questions, e.g. for most of <a href=\"https://apple.stackexchange.com/questions/11030/ios-developer-tools-utilities-must-haves-and-nice-to-haves\">iOS Developer Tools &amp; Utilities (must haves and nice to haves)</a> and similar questions.</p>\n\n<p>Don't know whether this is feasible on SE but could we come up with some extended FAQ like thing for these kind of information?</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2011-11-06T08:34:24.800","CommentCount":"2"},{"Id":"907","PostTypeId":"1","AcceptedAnswerId":"908","CreationDate":"2011-11-11T01:00:55.003","Score":"3","ViewCount":"57","Body":"<p>I just looked at my flag weight and it has a weird number:</p>\n\n<p><img src=\"https://i.stack.imgur.com/F8Fin.png\" alt=\"Decimal flag weight\"><br>\nIs it supposed to be a decimal number? Or is this a bug?</p>\n","OwnerUserId":"7833","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Why has my flag weight turned to decimal points?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"908","PostTypeId":"2","ParentId":"907","CreationDate":"2011-11-11T01:16:25.503","Score":"5","Body":"<p>This is normal. To quote a <a href=\"https://meta.stackexchange.com/questions/80170/what-is-flag-weight/80178#80178\">MSO post</a>:</p>\n\n<blockquote>\n  <p>Because flag weight above 500 does not increase in a linear fashion, decimal places are shown for precision purposes and to show you how your flag weight is changing.</p>\n</blockquote>\n","OwnerUserId":"2220","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2011-11-11T01:16:25.503","CommentCount":"1"},{"Id":"909","PostTypeId":"1","AcceptedAnswerId":"910","CreationDate":"2011-11-11T07:30:03.290","Score":"1","ViewCount":"59","Body":"<p>According to <a href=\"https://apple.stackexchange.com/badges/33/copy-editor\">the description of the copy editor badge</a>, the requirement is for you to edit 500 posts. I have done that and I don't see the badge. If you look on <a href=\"https://apple.stackexchange.com/users?tab=editors&amp;filter=all\">the users page</a>, you'll notice that both bmike and I have edited more than 500 posts. Why don't I have a badge?</p>\n","OwnerUserId":"7833","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Is the copy editor badge not working?","Tags":"<bug><status-bydesign>","AnswerCount":"2","CommentCount":"0"},{"Id":"910","PostTypeId":"2","ParentId":"909","CreationDate":"2011-11-11T07:44:03.807","Score":"3","Body":"<p>There are a few potential reasons:</p>\n\n<ul>\n<li>You seem to have recently crossed over the threshold, so the badge simply hasn't been awarded yet. Some badges aren't awarded immediately, but instead with a batch script that's run daily.</li>\n<li>You edit a lot of tag wikis. It's possible that the /users page tracks <em>all</em> edits, but the badge only counts edits to posts.</li>\n<li>Maybe only edits to the <em>content</em> of a post are considered for the badge, and while you have 500 edits some are editing the tags of a question instead of the actual content of the post.</li>\n</ul>\n\n<p>These are just speculations, but I'll bet that at least one is true. Just keep editing, you'll get it eventually :)</p>\n","OwnerUserId":"13","LastActivityDate":"2011-11-11T07:44:03.807","CommentCount":"3"},{"Id":"912","PostTypeId":"2","ParentId":"909","CreationDate":"2011-11-12T12:55:13.330","Score":"1","Body":"<p>It has been stated in meta.so (<a href=\"https://meta.stackexchange.com/questions/108816/is-the-number-of-edits-on-the-users-page-the-one-relevant-for-the-edit-badges\">Is the number of edits on the users page the one relevant for the edit badges?</a>) that the edits count in the users page is <em>not</em> relevant for the edit badges. It is said to exclude trivial edits, but <a href=\"https://meta.stackexchange.com/questions/81655/what-kind-of-edits-are-counted-in-userstab-editors\">it has not been officially stated which are trivial</a>.</p>\n\n<p>Just recently a counter has been added to the right pane of the <a href=\"https://apple.stackexchange.com/review/\">review</a> page, which shows your progress on edits:</p>\n\n<p><img src=\"https://i.stack.imgur.com/l56U2.png\" alt=\"review progress\"></p>\n\n<p>Reflecting the edit count on the review page to the one on the users page; I can say that <strong>retags</strong> aren't counted for badges while they are counted on the users page — just checked this.</p>\n","OwnerUserId":"1453","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2011-11-15T09:32:53.997","CommentCount":"4"},{"Id":"914","PostTypeId":"1","AcceptedAnswerId":"915","CreationDate":"2011-11-20T06:11:21.863","Score":"7","ViewCount":"80","Body":"<p>Now that the dust is settling over Lion and iOS 5, there are a large amount of questions that had been asked in the past that had either a workaround or a not-quite direct answer, but now there is a very direct answer.</p>\n\n<p>Two Examples:</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/4567/how-can-i-keep-track-of-twitter-usernames-in-address-book\">How can I keep track of Twitter usernames in Address Book?</a></p>\n\n<p>Under Snow Leopard and previous, this was not a direct answer, though using URL as tweetie:@username is really ingenius. IIRC the official Twitter for iPhone app supports twitter:username, but I digress.</p>\n\n<p>As of Lion and iOS 5, there is now a first-tier field for Twitter (and Facebook, and Flickr, and LinkedIn, and even MySpace). A user has <a href=\"https://apple.stackexchange.com/questions/4567/how-can-i-keep-track-of-twitter-usernames-in-address-book/31724#31724\">answered the question directly</a> (admittedly with quite poor quality), but if this question is edited and really updated.</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/9549/share-links-url-between-ipads\">Share links (URLs) between iPads</a></p>\n\n<p>This is rather simple: Use iMessage is a great answer. Not necessarily any different than mine, simply meaning, the best answer is some sort of direct text communication. But iMessage is almost guaranteed to be there, and is easier to set up than e-mail accounts of chat networks.</p>\n\n<hr>\n\n<p>I know moderators are not supposed to deal with answers, even if they are factually wrong, so I assumes this also means they cannot un-accept the current answer.</p>\n\n<p>Is there another answer besides the obvious (but unreliable):</p>\n\n<p>Hope the OP comes back, or, <a href=\"https://apple.stackexchange.com/questions/9763/cant-read-full-song-title-on-ipod-touch-or-iphone/9775#9775\">hope the user with the accepted answer updates their answer</a>?</p>\n","OwnerUserId":"1346","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2011-11-20T08:19:03.463","Title":"What can users do to address orphaned questions with newer/better answers?","Tags":"<discussion><accepted-answer>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"}]