[{"Id":"1790","PostTypeId":"1","CreationDate":"2013-08-25T17:14:49.790","Score":"1","ViewCount":"721","Body":"<p>We have a question about per-app VPN that is on hold on the main site:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/99988/\">How to configure VPN per app in iOS 7?</a></li>\n</ul>\n\n<p>Does anyone see a way to edit this so that it's about what Apple has announced and not running afoul of our community standard to not <a href=\"https://apple.meta.stackexchange.com/questions/1716/why-are-some-ios7-questions-closed-and-others-left-open\">keep open some pre-release iOS 7 questions</a>? The initial edit of the question seems to me about how to use a beta function on the beta OS and that it's squarely in the \"should be closed\" category, but I also would be happy if someone could make a case for reopening it if my interpretation is incorrect or there is some reason to open this due to other concerns like how it helps with shipping OS and isn't really about iOS7.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2013-08-27T18:04:44.210","Title":"Can this question about pre-release software be fixed and opened?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"1791","PostTypeId":"2","ParentId":"1790","CreationDate":"2013-08-27T18:04:44.210","Score":"2","Body":"<p><em>I'm fairly new around here, but here's my opinion:</em></p>\n\n<p>The OP has already done some research on the topic, but hasn't found any more information (presumably due to the NDA). If we gave any more information, through knowledge of information under the NDA, wouldn't we be breaking the agreement?</p>\n\n<p>As you mentioned in your comment, a non-NDA link to Apple's announcement would be useful in deciding whether to close it or not. So far, all I've found is this on <a href=\"http://www.apple.com/ios/ios7/business/\" rel=\"nofollow noreferrer\">Apple's iOS 7 non-NDA Business</a> site:</p>\n\n<p><img src=\"https://i.stack.imgur.com/f5xkI.png\" alt=\"Per app VPN\"></p>\n\n<p>As far as I understand, this limited paragraph and no links to any more information indicate that Apple are not willing to release more non-NDA information about this feature until it is publicly released with iOS 7.</p>\n\n<p>Consequently, <strong>I don't think this should be opened until iOS 7 is publicly released.</strong></p>\n","OwnerUserId":"37797","LastActivityDate":"2013-08-27T18:04:44.210","CommentCount":"0"},{"Id":"1792","PostTypeId":"1","AcceptedAnswerId":"1793","CreationDate":"2013-08-28T19:28:11.070","Score":"3","ViewCount":"38","Body":"<p>I recently made <a href=\"https://apple.stackexchange.com/review/suggested-edits/36499\">this suggested edit</a> to an answer to fit with the edit that had been made to the question (being specific about Apple's <strong>UK</strong> Support site).</p>\n\n<p><img src=\"https://i.stack.imgur.com/XsZgJ.png\" alt=\"My suggested edit\"></p>\n\n<p>An <a href=\"https://apple.stackexchange.com/posts/100250/revisions\">edit</a> was then made to add the region to the link, however the incorrect region was added (US instead of UK).</p>\n\n<p><img src=\"https://i.stack.imgur.com/fETCL.png\" alt=\"@bmike&#39;s edit\"></p>\n\n<p>As per the guidelines, I should avoid trivial, tiny one-letter edits, and suggested edits must be longer than 6 characters anyway.</p>\n\n<p>Am I overlooking something?</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2013-08-29T15:58:08.673","Title":"Should I suggest an edit to rollback an edit?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"1793","PostTypeId":"2","ParentId":"1792","CreationDate":"2013-08-28T19:30:11.157","Score":"4","Body":"<p>In this case - false information trumps the general prohibition to make a trivial edit. Sadly, the system won't even let us fix that one typo so we have to change more or use two edits to effect a one character change.</p>\n\n<p>I wouldn't roll back, but just edit it correct going forward. </p>\n\n<p>Great catch. </p>\n\n<p><em>btw - that bmike fellow often is on an iPad and making silly typos when trying to improve a suggested edit</em> </p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2013-08-29T15:58:08.673","LastActivityDate":"2013-08-29T15:58:08.673","CommentCount":"3"},{"Id":"1794","PostTypeId":"1","CreationDate":"2013-08-29T12:40:11.270","Score":"5","ViewCount":"50","Body":"<p>If more than one answer is deemed suitable as \"the correct answer\" for a given question such as this:</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/100258/is-it-possible-to-use-desktop-mac-apps-on-an-ipad/100261#100261\">Is It Possible To Use Desktop Mac Apps On An iPad?</a></p>\n\n<p>Obviously you cannot tick all as correct, so what is the view to adopt in regards to selecting one answer?</p>\n","OwnerUserId":"35244","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2013-08-29T18:10:22.120","Title":"Accepting An Answer When More Than One Answer Is Deemed Suitable?","Tags":"<discussion>","AnswerCount":"3","CommentCount":"4"},{"Id":"1795","PostTypeId":"2","ParentId":"1794","CreationDate":"2013-08-29T13:20:08.867","Score":"5","Body":"<p>Pick the one you find <strong>most</strong> helpful. You can vote for multiple answers, but only one can get the checkmark. If you really want to reward a particularly great answer, you could start a bounty.</p>\n","OwnerUserId":"9388","LastEditorUserId":"9388","LastEditDate":"2013-08-29T18:10:22.120","LastActivityDate":"2013-08-29T18:10:22.120","CommentCount":"3"},{"Id":"1796","PostTypeId":"2","ParentId":"1794","CreationDate":"2013-08-29T14:07:55.727","Score":"3","Body":"<p>That's one of the problems with <code>software-recommendation</code> questions. Several good answers might come back over time and you only can accept one of them. Now there are several things to note:</p>\n\n<ul>\n<li>It's not mandatory to accept any answer at all. So you can just upvote the recommendations you liked and go on with your life</li>\n<li>If you are going to accept an answer, it would probably best to accept the one you followed up on at the end (e.g. by installing/using the recommended software). </li>\n</ul>\n","OwnerUserId":"9058","LastActivityDate":"2013-08-29T14:07:55.727","CommentCount":"1"},{"Id":"1797","PostTypeId":"2","ParentId":"1794","CreationDate":"2013-08-29T15:24:35.490","Score":"5","Body":"<p>My experience is when it's hard to select an answer, that's a sign that the question itself needs improvement. Now, not all questions need to be improved - that one you linked to could easily have a check mark awarded, some up votes awarded and then after you've digested the options, come back and ask a knock-out, awesome, good-subjective question explaining how exactly to get one app to work well from Mac to iPad.</p>\n\n<p>The rest of this answer is more for looking forward and general ideas on how to decide how to answer, but I'll also relate it to the question at hand.</p>\n\n<p>First, Let's look at the guidelines on asking:</p>\n\n<p><a href=\"https://apple.stackexchange.com/help/how-to-ask\">https://apple.stackexchange.com/help/how-to-ask</a></p>\n\n<p>The question that was linked failed to do three things:</p>\n\n<ol>\n<li>Show the research that was done to try and solve the question.</li>\n<li>Provide context</li>\n<li>Lacks any way to judge which answer is the best answer</li>\n</ol>\n\n<p>The guidelines on what not to ask help with the last criteria:</p>\n\n<p><a href=\"https://apple.stackexchange.com/help/dont-ask\">https://apple.stackexchange.com/help/dont-ask</a></p>\n\n<p>Since the question seems more about discussion a general theme than asking for an expert to explain one specific thing it's turning into a poll of options as opposed to a plan to address a documented need.</p>\n\n<p>Since those two links above are very dry, condensed and - dare I say - a bit lacking in specificity, here is a story explaining how these rules came to be.</p>\n\n<p><a href=\"http://blog.stackoverflow.com/2011/01/real-questions-have-answers/\">http://blog.stackoverflow.com/2011/01/real-questions-have-answers/</a></p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-08-29T15:24:35.490","CommentCount":"1"},{"Id":"1798","PostTypeId":"1","AcceptedAnswerId":"1799","CreationDate":"2013-08-30T01:33:30.553","Score":"6","ViewCount":"71","Body":"<p><a href=\"https://apple.stackexchange.com/\">AskDifferent Home Page</a> breaks on Mac possible because of \n<code>/questions/100422/why-does-crash-macs</code>. Vulnerability identified at <a href=\"http://arstechnica.com/apple/2013/08/rendering-bug-crashes-os-x-and-ios-apps-with-string-of-arabic-characters/\" rel=\"nofollow noreferrer\">http://arstechnica.com/apple/2013/08/rendering-bug-crashes-os-x-and-ios-apps-with-string-of-arabic-characters/</a></p>\n\n<p>I cant even hyperlink this page since it tries to fetch and breaks the page. Prepend the home page link to the above link to </p>\n\n<p>To Verify curl the home page to see the text exists.</p>\n\n<p>Kindly remove the link or remove the encoding to get the home page back for OS X users</p>\n","OwnerUserId":"1976","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2013-09-24T15:22:10.267","Title":"Getting an 'Aw Snap' on Chrome on the apple.stackexchange home page","Tags":"<bug><status-completed><flagging>","AnswerCount":"1","CommentCount":"0"},{"Id":"1799","PostTypeId":"2","ParentId":"1798","CreationDate":"2013-08-30T01:49:27.620","Score":"3","Body":"<p>Thanks for troubleshooting this! It's fixed now. Thanks to Sairam for diagnosing the problem so well so we could fix it quickly.</p>\n","OwnerUserId":"9388","LastEditorUserId":"9388","LastEditDate":"2013-09-01T03:29:19.797","LastActivityDate":"2013-09-01T03:29:19.797","CommentCount":"0"},{"Id":"1800","PostTypeId":"1","AcceptedAnswerId":"1801","CreationDate":"2013-08-31T17:45:50.863","Score":"5","ViewCount":"106","Body":"<p>I have looked back over the <a href=\"https://apple.stackexchange.com/posts/100577/revisions\">revision history</a> to <a href=\"https://apple.stackexchange.com/questions/100577/imessage-sign-in-not-working-correctly-after-changing-apple-id\">this question</a> and I am confused as to what actually happened.</p>\n\n<p>I posted my suggested edit shortly after the question was posted initially (around 15 minutes after posting), yet my edit is not correctly listed and <a href=\"https://apple.stackexchange.com/review/suggested-edits/36761\">was reverted</a> since it seemed to 'mess up' a <em>later</em> suggested edit.</p>\n\n<p><img src=\"https://i.stack.imgur.com/5WR59.png\" alt=\"Revision History\"></p>\n\n<p>For example, it shows that my suggested edit removed the <a href=\"https://apple.stackexchange.com/questions/tagged/imessage\" class=\"post-tag\" title=\"show questions tagged &#39;imessage&#39;\" rel=\"tag\">imessage</a> tag, yet this tag did not exist when I submitted my suggested edit.</p>\n\n<p>The revision history shows that <a href=\"https://apple.stackexchange.com/users/54484/tubedogg\">@tubedogg</a> submitted his edit 2 hours after the original post, considerably later than mine, yet mine also shows 2 hours, and being after his…</p>\n\n<p>What's happened, and why did Community not reject one of the edits?</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2013-09-26T17:06:53.840","Title":"Suggested edit confusion","Tags":"<discussion><support><suggested-edits>","AnswerCount":"1","CommentCount":"1","FavoriteCount":"0"},{"Id":"1801","PostTypeId":"2","ParentId":"1800","CreationDate":"2013-08-31T18:06:25.297","Score":"4","Body":"<p>Reading the logs as closely as I can, it would appear that two suggested edits were allowed to be submitted to the same question, which the system ordinarily does not permit. Both were approved, but the second edit was applied on top of the first, which made less sense. As far as I can tell, this is a bug.</p>\n\n<p>The one thing I about this that does make sense to me is that the time posted on suggested edits is the time at which they were approved, not the time at which they were submitted. So 2 hours after the original post is when both of your edits were approved, not when they were submitted.</p>\n\n<p>Community◆ would not ordinarily reject an edit for that reason; instead, the ability to suggest an edit would be blocked if another suggested edit was pending.</p>\n","OwnerUserId":"9388","LastActivityDate":"2013-08-31T18:06:25.297","CommentCount":"1"},{"Id":"1802","PostTypeId":"1","CreationDate":"2013-09-02T18:18:27.010","Score":"8","ViewCount":"279","Body":"<p>Our help section has a prohibition on \"hackintosh\" questions where I believe the intent is to avoid low value, low quality questions about driver support.</p>\n\n<p><a href=\"https://apple.stackexchange.com/help/on-topic\">https://apple.stackexchange.com/help/on-topic</a></p>\n\n<blockquote>\n  <p>Installing or using Apple operating systems on non-Apple hardware (and most other explicitly unlicensed use of product)</p>\n</blockquote>\n\n<p>Would it be helpful to explicitly mention virtualization as either on-topic or off-topic or just leave things as stated - focus on the hardware and close topics that aren't about virtualizing directly onto Mac hardware per the strict reading of the current help section?</p>\n\n<p>Here are a few questions we've had under this category:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/100726/playing-videos-on-virtualbox-macos-x-guest-on-ubuntu-13-04-as-host\">Playing videos on VirtualBox Mac OS X guest on Ubuntu 13.04 as host</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/99433/moving-fusion-vms-to-esxi\">Moving Fusion VMs to ESXi</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/86304/can-mountain-lion-os-x-run-on-hp-g62-series-using-vmware-virtualization\">Can Mountain Lion OS X run on HP G62 series using VMWare virtualization?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/51846/how-to-get-mac-os-x-to-run-in-a-vm-on-windows\">How to get Mac OS X to run in a VM on Windows</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/29065/installing-ios-on-vmware-workstation\">Installing iOS on VMware Workstation</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/20965/does-apples-license-for-os-x-allow-it-to-be-virtualized-on-an-hp-pc\">Does Apple&#39;s license for OS X allow it to be virtualized on an HP PC?</a></li>\n</ul>\n\n<p>Also unlicensed are these questions:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/64961/is-it-possible-to-install-mac-os-9-on-a-vm\">Is it possible to install Mac OS 9 on a VM?</a></li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2013-09-04T10:53:01.223","Title":"Can anyone point to a reason to ban virtualized OS on the site?","Tags":"<discussion><site-scope>","AnswerCount":"2","CommentCount":"1"},{"Id":"1803","PostTypeId":"1","AcceptedAnswerId":"1804","CreationDate":"2013-09-02T18:27:48.200","Score":"5","ViewCount":"32","Body":"<p>I found the question that is exactly what I'm looking for, but it's old and the solutions don't work for my version (Mountain Lion 10.8.4).</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/15030/how-can-i-add-a-new-application-to-the-open-with-menu\">How can I add a new application to the Open With menu?</a></p>\n\n<p>Should I create a new question?</p>\n","OwnerUserId":"40511","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-09-02T18:32:24.923","Title":"What to do if the answers do not work for the latest OS version?","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"1804","PostTypeId":"2","ParentId":"1803","CreationDate":"2013-09-02T18:32:24.923","Score":"7","Body":"<p>That would certainly be one good way to go about it, and honestly the method most likely to get you a useful answer. In your question, be sure to acknowledge the existence of the other question and to explain how your situation is different (that question specifies that it is for 10.7.4; the answers there do not help you) so that your question does not get closed as a duplicate. If your question <em>does</em> get closed as a duplicate, please do not get discouraged; we can re-open it, because it is not, in fact, a duplicate.</p>\n","OwnerUserId":"9388","LastActivityDate":"2013-09-02T18:32:24.923","CommentCount":"1"},{"Id":"1805","PostTypeId":"2","ParentId":"1802","CreationDate":"2013-09-02T18:38:33.447","Score":"11","Body":"<p>As far as I can read the Apple License (and I am not a lawyer), installing Apple operating systems in a virtualized environment is permitted by the terms of the license as long as the virtualized environment is running on Apple-branded hardware. Running a virtualized system on non-Apple hardware <em>is</em> \"explicitly unlicensed use of product\".</p>\n\n<p>If we want to keep that as our bright line test (and I'm indifferent to that as a standard, but it is our current one), then I'd say questions about installing OS X in a virtualized environment <em>in general</em> are on-topic here, because they could apply to a licensed use of OS X. If one can run Linux on a Mac (and a quick Google search indicates that this seems to be possible), then running OS X virtualized on a Mac that is running Linux would be a licensed use of the product, and thus on-topic for the site.</p>\n\n<p>Questions specific to running OS X virtualized on Linux on, say, a Dell or a Wang or ENIAC would be off-topic because they explicitly violate the license agreement.</p>\n\n<p>So my reading of the current standards is that because one could run Linux on a Mac and then legitimately virtualize OS X on top of that, the question is on-topic and needs no update to the FAQ.</p>\n\n<p>Going through your examples,\nthe <a href=\"https://apple.stackexchange.com/questions/100726/playing-videos-on-virtualbox-macos-x-guest-on-ubuntu-13-04-as-host\">first one</a> is on-topic as is; Ubuntu can run on a Mac, so an end user entirely within the scope of Apple's license could be helped by this answer.</p>\n\n<p>The <a href=\"https://apple.stackexchange.com/questions/99433/moving-fusion-vms-to-esxi\">second one</a> is explicitly run on a Mac. The Apple terms say the software is licensed to run on Apple hardware, and that's what's being done.</p>\n\n<p>The <a href=\"https://apple.stackexchange.com/questions/86304/can-mountain-lion-os-x-run-on-hp-g62-series-using-vmware-virtualization\">third one</a> is off-topic; it's asking specifically about getting it to run on a HP computer. It might be editable to be on-topic, but if the problem is specific to the drivers needed for the HP hardware, it's off-topic.</p>\n\n<p>The <a href=\"https://apple.stackexchange.com/questions/51846/how-to-get-mac-os-x-to-run-in-a-vm-on-windows\">fourth one</a> is on-topic. Windows can run on a Mac, so this answer could apply to someone running Mac OS X on Apple hardware.</p>\n\n<p>The <a href=\"https://apple.stackexchange.com/questions/29065/installing-ios-on-vmware-workstation\">fifth one</a> is leaning toward off-topic as written, but edit \"I have a Windows PC\" to \"I have a computer running Windows\" and we're back in on-topic territory.</p>\n\n<p>The <a href=\"https://apple.stackexchange.com/questions/20965/does-apples-license-for-os-x-allow-it-to-be-virtualized-on-an-hp-pc\">sixth one</a> is clearly on-topic; it's asking what the license allows, rather than asking how to do something not permitted.</p>\n","OwnerUserId":"9388","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-09-03T02:48:23.163","CommentCount":"4"},{"Id":"1806","PostTypeId":"1","AcceptedAnswerId":"1807","CreationDate":"2013-09-03T16:48:33.923","Score":"3","ViewCount":"167","Body":"<p>Invitations for Apple's fall (in the northern hemisphere) 2013 press event have been sent:</p>\n\n<ul>\n<li><a href=\"http://www.loopinsight.com/2013/09/03/apple-announces-special-event-for-september-10/\" rel=\"nofollow\">http://www.loopinsight.com/2013/09/03/apple-announces-special-event-for-september-10/</a></li>\n</ul>\n\n<p>The pithy summary for this post above is: <em>It is widely expected that Apple will introduce a new iPhone at the event.</em></p>\n\n<p>I have posted a community event for <a href=\"http://everytimezone.com/#2013-9-10,300,1zz\" rel=\"nofollow\">10 AM Pacific Time</a> that links to this discussion thread so people can share their ideas to help promote either the site or this event.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2013-09-11T20:20:31.443","LastActivityDate":"2013-09-11T20:20:31.443","Title":"What is planned for Apple's fall 2013 press event?","Tags":"<discussion><status-completed>","AnswerCount":"1","CommentCount":"0"},{"Id":"1807","PostTypeId":"2","ParentId":"1806","CreationDate":"2013-09-03T17:58:11.510","Score":"3","Body":"<p>Well, we should have a chat room event for a start, a place to hang out and share useful livestreams and other info etc, maybe open it early and let people rip with the rumours in a controlled space ;)</p>\n","OwnerUserId":"9495","LastActivityDate":"2013-09-03T17:58:11.510","CommentCount":"6"},{"Id":"1808","PostTypeId":"2","ParentId":"1802","CreationDate":"2013-09-04T10:53:01.223","Score":"4","Body":"<p>Can think of various reasons NOT to ban them, I think a better direction is to take a good look at the on-topic section, and look to review and clarify existing content, and then expand it maybe to include a mini FAQ and/or example Q&amp;A for all contentious portions (Virtualised OS, Developer Programs/iTunes Connect, NDA covered topics etc) to make it a bit more useful on the whole.</p>\n\n<p>I think the hackintosh subject is very quiet these days, both on the site and general in terms of internet chatter, but we see plenty of questions regarding other issues that are off topic far more regularly.</p>\n","OwnerUserId":"9495","LastActivityDate":"2013-09-04T10:53:01.223","CommentCount":"0"},{"Id":"1809","PostTypeId":"1","CreationDate":"2013-09-09T10:44:45.030","Score":"10","ViewCount":"173","Body":"<p>If I slowly mouseover the comments button on AD (I have tried with with 2 other SE sites that I cannot replicate this on) I get a rapid flickering between the hover and non hover state when I near the edge of the button, that stops when I go to the center of the button (or move away).</p>\n\n<p>It looks like the button size for the \"on hover\" css is a couple of pixels smaller than the normal state.  This means that if you touch the very bottom of the button in the normal state, then the on-hover triggers and the button is highlighted, but without moving the cursor is now seems outside the 'on hover' detection edge, and reverts back to the normal view, and repeats on/off until I move the mouse.</p>\n\n<p>This seems to happen on the bottom and right edges, but not the top or left.</p>\n\n<p><img src=\"https://i.stack.imgur.com/PYJzo.gif\" alt=\"GIF\"></p>\n\n<p>I made this video to make it clearer <a href=\"http://cl.ly/RHi6\" rel=\"nofollow noreferrer\">http://cl.ly/RHi6</a> </p>\n\n<p>This happens on (Windows) Chrome 29.blah for me, but not on IE8 which renders the button differently (no rounded corners) although it does move everything below the button up a few pixels when highlighted.  Not on a Mac presently to test in OS X.</p>\n","OwnerUserId":"9495","LastEditorUserId":"292","LastEditDate":"2015-03-15T05:33:05.397","LastActivityDate":"2015-03-15T05:33:05.397","Title":"CSS Bug 'on hover' for comment button","Tags":"<bug><status-completed><status-reproduced><design>","AnswerCount":"2","CommentCount":"8"},{"Id":"1810","PostTypeId":"2","ParentId":"1655","CreationDate":"2013-09-09T15:23:06.890","Score":"1","Body":"<p>You are correct in detecting that at least one merge happened to be linked question. </p>\n\n<p>The history shows a merge around January 28. </p>\n\n<p>Feel free to flag any answers you feel should be deleted or edited as a result of the merge. </p>\n","OwnerUserId":"5472","LastActivityDate":"2013-09-09T15:23:06.890","CommentCount":"2"},{"Id":"1811","PostTypeId":"1","CreationDate":"2013-09-11T15:33:28.820","Score":"6","ViewCount":"69","Body":"<p>We wanted to let you know that we are currently testing some new ads on the mobile version of Ask Different. They are shown in two places right now: the bottom of the home page, and the question page (between the first and second answers, as on Stack Overflow). Right now you'll only see them if:</p>\n\n<ol>\n<li>You're viewing the mobile version of the web site</li>\n<li>You're on an iOS device</li>\n<li>You have less than 200 rep (i.e. don't have the <a href=\"https://stackoverflow.com/help/privileges/reduced-ads\">reduced ads privilege</a>).</li>\n</ol>\n\n<p>This is only a test, and we're interested in your feedback. Obviously, nobody <em>loves</em> ads, but we're hoping these are unobtrusive enough (especially for high-rep users, who will see less of them) and at least somewhat interesting to justify their existence. Stack Exchange will always remain free, so we have to experiment with some small ways to pay for the sites' upkeep. </p>\n\n<p>If we don't see good enough results from these ads, we'll shut them off in a few weeks.</p>\n\n<p><img src=\"https://i.stack.imgur.com/uqyf3.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"4","LastEditorUserId":"-1","LastEditDate":"2017-05-23T11:33:34.410","LastActivityDate":"2013-09-11T15:33:28.820","Title":"Announcement: new mobile ads","Tags":"<discussion>","AnswerCount":"0","CommentCount":"1"},{"Id":"1812","PostTypeId":"1","AcceptedAnswerId":"1813","CreationDate":"2013-09-11T20:25:43.513","Score":"3","ViewCount":"65","Body":"<p>I was editing a question and tried to add a \"iphone-5s\" tag and AD won't let me do it. I have the rep to create new tags, but I guess not if it is too similar to an existing tag.</p>\n\n<p>I was trying to update this question: <a href=\"https://apple.stackexchange.com/questions/101532\">What&#39;s the difference between the battery of iPhone 5s vs iPhone 5?</a></p>\n\n<p>Also, a tag for iPhone-5c will probably be necessary shortly.</p>\n\n<p>Is there a way to create these tags, or do I need to ask the moderators nicely?</p>\n","OwnerUserId":"2313","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Trying to create iphone-5s tag","Tags":"<discussion><support><tags>","AnswerCount":"1","CommentCount":"3"},{"Id":"1813","PostTypeId":"2","ParentId":"1812","CreationDate":"2013-09-11T23:13:18.107","Score":"2","Body":"<p>We've established the <a href=\"https://apple.stackexchange.com/questions/tagged/iphone-5s\" class=\"post-tag\" title=\"show questions tagged &#39;iphone-5s&#39;\" rel=\"tag\">iphone-5s</a> and a synonym to <a href=\"https://apple.stackexchange.com/questions/tagged/iphone5s\" class=\"post-tag\" title=\"show questions tagged &#39;iphone5s&#39;\" rel=\"tag\">iphone5s</a> as well as <a href=\"https://apple.stackexchange.com/questions/tagged/iphone-5c\" class=\"post-tag\" title=\"show questions tagged &#39;iphone-5c&#39;\" rel=\"tag\">iphone-5c</a> and its synonym.</p>\n\n<p>Let's use this post to discuss the pros and cons of having separate tags (vs all using iPhone or all using iPhone 5 vs emacs vs vi et.cetera.)</p>\n\n<p>For what it's worth, you ran into the <a href=\"https://meta.stackexchange.com/questions/187406/is-the-tag-pluralization-filter-working-correctly\">tag pluralization filter</a> which was implemented to prevent <a href=\"https://meta.stackexchange.com/questions/6752/merge-singular-and-plural-tags\">bigger messes like this</a> from happening. I believe only site moderators and staff can establish tags that contravene that filter (in this case iPhone-5s was locked since we had a pre-existing tag of iPhone-5).</p>\n\n<p>I see no special privilege that allows this, but we might be able to get one of out 10k users to test creating a tag that would normally be tripped up by the filter to know for sure.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2013-09-12T21:49:33.323","CommentCount":"8"},{"Id":"1814","PostTypeId":"1","CreationDate":"2013-09-13T07:10:08.160","Score":"1","ViewCount":"48","Body":"<p>I could swear that I commented yesterday on <a href=\"https://apple.stackexchange.com/questions/68836/where-can-i-download-safari-for-windows/94010#94010\">Where can I download Safari for Windows?</a>, but I am not seeing it now.</p>\n\n<p>Assuming it has been deleted, is there anywhere to access it, and/or see the reason for it's deletion?</p>\n","OwnerUserId":"19526","OwnerDisplayName":"user66001","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-09-13T11:03:17.490","Title":"Low rep user accessing own deleted comments","Tags":"<support><comments>","AnswerCount":"1","CommentCount":"1"},{"Id":"1815","PostTypeId":"2","ParentId":"1814","CreationDate":"2013-09-13T11:03:17.490","Score":"4","Body":"<p>Yes, a moderator removed the comment because it wasn't related to any question or answer particularly and was rather discussion about who might have downvoted an answer.  No-one, not even moderators, can see who voted for who (unless there is a pattern of vote abuse that is picked up by the system and alerted to us) and questioning a user on their voting isn't considered appropriate.</p>\n\n<p>Unlike for questions, reasons are not stored for edits and deletion of comments so there is nothing to see.  As mentioned by @Mat, only moderators can see deleted comments.</p>\n","OwnerUserId":"9495","LastActivityDate":"2013-09-13T11:03:17.490","CommentCount":"6"},{"Id":"1816","PostTypeId":"1","CreationDate":"2013-09-13T11:39:23.320","Score":"4","ViewCount":"54","Body":"<p>It seems to be an ongoing pattern that Apple regularly upgrades product designations by adding the letter \"S\" to the end of a product name. Thus, the iPhone 3G was succeeded by the iPhone 3GS; the iPhone 4 was followed by the iPhone 4S, and this week the iPhone 5S was announced as the upgrade from the iPhone 5.</p>\n\n<p>Our site has product specific tags, and while I'm not convinced that is a good thing, many users are, and thus when a new product is launched, we frequently encounter the desire to create a tag for the new product.</p>\n\n<p>The Stack Exchange tag system, in an attempt to block the creation of useless plural tags, prohibits users from creating a tag that matches a previous tag and has an S appended to it. You cannot create a <a href=\"https://apple.stackexchange.com/questions/tagged/networks\" class=\"post-tag\" title=\"show questions tagged &#39;networks&#39;\" rel=\"tag\">networks</a> tag if there is already a <a href=\"https://apple.stackexchange.com/questions/tagged/network\" class=\"post-tag\" title=\"show questions tagged &#39;network&#39;\" rel=\"tag\">network</a>. This is a very good thing. But this check system to prevent plural tags is preventing users from creating very proper tags for newly announced products.</p>\n\n<p>This has happened <a href=\"https://apple.meta.stackexchange.com/questions/831/could-we-allow-the-creation-of-iphone-4s-tag\">before</a> and it just came up <a href=\"https://apple.meta.stackexchange.com/questions/1812/trying-to-create-iphone-5s-tag\">again</a>.</p>\n\n<p>Is there any way we could relax the anti-plural filter so non-moderator users of sufficient reputation could create appropriate tags on our site without requiring moderator intervention?</p>\n","OwnerUserId":"9388","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2013-09-16T16:40:01.620","Title":"Plural guard registering false positives on this site","Tags":"<feature-request><status-bydesign><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"1817","PostTypeId":"2","ParentId":"1816","CreationDate":"2013-09-13T14:59:09.380","Score":"3","Body":"<p>It wouldn't be advisable to relax a basic sanity check that works the vast, vast majority of the time. Like you said, most of the time this is a very good thing.</p>\n\n<p>On the rare occasion where a tag like <a href=\"https://apple.stackexchange.com/questions/tagged/iphone-5s\" class=\"post-tag\" title=\"show questions tagged &#39;iphone-5s&#39;\" rel=\"tag\">iphone-5s</a> is <em>needed</em>, a moderator can create it. That's why we call them <em>exception handlers.</em> They can create tags like this.</p>\n","OwnerUserId":"3","LastEditorUserId":"3","LastEditDate":"2013-09-16T16:40:01.620","LastActivityDate":"2013-09-16T16:40:01.620","CommentCount":"3"},{"Id":"1818","PostTypeId":"2","ParentId":"1787","CreationDate":"2013-09-18T20:44:59.673","Score":"2","Body":"<p>Please make sure to read prior discussion of this, especially <a href=\"https://meta.stackexchange.com/a/18318/160917\">https://meta.stackexchange.com/a/18318/160917</a>.  Our moderators are impressively knowledgeable, but I don't think it would make sense to have them select which answers should be accepted.  One of the principles of this site is that the wisdom of the community is, in aggregate, far greater than the wisdom of any one person (even one of our esteemed moderators).  Therefore, it makes more sense to reserve moderators for process issues -- not to substitute their judgement on substantive issues for that of the community.</p>\n","OwnerUserId":"24154","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2013-09-19T05:34:36.957","CommentCount":"3"},{"Id":"1819","PostTypeId":"1","AcceptedAnswerId":"1820","CreationDate":"2013-09-19T10:44:30.430","Score":"3","ViewCount":"44","Body":"<p>Suitability of Question:</p>\n\n<p>As iOS 7 is new. Is it suitable to ask a question regarding:</p>\n\n<p><strong>iOS 7 Tips and Tricks ?</strong></p>\n\n<p>Similar questions include:</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/5435/got-any-tips-or-tricks-for-terminal-in-mac-os-x\">Got any tips or tricks for Terminal in Mac OS X?</a></p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/400/please-share-your-hidden-os-x-features-or-tips-and-tricks\">Please share your hidden OS X features or tips and tricks</a></p>\n\n<p>Is this wiki style question now not so desirable anymore ? </p>\n","OwnerUserId":"35244","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2013-09-19T10:45:50.400","Title":"iOS 7 Tips and Tricks?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"1820","PostTypeId":"2","ParentId":"1819","CreationDate":"2013-09-19T10:45:50.400","Score":"3","Body":"<p>We have one here:</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/101382/what-are-some-hidden-or-undocumented-features-in-ios-7\">What features in iOS 7 make a difference?</a></p>\n\n<p>Free free to just tag on the coat-tails of it without starting a new one.</p>\n","OwnerUserId":"9495","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2013-09-19T10:45:50.400","CommentCount":"1"},{"Id":"1821","PostTypeId":"1","CreationDate":"2013-09-19T13:24:47.850","Score":"2","ViewCount":"26","Body":"<p>We've had many, many questions about call blocking and most of them are quite outdated.</p>\n\n<p>I've tried to find the best canonical question and this is the one I propose we maintain as the primary target for closing duplicates.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/34157/call-blocking-for-iphone\">Call blocking for iPhone?</a></li>\n</ul>\n\n<p>It's the simplest, least convoluted, and also fairly old and well indexed already by major search engines.</p>\n\n<p>I'll post an answer with the duplicates I've closed there (no merging yet)</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-09-19T13:24:47.850","Title":"I'm looking for a canonical question on call blocking to help clean up the main site","Tags":"<discussion>","AnswerCount":"0","CommentCount":"2"},{"Id":"1822","PostTypeId":"1","AcceptedAnswerId":"1823","CreationDate":"2013-09-21T13:33:48.430","Score":"-2","ViewCount":"50","Body":"<p>Would this be suitable as a question on Ask Different?</p>\n\n<p><strong>Using A Combination of Android &amp; iOS Devices in Everyday Digital Life?</strong></p>\n\n<p>I have often heard the phrase, if you own an iOS device that is what you should stick to, in order to immerse yourself &amp; harmonise your activities within Apple's ecosystem.</p>\n\n<p>Similarly if you own an Android smartphone, you should own an Android tablet in order to immerse yourself &amp; harmonise your activities within the Android/Google Ecosystem.</p>\n\n<p>Whilst this makes perfect sense to me......</p>\n\n<p>If one were to combine an iDevice, either iPhone or iPad with an Android device (either smartphone or tablet), and therefore immersing yourself in both worlds.</p>\n\n<p>Is one giving oneself additional hassle in everyday life with such an arrangement (as opposed to just to sticking to one or the other) ?</p>\n","OwnerUserId":"35244","LastEditorUserId":"5472","LastEditDate":"2013-09-21T15:05:33.193","LastActivityDate":"2013-09-21T15:05:33.193","Title":"How suitable is this example question for the main site?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"3"},{"Id":"1823","PostTypeId":"2","ParentId":"1822","CreationDate":"2013-09-21T14:50:03.557","Score":"3","Body":"<p>Seem to run afoul of the guidelines to have a practical question. </p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/help/dont-ask\">https://apple.stackexchange.com/help/dont-ask</a></li>\n</ul>\n\n<p>What specific problem would you be trying to solve by asking a question like the one you proposed? </p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-09-21T14:50:03.557","CommentCount":"8"},{"Id":"1824","PostTypeId":"1","AcceptedAnswerId":"1825","CreationDate":"2013-09-22T17:28:20.497","Score":"8","ViewCount":"86","Body":"<p>I just wanted to post this as a featured item to let everyone know that we have a lot more traffic than normal which means a lot of new users.</p>\n\n<p>I want to thank everyone who is adding constructive comments and downvotes to the inevitable influx of poor quality posts.</p>\n\n<p>I would encourage people to avoid using spam flags for posts that have zero constructive comments, zero down votes and are not actually commercial promotions or offensive speech.</p>\n\n<p>Furthermore, we're declining more than the usual flags for the <strong>not an answer</strong> reason when the post is clearly an attempt to answer (it's not a me too, or an entirely new question) and it's in some way not the answer an expert might give or it even is a totally wrong answer.</p>\n\n<p>Please try to be patient with new users. Assume they are here to learn and contrite and perhaps use the other flag to explain precisely what you feel is harmful to the site by leaving the post up. We can mark those flags as helpful much easier than if we ding a new account for spam just because they posted a wrong answer. Also, it saves the system from de-prioritizing your future flags since an accumulation of several declined flags puts your input at the bottom of the list.</p>\n\n<p>The majority of the flags are awesome and the vast majority merited some flag - just that severe flags are being used for trivial posts that a simple edit or a helpful comment and some patience will clear up.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2013-09-26T16:50:42.990","LastActivityDate":"2013-09-26T16:50:42.990","Title":"Site traffic -> new users -> an influx of invalid spam flags","Tags":"<discussion><flagging>","AnswerCount":"1","CommentCount":"3"},{"Id":"1825","PostTypeId":"2","ParentId":"1824","CreationDate":"2013-09-23T01:40:40.723","Score":"4","Body":"<p><strong>42</strong></p>\n\n<p><sub>(unanswered questions get bumped back to the top later when we least expect it, so to prevent this from happening, I've posted an \"answer\" to this \"question.\" The question is indeed a timely reminder and a useful use of the <a href=\"https://apple.stackexchange.com/questions/tagged/featured\" class=\"post-tag\" title=\"show questions tagged &#39;featured&#39;\" rel=\"tag\">featured</a> tag. Besides, you can't go wrong with the answer 42.)</sub></p>\n","OwnerUserId":"9388","LastActivityDate":"2013-09-23T01:40:40.723","CommentCount":"2"},{"Id":"1826","PostTypeId":"1","CreationDate":"2013-09-23T14:57:29.957","Score":"6","ViewCount":"85","Body":"<p>In reference to <a href=\"https://apple.meta.stackexchange.com/questions/1824/site-traffic-new-users-an-influx-of-invalid-spam-flags\">this other meta question</a>:</p>\n\n<blockquote>\n  <p>I would encourage people to avoid using spam flags for posts that have\n  zero constructive comments, zero down votes and are <em>not actually\n  commercial promotions</em> or offensive speech. &nbsp; <em>[emphasis mine]</em></p>\n</blockquote>\n\n<p>I expect those of us who use the flagging system work from a standpoint of <em>\"I'll know it when I see it\"</em> &mdash; but we don't all see things the same way in the face of ambiguity.</p>\n\n<p>As a moderator elsewhere in the SE network, I've developed a somewhat low threshold for considering a post spam, and since I hang out here too I consider it my civic responsibility to put my nose to good use.  (Actually, I really just want a shiny <a href=\"https://apple.stackexchange.com/help/badges/73/marshal\">Marshal badge</a>. :)</p>\n\n<p>So, under my thinking:  If a new, mostly unidentified, unregistered, 1-rep user posts an answer to an old question, and the answer mentions/links to a <strong>commercial</strong> product or service, or a sketchy blog/article linking to such, my shit-detector goes off.</p>\n\n<p>I ask myself: Why, out of the blue, did a completely new user come to the site and post a commercial link-containing answer to an old, already-answered question (i.e. quite often <strong>not</strong> a question on the home page) for a problem they aren't having?</p>\n\n<p>The simple explanation is it's a spammer using a <strong>targeted search</strong> for places to astroturf.  Since most spam are one-offs, I often don't wait for a pattern to emerge.  This isn't a criminal court, and presumption of innocence isn't necessary. I work on the balance of the probabilities. Deleting a seemingly spammy post isn't the death sentence.</p>\n\n<p>But that's me.  I've had some flags rejected.  Maybe I'm too quick to judge?</p>\n\n<p>So:  What is (or should be) the objective criteria or definition here at Ask Different for considering something spam or commercial promotion?</p>\n\n<p>If the current standard is tacit, can we work to write it down?  If there isn't such a standard, can we work to establish one?  What do you think of the criteria I mentioned above?  It's easy to recognize <em>obvious</em> spam (\"Buy now! Operators are standing by!\") and also spam where there's a clear pattern, but what about quick &amp; subtle one-offs?</p>\n\n<p>Thanks!</p>\n","OwnerUserId":"116","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2013-09-23T19:29:39.260","Title":"Could we set out objective criteria for what is \"spam\" or \"commercial promotion\" here?","Tags":"<discussion><flagging><moderation><spam>","AnswerCount":"3","CommentCount":"1"},{"Id":"1827","PostTypeId":"2","ParentId":"1826","CreationDate":"2013-09-23T15:20:30.513","Score":"2","Body":"<p>This</p>\n\n<blockquote>\n  <p>So, under my thinking: If a new, mostly unidentified, unregistered, 1-rep user posts an answer to an old question, and the answer mentions/links to a commercial product or service, or a sketchy blog/article linking to such, my shit-detector goes off.</p>\n</blockquote>\n\n<p>describes the way I look for spam myself  quite nicely. So if you follow that approach to flag stuff as spam (especially for answers around the usual suspects like video conversion and data recovery of any kind) you'll probably have a rather high approval rate. It may not be 100% though because a single message by a single user may or may not be considered as spam by the moderator handling the flag.</p>\n\n<p>What's actually more an issue (and which the driver behind the question linked to) is that sometimes users tend to flag stuff they don't like or agree with (and at least partially use the \"spam\" option for whatever reason). We have taken up a more relaxed position here recently and are rejecting flags for things which are at least slightly on-topic.</p>\n","OwnerUserId":"9058","LastActivityDate":"2013-09-23T15:20:30.513","CommentCount":"1"},{"Id":"1828","PostTypeId":"2","ParentId":"1826","CreationDate":"2013-09-23T16:21:56.333","Score":"3","Body":"<p>I'm mainly interested in avoiding false positives. If someone is legitimate new user to our site and wants to find question they can answer, one way to get a foot in the door might be to recommend a piece of software that solves someone's problem. Of course this is also the model for how a spammer would operate. My main concern is avoiding alienating new users who actually plan to contribute to the site while weeding out the spam.</p>\n\n<p>If a user's first post is to recommend software that actually is relevant to solving someone else's problem, I'm inclined to give the user the benefit of the doubt. Now if the same piece of shady software keeps popping up in first-post recommendations, if the user only recommends software in answers and nothing else, or other conditions that I can't publicly disclose make it clear that the account is a spam account, fire away.</p>\n\n<p>Spam is harmful primarily because of its volume (thus the term Spam, in reference to the <a href=\"http://www.youtube.com/watch?v=anwy2MPT5RE\" rel=\"nofollow\">Monty Python sketch</a>). A single promotional post is either a helpful answer, in which case it will attract votes, or unhelpful, in which case it will languish without votes and be fairly innocuous. It's only when the posts become part of a larger pattern with volume that they become disruptive. So if a pattern emerges, we zap. In the meantime, we need not act too hastily unless the post is clearly promotional noise.</p>\n","OwnerUserId":"9388","LastActivityDate":"2013-09-23T16:21:56.333","CommentCount":"3"},{"Id":"1829","PostTypeId":"2","ParentId":"1826","CreationDate":"2013-09-23T19:29:39.260","Score":"1","Body":"<p>I'd be more okay with a more aggressive anti-spam approach if we had a help page about \"My message got deleted as spam but I wasn't trying to post spam. What happened and what can I do?\" that a user got a link to when their post was deleted as spam.</p>\n\n<p>That page could describe that first posts that contain either promotion of less-known software or links to blogs promoting less-known software are considered suspect, but if the user wants to get involved in the site by answering other questions in ways that don't resemble guerrilla software promotion, their posts would be less likely to be taken down.</p>\n","OwnerUserId":"9388","LastActivityDate":"2013-09-23T19:29:39.260","CommentCount":"1"},{"Id":"1830","PostTypeId":"1","CreationDate":"2013-09-24T16:10:40.103","Score":"0","ViewCount":"42","Body":"<p>I would like to ask this question or similar on the main site:</p>\n\n<p>Are there iOS apps which are specifically designed for iPhone or iPad only and cannot be used on both iDevices (with the exception of apps for making calls which I think are generally iPhone only - correct me if i'm wrong) eg <a href=\"http://discovr.info/\" rel=\"nofollow\">Discovr for iPhone</a></p>\n\n<p>The example above specifically says for iPhone, but I see no reason for it not to be used on an iPad (or is it just the marketing surrounding this particular app).</p>\n","OwnerUserId":"35244","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Suitability of Question Regarding iOS Apps?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"3"},{"Id":"1831","PostTypeId":"2","ParentId":"1830","CreationDate":"2013-09-24T16:25:41.020","Score":"2","Body":"<p>As phrased, that strikes me as a poor question for the site. </p>\n\n<p>In your case - you are asking a yes/no question.</p>\n\n<p>One answer will be yes - there are apps that only run on one device.</p>\n\n<p>Another answer will be no - there is no way to target apps to run on only one device.</p>\n\n<p>We even entertain wrong answers - so you might get both answers to the same question and have to suss out which makes more sense to you.</p>\n\n<hr>\n\n<p>In this case, what next? What problem are you actually trying to solve. It seems you are falling into the XY problem trap and not describing what you really want to do.</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/183093/editing-questions-to-solve-xy-problems\">Editing questions to solve XY problems</a></li>\n<li><a href=\"https://meta.stackexchange.com/questions/66377/what-is-the-xy-problem\">What is the XY problem?</a></li>\n</ul>\n\n<p>Basically, it reads like a \"teach me everything you know about how apps are targeted to hardware\" and not a \"I have this specific problem that I can't solve and hope an expert would explain X to me\"</p>\n\n<hr>\n\n<p>The help guide has some guidance on refining the question.</p>\n\n<p><a href=\"https://apple.stackexchange.com/help/how-to-ask\">https://apple.stackexchange.com/help/how-to-ask</a></p>\n\n<p>What parts of that guide seem to be most likely that you could use to improve that question before asking it?</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2013-09-24T16:30:48.527","CommentCount":"10"},{"Id":"1832","PostTypeId":"1","CreationDate":"2013-09-24T17:20:17.597","Score":"5","ViewCount":"45","Body":"<p>We have a lot of images that due to retina display densities, appear huge when uploaded using the stock controls.</p>\n\n<p><img src=\"https://i.stack.imgur.com/gU2OO.png\" alt=\"large, retina image\"></p>\n\n<p>When I go in and add a height control before the src, the html isn't rendered on the site:</p>\n\n<p></p>\n\n<p><img src=\"https://i.stack.imgur.com/gU2OO.png\" height=\"40\" ></p>\n\n<pre><code>&lt;img height=\"40\" src=\"http://i.stack.imgur.com/gU2OO.png\" &gt;\n\n&lt;img src=\"http://i.stack.imgur.com/gU2OO.png\" height=\"40\" &gt;\n</code></pre>\n\n<p>When you add the height tag after the src, it renders properly. Could the code be fixed so that valid img syntax works without needing to order the modifiers after the src attribute of the ing element doesn't have to come first in the post text?</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2013-09-26T17:00:20.170","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Bug in <img> tag for specifying height to reduce retina images","Tags":"<bug><status-reproduced>","AnswerCount":"1","CommentCount":"1"},{"Id":"1833","PostTypeId":"2","ParentId":"1832","CreationDate":"2013-09-24T17:24:05.897","Score":"4","Body":"<p>I'd rather this were corrected in the uploading process as requested on MSO, but fixing this might be easier and let us pop the height in after the img tag rather than having to scroll past the image src to find the the insertion point for modifying the width or height of an inline image.</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/161111/checkbox-to-include-img-html-or-automatically-resize-a-retina-display-screens\">Automatically resize high-resolution screenshots</a></li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2013-09-24T17:24:05.897","CommentCount":"0"},{"Id":"1834","PostTypeId":"2","ParentId":"1647","CreationDate":"2013-09-25T21:30:57.373","Score":"2","Body":"<p>I agree with you.  The answer does not comply with <a href=\"https://apple.stackexchange.com/help/behavior\">the StackExchange policy on self-promotion</a>.  As the policy says:</p>\n\n<blockquote>\n  <p>Avoid overt self-promotion.</p>\n  \n  <p>The community tends to vote down overt self-promotion and flag it as spam. Post good, relevant answers, and if some (but not all) happen to be about your product or website, that’s okay. However, you must disclose your affiliation in your answers.</p>\n</blockquote>\n\n<p>The answer you link to violates those guidelines.  It does not disclose the user's affiliation in the answer.  (If you go to the user's profile, you can discover the affiliation, but almost no one does that.).</p>\n\n<p>In addition, I consider the answer borderline deceptive.  The answer states:</p>\n\n<blockquote>\n  <p>I use it and it really works like a charm.</p>\n</blockquote>\n\n<p>As a reader, I would interpret that to imply that the person who wrote that is an unaffiliated user of the product.  That just invites the reader to draw inferences that are inaccurate -- and the user who posted the answer should have known better.</p>\n\n<p>I left a comment for the poster.  I'm also reflagging this answer, given how it violates site policies.  We'll see what happens.</p>\n\n<hr>\n\n<p>Update: The answer has now been edited to bring it into compliance with the site policy.  Therefore, I consider this issue to be fixed and to have a happy resolution.   Thank you for your patience and for bringing this to the attention of the community!</p>\n","OwnerUserId":"24154","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-09-30T21:47:22.380","CommentCount":"0"},{"Id":"1835","PostTypeId":"1","AcceptedAnswerId":"1836","CreationDate":"2013-09-25T22:34:18.013","Score":"2","ViewCount":"32","Body":"<p>I have a question I'd like to ask before purchasing a new iPhone that involves advice about switching carriers, carrier reception, if in my circumstances I should be going through a physical store or online and through the carrier or Apple, and buyback or exchange programs. Is this ok? Would parts be ok to ask individually? Do I need to make sure they're broad enough to not apply only to me? What's acceptable for what I want to ask?</p>\n","OwnerUserId":"37413","LastActivityDate":"2013-09-26T15:52:42.390","Title":"Can I ask a question asking for iPhone pre-purchase advice?","Tags":"<discussion><asking-questions><iphone>","AnswerCount":"2","CommentCount":"0"},{"Id":"1836","PostTypeId":"2","ParentId":"1835","CreationDate":"2013-09-26T12:40:06.027","Score":"1","Body":"<p>The main limit on what you can ask for this is making the question ask for answers that are opinion based or you ask too broad a question (see the help centre especially <a href=\"https://apple.stackexchange.com/help/dont-ask\">here</a>)</p>\n\n<p>You need to ask about one thing at a time and make it so that any answer is based on facts and not opinion. I don't think there is a problem if the question only applies to you but iy must be for a given reason.</p>\n\n<p>I would not that mobile phone contracts are complex and subject to change at any time so I would suspect the cheapest way will change and is unanswerable.</p>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-09-26T12:40:06.027","CommentCount":"0"},{"Id":"1837","PostTypeId":"2","ParentId":"1657","CreationDate":"2013-09-26T12:48:26.397","Score":"1","Body":"<p>One thing to add to the answers and/or emphasise is if you are not sure.</p>\n\n<p><strong>Look at both sites for similar questions</strong>.</p>\n\n<p>First this will help you make a choice, you know what sort of answer you want and can see what sort of answers each site gives you.</p>\n\n<p>and</p>\n\n<p>In general especially for development (ie Stack Overflow) assume that the question has been asked before and only if you can't find then ask. There are a lot of developers and users out there and you probably won't be the first.</p>\n\n<p>For example the iOSSimulator question was migrated to SO, which seems correct to me and then was immediately closed as a duplicate.</p>\n","OwnerUserId":"237","LastActivityDate":"2013-09-26T12:48:26.397","CommentCount":"0"},{"Id":"1838","PostTypeId":"2","ParentId":"1835","CreationDate":"2013-09-26T15:52:42.390","Score":"0","Body":"<p>I would hesitate to ask those sort of questions, they seem overly localised, very much point in time, and potentially of little re-use for future visitors.</p>\n","OwnerUserId":"9495","LastActivityDate":"2013-09-26T15:52:42.390","CommentCount":"0"},{"Id":"1839","PostTypeId":"1","CreationDate":"2013-09-26T15:55:09.517","Score":"11","ViewCount":"278","Body":"<p>I have provided an answer to <a href=\"https://apple.stackexchange.com/q/68738/24974\">\"Why is my MacBook Pro stuck on mute?\"</a>.</p>\n\n<blockquote>\n  <p>This is simple, this is Apple fault. I'm using Ubuntu now on my\n  macbook pro, it never suffers from the infamous headphone jack\n  problem. Removing the headphones, the internal speakers work, plug it\n  in, the headphone works.</p>\n  \n  <p>On OS X, it just doesn't work. If I dare plugging in the headphones, I\n  know that when I take it out, internal speakers will stop working,\n  they will be muted, and not come back after a while. I've stopped\n  plugging stuff in and out trying to make it work.</p>\n  \n  <p>I just installed a new OS that works.</p>\n</blockquote>\n\n<p><a href=\"https://apple.stackexchange.com/users/9495/stuffe\">stuffe</a> moderator has just deleted the answer, and commented, \"this is not an answer\".</p>\n\n<p>I really would like this undeleted. Because <a href=\"http://www.zdnet.com/blog/apple/continuing-issues-and-solutions-for-the-mbps-silent-speaker-problem/12865\" rel=\"nofollow noreferrer\">I've digged this problem so much</a>, and when I installed Ubuntu, it just didn't exist.</p>\n","OwnerUserId":"24974","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2013-10-05T11:21:04.993","Title":"Can anyone explain why this answer is not an answer?","Tags":"<discussion><moderators><moderation>","AnswerCount":"3","CommentCount":"4"},{"Id":"1840","PostTypeId":"2","ParentId":"1607","CreationDate":"2013-09-26T17:09:57.307","Score":"1","Body":"<p>This appears to be fixed.</p>\n\n<p><img src=\"https://i.stack.imgur.com/Kgf6i.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"5472","LastActivityDate":"2013-09-26T17:09:57.307","CommentCount":"0"},{"Id":"1841","PostTypeId":"2","ParentId":"463","CreationDate":"2013-09-26T21:01:11.287","Score":"1","Body":"<p>I'm going to status declined this since we're on Chrome 29 now and that visual element is long gone from Chrome's chrome.</p>\n","OwnerUserId":"5472","LastActivityDate":"2013-09-26T21:01:11.287","CommentCount":"0"},{"Id":"1842","PostTypeId":"2","ParentId":"1839","CreationDate":"2013-09-26T21:05:59.520","Score":"13","Body":"<p>Thanks for posting this up here - we always answer and would much rather have a civil discussion here rather than a to and fro in comments.</p>\n\n<p>Here are my thoughts:</p>\n\n<p>Your answer as originally posted could essentially be boiled down to \"<em>It's Apple's fault. The headphone socket does not work on OS X, use Ubuntu</em>\".  I could have used a couple of reasons for deletion such as \"Not Constructive\", or I could have added a formal post notice to it.  In my haste, I didn't explain it fully (for which I take one on the chin without prejudice) but believe me I feel confident that it would have been flagged by another user if I hadn't happened to see it first so soon after you posted it.</p>\n\n<p>I think you will agree that in the form against which I moderated it, it was not really an acceptable answer, and more of a rant, unless you were genuinely of the opinion that telling the OP that it just doesn't work by design and to use a stop using OS X on an Apple Q&amp;A site was being helpful.</p>\n\n<p>While your edit is much less combative it's still saying more or less the same thing, and using some language that isn't necessarily required which adds a negative tone to the content; \"<strong><em>If I dare</strong> plug in the headphones</em>\", why not simply state \"<strong><em>When</strong> I plug in...</em>\"?</p>\n\n<p>Even with further modification, I think there are still issues with the answer, namely:</p>\n\n<ul>\n<li><p>Your own contribution is still \"<em>Doesn't work; Use Ubuntu</em>\", and the external links are simply links with no summary or overview</p></li>\n<li><p>Your summary is incorrect, it's a hardware problem, and nothing to do with the OS.  Just because Ubuntu doesn't support the extra functions and defaults to normal headphone mode doesn't mean OS X is at fault.  Even the links you provide state for example:</p>\n\n<ul>\n<li><blockquote>\n  <p>\"Inside the jack is a very small switch that turns on and off the optical audio output while simultaneously disabling the internal speakers. The switch can be turned on by simply using headphones.\"</p>\n</blockquote></li>\n<li><blockquote>\n  <p>It seems that when removing the headphones with a yank after editing some audio, I must have accidentally flicked a switch inside the port. The MacBook Pro thought that there was still a TOSLINK connector attached even though there wasn’t anything plugged into the port.</p>\n</blockquote></li>\n</ul></li>\n</ul>\n\n<p>This sort of thing is common in a variety of devices that use headphone sockets.  Here is pretty much the same issue on someone's iPhone (Not directly caused by a <em>toslink</em> switch, but caused by a gummed up socket that has the same end result - the socket thinks something is using it): <a href=\"https://apple.stackexchange.com/questions/81879/apple-headphone-remote-doesnt-always-work/81889#81889\">Apple headphone remote doesn&#39;t always work</a> (I would suggest trying the accepted answer and seeing if it helps if you still have an OS X install on the machine).</p>\n\n<p>I hope this helps explain why I removed it.  I notice that it's been undeleted, and has since received an up vote; I won't perform any other moderation on it, as though while I feel it's borderline useful it's not actively poor any more, so it's now down to the community to accept or flag as appropriate.</p>\n\n<p>Thanks for your time, and feel free to pop into chat or engage further in Meta.</p>\n","OwnerUserId":"9495","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2013-09-26T21:05:59.520","CommentCount":"16"},{"Id":"1843","PostTypeId":"2","ParentId":"848","CreationDate":"2013-09-26T21:07:31.220","Score":"1","Body":"<p>This is resolved:</p>\n\n<p><img src=\"https://i.stack.imgur.com/OUzDl.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"5472","LastActivityDate":"2013-09-26T21:07:31.220","CommentCount":"0"},{"Id":"1844","PostTypeId":"2","ParentId":"1839","CreationDate":"2013-09-29T13:42:53.877","Score":"6","Body":"<p>No. Nobody can explain this to you because you're already convinced that you've provided a quality answer and are unpersuaded by arguments to the contrary. </p>\n\n<p>Open debate is good for the community and I'm glad you raised the issue but every respondent has pretty much told you the same thing. Mike, as is his nature, went (in my opinion) above and beyond to try to coax a quality (or at least inoffensive and somewhat useful) answer from you. You have, in my eyes and apparently to those of others, failed to meet the challenge.  No champion for your side has emerged and it's time to let this one go. I know I speak for everyone responding in saying that I hope you stick around and that I look forward to up voting future answers you provide—if they merit the vote. </p>\n","OwnerUserId":"11791","LastEditorUserId":"9058","LastEditDate":"2013-09-29T17:21:03.420","LastActivityDate":"2013-09-29T17:21:03.420","CommentCount":"1"},{"Id":"1845","PostTypeId":"1","CreationDate":"2013-10-04T19:33:50.800","Score":"0","ViewCount":"100","Body":"<p>I was going through the Suggested Edits review queue, and <a href=\"https://apple.stackexchange.com/review/suggested-edits/39619\">this</a> suggested edit came up. I pressed <strong>Improve</strong>, edited the post and submitted it.</p>\n\n<p><img src=\"https://i.stack.imgur.com/V8VFq.png\" alt=\"Revision History\"></p>\n\n<p>However, the suggested edit was <strong>only</strong> approved by Community♦…</p>\n\n<p><img src=\"https://i.stack.imgur.com/vV3Ke.png\" width=\"300\"></p>\n\n<p>Why (and how) did this happen?</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-07-22T10:16:54.660","Title":"My suggested edit review didn't count as a review for me","Tags":"<bug><status-bydesign><suggested-edits>","AnswerCount":"1","CommentCount":"8"},{"Id":"1846","PostTypeId":"2","ParentId":"1839","CreationDate":"2013-10-05T11:21:04.993","Score":"2","Body":"<p>I've been there many times, in different StackExchange websites. Got many of my questions deleted. Got few of my answers heavily down-voted. <em>It's very frustrating indeed.</em> But I've never been on the other side: being a mod. So I can only assume...</p>\n\n<p>To me, the moderators are doing a very heavy job, most of the time. All of the ones I've crossed by are highly skeptical and knowledgeable people. Almost always they know much more than I do on the site's subject. That's how they got so interested on the subject to dedicate so much time of their life writing and reading about it.</p>\n\n<p>That being said, not all mods are the same, but most of them like to <strong>keep things clean</strong>. Thus, <em>deleting</em>. Simply put, it was deleted because he thought it was actually a bad answer for the site. He said it so in his own words.</p>\n\n<p>I disagree with his position, but I understand where he comes from. Your answer is indeed and already proven, even today, not well accepted by the community. Almost nobody with a Mac OSX will want to install any other OS. It makes very little sense to do so.</p>\n\n<p>If I were to be a mod I <em>think</em> I'd never delete anyone's post, unless it's plain spam. Ever. You see, I don't mind if things aren't perfectly clean. I love [kbd]CMD[/kbd]+F, gmail and google for the same reasons. That's what makes it even more frustrating when someone does it. It seems to be <strong>very inconsiderate</strong>.</p>\n\n<p>But, truth is, <em>stuffe</em> wasn't ignoring you at all. I'd say probably no moderator delete any post without some consideration.</p>\n\n<p>In the end, I think this is all just 2 very different worlds colliding and, if you want to \"be accepted\" in any of the SEN sites, you have to forego many of your pre-conceived concepts. First, about other people hurting you. Nobody here is trying to get that personal. Then, about feelings, emotions and even opinions. Not really welcomed here. As I see it, SEN is about consensus and focus.</p>\n\n<p>I find it unfortunate in some cases, but well, nothing is perfect. Quora is a good counter example in which you can ask much broader questions and, thus, get much less specific answers.</p>\n\n<p>In any case, wish you the best dude. I'm thankful your answer got undeleted already.</p>\n","OwnerUserId":"1174","LastActivityDate":"2013-10-05T11:21:04.993","CommentCount":"6"},{"Id":"1847","PostTypeId":"1","CreationDate":"2013-10-08T04:09:40.383","Score":"7","ViewCount":"558","Body":"<p>For some reason, I've got two OpenID accounts on StackExchange. I use only one of them to login to AskDifferent. I've already removed unwanted one from 'my logins' list in my profile page, but I've got no idea how to completely delete  unnecessary OpenID account. Please, help.</p>\n","OwnerUserId":"58740","LastActivityDate":"2014-04-23T08:48:43.713","Title":"How can I delete my StackExhange OpenID?","Tags":"<support><user-accounts><openid>","AnswerCount":"1","CommentCount":"4"},{"Id":"1848","PostTypeId":"2","ParentId":"1847","CreationDate":"2013-10-08T11:32:47.200","Score":"3","Body":"<p>If you wish to merge the posts, you can start here: <a href=\"https://apple.stackexchange.com/help/merging-accounts\">https://apple.stackexchange.com/help/merging-accounts</a></p>\n\n<p>To just delete of one account is here: <a href=\"https://apple.stackexchange.com/help/deleting-account\">https://apple.stackexchange.com/help/deleting-account</a></p>\n\n<p>You might be able to delete the alternate open id yourself from your account page: <a href=\"https://meta.stackexchange.com/questions/67356/openid-delete-account\">OpenID Delete account</a></p>\n\n<ul>\n<li>go to <a href=\"https://apple.meta.stackexchange.com/users/58740/littlenimrod\">https://apple.meta.stackexchange.com/users/58740/littlenimrod</a></li>\n<li>select my logins from the list of links near the top of the screen</li>\n</ul>\n\n<p>Worst case, the contact us form in the top two links will get a site employee to assist as moderators no longer merge user accounts or have access to those tools directly. </p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2013-10-10T11:15:01.923","CommentCount":"0"},{"Id":"1849","PostTypeId":"1","AcceptedAnswerId":"1850","CreationDate":"2013-10-23T17:49:25.187","Score":"1","ViewCount":"38","Body":"<p>Whilst I understand that pre-release software questions are not permitted, once the public version of the software is released, can I ask questions regarding the pre-release versions?</p>\n\n<p>For example, would the following questions be permissible?</p>\n\n<ul>\n<li>What are the differences between Mavericks GM and public release?</li>\n<li>Is a pre-release version of iTunes able to manage devices with a public release of iOS?</li>\n</ul>\n","OwnerUserId":"37797","LastActivityDate":"2013-10-23T19:06:09.527","Title":"Are questions regarding pre-release software allowable once the public version of the software has been released?","Tags":"<discussion><prerelease>","AnswerCount":"1","CommentCount":"0"},{"Id":"1850","PostTypeId":"2","ParentId":"1849","CreationDate":"2013-10-23T19:06:09.527","Score":"3","Body":"<p>I would say no - we shouldn't muddy the waters with questions about pre-release software. However, we do allow questions about how to get back into a release version from the beta version and if that teases out information about the beta to correctly answer the question I see no reason to remove that information.</p>\n\n<p>I see things this way - the audience for beta software is very small before it's released. Now after that window has passed, even fewer people can get the software and those that did get locked out quite rapidly since Apple is in the habit of expiring all beta software (search Apple discussions and this site for all the urgent questions about what to do when beta Mountain Lion and beta iOS 6 software stops working).</p>\n\n<p>However, just because I say no in general, it's fine to try one question if you're OK with it getting closed / edited / worked on (or over) as appropriate.</p>\n","OwnerUserId":"5472","LastActivityDate":"2013-10-23T19:06:09.527","CommentCount":"0"},{"Id":"1851","PostTypeId":"1","CreationDate":"2013-10-24T10:33:48.117","Score":"7","ViewCount":"144","Body":"<p>A new OS X release, and a new Community Wiki question, and a further round of hand wringing over what the use of these questions means on the site, and whether they should be encourage, discontinued, modified etc.</p>\n\n<p>Without putting my particular stance in the question to avoid answers agreeing or disagreeing or discussing it, can I ask that anyone with an opinion on them please put that opinion in an answer, and for people to discuss each answer in appropriate comments rather than with other answers (unless the answer you subsequently add is to describe your own thoughts, rather than comment on anothers).</p>\n\n<p>Things you might like to think about (obviously this is just a braindump and not full guidance - bring your own thoughts):</p>\n\n<ul>\n<li>Do we have too many</li>\n<li>Should anyone be able to set them up, or should it be an earned priviledge, or a Mod action</li>\n<li>Should there be a seperate \"On Topic\" entry for this type of question</li>\n<li>Should we close them on sight</li>\n<li>Do they have any value that is less easily replicated on a traditional Q&amp;A</li>\n<li>Should they be located on Meta</li>\n<li>Can a change of format make them more useful</li>\n<li>Do they detract from the rest of the site</li>\n<li>Is their value transitional, do they lose relevance over time</li>\n<li>Should we provide a template for questions for consistency</li>\n<li>Do they drive users to the site</li>\n<li>Do they drive users away</li>\n<li>Are they popular with regular site users</li>\n<li>Are they an embarassment to other SE site users</li>\n</ul>\n\n<p>There's lots to think about, and many pros and cons to discuss.  If everyone with a strong enough opinion writes their monologue below as an answer, perhaps enough of a theme can be picked out to direct future use of them.</p>\n","OwnerUserId":"9495","LastActivityDate":"2013-10-24T22:01:14.897","Title":"Please can you add your opinion on Community Wiki questions to aid in identifying a common approach to future instances","Tags":"<discussion><community-wiki>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"1"},{"Id":"1852","PostTypeId":"2","ParentId":"1851","CreationDate":"2013-10-24T13:01:37.970","Score":"6","Body":"<p>These one-per-OS-release questions don't have a right answer (if they did, there would be an accepted answer, but clearly there is no canonical correct answer to them). They aren't an ideal fit for our Q&amp;A format. The Q&amp;A engine doesn't scale particularly well to questions with many pages of answers; the earlier answers pick up votes, and thus remain on page one, and thus pick up more votes (repeat ad infinitum). So I think the questions aren't really a good fit for the site.</p>\n\n<h1>BUT…</h1>\n\n<p>I <em>do</em> find them useful when I'm first navigating a new operating system. What are the new features and stumbling blocks that aren't what you find in Apple's release PR or the five paragraph release at MacWorld? What are the implications for end users that aren't in John Siracusa's metadata-oriented exhaustive review?</p>\n\n<p>For some previous OS releases, John Gruber had an <a href=\"http://daringfireball.net/2005/04/tiger_details_list\" rel=\"nofollow\">interactive collection of little features</a> that users could contribute to. I really do think there's some utility to this that isn't being met by existing venues, and by having it here, there are some pluses:</p>\n\n<ul>\n<li>users get excited about it (these questions get a <strong>lot</strong> of votes)</li>\n<li>attracts search engine traffic and external links</li>\n<li>gives people a chance to contribute who might not otherwise be able to answer people's questions</li>\n<li>our voting mechanism gives the list an order in terms of which features are most/least important to other readers beyond the submitter</li>\n<li>the community is excited about the new OS (unless we aren't), and want to share our observations</li>\n<li>it's fun</li>\n</ul>\n\n<p>These questions take a lot of active maintenance. They don't age particularly well. But when the questions are first set up, they're both exciting and useful (and it's usually two questions a year — hardly filling up the front page for people who dislike these).</p>\n\n<h1>So my proposal is this:</h1>\n\n<p>We have a set window of time (45 days?) in which the question is open for people to contribute their discoveries about the new OS.  At the end of the window, we close the question to new answers, but leave unlocked so people can continue to vote and edit for another window of time (15 days?).</p>\n\n<p>After the two windows (60 days after original post?) we would lock the question using the \"historical significance\" reason and potentially ask the community to roll the question and answer into a blog post on the Ask Different Blog showing the features, in voted order, that people discovered about the new OS.</p>\n","OwnerUserId":"9388","LastEditorUserId":"5472","LastEditDate":"2013-10-24T18:42:55.210","LastActivityDate":"2013-10-24T18:42:55.210","CommentCount":"7"},{"Id":"1853","PostTypeId":"1","AcceptedAnswerId":"1854","CreationDate":"2013-10-24T14:15:46.733","Score":"1","ViewCount":"29","Body":"<p>With regards to this question entitled <a href=\"https://apple.stackexchange.com/questions/106331/change-dock-color-on-left-right-site-in-os-x-10-9-mavericks\">Change Dock color on left/right site in OS X 10.9 Mavericks.</a></p>\n\n<p>I came across this edit which I ve never seen before:</p>\n\n<p><img src=\"https://i.stack.imgur.com/udkjf.png\" alt=\"enter image description here\"></p>\n\n<p>Is it new or just the fact it is not used very often ?</p>\n","OwnerUserId":"35244","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2013-10-24T14:32:39.187","Title":"Is This A New Edit Feature?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"1854","PostTypeId":"2","ParentId":"1853","CreationDate":"2013-10-24T14:32:39.187","Score":"2","Body":"<p>It's not new, it just a quoted section starting with <code>&gt;</code>. You can see for yourself how it's done by just clicking on <code>edit</code> and having a look at the raw text.</p>\n\n<p>If you want to see all the formatting options/commands, you can either click on the blue question mark at top right of any edit windows or look at the <a href=\"https://apple.meta.stackexchange.com/editing-help\">Markdown Editing Help</a>.</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.967","LastActivityDate":"2013-10-24T14:32:39.187","CommentCount":"3"},{"Id":"1855","PostTypeId":"2","ParentId":"1851","CreationDate":"2013-10-24T21:11:30.603","Score":"2","Body":"<p>I like Community Wikis (and for clarity, I am referring to ones created deliberately for the purposes of listing cool features and <em>tiny things</em> etc), provided they are done right, but think that the current system makes them hard to manage and leads to variable quality.</p>\n\n<p>Reasons I like them:</p>\n\n<ul>\n<li>They make people contribute.</li>\n<li>They drive page views, and new users (me!)</li>\n<li>They quickly seed the site with really useful SEO keywords for new phrases and features that are introduced in new products.</li>\n<li>They get people voting, and commenting.</li>\n<li>They are an <em>Event</em>, that brings the community together.</li>\n<li>The result (when done right) in a good reference resource that is quite fun to read, and enjoyable to participate in rather than dry reviews and blog posts.  People are not reviewing the OS, or product, they are showing their delight at particular bits which they really appreciate, and helping to crowdsource the Ask Different review, in a way.</li>\n<li>The voting aspect means that rather than being a duplication of stuff you can read elsewhere, it's a case of the community ranking those features by most useful.</li>\n</ul>\n\n<p>So, for me I think that they should stay, nominally in the same format that they do now, however with the following provisos</p>\n\n<ul>\n<li>They should not be created by anyone - there is a bit of a painful rush to be the one who creates the one for iOS8 etc, and as a result the first attempt at creating one is often done poorly.</li>\n<li>They should be created by a Mod, using a predefined template, preferably several days earlier than required and then temporarily put on hold until they become appropriate to open properly.  This should help in two ways, firstly they get worded correctly, secondly any user trying to duplicate it by creating their own <em>should</em> see it as a duplicate before posting</li>\n<li>We should stop trying to force these square pegs into round holes by attempting to word the question in a way that tries to justify it as a genuine Q&amp;A style problem.  Requesting <em>undocumented</em>, or worse <em>under-documented</em> features is just a horrible hack to try to make it a real question.  We know the purpose of these CWs is to <em>talk about cool stuff!</em>.  Every time someone starts commenting on the answers showing links to where an answer is already documented online, or arguing about what constitutes <em>documented</em>, and it just turns some of the comments into little sniping matches that saps the fun.  Let's just be honest about the purpose of the questions.</li>\n<li>The answers need to be policed more carefully.  No more one line answers with a screenshot that don't add to the equation, let's get people being effusive about why they contributed this answer.  Some of this would be down to the question wording to ensure people aren't just racing to tick off the features lists.</li>\n<li>The whole thing should be protected for a day or so after opening so only repped users can set the ball rolling with quality answers that serve as an example of how to answer.</li>\n<li>They should be appropriately tagged with a tag that shows that it is more of a participation piece, than a question - Not sure what we would use, other sites have the idea of \"canonical\" answers etc.</li>\n<li>Our site guidelines should be updated to reflect the above as CW policy, to show that for appropriately created CWs they are on topic</li>\n</ul>\n\n<p>The above should go a long way to making them more enjoyable for everyone.  Not having a clear policy (whichever one is agreed) always invites some random Mod or high rep users from other sites to come and poke fun at our site.  These questions are unique in style to Ask Different, they don't appear on any other SE site, and while they are clearly not a genuine Q&amp;A format, sure that is <em>exactly</em> why we have the concept of the Community Wiki - for what other purpose does it exist if not for the couple of times a year when we might want to do the above.  Other sites have their own idiosyncrasies that are not a perfect SE fit, whether it's \"Name that book\" or recommendation based questions.  This is Ask <em>Different</em>, not Ask <em>Like a all the other SE sites using this prescriptive format for every single contribution</em>.</p>\n\n<p>There remains however, one problem that I do not know how to resolve.  As these are genuine <em>point in time</em> questions, it's invariable that the earliest answers often gain the most votes.  Sometimes it's almost as if people read the list up voting every answer, and in this way the highest voted answer is often just the earliest.  I don't know how to fix this, other than to see if we can just sort question answer randomly for CWs.</p>\n","OwnerUserId":"9495","LastEditorUserId":"9388","LastEditDate":"2013-10-24T22:01:14.897","LastActivityDate":"2013-10-24T22:01:14.897","CommentCount":"5"},{"Id":"1856","PostTypeId":"1","AcceptedAnswerId":"1857","CreationDate":"2013-10-25T12:45:25.867","Score":"6","ViewCount":"42","Body":"<p>I have a problem with an app in my iPhone, and I tried everything I could find in the internet.</p>\n\n<p>Is it ok to ask those questions here?</p>\n","OwnerUserId":"2587","LastActivityDate":"2013-10-27T23:43:46.357","Title":"Is it ok to ask about problems with specific apps?","Tags":"<discussion>","AnswerCount":"2","CommentCount":"0"},{"Id":"1857","PostTypeId":"2","ParentId":"1856","CreationDate":"2013-10-25T12:48:31.710","Score":"4","Body":"<p>Fine by me, so long as it's a genuine problem, one that you have showed effort in resolving, and one that is on topic then that's fine.  We don;t just do Apple software support, we look after you guys running apps on Apple hardware.  One potential issue is that your question may be flagged as too localised, depending on the nature of your (unspecified) problem, but if give it a go - even if the question is not perfect, we can help you fix it up so it passes muster.</p>\n","OwnerUserId":"9495","LastActivityDate":"2013-10-25T12:48:31.710","CommentCount":"2"},{"Id":"1858","PostTypeId":"2","ParentId":"1856","CreationDate":"2013-10-27T23:43:46.357","Score":"1","Body":"<p>Yes, asking questions about software running on Apple products is on-topic for this site.</p>\n\n<p>The more concrete your question and <a href=\"https://apple.stackexchange.com/help/how-to-ask\">the more details you supply</a> about what you want to accomplish, what happens when you try, and what you've tried to do to fix the problem, the more likely \nyou are to get an answer that helps you.</p>\n\n<p>In general, a post ranting that \"this software doesn't work!\" is unlikely to get you any useful advice, but \"I'm trying to enter multi-player mode on CoolGame.app version 1.3.2, but when I tap <code>Multi-Player</code>, it just brings up a splash screen and does not actually start a game. The web site for the game advertises multi-player mode, but I can't seem to bring it up. Does anyone have any advice?\" is more likely to get you somewhere.</p>\n","OwnerUserId":"9388","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-10-27T23:43:46.357","CommentCount":"0"},{"Id":"1859","PostTypeId":"1","CreationDate":"2013-10-28T14:19:36.847","Score":"5","ViewCount":"53","Body":"<p>I recently earned the Famous Question badge [10k views] for <a href=\"https://apple.stackexchange.com/questions/63911/app-store-an-unknown-error-has-occurred-apple-support-fix-was-only-temporary\">App Store &quot;An Unknown Error Has Occurred&quot;, Apple Support fix was only temporary. How fix permanently?</a></p>\n\n<p>I note that there are still low votes on both the question, the answer, and a hackintosh specific answer. Is this a known phenomenon within Apple.SE or the entire SE family of sites? </p>\n\n<p>I am not complaining here, I asked and answered my own question. I am proud that it is viewed often. I hope that means people are searching, finding my question, and getting the answer they need. </p>\n","OwnerUserId":"28919","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2013-10-29T00:00:08.603","Title":"Is having a question with high views and low votes common?","Tags":"<discussion><voting><badges>","AnswerCount":"2","CommentCount":"3"},{"Id":"1860","PostTypeId":"2","ParentId":"1859","CreationDate":"2013-10-28T15:17:55.370","Score":"4","Body":"<p>Given <a href=\"https://apple.stackexchange.com/search?page=6&amp;tab=votes&amp;q=views%3a10000%20closed%3ano%20score%3a..3\">these search results</a>, I would say that the phenomenon is far from rare.</p>\n\n<p>There are 288 posts with at least 10,000 views with a score of 3 or lower. My cutoffs were arbitrary there, but you can play with the parameters and see that there are many posts with lots of page views and low scores.</p>\n","OwnerUserId":"9388","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2013-10-28T15:17:55.370","CommentCount":"1"},{"Id":"1861","PostTypeId":"2","ParentId":"1859","CreationDate":"2013-10-28T20:34:20.900","Score":"5","Body":"<p>This is, I believe, a systemic problem with the user base of Ask Different*. Sites like Stack Overflow, where the approach to Q&amp;A was pioneered and little better ingrained in the user base, don't seem to have it quite as bad as we do**.</p>\n\n<p>We attract a lot of search queries for problems and solutions that would otherwise have lead people to more traditional Q&amp;A type stuff: MacWorld, blogs, traditional forums, etc. We have great content here that covers a wide range and great depth of subject matter, so we pull a good deal of search traffic from these topics. Unfortunately, the people looking for answers to these topics tend to not be greatly familiar with our Q&amp;A approach: if you like something, vote it up. We get a lot of \"thank you\" type posts and comments we have to clean up as mods -- which is pretty clear indicator if you ask me that people visiting here often don't get that you don't write a thank you, you say thanks by clicking the upvote button.</p>\n\n<p>So how do we solve this problem? That, I'm afraid, I have no good answers for.</p>\n\n<pre><code>* Completely speculative, I have no hard data for this.\n** Also speculative, don't press me for data 'cause I'll crumble under scrutiny here.\n</code></pre>\n","OwnerUserId":"292","LastEditorUserId":"9388","LastEditDate":"2013-10-29T00:00:08.603","LastActivityDate":"2013-10-29T00:00:08.603","CommentCount":"1"},{"Id":"1862","PostTypeId":"1","CreationDate":"2013-10-29T20:26:53.183","Score":"4","ViewCount":"88","Body":"<p>I'm stuck with <a href=\"https://apple.stackexchange.com/questions/105391/what-options-exist-to-reliably-have-three-partitions-and-boot-camp-on-apple-hard\">this question</a>:</p>\n\n<ul>\n<li>first, it gets closed as \"too broad\"</li>\n<li>then, I try to address <a href=\"https://apple.stackexchange.com/questions/105391/what-options-exist-to-reliably-have-three-partitions-and-boot-camp-on-apple-hard#comment124040_105391\">the suggestion</a> on how it can be improved</li>\n<li>finally, that edits are effectively reverted--and moreover, last 3 bullets of original criterias are removed</li>\n</ul>\n\n<p>I wonder how I should act in the first place; why the post-close edits were reverted if asked for, and why last three bullets were removed from my question.</p>\n","OwnerUserId":"54644","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2013-10-30T20:42:05.480","Title":"Question closed as \"too broad\" followed by edits only removing pieces of the original question","Tags":"<discussion><support>","AnswerCount":"1","CommentCount":"0"},{"Id":"1863","PostTypeId":"2","ParentId":"1862","CreationDate":"2013-10-29T21:33:02.020","Score":"7","Body":"<p>I would have rather cut more bullet points, but as you can see, I <a href=\"https://apple.stackexchange.com/posts/105391/revisions\">took quite a cut of text</a> from your question to reduce the scope and make it less broad:</p>\n\n<p><img src=\"https://i.stack.imgur.com/Mz9Ok.png\" alt=\"enter image description here\"></p>\n\n<p>From our <a href=\"https://apple.stackexchange.com/help/closed-questions\">help page on closed questions</a> you can see why I removed several bullet points to eliminate the \"too broad\" problem that I saw with the question.</p>\n\n<p>Specifically, how to transfer an entire mac to a new system is quite a broad question in and of itself. Here you complicate things by having no clear picture of what you actually need. I saw your question as asking best practice to set things up - based on how that is answered, you might be able to ask how to back up each proposed \"answer\" as a follow on question.</p>\n\n<p>I still think the question is quite broad since it seems to be three questions:</p>\n\n<ol>\n<li><p>What partition format is readable by OS A and OS B where you specify exactly what version of Mac and Windows you run.</p></li>\n<li><p>How do you see upgrading / reinstalling windows as affecting Mac OS X or risk losing data? (and wouldn't having a Time Machine backup remedy things should windows hose your Mac side of things?)</p></li>\n<li><p>Why complicate things to have people guess whether OS X upgrade will or will not affect things on Windows side. That alone would be a good single question.</p></li>\n</ol>\n\n<p>Basically, the more narrow of a problem you can phrase, the more likely it will be useful to a wide variety of people. Having small, thought through, clear questions allows you and others to chain together facts and answers to make a nice summary post / question should you find some conflict between the individual pieces. As it stands, I would tend to close a question that was asked as yours is now, but I wanted to reopen it to see how it plays out and whether we can get some answers that help you since you did show effort to edit it as we asked.</p>\n\n<p>In essence, the \"reversion\" was that we asked you to narrow the question and to some extent you broadened it - so rather than ask you to go back and do your work over, I attempted to show what I saw as an improvement. Let's see what other moderators think - if they could edit or perhaps offer constructive criticism to get a) you to understand why the edits happened b) a question that's likely to get some answers.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2013-10-30T20:42:05.480","CommentCount":"6"},{"Id":"1864","PostTypeId":"1","CreationDate":"2013-11-06T16:28:38.003","Score":"7","ViewCount":"73","Body":"<p>I can't really think why this would not be a good idea:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/admin\">admin</a> 28 uses (9 this year)</li>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/administrator\">administrator</a> 14 uses (5 this year)</li>\n</ul>\n","OwnerUserId":"27759","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-09-03T00:02:12.253","Title":"Should the admin and administrator tags on the main site be merged?","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"1"},{"Id":"1865","PostTypeId":"2","ParentId":"1864","CreationDate":"2013-11-06T18:20:35.887","Score":"1","Body":"<p>I would say, let's first flush out what these tags mean to the site by having someone write a wiki summary for both tags (or at least propose what the tag <em>should</em> mean for the site in an answer here). Unless we have a good reason to keep them, let's just clean up the questions and let the nightly unused tag culling put them both out of their misery.</p>\n\n<p>What sort of questions should be collected under <a href=\"https://apple.stackexchange.com/questions/tagged/administrator\">https://apple.stackexchange.com/questions/tagged/administrator</a> and what sort of questions should be collected under <a href=\"https://apple.stackexchange.com/questions/tagged/admin\">https://apple.stackexchange.com/questions/tagged/admin</a></p>\n\n<p>It's not clear to me that we even need either of the tags and really we could edit the questions / merge them down to point to <a href=\"https://apple.stackexchange.com/questions/tagged/windows\">Windows</a> or <a href=\"https://apple.stackexchange.com/questions/tagged/osx\">OS X</a></p>\n\n<p>We could merge and then clean up later as it appears both tags suffer from vague use patterns.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-11-06T18:33:48.937","CommentCount":"2"},{"Id":"1866","PostTypeId":"1","AcceptedAnswerId":"1867","CreationDate":"2013-11-14T20:45:54.970","Score":"0","ViewCount":"40","Body":"<p>Should <a href=\"https://apple.stackexchange.com/questions/110575/is-possible-to-upgrade-ios-offline\">this question</a> be made into a community wiki post, so we can just mark any \"How do I go from iOS {x} to iOS {y}?\" questions as a duplicate of this? Of course, we would need to rephrase the actual question be quite generic, but my answer on it has already been made as generic as possible. Perhaps it should just be a new question that I just ask and answer myself and mark as a wiki. Thoughts?</p>\n","OwnerUserId":"18387","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2013-11-15T13:03:48.823","Title":"Is this a potential community wiki question?","Tags":"<discussion><community-wiki>","AnswerCount":"1","CommentCount":"0"},{"Id":"1867","PostTypeId":"2","ParentId":"1866","CreationDate":"2013-11-15T13:03:48.823","Score":"2","Body":"<p>I do not see why this sould be CW.</p>\n\n<p>The question could be made a bit more general re the iOS versions but the answer seems to stay the same. Both seem good enough and covering an explict question so that they can be a normal answer</p>\n","OwnerUserId":"237","LastActivityDate":"2013-11-15T13:03:48.823","CommentCount":"6"},{"Id":"1868","PostTypeId":"1","AcceptedAnswerId":"1869","CreationDate":"2013-11-16T03:17:22.380","Score":"1","ViewCount":"55","Body":"<p>I spent over a hour helping another user <a href=\"https://apple.stackexchange.com/q/110265/10733\">Localhost Forbidden</a> with his question.</p>\n\n<p>As he had little reputation, he went ahead and upvoted most of my questions and answers after I solved his issue with him.</p>\n\n<p><strong>Is that not allowed?</strong> the user is an independent user and I don't know him outside of ask.different.</p>\n\n<p>Is this automatic or something controlled by the moderators?</p>\n","OwnerUserId":"10733","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2013-11-16T16:17:16.797","Title":"Serial upvoting reverersal","Tags":"<support><voting>","AnswerCount":"2","CommentCount":"0"},{"Id":"1869","PostTypeId":"2","ParentId":"1868","CreationDate":"2013-11-16T03:46:25.170","Score":"5","Body":"<p>In the most literal sense, the answer to your question appears to be \"no, this is not allowed\" in the sense that the many votes you cast yesterday for a single user were invalidated, as were the many votes another user cast for you today. This is an automated part of the voting mechanism; the system sometimes disallows votes based on its (unpublished) criteria, and clearly these votes were not allowed, because if they had been allowed, your score would be higher.</p>\n\n<p>On a more philosophical level, the question remains whether they <em>should</em> be allowed, or <em>why</em> they are not allowed. While anyone with sufficient reputation can click the up arrow on anyone's post but their own up to 40 times a day if they feel so moved, there are some underlying \"shoulds\" in the way the system is designed. Ideally, users vote for posts based on their content and not on their author. If there is widespread evidence that someone's voting patterns seem to be based on who the author is and not on simply what posts they find helpful, the system is designed in such a way to identify and reverse votes that seem to be based on a pattern of voting for or against a person. The moderators are neither informed about what these patterns are nor do we have any say in intervening in them.</p>\n","OwnerUserId":"9388","LastActivityDate":"2013-11-16T03:46:25.170","CommentCount":"8"},{"Id":"1870","PostTypeId":"2","ParentId":"1868","CreationDate":"2013-11-16T16:11:23.243","Score":"1","Body":"<p>The system is designed to have votes represent only the post at hand - and have nothing to do with the person's other actions on the site.</p>\n\n<ul>\n<li>Automatic vote invalidation happens outside the tools and visibility of elected moderators. We know how it works but do not get notified when it triggers. We can check a specific user to see if it has happened to them, but we can not even inspect the algorithm used to detect it. </li>\n<li>The site developers are the ones that tune, watch, craft that tool.</li>\n</ul>\n\n<p>As you laid out the actions, it seems that the tool stepped in properly to alert you to the mis-use of the votes, but realize this isn't any sort of permanent penalty. Think of it as a warning if you were speeding on the freeway. The \"officer\" pulled you over and said - \"Glad you're having fun with the voting system, but please slow down.\"</p>\n\n<p>However, we all recognize, that sometimes a token appreciation seems insufficient for a very generous effort.</p>\n\n<p>Officially, the correct way to transfer more reputation to an answerer is to use the <a href=\"https://apple.stackexchange.com/help/bounty\">bounty mechanism</a> as opposed to searching and voting for other content. That is a much more direct and transparent mechanism to reward an outstanding contribution.</p>\n\n<p>The site unofficially has a \"pay it forward\" feeling due to the creative commons licensing. So, you could also just offer a sincere and well phrased comment about how the answer in question really was awesome (explaining why if it's not obvious) and then seek a chance to answer another user's question where you have excess knowledge to share.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-11-16T16:17:16.797","CommentCount":"0"},{"Id":"1873","PostTypeId":"1","AcceptedAnswerId":"1875","CreationDate":"2013-11-22T04:16:03.870","Score":"8","ViewCount":"132","Body":"<p>In my Stack Exchange experience, it's the first time I'm seeing this:</p>\n\n<p><img src=\"https://i.stack.imgur.com/d9FBy.png\" alt=\"current bounties\" title=\"Wow, how is this done?\"></p>\n\n<p>How does it work? Is there a minimum bounties value that triggers the banner? If it were to be suggested in other SE sites, how would one refer to this? Is there any other known site using it?</p>\n","OwnerUserId":"21950","LastEditorUserId":"1346","LastEditDate":"2013-11-23T04:22:41.770","LastActivityDate":"2013-11-24T00:22:53.120","Title":"How does the Active Bounties Banner work?","Tags":"<discussion>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"1"},{"Id":"1874","PostTypeId":"2","ParentId":"1873","CreationDate":"2013-11-22T08:01:15.973","Score":"5","Body":"<p>It was written by a couple of our Mods I believe, and you can see how it enters the site as a normal site promoted ad:</p>\n\n<p><a href=\"https://apple.meta.stackexchange.com/a/1521/5472\">https://apple.meta.stackexchange.com/a/1521/5472</a></p>\n\n<p>It may not be suitable for all sites, as it doesn't scale well for the 3 figure bounty totals that some sites have, but as long as that limitation is fine, you could try it on other sites with about three lines of markdown.</p>\n","OwnerUserId":"9495","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.967","LastActivityDate":"2013-11-22T15:34:17.383","CommentCount":"2"},{"Id":"1875","PostTypeId":"2","ParentId":"1873","CreationDate":"2013-11-23T04:28:12.610","Score":"5","Body":"<p>Kyle's comment on the post linked in the other answer points you in the right direction. But in case you want to jump right to it; <a href=\"https://apple.meta.stackexchange.com/questions/1519/community-promotion-ads-2013/1521#comment3199_1521\">Community Promotion Ads - 2013</a></p>\n\n<p>If you wanna see some serious magic, go embed <a href=\"http://stack-exchange-dynamic-ads.herokuapp.com/bounty.png\" rel=\"nofollow noreferrer\">http://stack-exchange-dynamic-ads.herokuapp.com/bounty.png</a> on one of the other sites you listed. (e.g. create a question or an answer with the contents <code>![](http://stack-exchange-dynamic-ads.herokuapp.com/bounty.png)</code></p>\n","OwnerUserId":"1346","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2013-11-24T00:22:53.120","CommentCount":"1"},{"Id":"1876","PostTypeId":"1","CreationDate":"2013-11-26T14:43:18.493","Score":"1","ViewCount":"40","Body":"<p>Why did <a href=\"https://apple.stackexchange.com/questions/111897/upgrade-to-mavericks-from-mountain-lion-offline-with-dmg-file\">this question</a> get marked as duplicate of <a href=\"https://apple.stackexchange.com/questions/106088/what-is-the-best-way-to-generate-a-mavericks-install-usb-flash-drive\">this question</a> and closed?</p>\n\n<p>I think the scenarios are opposites: I want to upgrade without using an external drive and the supposed question I duplicated is about creating USB drive to upgrade.</p>\n\n<p>My problem is, I have an OS X Mavericks dmg file. I have tried OS X install app but, after agreeing to software licence agreement, when I click to install, nothing happens.</p>\n\n<p>I want to know if it's possible to upgrade Mountain Lion to Mavericks from the installer dmg file without using an external drive -- as it doesn't seem to be working for me.</p>\n","OwnerUserId":"63444","OwnerDisplayName":"lg_shant","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-11-26T17:12:06.853","Title":"Why did this question about upgrading ML to Mavericks get closed a duplicate?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"1877","PostTypeId":"2","ParentId":"1876","CreationDate":"2013-11-26T17:12:06.853","Score":"1","Body":"<p>It was closed because someone thought the linked question provided an answer for yours. Since that does not answer your question, edit your question to make it clearer that what you are looking for is not that. That said, I suspect you might be asking the wrong question. Your question does not make clear enough in the body of the question that your dmg is not from the App Store directly; have you verified the checksum of your dmg file?</p>\n","OwnerUserId":"9388","LastActivityDate":"2013-11-26T17:12:06.853","CommentCount":"1"},{"Id":"1878","PostTypeId":"1","AcceptedAnswerId":"1879","CreationDate":"2013-11-26T18:51:43.120","Score":"1","ViewCount":"30","Body":"<p>Going through my close vote list to see how many of the questions I voted to close were actually closed, I see that one of the questions that I voted to close <a href=\"https://stackoverflow.com/questions/19693311/associating-a-file-extension-with-my-application\">was migrated</a>:</p>\n\n<p><img src=\"https://i.stack.imgur.com/69Fhm.png\" width=\"500\"></p>\n\n<p>Being intrigued, I click the link and sure enough, it takes me to the question now on SO.</p>\n\n<p>Since I want to see how this migration is shown on the original question posted to Apple.SE, I add <code>?noredirect=1</code> to the link, and sure enough I end up at <a href=\"https://apple.stackexchange.com/questions/107675/registering-a-file-extension-with-my-application?noredirect=1\">the original question</a>.</p>\n\n<p>However where I usually see the 'on hold' or 'closed' message, I see 'migrated' as I expected to see, <strong>but with my name shown as one of those that migrated the question</strong>.</p>\n\n<p><img src=\"https://i.stack.imgur.com/RNQyU.png\"></p>\n\n<p>How? <strong>I didn't vote to migrate, I voted to close</strong>, albeit with one of Apple.SE's predefined off-topic reasons suggesting that it be posted to Stack Overflow, but I thought this was just one of the reasons written by a ♦ moderator with some custom text, and didn't have any technical consequences on my close vote…?</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-05-23T12:40:12.040","LastActivityDate":"2013-11-26T19:00:54.397","Title":"Voted to close, but shows as voted to migrate?","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"1879","PostTypeId":"2","ParentId":"1878","CreationDate":"2013-11-26T19:00:54.397","Score":"3","Body":"<p>Technically speaking, all close votes are the same, irregardless of the close reason given by the individual voter. So if there are different vote reasons given, either the majority or (as in this case) the most meaningful reason wins.</p>\n\n<p>As migration is a subset of the \"off topic\" close reason, it still counts as a close vote for you (and you didn't do anything wrong either). Migrating questions to different SE sites is always a tricky thing anyway.</p>\n","OwnerUserId":"9058","LastActivityDate":"2013-11-26T19:00:54.397","CommentCount":"3"},{"Id":"1880","PostTypeId":"1","CreationDate":"2013-11-29T16:20:21.380","Score":"1","ViewCount":"121","Body":"<p>I am considering to post the following question. Will it be allowed at AskDifferent? Any suggestions on how it can be improved?</p>\n\n<hr>\n\n<p><em>title:</em> <strong>battery replacement for Macbook Air (if original Apple service is not available in my country)</strong></p>\n\n<p><em>body:</em></p>\n\n<p>I need to replace a battery for Macbook Air 2011. Apple doesn't provide its own official support in my country, only lists authorized service providers. I am concerned that those providers can easily use non-genuine replacement parts, and I'm also willing to save 30% to 40% of totals cost by a do-it-yourself repair (judging by official prices Apple gives for its official batt replacement for the US, for example).</p>\n\n<p>What can be the best option online to buy a most lasting and robust battery replacement? How can I ensure before ordering that it's closest to the genuine battery possible?</p>\n","OwnerUserId":"54644","LastActivityDate":"2013-11-29T20:36:31.623","Title":"question allowed here? buying a battery replacement for Macbook Air if Apple doesn't have official service in the country","Tags":"<support><asking-questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"1881","PostTypeId":"2","ParentId":"1880","CreationDate":"2013-11-29T20:36:31.623","Score":"2","Body":"<p>You seem to have two questions overall:</p>\n\n<ol>\n<li>What can be the best option online to buy a most lasting and robust battery replacement? </li>\n<li>How can I ensure before ordering that it's closest to the genuine battery possible?</li>\n</ol>\n\n<p>The first question doesn't work here. I can appreciate your predicament but understand that answering it well means it's: a) likely specific to where ever you live; b) only relevant for a short period of time because prices changes, retailers come and go, technology marches on.</p>\n\n<p>The second question seems okay though -- when ordering a battery online, how can you ensure it's either genuine Apple or at least Apple compatible to some degree? That's a question with some general longevity to it, especially if you focus the question on how, when doing DIY repairs to Apple equipment, to ensure you're buying the right components and not ending up with partially-compatible pieces. It could even be made non-specific to batteries. That's a good question IMO.</p>\n\n<p>I'd suggest shortening the whole thing down to something like:</p>\n\n<blockquote>\n  <p><strong>How do I make sure I'm buying Apple-compatible replacement parts when performing DIY repairs?</strong></p>\n  \n  <p>I live in a place where Apple has no official presence. Support and repairs are done by Apple-authorized service providers. I'm fairly savvy with electronics and would like to save on the authorized repair markup and do my own repairs. I'm currently in need of a battery replacement in my MacBook Pro, but other repairs may come up as I try to extend the life of my Apple investment.</p>\n  \n  <p>How can I be certain that any replacement parts I order for my repairs that are obviously Apple genuine parts, are at least Apple compatible parts?</p>\n</blockquote>\n\n<p>That seems to capture the spirit of your question, not wanting to order the wrong thing when going DIY in a country where returning an order can be problematic and expensive, but without asking for specific purchase advice that would quickly become obsolete.</p>\n\n<p>Does that help?</p>\n","OwnerUserId":"292","LastActivityDate":"2013-11-29T20:36:31.623","CommentCount":"6"},{"Id":"1882","PostTypeId":"1","CreationDate":"2013-12-06T11:44:57.857","Score":"8","ViewCount":"791","Body":"<p>It's the time of the year again, namely it is December 2013, and so we shall now refresh our Community Promotion Ads for the new year.</p>\n\n<h3>What are Community Promotion Ads?</h3>\n\n<p>Community Promotion Ads are community-vetted advertisements that will show up on the main site, in the right sidebar. The purpose of this question is the vetting process. Images of the advertisements are provided, and community voting will enable the advertisements to be shown.</p>\n\n<h3>Why do we have Community Promotion Ads?</h3>\n\n<p>This is a method for the community to control what gets promoted to visitors on the site. For example, you might promote the following things:</p>\n\n<ul>\n<li>interesting apple related open source apps</li>\n<li>the site's twitter account</li>\n<li>script packs or power tools</li>\n<li>cool events or conferences</li>\n<li>anything else your community would genuinely be interested in</li>\n</ul>\n\n<p>The goal is for future visitors to find out about <em>the stuff your community deems important</em>. This also serves as a way to promote information and resources that are <em>relevant to your own community's interests</em>, both for those already in the community and those yet to join. </p>\n\n<h3>Why do we reset the ads every year?</h3>\n\n<p>Some services will maintain usefulness over the years, while other things will wane to allow for new faces to show up. Resetting the ads every year helps accommodate this, and allows old ads that have served their purpose to be cycled out for fresher ads for newer things. This helps keep the material in the ads relevant to not just the subject matter of the community, but to the current status of the community. We reset the ads once a year, every December.</p>\n\n<p>The community promotion ads have no restrictions against reposting an ad from a previous cycle. If a particular service or ad is very valuable to the community and will continue to be so, it is a good idea to repost it. It may be helpful to give it a new face in the process, so as to prevent the imagery of the ad from getting stale after a year of exposure.</p>\n\n<h3>How does it work?</h3>\n\n<p>The answers you post to this question <em>must</em> conform to the following rules, or they will be ignored. </p>\n\n<ol>\n<li><p>All answers should be in the exact form of:</p>\n\n<pre><code>[![Tagline to show on mouseover][1]][2]\n\n   [1]: http://image-url\n   [2]: http://clickthrough-url \n</code></pre>\n\n<p>Please <strong>do not add anything else to the body of the post</strong>. If you want to discuss something, do it in the comments.</p></li>\n<li><p>The question must always be tagged with the magic <a href=\"/questions/tagged/community-ads\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;community-ads&#39;\" rel=\"tag\">community-ads</a> tag. In addition to enabling the functionality of the advertisements, this tag also pre-fills the answer form with the above required form.</p></li>\n</ol>\n\n<h3>Image requirements</h3>\n\n<ul>\n<li>The image that you create must be <strong>220 x 250 pixels</strong></li>\n<li>Must be hosted through our standard image uploader (imgur)</li>\n<li>Must be GIF or PNG</li>\n<li>No animated GIFs</li>\n<li>Absolute limit on file size of 150 KB</li>\n</ul>\n\n<h3>Score Threshold</h3>\n\n<p>There is a <strong>minimum score threshold</strong> an answer must meet (currently <strong>6</strong>) before it will be shown on the main site.</p>\n\n<p>You can check out the ads that have met the threshold with basic click stats <a href=\"https://apple.meta.stackexchange.com/ads/display/1882\">here</a>.</p>\n","OwnerUserId":"8994","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2014-04-16T14:10:52.190","Title":"Community Promotion Ads - 2014","Tags":"<discussion><community-ads>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"2","ClosedDate":"2015-01-01T03:28:12.467","CommunityOwnedDate":"2013-12-06T11:44:57.857"},{"Id":"1883","PostTypeId":"2","ParentId":"1882","CreationDate":"2013-12-06T11:44:57.857","Score":"4","Body":"<p><a href=\"http://twitter.com/#!/askdifferent\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/H3wF3.png\" alt=\"Follow us on Twitter\"></a></p>\n","OwnerUserId":"8994","LastActivityDate":"2013-12-06T11:44:57.857","CommentCount":"3","CommunityOwnedDate":"2013-12-06T11:44:57.857"},{"Id":"1884","PostTypeId":"2","ParentId":"1882","CreationDate":"2013-12-06T17:24:50.407","Score":"12","Body":"<p><a href=\"https://apple.stackexchange.com/?tab=featured\">Current Ask Different bounties http://stack-exchange-dynamic-ads.herokuapp.com/apple.stackexchange.com/bounty.png</a></p>\n","OwnerUserId":"13","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-04-16T14:10:52.190","CommentCount":"11","CommunityOwnedDate":"2013-12-06T17:24:50.407"},{"Id":"1885","PostTypeId":"1","CreationDate":"2013-12-07T20:05:58.947","Score":"6","ViewCount":"58","Body":"<p>Please have a look here :</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/113100/how-to-have-safari-open-links-with-the-eviltarget-blank-open-in-the-same-tab\">How to have Safari open links with the evil&#160;target attribute open in the same tab?</a></p>\n\n<p>These curly quotes in the title of my question are totally wrong ! This sort of “correction” smells of Micro$oft Word. I have written correctly target=\"_blank\".</p>\n\n<p>Can you please correct your “correction” ?</p>\n\n<p>I have tried ``the backtick trick<code>\\</code> — to no avail. </p>\n","OwnerUserId":"38177","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-06-06T18:12:32.230","Title":"Wrong “correction” of the title","Tags":"<bug><status-reproduced><asking-questions>","AnswerCount":"1","CommentCount":"6","FavoriteCount":"1"},{"Id":"1888","PostTypeId":"2","ParentId":"1885","CreationDate":"2013-12-07T21:12:40.413","Score":"2","Body":"<p>My initial analysis is the correct characters are stored in the database, yet the rendered code strips html entities and changes the standard quote into smart (or dumb depending on your outlook) quotes. </p>\n\n<p>My guess is this transformation of text in question titles is intentional and might even have a technical reason relating to URL encoding or other database / security concerns. </p>\n\n<p>Let's see what the site developers say when they see this bug report. </p>\n","OwnerUserId":"5472","LastActivityDate":"2013-12-07T21:12:40.413","CommentCount":"1"},{"Id":"1890","PostTypeId":"1","CreationDate":"2013-12-10T17:53:11.067","Score":"1","ViewCount":"82","Body":"<p>I'm just coming over here from Stack Overflow, and the controls on who can answer a question or comment are much, much too restrictive. </p>\n\n<p>Is there a reason for this? </p>\n\n<p>I had to start a <a href=\"https://apple.stackexchange.com/questions/113143/will-someone-upvote-this-question-so-i-can-contribute\">question</a> just to get enough rep to answer <a href=\"https://apple.stackexchange.com/questions/108333/osx-keeps-switching-to-the-first-space\">this other question</a>, and it actually helped someone out, but he had to put his reply as an answer because it takes less rep to do that than to comment, and then I couldn't comment on his answer because I don't have enough rep, so I was faced with either making another answer, or commenting on my own answer in the hope that he sees it.</p>\n","OwnerUserId":"35950","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2013-12-16T02:20:01.333","Title":"Why is my account on Ask Different more restrictive than my account on SO?","Tags":"<discussion><reputation>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"1891","PostTypeId":"2","ParentId":"1890","CreationDate":"2013-12-10T18:00:54.227","Score":"7","Body":"<p>There is actually no difference in reputation required for commenting on StackOverflow or AskDifference. </p>\n\n<p>On both sites:</p>\n\n<ul>\n<li>you need a reputation of 50 to be able to comment on posts other than your own. </li>\n<li>you need a reputation of 10 to answer protected posts (search for protected:1 to see those on either site)</li>\n<li>some posts get locked and no one can comment or answer them. </li>\n</ul>\n\n<p>Asking in meta is the best manner to figure out things - kudos for that. You could also flag a post and explain to a moderator why you want a lock removed if a restriction is really preventing an honest effort to contribute a needed and quality answer. </p>\n\n<p>You do have a reputation of 167 (as of now) on StackOverflow so you are past that point there.</p>\n\n<p>Also (from <a href=\"https://apple.stackexchange.com/help/whats-reputation\">What is reputation</a>):</p>\n\n<blockquote>\n  <p>If you are an experienced Stack Exchange network user with 200 or more reputation on at least one site, you will receive a starting +100 reputation bonus to get you past basic new user restrictions. This will happen automatically on all current Stack Exchange sites where you have an account, and on any other Stack Exchange sites at the time you log in.</p>\n</blockquote>\n\n<p>The reason why you initially couldn't add an answer to <a href=\"https://apple.stackexchange.com/questions/108333/osx-keeps-switching-to-the-first-space\">this question</a> was because it was protected to prevent any further me too/garbage answers (which have been deleted already so you can't see them). I've converted both your answer and the one from the user responding to it to comments now.</p>\n\n<p>The best thing to do is find things you can either improve with an edit or answer well and you'll have gotten past most of the new user restrictions in short order.</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2013-12-10T20:51:15.660","CommentCount":"0"},{"Id":"1892","PostTypeId":"1","CreationDate":"2013-12-12T01:17:43.490","Score":"6","ViewCount":"74","Body":"<p>The <a href=\"https://apple.stackexchange.com/about\">about page</a> for Ask Different uses <a href=\"https://apple.stackexchange.com/questions/37465/is-it-possible-to-read-ibooks-without-an-ios-device\">this question</a>:</p>\n\n<p><img src=\"https://i.stack.imgur.com/CqsLV.png\" alt=\"screenshot\"></p>\n\n<p>The problem is, the answer, as of a few months ago is YES. Apple released iBooks support in the newest version of OS X: Mavericks.</p>\n\n<p><img src=\"https://i.stack.imgur.com/hqhSw.jpg\" alt=\"Mavericks iBooks\"></p>\n\n<p>There is an answer on that page, by Jason S, which is correct, but it only has 2 upvotes and the accepted answer now has 18 upvotes. I think it'd be a good idea to change the question exampled there.</p>\n\n<p><sub><a href=\"https://meta.stackexchange.com/questions/211188/some-problems-with-about-pages\">See also: my question on meta.SO about a bunch of /about problems.</a></sub></p>\n","OwnerUserId":"55120","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2013-12-12T02:11:22.440","Title":"The accepted answer of the Ask Different example question is wrong!","Tags":"<bug><feature-request><status-completed>","AnswerCount":"1","CommentCount":"2"},{"Id":"1893","PostTypeId":"2","ParentId":"1892","CreationDate":"2013-12-12T02:00:27.883","Score":"1","Body":"<p>Alright.  I have selected a new question and will ask people to comment here or answer if they would like to nominate another question (or type of question) for the about page. We can't choose any question, but have several dozens to pick. </p>\n\n<p>Additionally, since we liked the question that was being featured enough to feature it, I've placed a bounty to see if we can get a better answer. I probably will bounty the current question to see if we can get a better answer and remind me to check on it in a week to be sure it still shows well on the about page. </p>\n","OwnerUserId":"5472","LastActivityDate":"2013-12-12T02:00:27.883","CommentCount":"5"},{"Id":"1896","PostTypeId":"1","CreationDate":"2013-12-16T15:23:05.960","Score":"4","ViewCount":"65","Body":"<p>So some hats are designated as \"secret hats.\" Some of them are pretty guessable as to how you got them (if you happen to do so), but others are quite a mystery. Is there a way for people who are awarded secret hats to learn how they got the hat or what it means?</p>\n","OwnerUserId":"9388","LastEditorUserId":"9388","LastEditDate":"2013-12-16T17:43:17.607","LastActivityDate":"2013-12-16T17:43:17.607","Title":"Secret hats are so secret those who earn them don't know why!","Tags":"<feature-request><status-bydesign>","AnswerCount":"1","CommentCount":"1"},{"Id":"1897","PostTypeId":"2","ParentId":"1896","CreationDate":"2013-12-16T17:43:00.133","Score":"3","Body":"<p>It seems that the answer is that any secret hats that may or may not exist are secret by design, and that should said hats exist (which they may or may not), part of the fun is to try to guess why you might have received one.</p>\n","OwnerUserId":"9388","LastActivityDate":"2013-12-16T17:43:00.133","CommentCount":"0"},{"Id":"1898","PostTypeId":"1","AcceptedAnswerId":"1899","CreationDate":"2013-12-16T20:04:32.397","Score":"3","ViewCount":"37","Body":"<p>Came across this question:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/114081/enforcing-single-document-copy-in-ios\">Enforcing single docent copy in iOS [on hold]</a></li>\n</ul>\n\n<p>It's on hold and locked, according to timeline, and I can't comment/edit…</p>\n\n<p><img src=\"https://i.stack.imgur.com/TyLFy.png\" width=\"300\"></p>\n\n<p><img src=\"https://i.stack.imgur.com/QXbdi.png\" height=\"60\"><img src=\"https://i.stack.imgur.com/QPKwg.png\" height=\"30\"></p>\n\n<p>Yet the banners below the post only shows the migration and the 'on hold' state, with no mention of the lock:</p>\n\n<p><img src=\"https://i.stack.imgur.com/yrrJk.png\"></p>\n\n<p>Is this <a href=\"/questions/tagged/status-bydesign\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;status-bydesign&#39;\" rel=\"tag\">status-bydesign</a>? I've tagged this as <a href=\"/questions/tagged/support\" class=\"post-tag required-tag\" title=\"show questions tagged &#39;support&#39;\" rel=\"tag\">support</a> instead of <a href=\"/questions/tagged/bug\" class=\"post-tag required-tag\" title=\"show questions tagged &#39;bug&#39;\" rel=\"tag\">bug</a> because I'm not sure yet.</p>\n\n<p><em>If so, there seems to be a further problem, since the 'on hold' banner says 'please edit the question' which can't happen because it's locked…</em></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2013-12-16T20:57:01.007","Title":"Question was locked and put on hold, but the banners only show 'on hold' and migration","Tags":"<support><closed-questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"1899","PostTypeId":"2","ParentId":"1898","CreationDate":"2013-12-16T20:57:01.007","Score":"2","Body":"<p>I've cleared the lock. Thanks for spotting the anomaly. </p>\n","OwnerUserId":"5472","LastActivityDate":"2013-12-16T20:57:01.007","CommentCount":"4"},{"Id":"1900","PostTypeId":"1","CreationDate":"2013-12-26T16:59:35.823","Score":"1","ViewCount":"47","Body":"<p>I recently wanted to use the 'keyboard-shortcuts' tag, but then learned that it is a synonym of the 'keyboard' tag; however, this did not make sense to me in the context of the thread I was attempting to add it to.</p>\n\n<p>In my opinion, the 'keyboard' tag focuses on the physical hardware; whereas, the 'keyboard-shortcuts' tag focuses on the software implementation, namely an operating system's or an application's ability to provide quick and easy access to features, which is keyboard <em>independent</em>.</p>\n\n<p>To label a post with the 'keyboard' tag when ones intention is to focus on one or more 'keyboard-shortcuts' can be misleading in my opinion.</p>\n\n<hr>\n\n<p><em><strong>So why is it that these are set up as synonyms of each other? And if we can reach a consensus, can this synonym relationship be removed?</em></strong></p>\n\n<p>If we are to split these into distinct tags and alter their respective descriptions, I propose the following:</p>\n\n<ul>\n<li><strong>keyboard</strong>: 'A physical device with buttons that allow characters to be entered' (Unchanged)</li>\n<li><strong>keyboard-shortcuts</strong>: 'A combination, or sequence of, keyboard keys that when activated, trigger an action to be performed by a piece of software'</li>\n</ul>\n","OwnerUserId":"52901","LastEditorUserId":"52901","LastEditDate":"2014-01-22T15:38:31.073","LastActivityDate":"2014-01-22T15:38:31.073","Title":"Can we remove the tag synonym relationship between 'keyboard-shortcuts' and 'keyboard'?","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"1901","PostTypeId":"2","ParentId":"1900","CreationDate":"2013-12-26T17:16:29.347","Score":"3","Body":"<p>A succinct answer would be there's no good reason to split off shortcut and hotkey related questions from general keyboard questions. (The synonyms point to keyboard, not the other way around as your title states.)</p>\n\n<p><img src=\"https://i.stack.imgur.com/k22pe.png\" alt=\"enter image description here\"></p>\n\n<p>We can absolutely change the synonym and meta is the place to build consensus. The next step would be someone detailing what the actual wording of the keyboard  and keyboard-shortcut tags so we can discuss, vote or adjust as needed?</p>\n\n<p>If there were enough supports to break them apart, then we would want to have a second post here to start cataloging which ones belong in the shortcut category in which ones remain in keyboard. </p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2013-12-26T18:49:54.517","LastActivityDate":"2013-12-26T18:49:54.517","CommentCount":"4"},{"Id":"1902","PostTypeId":"1","CreationDate":"2013-12-27T17:03:16.853","Score":"1","ViewCount":"51","Body":"<p>Now that server is an app you install from the Mac App store on Lion and later, should I tag questions about server as <a href=\"https://apple.stackexchange.com/questions/tagged/osx-server\">osx-server</a> or <a href=\"https://apple.stackexchange.com/questions/tagged/server.app\">server.app</a>?</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-03-04T21:13:53.273","Title":"What tag should be used for Server on Lion and later?","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"1903","PostTypeId":"2","ParentId":"1902","CreationDate":"2013-12-27T17:08:44.537","Score":"3","Body":"<p>As of mid 2013, the wiki tags indicate that osx-server is only for Snow Leopard and older server installs. I have been retagging server.app to all Lion and newer questions and removing the osx-server tags when it's not used on 10.6 and earlier.</p>\n\n<p>Perhaps we will want to re-evaluate this and make a synonym to point them all to the same tag and/or re-tag old questions.</p>\n\n<p>The only problem is that old server installs aren't served well by server.app but the number of people that need that distinction will shrink rapidly. Also, I wonder if we can prevent use of the old tag and still link things so the new tag feeds both in terms of badge counts and searching.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2014-03-04T20:47:49.880","LastActivityDate":"2014-03-04T20:47:49.880","CommentCount":"8"},{"Id":"1904","PostTypeId":"2","ParentId":"1340","CreationDate":"2013-12-29T00:06:41.753","Score":"1","Body":"<p>I would like to make an official post to support brevity in answers. There is nothing wrong with a short answer if it helps the user. In fact, I think concise answers should be preferred. Unnecessarily long answers waste a user's time.</p>\n\n<p>This is standard practice on Stack Overflow, where the most highly voted answers are almost always concise:</p>\n\n<ul>\n<li><a href=\"https://stackoverflow.com/questions/510348/how-can-i-make-a-time-delay-in-python\">Example 1</a></li>\n<li><a href=\"https://stackoverflow.com/questions/2186525/use-a-glob-to-find-files-recursively-in-python\">Example 2</a></li>\n<li><a href=\"https://stackoverflow.com/questions/1747817/python-create-a-dictionary-with-list-comprehension\">Example 3</a></li>\n</ul>\n","OwnerUserId":"4729","LastEditorUserId":"-1","LastEditDate":"2017-05-23T12:40:12.040","LastActivityDate":"2013-12-29T00:06:41.753","CommentCount":"0"},{"Id":"1905","PostTypeId":"1","CreationDate":"2013-12-31T08:48:38.673","Score":"3","ViewCount":"36","Body":"<p>I'm sure at some point we've all noticed while mousing over certain users picture/gravatar that extended information pops open about that person. Mine used to do this, although no longer seems to — just curious why it doesn't anymore. </p>\n","OwnerUserId":"10139","LastEditorUserId":"53079","LastEditDate":"2014-01-10T06:37:42.423","LastActivityDate":"2014-01-10T06:37:42.423","Title":"Usercard no longer expands while mousing over it","Tags":"<support><profile-page><users>","AnswerCount":"1","CommentCount":"0"},{"Id":"1906","PostTypeId":"2","ParentId":"1905","CreationDate":"2013-12-31T12:53:42.730","Score":"3","Body":"<p>For the user-info card to be expanded on hover you need more than 1000 rep, and a somewhat meaningful <strong>about me</strong> excerpt (more than 50 chars of text). Your about me isn't being recognized as such, so no hover card for you.</p>\n","OwnerUserId":"53079","LastEditorUserId":"53079","LastEditDate":"2014-01-10T06:37:29.343","LastActivityDate":"2014-01-10T06:37:29.343","CommentCount":"2"},{"Id":"1907","PostTypeId":"2","ParentId":"1845","CreationDate":"2013-12-31T14:39:12.547","Score":"1","Body":"<p>This isn't a bug, but is actually seen as a feature. </p>\n\n<p>The way to unroll who approved the edit is to look at the post history. </p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/posts/103634/revisions\">https://apple.stackexchange.com/posts/103634/revisions</a></li>\n</ul>\n\n<p>When a reviewer chooses improve, the community user approves the initial edit immediately to unblock the post and let the reviewer make changes. So, in this case, Peter made the first edit that needed review and you caused community to approve and then you made the second edit. </p>\n\n<p>This is documented as Mark described at:</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/80518/improved-edit-suggestions-approved-by-community\">Improved edit suggestions approved by Community</a></li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2013-12-31T14:39:12.547","CommentCount":"1"},{"Id":"1908","PostTypeId":"1","AcceptedAnswerId":"2230","CreationDate":"2014-01-02T14:44:46.853","Score":"1","ViewCount":"96","Body":"<p>The alignment here is not very nice. It would be good to have a bit more space between the Answer button and the <code>i</code> too.</p>\n\n<p>Chrome, Mac OS</p>\n\n<p>Safari 7.0.3 repro</p>\n\n<p><img src=\"https://i.stack.imgur.com/sLhDs.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"12544","LastEditorUserId":"17358","LastEditDate":"2014-10-06T22:31:20.900","LastActivityDate":"2014-10-06T22:34:19.910","Title":"Email answer question is out of place","Tags":"<bug><status-completed><design>","AnswerCount":"2","CommentCount":"5"},{"Id":"1909","PostTypeId":"1","AcceptedAnswerId":"1910","CreationDate":"2014-01-08T21:29:11.593","Score":"0","ViewCount":"23","Body":"<p>A 'plural tag' merge request:</p>\n\n<ul>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/font\" class=\"post-tag\" title=\"show questions tagged &#39;font&#39;\" rel=\"tag\">font</a> — 177 tagged, 39 this year, 5 this month</p>\n\n<blockquote>\n  <p>A font (more accurately a typeface) is the visual appearance, representation or interpretation of a set of characters, typically alphanumeric as a minimum.</p>\n</blockquote></li>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/fonts\" class=\"post-tag\" title=\"show questions tagged &#39;fonts&#39;\" rel=\"tag\">fonts</a> — 44 tagged, 13 this year</p>\n\n<blockquote>\n  <p><em>no tag wiki/excerpt</em></p>\n</blockquote></li>\n</ul>\n","OwnerUserId":"37797","LastActivityDate":"2014-01-08T21:31:04.433","Title":"Merge the \"font\" and \"fonts\" tags","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"1910","PostTypeId":"2","ParentId":"1909","CreationDate":"2014-01-08T21:31:04.433","Score":"1","Body":"<p>Done - I resisted the urge to merge into <a href=\"https://apple.stackexchange.com/questions/tagged/typeface\" class=\"post-tag\" title=\"show questions tagged &#39;typeface&#39;\" rel=\"tag\">typeface</a> or other term and also merged font-rendering into the base tag... :-)</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-01-08T21:31:04.433","CommentCount":"0"},{"Id":"1911","PostTypeId":"1","CreationDate":"2014-01-09T15:05:14.563","Score":"4","ViewCount":"147","Body":"<p>We've had a run these past few days where a dedicated spammer pushing a phone number and offering counseling on love, relation, promotion and other matters has managed to get their content advertised to the world:</p>\n\n<p><a href=\"https://www.google.com/#q=9694850756+site:stackexchange.com\" rel=\"nofollow\">https://www.google.com/#q=9694850756+site:stackexchange.com</a></p>\n\n<p>What should people do when they see posts like this on the site?</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2014-01-22T22:21:22.967","LastActivityDate":"2014-04-23T08:48:43.713","Title":"How to handle blatant off-topic spam?","Tags":"<discussion><spam>","AnswerCount":"1","CommentCount":"0"},{"Id":"1912","PostTypeId":"2","ParentId":"1911","CreationDate":"2014-01-09T15:08:03.673","Score":"5","Body":"<p>The best thing is to bury the post, not editing or commenting at all. Don't feed the behavior.</p>\n\n<ol>\n<li><p><strong>Flag as spam</strong>. There's a system in place that detects this activity and will help prevent the spammer from continuing that activity and creating new accounts. This is important since <a href=\"https://meta.stackexchange.com/a/58035/165931\">three spam flags</a> banishes the question from the front page. 6 such flags deletes and locks the question which is what we want for this.</p></li>\n<li><p><strong>Vote to close the question</strong>. It costs you zero reputation and you get the question in the close queue for other reviewers to see.</p></li>\n<li><p>Most of all, do not comment or edit or bump it up by making any activity on the post. It's that type of <em>recognition</em> and eyeballs the spammer is looking for.</p></li>\n</ol>\n\n<p>I've made a chat room for <a href=\"http://chat.stackexchange.com/rooms/12395/spam-on-askdifferent\">discussion and to document this</a> and if the rate of spam keeps getting worse, we can work with the site developers to see if a blacklist or other change can make the site less appealing for this sort of activity.</p>\n\n<p>Thanks again for all the great editing, moderation and flagging. Keep it up and we can keep the door open to people that have legitimate questions and not make the regular users too irritated at this sort of post.</p>\n\n<p>Also, it appears that our site isn't the only one with an uptick as we're not seeing several of the patterns that other sites are dealing with. If you are interested, there is a nice thread on the Ask Ubuntu meta:</p>\n\n<ul>\n<li><a href=\"https://meta.askubuntu.com/questions/8085/regarding-the-recent-wave-of-spam-what-are-we-doing-about-it\">https://meta.askubuntu.com/questions/8085/regarding-the-recent-wave-of-spam-what-are-we-doing-about-it</a></li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-01-13T03:55:03.667","CommentCount":"12"},{"Id":"1913","PostTypeId":"2","ParentId":"1908","CreationDate":"2014-01-09T16:19:55.827","Score":"0","Body":"<p>I've tagged this as feature request, since it's clearly a design aesthetic and the I and text starting with \"Would you like to\" serve zero functional purpose.</p>\n\n<p>The designer put this together and from other use of the \"Circle i\" it appears that the top of the icon visually is to be aligned with the top of the text that goes next to the icon.</p>\n\n<p>If there is some way the site doesn't work for you with the layout (say for some reasonable screen size, the alignment puts an important part of content off screen) we can change this back to a bug.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-01-09T16:19:55.827","CommentCount":"0"},{"Id":"1914","PostTypeId":"1","AcceptedAnswerId":"1919","CreationDate":"2014-01-10T15:39:06.043","Score":"3","ViewCount":"48","Body":"<p>Not really much to say, other than here's a GIF to explain:</p>\n\n<p><img src=\"https://i.stack.imgur.com/pPNLH.gif\" alt=\"Explanatory GIF\"></p>\n\n<p>Whilst in this example I'm editing an existing post, this happens for new posts too.</p>\n\n<p>If I omit the <code>,</code> in the text, it removes the entire line.</p>\n\n<p>What's going on?</p>\n\n<p><sup>Link to actual post: <a href=\"https://apple.stackexchange.com/a/116710/37797\">https://apple.stackexchange.com/a/116710/37797</a></sup></p>\n\n<hr>\n\n<p>A text explanation:</p>\n\n<ol>\n<li><p>Posted the following content:</p>\n\n<blockquote>\n  <p>Either reboot, or run</p>\n\n<pre><code>sudo launchctl load /System/Library/LaunchDaemons/com.apple.taskgated.plist\n</code></pre>\n</blockquote></li>\n<li><p>Submitted as</p>\n\n<blockquote>\n  <p>or run</p>\n\n<pre><code>sudo launchctl load /System/Library/LaunchDaemons/com.apple.taskgated.plist\n</code></pre>\n</blockquote></li>\n</ol>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-01-13T07:08:55.850","Title":"Answer being auto-edited before being posted?","Tags":"<bug><status-completed><answers>","AnswerCount":"1","CommentCount":"2"},{"Id":"1915","PostTypeId":"1","AcceptedAnswerId":"1918","CreationDate":"2014-01-11T15:58:32.183","Score":"1","ViewCount":"76","Body":"<p>The comment shortcuts (magic links) don't seem to be working…</p>\n\n<ul>\n<li><p>Current comments</p>\n\n<p><img src=\"https://i.stack.imgur.com/DgfFo.png\" width=\"600\"></p></li>\n<li><p>New comments</p>\n\n<p><img src=\"https://i.stack.imgur.com/paUbA.png\" width=\"300\"></p></li>\n</ul>\n\n<p>What's happened?</p>\n","OwnerUserId":"37797","LastEditorUserId":"173","LastEditDate":"2014-01-12T01:58:02.380","LastActivityDate":"2014-04-28T05:33:49.403","Title":"What's happened to magic links?","Tags":"<bug><status-completed><comments>","AnswerCount":"1","CommentCount":"1"},{"Id":"1916","PostTypeId":"1","AcceptedAnswerId":"1917","CreationDate":"2014-01-11T16:22:13.230","Score":"0","ViewCount":"24","Body":"<p>Another 'plural tag' merge request:</p>\n\n<ul>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/bug\" class=\"post-tag\" title=\"show questions tagged &#39;bug&#39;\" rel=\"tag\">bug</a> — 108 tagged, 39 this year</p>\n\n<blockquote>\n  <p>An unintentional mistake or omission in the programming code of an application that causes undesirable results. This tag will be used in discussions identifying potential bugs and seeking ways to circumvent or correct them.</p>\n</blockquote></li>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/bugs\" class=\"post-tag\" title=\"show questions tagged &#39;bugs&#39;\" rel=\"tag\">bugs</a> — 10 tagged, 3 this year</p>\n\n<blockquote>\n  <p><em>no tag wiki/excerpt</em></p>\n</blockquote></li>\n</ul>\n","OwnerUserId":"37797","LastActivityDate":"2014-01-11T18:39:58.983","Title":"Merge the \"bug\" and \"bugs\" tags","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"1917","PostTypeId":"2","ParentId":"1916","CreationDate":"2014-01-11T18:39:58.983","Score":"2","Body":"<p>I merged <code>bugs</code> -> <code>bug</code> and created a synonym. I'm on the fence about having a plural form of <code>bug</code> though. A question that's asking about multiple bugs might be indicative of something that needs to be split in to multiple questions.</p>\n","OwnerUserId":"292","LastActivityDate":"2014-01-11T18:39:58.983","CommentCount":"0"},{"Id":"1918","PostTypeId":"2","ParentId":"1915","CreationDate":"2014-01-11T22:30:07.873","Score":"0","Body":"<p>Seems like it's fixed now…</p>\n\n<p><img src=\"https://i.stack.imgur.com/RutFO.png\"></p>\n\n<hr>\n\n<p>Meta.SE: <a href=\"https://meta.stackexchange.com/questions/215786/magical-site-hyperlinks-broken\">Magical site hyperlinks broken</a></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-04-28T05:33:49.403","CommentCount":"0"},{"Id":"1919","PostTypeId":"2","ParentId":"1914","CreationDate":"2014-01-13T07:08:41.270","Score":"3","Body":"<p>Thanks for reporting this, it was a false positive in the method that removes greetings from the beginning of the post. I see you've already found a workaround for this issue. </p>\n\n<p>Anyway, fix is rolling out with build rev <code>2014.1.13.1297</code>.</p>\n","OwnerUserId":"53079","LastActivityDate":"2014-01-13T07:08:41.270","CommentCount":"2"},{"Id":"1920","PostTypeId":"1","AcceptedAnswerId":"1921","CreationDate":"2014-01-15T09:16:38.583","Score":"3","ViewCount":"66","Body":"<p>An answer has been marked as \"Accepted\" but is clearly wrong.\nIs there anything that can be done about this?</p>\n\n<p>This is the url:\n<a href=\"https://apple.stackexchange.com/questions/38320/how-to-set-a-default-font-for-outgoing-messages-in-mail-on-lion/38333#38333\">How to set a default font for outgoing messages in Mail on Lion</a></p>\n\n<p>Thanks.</p>\n","OwnerUserId":"34561","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-01-15T19:29:20.230","Title":"The accepted answer is wrong","Tags":"<support><answers><accepted-answer>","AnswerCount":"2","CommentCount":"0"},{"Id":"1921","PostTypeId":"2","ParentId":"1920","CreationDate":"2014-01-15T11:11:11.840","Score":"5","Body":"<p>Nothing can be done, although you can downvote the answer (and either answer with the correct answer, providing some reference to the accepted answer, or comment underneath the accepted answer).</p>\n\n<p>Mods cannot override, remove, or nominate accepted answers, only the OP can do that.</p>\n","OwnerUserId":"9495","LastActivityDate":"2014-01-15T11:11:11.840","CommentCount":"2"},{"Id":"1922","PostTypeId":"2","ParentId":"1920","CreationDate":"2014-01-15T11:57:21.763","Score":"5","Body":"<p>\"Accepted\" basically means that the asker was happy with the answer (which doesn't necessarily mean it's correct). Usually votes are a better indicator on answer quality/correctness because more eyeballs are involved. So if you run into such a situation you can</p>\n\n<ul>\n<li>downvote wrong answers (even if they are accepted)</li>\n<li>upvote correct answers (or provide the correct answer if it is missing)</li>\n<li>add a comment to the question (so the asker gets notified) or the wrongly accepted answer (referencing the asker with @xyz)</li>\n</ul>\n","OwnerUserId":"9058","LastActivityDate":"2014-01-15T11:57:21.763","CommentCount":"0"},{"Id":"1923","PostTypeId":"1","AcceptedAnswerId":"1935","CreationDate":"2014-01-16T16:33:48.993","Score":"-9","ViewCount":"78","Body":"<p>Sorry guys, but I don't want this as a separate answer. Either accept my edit or lose the information from this site.</p>\n\n<p><a href=\"https://apple.stackexchange.com/review/suggested-edits/50199\">https://apple.stackexchange.com/review/suggested-edits/50199</a></p>\n\n<p><em>This is just a note to the community. I won't be reading answers or comments to this.</em></p>\n","OwnerDisplayName":"user28268","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-02-05T15:08:11.010","Title":"I want this information as part of the answer that I edited, not as a separate answer","Tags":"<discussion><suggested-edits>","AnswerCount":"3","CommentCount":"0"},{"Id":"1924","PostTypeId":"2","ParentId":"1923","CreationDate":"2014-01-16T19:13:03.550","Score":"5","Body":"<p>I've reviewed the post and agree with the reviewers that rejected the edit.</p>\n\n<p>For the record, one reviewer approved and two rejected.</p>\n\n<p>The content posted by what was excellent, but made a long post even longer and was rejected. I'll see if I can make a way to approve the edit and then fix it so it flows with the prior work in accordance with the idea that edits should flow and not be called out / tacked at the bottom of a post in general.</p>\n\n<p>Thanks for alerting us - and sorry you decided to leave.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-01-16T19:13:03.550","CommentCount":"1"},{"Id":"1925","PostTypeId":"2","ParentId":"1923","CreationDate":"2014-01-17T09:19:19.537","Score":"5","Body":"<p>Can't lose the information from the site, it's now there, and should I choose to take your edit and include it as an answer by myself, I am within my rights to do so, as the information was freely provided to SE - you cannot ungive it.  As it stands, I'm not, but the point stands that this site is collaboratively edited, so while as you know you can happily edit other users work (whether this is wholesale rewrite or just tagging an \"Edit: blah...\" on the end), the same works both ways, and you cannot demand that an edit is kept.  If you want control over what your contribution says, then post it as your own answer, and roll back any edits made if you don't like them.  Appreciate you went to some length to find an obscure solution to this answer, but can't see why you don't want to include it as an answer attributed to you where you may receive appropriate rep from it, rather than tagging it to a relatively unrelated answer.</p>\n","OwnerUserId":"9495","LastActivityDate":"2014-01-17T09:19:19.537","CommentCount":"0"},{"Id":"1926","PostTypeId":"1","CreationDate":"2014-01-21T16:59:02.353","Score":"5","ViewCount":"35","Body":"<p>The admin page at <a href=\"https://apple.stackexchange.com/admin/dashboard\">https://apple.stackexchange.com/admin/dashboard</a> will occasionally list the <a href=\"http://chat.stackexchange.com/rooms/4083\">Temperance</a> chat room which apparently is for religious moderation.</p>\n\n<p>Please remove that as it doesn't concern moderation of this site.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-01-21T16:59:02.353","Title":"Please remove the \"temperance\" chat room from this site's admin page","Tags":"<bug>","AnswerCount":"0","CommentCount":"1"},{"Id":"1927","PostTypeId":"1","AcceptedAnswerId":"1928","CreationDate":"2014-01-21T18:35:10.960","Score":"3","ViewCount":"32","Body":"<p>I clicked the <a href=\"https://apple.stackexchange.com/review\">review tab</a>, it showed there was 1 First Post, and 1 Early Answer to be reviewed.</p>\n\n<p>When I clicked each, there was no task waiting for me to review.</p>\n\n<p>Is this because someone else clicked it right before I did, or is this a bug?</p>\n","OwnerUserId":"34561","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-01-21T18:47:53.517","Title":"Review 1 First Post","Tags":"<discussion><review-page>","AnswerCount":"1","CommentCount":"0"},{"Id":"1928","PostTypeId":"2","ParentId":"1927","CreationDate":"2014-01-21T18:40:08.503","Score":"4","Body":"<p>This is a known behavior where others can take review tasks in the time between when you looked and when your request hit the server.</p>\n\n<p>To check on this, you can look at the <a href=\"https://apple.stackexchange.com/review/first-posts/history\">review history</a> for the queue that just has shown no tasks to see who handled the items that were just recently outstanding.</p>\n\n<p>This is far more common on large sites (like Stack Overflow) where dozens of questions arrive each minute and it's not uncommon to have hundreds of reviews happen within a 60 second interval.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-01-21T18:47:53.517","CommentCount":"2"},{"Id":"1929","PostTypeId":"1","AcceptedAnswerId":"1930","CreationDate":"2014-01-22T21:24:14.873","Score":"5","ViewCount":"64","Body":"<p>A merge/synonym request:</p>\n\n<ul>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/mavericks\" class=\"post-tag\" title=\"show questions tagged &#39;mavericks&#39;\" rel=\"tag\">mavericks</a> — 1020 tagged, 62 this week, 10 today</p>\n\n<blockquote>\n  <p>OS X 10.9, Mavericks, is the tenth iteration of the computer operating system, OS X.</p>\n</blockquote></li>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/osx-mavericks\" class=\"post-tag\" title=\"show questions tagged &#39;osx-mavericks&#39;\" rel=\"tag\">osx-mavericks</a> — 10 tagged, 10 this month, 9 this week</p>\n\n<blockquote>\n  <p>Version 10.9.x of the Mac Operating System.</p>\n</blockquote></li>\n</ul>\n","OwnerUserId":"37797","LastEditorUserId":"5472","LastEditDate":"2014-01-22T22:20:46.980","LastActivityDate":"2014-01-22T22:20:46.980","Title":"Merge the \"osx-mavericks\" and \"mavericks\" tags","Tags":"<discussion><status-completed><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"1930","PostTypeId":"2","ParentId":"1929","CreationDate":"2014-01-22T22:20:35.603","Score":"3","Body":"<p>That follows what we've done for other OS names.</p>\n\n<pre><code>Tag Synonym osx-mavericks -&gt; mavericks was approved!\n</code></pre>\n","OwnerUserId":"5472","LastActivityDate":"2014-01-22T22:20:35.603","CommentCount":"0"},{"Id":"1931","PostTypeId":"1","CreationDate":"2014-01-23T06:20:37.880","Score":"3","ViewCount":"56","Body":"<p>What should you do to an answer that is \"No I'm no canfarm wifi bulothot\" ? </p>\n\n<p>Should I mark it down as well as flag it? It's not <strong>really</strong> spam.</p>\n","OwnerUserId":"40544","LastActivityDate":"2014-01-23T08:20:04.643","Title":"What to do about totally absurd answer","Tags":"<discussion><flagging><answers>","AnswerCount":"1","CommentCount":"2"},{"Id":"1932","PostTypeId":"2","ParentId":"1931","CreationDate":"2014-01-23T07:55:52.280","Score":"5","Body":"<p>The important step in these cases is to flag the post so the moderator team is aware of it. Flagging gives you several options. In cases like the one mentioned in the question</p>\n\n<ul>\n<li>\"it is not an answer\" </li>\n<li>\"it is very low quality\"</li>\n</ul>\n\n<p>seem to be appropriate (and you can always use the \"other\" option of course). </p>\n","OwnerUserId":"9058","LastEditorUserId":"9058","LastEditDate":"2014-01-23T08:20:04.643","LastActivityDate":"2014-01-23T08:20:04.643","CommentCount":"0"},{"Id":"1933","PostTypeId":"1","CreationDate":"2014-01-29T17:11:27.793","Score":"3","ViewCount":"49","Body":"<p>Questions about Microsoft Office for Mac (including Excel, Word, Outlook etc) are on-topic both here (tag <code>ms-office</code>) and at <a href=\"http://superuser.com\">http://superuser.com</a> - but where's the best place to ask them?</p>\n\n<p>In my experience, there aren't so many people interested in MS software here (<code>ms-office</code> tag appears to have 10 followers at the moment), but, superuser has very few Mac users. I'd say I've generally had more luck here in the past, but it's close. </p>\n\n<p>Generally, on both sites, these questions get very few views at first, but then a steady flow of search engine traffic - I think on both sites, I've asked an Office for Mac question, got <code>tumbleweed</code> for it, then later on got <code>popular question</code> and <code>notable question</code> badges for the same question.</p>\n\n<p>In the past, where I've had questions that slip between the cracks, I've asked at one site, then, if it goes full-on tumbleweed, I've asked for it to be migrated to the other. </p>\n\n<p>Is this the best approach? Where would you recommend asking first? Should anything be considered e.g. any time window beyond which questions can't be migrated?</p>\n\n<p>Recent example question: <a href=\"https://apple.stackexchange.com/questions/119185/stop-excel-for-mac-2011-continuing-formatting-from-last-cell-entered\">Stop Excel for Mac (2011) continuing formatting from last cell entered?</a></p>\n\n<hr>\n\n<p>I asked a similar question to this on meta superuser a while ago: <a href=\"https://meta.superuser.com/questions/5669/where-how-can-i-get-answers-to-questions-on-office-for-mac\">Where/how can I get answers to questions on Office for Mac?</a></p>\n","OwnerUserId":"31241","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-01-31T15:51:39.677","Title":"MS Office for Mac questions: ask here, or at superuser?","Tags":"<discussion><support>","AnswerCount":"1","CommentCount":"0"},{"Id":"1934","PostTypeId":"2","ParentId":"1933","CreationDate":"2014-01-29T18:31:41.423","Score":"3","Body":"<p>In general, either site could host such a question, but we <strong>ask you choose one or the other</strong> and then ask your best phrasing of that one question. If after a week or two, you don't see any action / comment or flag and the moderators of each site can assist in migrating it if needed.</p>\n\n<p>In the end, you'll probably get more users of Office here now that our traffic is grown to a point where SU doesn't dwarf us in eyeballs. (SU is 500k visits daily, we are currently 150k visits daily)</p>\n\n<p>Now, if the topic is clearly about Windows OS interacting with the Mac version, you might ask at Super User first. Alternatively, if you are interested in how Mac specific items relate to the package or working within Mac and iOS ecosystems, then the iOS part makes it off-topic on Super User.</p>\n\n<p>It's more about <em>who</em> you want answering the question as opposed to which site has more eyeballs since both sites have active chat rooms where people can assist with editing or promoting a question that isn't getting enough eyeballs.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2014-01-31T15:51:39.677","LastActivityDate":"2014-01-31T15:51:39.677","CommentCount":"0"},{"Id":"1935","PostTypeId":"2","ParentId":"1923","CreationDate":"2014-02-05T15:08:11.010","Score":"1","Body":"<p>But that is not how the site works.  </p>\n\n<p>Just for completeness I posted the answer as an answer.  If you decide to change your mind and post it as an answer I will remove mine.</p>\n","OwnerUserId":"10733","LastActivityDate":"2014-02-05T15:08:11.010","CommentCount":"4"},{"Id":"1936","PostTypeId":"1","AcceptedAnswerId":"1937","CreationDate":"2014-02-06T22:51:27.240","Score":"1","ViewCount":"40","Body":"<p>Just a questions about editing. </p>\n\n<p>In a post such as <a href=\"https://apple.stackexchange.com/posts/120147/revisions\">this where the person answering</a> gives out their email address.</p>\n\n<p>I did not edit this out because I did not want to offend but if standard practice is to remove such invitations, I will remove them, to avoid double editing such as patrix had to do in the above case.</p>\n\n<p>Is it standard practice to remove such invitations.</p>\n","OwnerUserId":"10733","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Answers telling people to email them","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"1937","PostTypeId":"2","ParentId":"1936","CreationDate":"2014-02-07T00:43:42.247","Score":"3","Body":"<p>It is standard practice to remove these as well as any other signature parts like Thanks and the writers name.</p>\n\n<p>There are many threads on <a href=\"http://meta.stackexchange.com\">http://meta.stackexchange.com</a> setting out the reasons including this question as a <a href=\"https://meta.stackexchange.com/questions/5029/are-taglines-signatures-disallowed\">FAQ</a>\nand according to that the following should be in our FAQ(however I can't find the FAQ)</p>\n\n<blockquote>\n  <p><strong>Can I use a signature or tagline?</strong></p>\n  \n  <p>Please don't use signatures or taglines in your posts. Every post you make is already \"signed\" with your standard user card, which links directly back to your user page. Your user page belongs to you — fill it with interesting information about your interests, cool stuff you've worked on, or whatever else you like!</p>\n</blockquote>\n\n<p>for email addresses alone see this <a href=\"https://meta.stackexchange.com/questions/148394/should-real-e-mail-addresses-be-forbidden-in-questions-answers\">question</a></p>\n\n<blockquote>\n  <p>...The goal of Stack Overflow is to create a resource of knowledge to help people for years to come, and this means the focus is squarely on questions and answers.</p>\n  \n  <p>If I post a question and then ask people to email me the answers, this doesn't help future visitors. If I'm a spammer posting an email address so I can sell you my service, this creates a lot of noise that detracts from excellent Q&amp;A. If I post my email address, at minimum, I'm opening the door for spammers to obtain my email address.</p>\n</blockquote>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-02-07T00:43:42.247","CommentCount":"0"},{"Id":"1938","PostTypeId":"1","CreationDate":"2014-02-08T10:28:41.160","Score":"0","ViewCount":"27","Body":"<p>I'm not sure if the flag options changed. If so, is there a ;tldr or resume somewhere? I did not find one.</p>\n\n<p>Specifically I'm asking for <a href=\"https://apple.stackexchange.com/questions/120296/stuck-deactive-excelsheets-filter\">this</a> question.\nIt appeared to me, that the Flagging > Closing > \"another stackexchange page\" option disappeared and the only redirection is now meta.apple.stackexchange.com.</p>\n\n<p>Other Stackexchange sites(namely stackoverflow) still have this option.</p>\n","OwnerUserId":"23490","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Flag options changed?","Tags":"<discussion><flagging>","AnswerCount":"1","CommentCount":"2"},{"Id":"1939","PostTypeId":"1","CreationDate":"2014-02-08T10:47:36.863","Score":"0","ViewCount":"22","Body":"<p>This CSS piece is messing up and causing a weird behaviour when you get close with your mouse to the \"Add Comment\" Button.</p>\n\n<p>This applies to both, Meta and AskDifferent.</p>\n\n<pre><code>a.comments-link:hover {\npadding: 0px 3px 2px 3px;\n</code></pre>\n\n<p>This piece of CSS is also related to the issue:</p>\n\n<pre><code>.comments-link {\npadding: 0px 3px 2px 3px;\ncolor: #888;\nfont-family: 'Helvetica Neue',Helvetica,Arial,sans-serif;\ndisplay: inline-block;\npadding: 2px 7px 3px 8px; &lt;--\n</code></pre>\n\n<p>Can anyone poke for a fix please? (<a href=\"https://apple.meta.stackexchange.com/users/6/jin\">Jin?</a>)</p>\n\n<p>See this image for the place and button I mean:\n<img src=\"https://i.stack.imgur.com/hvVYm.png\" alt=\"See this image for the place and button I mean:\"></p>\n","OwnerUserId":"34561","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.967","LastActivityDate":"2014-02-08T12:13:57.273","Title":"CSS bug AskDifferent: add comment","Tags":"<bug><design>","AnswerCount":"0","CommentCount":"2","ClosedDate":"2014-02-08T14:00:50.833"},{"Id":"1940","PostTypeId":"2","ParentId":"1938","CreationDate":"2014-02-08T14:47:18.733","Score":"2","Body":"<p>I believe two things are in play. </p>\n\n<ol>\n<li>Migration only works for new questions (<a href=\"https://meta.stackexchange.com/questions/151890/disable-migration-for-questions-older-than-60-days\">past 60 days, migration is disabled on all SE sites</a>)</li>\n<li><p>Each site can request limited sites for non-diamond moderators to choose for migration and this site in particular has only a couple listed. </p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/658/which-sites-should-be-in-our-primary-migration-paths\">Which sites should be in our primary migration paths?</a></li>\n</ul></li>\n</ol>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-02-08T14:47:18.733","CommentCount":"3"},{"Id":"1941","PostTypeId":"1","AcceptedAnswerId":"2730","CreationDate":"2014-02-10T20:02:46.730","Score":"3","ViewCount":"38","Body":"<p>The tags on the Favourite Tags list don't animate in the same way that normal tags do:</p>\n\n<p><img src=\"https://i.stack.imgur.com/SQuR8.gif\"></p>\n\n<p>For comparison — normal tags:</p>\n\n<p><img src=\"https://i.stack.imgur.com/pbw5w.gif\"></p>\n","OwnerUserId":"37797","LastEditorUserId":"5472","LastEditDate":"2014-02-10T23:54:39.940","LastActivityDate":"2016-02-19T19:41:47.387","Title":"Favourite Tags don't animate","Tags":"<bug><status-reproduced><design><tags>","AnswerCount":"2","CommentCount":"1"},{"Id":"1942","PostTypeId":"2","ParentId":"1941","CreationDate":"2014-02-10T23:54:20.063","Score":"2","Body":"<p>I could get behind a feature request to not animate with rollover anything on the right hand side involving tags.</p>\n\n<p>Heck, I could get behind disabling the movement altogether.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-02-10T23:54:20.063","CommentCount":"0"},{"Id":"1943","PostTypeId":"1","CreationDate":"2014-02-11T19:20:43.720","Score":"5","ViewCount":"1722","Body":"<p>We have had several questions about people buying second hand phones and some have been closed as duplicate.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/114985/how-can-i-bypass-activation-lock\">How can I bypass Activation Lock?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/116606/how-to-open-iphone-5c-locked-with-an-icloud-account\">How to open iPhone 5c locked with an iCloud account?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/117806/apple-hardware-only\">https://apple.stackexchange.com/questions/117806/apple-hardware-only</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/120678/iphone-5-locked-out-from-previous-user\">iPhone 5 locked out from previous user</a></li>\n</ul>\n\n<p>I'm now convinced that we should have at least two questions, possibly three with good votes and great answers to avoid having lots of duplicate posts on this issue. What do people see as a good solution to solve this?</p>\n\n<p>My three canonical questions would be:</p>\n\n<ul>\n<li>How secure is Activation Lock?</li>\n<li>I know the person (or am the person) that controls the iCloud account that's now locking my device (or one I sold / gave away / donated)?</li>\n<li>I don't know the person that controls the iCloud account locking my device?</li>\n</ul>\n\n<p>Can someone answer or help find / ask these canonical questions on the site and confirm that my thinking is sound here?</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-02-11T21:26:22.093","Title":"Which of these questions should remain open?","Tags":"<discussion><closed-questions><exact-duplicates>","AnswerCount":"1","CommentCount":"2"},{"Id":"1944","PostTypeId":"2","ParentId":"1943","CreationDate":"2014-02-11T19:36:55.897","Score":"5","Body":"<p>I agree with the three situations as canonical questions:</p>\n\n<blockquote>\n  <ul>\n  <li>How secure is Activation Lock?</li>\n  </ul>\n</blockquote>\n\n<p><a href=\"https://apple.stackexchange.com/questions/104888/how-secure-is-activation-lock-on-ios-7\">How secure is Activation Lock on iOS 7 (and later)?</a></p>\n\n<blockquote>\n  <ul>\n  <li>I know the person (or am the person) that controls the iCloud account that's now locking my device (or one I sold / gave away / donated)?</li>\n  </ul>\n</blockquote>\n\n<p><a href=\"https://apple.stackexchange.com/questions/114985/how-can-i-bypass-activation-lock\">How can I bypass Activation Lock?</a></p>\n\n<p>…however, I think the title could be clarified a bit, as it doesn't appear to focus on the fact that the Activation Lock was activated by the 'previous owner' and therefore doesn't fit the third scenario.</p>\n\n<blockquote>\n  <ul>\n  <li>I don't know the person that controls the iCloud account locking my device?</li>\n  </ul>\n</blockquote>\n\n<p>This seems very much like the previous scenario and I believe could be answered by the existing answer to the above question.</p>\n\n<p>Personally, I'd like <a href=\"https://apple.stackexchange.com/questions/114985/how-can-i-bypass-activation-lock\">How can I bypass Activation Lock?</a> to be reopened, but with a new title that clarifies the focus on 'previous owner'.</p>\n\n<p>There has been a situation where it's not a previous owner but themselves that don't have access to the Apple ID any more. This question could suit that situation nicely: <a href=\"https://apple.stackexchange.com/questions/116010/our-ipad-is-locked-and-were-not-sure-of-the-apple-id-icloud-password\">Our iPad is locked and we&#39;re not sure of the Apple ID / iCloud password</a></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-02-11T19:36:55.897","CommentCount":"1"},{"Id":"1945","PostTypeId":"1","AcceptedAnswerId":"1946","CreationDate":"2014-02-17T06:19:33.660","Score":"9","ViewCount":"214","Body":"<p>If anyone's noticed, I've kind of just jumped right in and started trying to snipe bounties on this site. I know that this is acceptable behavior <a href=\"https://meta.stackexchange.com/a/127022/249673\">over on SO</a>, but since this site is much less aggressive (which is such a breath of fresh air), I just wanted to double check.\n(I've updated my profile here to reflect that I do more or less have the credentials.)</p>\n\n<p>I'm not trying to show off or anything — mostly, I'm really tired of not having 200 rep on any one SO site and therefore not being able to comment on sister sites.</p>\n\n<p>My main focus these days is working on my coding skills, because at 26, I am in no uncertain terms retired from support, after an abortive shot at starting a consulting company (did well, but 8-10 billing hours of Mac support + run business = mental breakdown. The end-up-in-hospital kind.).</p>\n\n<p>Also, I <strong>did</strong> notice that someone apparently awarded my a bounty on an answer where it seems the person who asked the question and posted the bounty seemed to have gone AWOL past the deadline, and despite having an answer of their own for the same question. Which is both very nice and a smart idea since otherwise good answers would likely slip through and people like me would get discouraged.</p>\n\n<p>So if I can answer a tricky question, why not, right? That kind of why bounties exist?</p>\n\n<p>Also, I <em>do</em> still of course still have Apple <strong>questions</strong>, and probably will be putting any rep gained here into a bountied question of my own shortly. But StackExchange basically makes my head spin just <a href=\"https://meta.stackexchange.com/questions/221008/etiquette-rules-or-advice-on-which-site-to-pose-a-question-or-why-are-there\">trying to figure out which site to even ask the question on.</a></p>\n","OwnerUserId":"65379","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-02-17T14:35:25.690","Title":"Is it ok to bounty hunt here?","Tags":"<discussion><bounty><new-users>","AnswerCount":"2","CommentCount":"5"},{"Id":"1946","PostTypeId":"2","ParentId":"1945","CreationDate":"2014-02-17T13:47:33.387","Score":"7","Body":"<p>Yes - choosing to only answer bountied questions is fine as long as each post adheres generally to the help center guidelines. </p>\n\n<p>Also, consider that the community gives and takes reputation points by voting. If you create a perception of taking more than you give - that can take time and effort to overcome. </p>\n\n<p>We haven't had to suspend or ban anyone for bounty sniping thus far - but there also are people that are known to show up on the site only when a contest is running, or when holiday hats are \"earned\" or solely to earn rep to drop and bounty their \"heavy\" question on the site that \"really need an immediate answer\". <em>(and the above generalizations are not at all directed at you Geoff, but do want to openly acknowledge that some have done this before and will probably continue to do so in the future)</em></p>\n\n<p>I hope over time people, and you specifically, will choose to answer questions that need great answers. I expect for all but the most rare expert at answering choice questions, far more reputation accrues from picking questions based on your ability to provide a quality answer rather than the rare moment when it has a bounty open on it - but that choice is certainly yours to make. </p>\n\n<p>I did want to address what might be confusing about your question to others and perhaps yourself. </p>\n\n<p>Bounties are a contract between the site and he person spending them. </p>\n\n<p>Put aside the awarding of the bounty for a moment. If you spend a bounty - you forfeit the points immediately and get the question promoted for a week. That is the requirement. </p>\n\n<p>Optional things that could happen:</p>\n\n<ul>\n<li>the bounty gets cancelled and refunded which immediately removes the promotion going forward but also credits the reputation to the offerer. </li>\n<li>the sponsor and only the sponsor can award it to any answer they choose</li>\n<li>only in the case where the offerer declines or is unable to award the bounty, the code operating as the community user awards half he bounty to the highest upvoted answer added after the bounty. </li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2014-02-17T14:35:25.690","LastActivityDate":"2014-02-17T14:35:25.690","CommentCount":"1"},{"Id":"1947","PostTypeId":"2","ParentId":"1945","CreationDate":"2014-02-17T14:06:05.680","Score":"2","Body":"<p>Welcome to Ask Different!</p>\n\n<p>You're doing exactly what the bounty system was intended for — it's promoted a question that people haven't answered<sup>1</sup> so that it's more noticeable. You seeing the question and then answering it is perfectly fine <em>and encouraged!</em></p>\n\n<p>Providing you don't <em>just</em> answer bountied questions, I see no reason why bounty hunting is bad, as was reasoned in the post that you linked to on Meta.SO.</p>\n\n<p><sup><sup>1</sup> There is the 'award existing answer' bounty reason though.</sup></p>\n","OwnerUserId":"37797","LastActivityDate":"2014-02-17T14:06:05.680","CommentCount":"0"},{"Id":"1949","PostTypeId":"1","CreationDate":"2014-02-18T16:40:38.460","Score":"0","ViewCount":"25","Body":"<p>I've often tried to share answers with friends on Twitter, IRC, etc. and it seems that if I use the share link for an answer that the page scrolls instead to the top answer.</p>\n\n<p>Example:</p>\n\n<p>Q: <a href=\"https://apple.stackexchange.com/q/121345/21050\">Can I put out a cigarette on aluminum Mac Books?</a></p>\n\n<p>A: <a href=\"https://apple.stackexchange.com/a/121414/21050\">https://apple.stackexchange.com/a/121414/21050</a></p>\n\n<p>I expected to reach this answer:</p>\n\n<blockquote>\n  <p>Yes, your cigarette will be irreparably damaged. You will have to replace it with a new one.</p>\n</blockquote>\n\n<p>but instead end up looking at the top-voted answer.</p>\n\n<p>I'm on Firefox 27.0.1 if that makes a difference.  I don't believe I have this issue on other SO sites.</p>\n","OwnerUserId":"21050","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-02-18T18:14:09.593","Title":"Are share links broken in Firefox?","Tags":"<bug>","AnswerCount":"0","CommentCount":"5","ClosedDate":"2014-02-20T18:17:11.790"},{"Id":"1950","PostTypeId":"1","AcceptedAnswerId":"2096","CreationDate":"2014-02-20T16:00:52.353","Score":"7","ViewCount":"101","Body":"<p>Having been participating on Stack Overflow a bit recently, I've noticed this:</p>\n\n<p><img src=\"https://i.stack.imgur.com/H6GWh.png\" width=\"498\"></p>\n\n<p>This doesn't seem to exist on Ask Different:</p>\n\n<p><img src=\"https://i.stack.imgur.com/nxvaX.png\" width=\"468\"></p>\n\n<p>Can it be added?</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T17:03:09.050","LastActivityDate":"2014-05-20T17:03:09.050","Title":"Can we have the reputation league shown in the user page like Stack Overflow?","Tags":"<feature-request><status-completed><reputation><profile-page>","AnswerCount":"2","CommentCount":"4"},{"Id":"1951","PostTypeId":"2","ParentId":"1809","CreationDate":"2014-02-21T17:03:44.890","Score":"1","Body":"<p>It's just a padding problem on the <code>mouseover</code> state. This should fix it:</p>\n\n<pre><code>a.comments-link:hover {\n    padding: 2px 7px 3px 8px;\n    ...\n}\n</code></pre>\n","OwnerUserId":"60395","LastActivityDate":"2014-02-21T17:03:44.890","CommentCount":"0"},{"Id":"1952","PostTypeId":"1","AcceptedAnswerId":"1955","CreationDate":"2014-02-22T09:17:52.920","Score":"0","ViewCount":"42","Body":"<p>Networking is very general and large, DHCP will narrow it much down. </p>\n\n<p>As DHCP is a dynamically created range of IP which will be automatically assigned to a device.\nNetworking on the other hand is very large.</p>\n\n<p>If a user decides to enter the Tag DHCP it will be a much easier subject to handle than just Networking.</p>\n\n<p>I'll add an excerpt and other information if it can be done.</p>\n\n<hr>\n\n<ul>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/networking\" class=\"post-tag\" title=\"show questions tagged &#39;networking&#39;\" rel=\"tag\">networking</a> (1121 tagged)</p>\n\n<blockquote>\n  <p>Questions about configuring, troubleshooting or using connections that one device uses to talk to another.</p>\n</blockquote></li>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/dhcp\" class=\"post-tag\" title=\"show questions tagged &#39;dhcp&#39;\" rel=\"tag\">dhcp</a> (synonym, 2 renames)</p></li>\n</ul>\n","OwnerUserId":"34561","LastEditorUserId":"37797","LastEditDate":"2014-02-24T18:10:31.467","LastActivityDate":"2014-02-24T18:14:14.747","Title":"Can DHCP be removed as Tag Synonym for Networking?","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"5"},{"Id":"1953","PostTypeId":"1","AcceptedAnswerId":"1954","CreationDate":"2014-02-22T11:19:52.153","Score":"0","ViewCount":"25","Body":"<p>Last time I've updated a tag synonym I've found the best information and very detailed on SO. The information I found was about the <a href=\"https://apple.stackexchange.com/questions/tagged/r\" class=\"post-tag\" title=\"show questions tagged &#39;r&#39;\" rel=\"tag\">r</a>-tag.</p>\n\n<p>Is it okay to do this? </p>\n","OwnerUserId":"34561","LastEditorUserId":"5472","LastEditDate":"2014-02-22T13:59:45.350","LastActivityDate":"2014-02-22T14:09:17.660","Title":"Steal or borrow or use Tag information from other StackExchange sites","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"1954","PostTypeId":"2","ParentId":"1953","CreationDate":"2014-02-22T14:09:17.660","Score":"0","Body":"<p>There are two things to consider:</p>\n\n<ol>\n<li>The function of a tag summary and tag wiki</li>\n<li>How to properly attribute Creative Commons licensed work. </li>\n</ol>\n\n<p>Both of those reasons make me feel we shouldn't just copy other tag content. A tag isn't a dictionary and the same word should have different meanings on different sites by definition. Take \"network/networking\" as it will be different here as on a workplace site. Even on computer sites like here, Super User and Ask Ubuntu - explaining what types of questions should get tagged as networking can and should be different. </p>\n\n<p>So, if there isn't any controversy or disagreement on use of a tag, the actual words attached to them are of little use in practice. I would say, in the case you mention - we would be served best by merging the r tag into open source since it won't make sense to most of the users of Mac, iOS and Apple Services as well as be more confusing to people typing other tags than the benefit of allowing some people to search for that one open-source software package. </p>\n","OwnerUserId":"5472","LastActivityDate":"2014-02-22T14:09:17.660","CommentCount":"1"},{"Id":"1955","PostTypeId":"2","ParentId":"1952","CreationDate":"2014-02-24T18:14:14.747","Score":"3","Body":"<p>Personally I disagree with this, since every question tagged <em>dhcp</em> should be tagged <em>networking</em> anyway and if someone tags with <em>dhcp</em> but not <em>networking</em> then the question may be missed by those that are following the <em>networking</em> tag (this would mean that one would have to follow two tags) and would probably lead to the question being edited to add the <em>networking</em> tag.</p>\n","OwnerUserId":"37797","LastActivityDate":"2014-02-24T18:14:14.747","CommentCount":"1"},{"Id":"1956","PostTypeId":"1","CreationDate":"2014-02-25T09:49:47.923","Score":"2","ViewCount":"32","Body":"<p>I see keyboard keys on this question\n<a href=\"https://apple.stackexchange.com/questions/121821/deleting-an-entire-line-moving-forward-shortcut\">Deleting an Entire Line Moving Forward Shortcut</a>\nBut there's no shortcut on how to make them?</p>\n","OwnerUserId":"71375","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-02-25T11:42:20.597","Title":"How do I create a keyboard key?","Tags":"<support>","AnswerCount":"1","CommentCount":"1","ClosedDate":"2014-02-25T09:53:01.393"},{"Id":"1957","PostTypeId":"1","AcceptedAnswerId":"1959","CreationDate":"2014-02-25T10:12:52.253","Score":"1","ViewCount":"27","Body":"<p>Check out the image below, this assumes I can edit someone's comment.\nHowever, clicking it does nothing.</p>\n\n<p>What does that button do there? In this specific picture it's next to Buscar's name and the <em>15 minutes ago</em>\n<img src=\"https://i.stack.imgur.com/Q0lWT.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"34561","LastEditorUserId":"34561","LastEditDate":"2014-02-25T10:25:53.630","LastActivityDate":"2014-02-26T14:08:10.947","Title":"Edit other person comment (not working though)","Tags":"<bug>","AnswerCount":"1","CommentCount":"2"},{"Id":"1958","PostTypeId":"2","ParentId":"1956","CreationDate":"2014-02-25T11:42:20.597","Score":"1","Body":"<p>Keyboard keys can be created using <code>&lt;kbd&gt;</code> tags.</p>\n\n<p>Example: <kbd>⌘</kbd></p>\n\n<p>For the key symbols, see\n<a href=\"https://apple.meta.stackexchange.com/questions/683/put-the-characters-somewhere-for-people-to-copy-paste\">Put the ⌃⌥⇧⌘⎋⏏⌫↑⇡↖⇞⇥ characters somewhere for people to copy/paste</a></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2014-02-25T11:42:20.597","CommentCount":"0"},{"Id":"1959","PostTypeId":"2","ParentId":"1957","CreationDate":"2014-02-25T19:17:29.820","Score":"1","Body":"<p>This answer is pretty easy and the question was pretty silly.</p>\n\n<p>The pencil indicates that the post was edited by someone, not that I could edit it.</p>\n","OwnerUserId":"34561","LastEditorUserId":"5472","LastEditDate":"2014-02-26T14:08:10.947","LastActivityDate":"2014-02-26T14:08:10.947","CommentCount":"0"},{"Id":"1960","PostTypeId":"2","ParentId":"1950","CreationDate":"2014-02-25T22:14:52.850","Score":"2","Body":"<p>It seems only SO shows the rep. league.</p>\n\n<p>Since SE has 115(!) Q&amp;A sites all in all, I made a script (obviously :P) to look through each of them and check whether profile pages showed rep. league.</p>\n\n<p>The result was that no other SE sites but SO showed it. To be extra sure, I also recorded total number of users for each site <em>and</em> number of users with actual RP change. And thus, I don't think it has anything to do with community size.</p>\n\n<p>Just to give you an idea of community sizes on SE:</p>\n\n<ul>\n<li>SO has ~2.85 mill.</li>\n<li>Ask Ubuntu has ~181k</li>\n<li>Ask Different has ~54k</li>\n<li>Homebrew has 3.6k</li>\n<li>Italian has 445</li>\n</ul>\n\n<p>So maybe the SE devs are just trying it out on their largest site? Doesn't seem to be by mistake that it only shows on SO.</p>\n","OwnerUserId":"64714","LastActivityDate":"2014-02-25T22:14:52.850","CommentCount":"0"},{"Id":"1961","PostTypeId":"1","AcceptedAnswerId":"1962","CreationDate":"2014-02-26T12:38:56.970","Score":"3","ViewCount":"32","Body":"<p>I'm new to reviewing and in relation to that I have a question regarding how to handle an answer to an <a href=\"https://apple.stackexchange.com/questions/58141/disable-saving-to-icloud-in-mountain-lion\">old question</a> with an already accepted answer like this one:</p>\n\n<p><img src=\"https://i.stack.imgur.com/bI3zW.png\" alt=\"\"></p>\n\n<p>It's an answer to a question from 2012. The answer is <em>technically</em> not wrong but it doesn't really add any value. Since it's a new user she might just not entire grasp the StackExchange system yet.</p>\n\n<p>Do I:</p>\n\n<ul>\n<li>Helpfully comment that it might be inappropriate?</li>\n<li>Ignore it?</li>\n<li>Down-vote?</li>\n<li>Flag it?</li>\n<li>Something else?</li>\n</ul>\n\n<p>Tried browsing meta to see if I could find an answer but with no luck.</p>\n\n<p>Any guidance would be greatly appriciated!</p>\n","OwnerUserId":"64714","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-02-26T13:33:31.317","Title":"What is the proper way to review a late answer from a new user that doesn't add anything?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"1962","PostTypeId":"2","ParentId":"1961","CreationDate":"2014-02-26T13:33:31.317","Score":"4","Body":"<p>New answers to old questions can be anything from spam to gem, so it's kind of difficult to give a simple answer on that. But in general the same rules apply both for current and for old topics</p>\n\n<ul>\n<li>if it is inappropriate or out of line -> flag</li>\n<li>if it is just wrong, incomplete or confusing -> downvote</li>\n<li>if you think the OP can/should improve it, add a comment with some followup questions</li>\n</ul>\n\n<p>In the case you mentioned it seems to have been meant as a comment to the accepted answer, something which is actually helpful because Mavericks brought some very welcome changes regarding iCloud document syncing. So flagging it for moderator attention would be a good way to handle that.</p>\n","OwnerUserId":"9058","LastActivityDate":"2014-02-26T13:33:31.317","CommentCount":"3"},{"Id":"1963","PostTypeId":"1","AcceptedAnswerId":"1964","CreationDate":"2014-02-26T16:51:20.187","Score":"1","ViewCount":"27","Body":"<p>How does the maths are done ? See the error bellow :</p>\n\n<p>3 active bounties for 250 rep, counter on the right is a 4 bounties and 350 rep...</p>\n\n<p><img src=\"https://i.stack.imgur.com/X0W8J.png\" alt=\"bounty count image\"></p>\n","OwnerUserId":"58138","LastEditorUserId":"5472","LastEditDate":"2014-02-26T18:21:42.233","LastActivityDate":"2014-02-26T18:21:42.233","Title":"Bounty count error","Tags":"<bug><status-bydesign>","AnswerCount":"1","CommentCount":"2"},{"Id":"1964","PostTypeId":"2","ParentId":"1963","CreationDate":"2014-02-26T17:07:24.923","Score":"1","Body":"<p>Caching delay.</p>\n\n<p><img src=\"https://i.stack.imgur.com/Qm7rQ.png\" alt=\"enter image description here\"></p>\n\n<p>It's resolved now.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-02-26T17:07:24.923","CommentCount":"2"},{"Id":"1965","PostTypeId":"1","AcceptedAnswerId":"1968","CreationDate":"2014-02-27T11:12:37.173","Score":"1","ViewCount":"23","Body":"<p>Please check image below, this is the current view on the privileges page.\n<img src=\"https://i.stack.imgur.com/6W7zt.png\" alt=\"enter image description here\"></p>\n\n<p>I've added one darker background color to the <code>&lt;div class=\"meter\"&gt;</code> resulting in this:\n<img src=\"https://i.stack.imgur.com/Cutv1.png\" alt=\"enter image description here\"></p>\n\n<p>Would it be an option to update the background color for the \"meter\" class? It's much better to read with one color darker.</p>\n","OwnerUserId":"34561","LastEditorUserId":"6","LastEditDate":"2014-02-28T18:40:13.723","LastActivityDate":"2014-02-28T18:40:13.723","Title":"\"Next Privilege\" bar hard to read","Tags":"<feature-request><status-completed><design>","AnswerCount":"1","CommentCount":"0"},{"Id":"1966","PostTypeId":"1","AcceptedAnswerId":"1967","CreationDate":"2014-02-28T08:39:46.443","Score":"1","ViewCount":"26","Body":"<p>I just did a review and clicked I'm done. The action displays as No Action Needed. \nThis is weird, as I put a comment below the review.</p>\n\n<p>What is wrong?</p>\n\n<p><img src=\"https://i.stack.imgur.com/3SiIt.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"34561","LastActivityDate":"2014-02-28T15:59:54.523","Title":"Review \"I'm Done\" resulted in \"No action needed\"","Tags":"<bug><review-page>","AnswerCount":"1","CommentCount":"0"},{"Id":"1967","PostTypeId":"2","ParentId":"1966","CreationDate":"2014-02-28T15:59:54.523","Score":"1","Body":"<p>I presume you are referring to this review:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/review/first-posts/54954\">https://apple.stackexchange.com/review/first-posts/54954</a></li>\n</ul>\n\n<p>Even though you've added a comment, it would appear that you selected the No Action Needed option. Even by 'reviewing' the post by adding a comment, the No Action Needed button is still enabled on the review page. It is possible that you may have accidentally clicked the button instead of the I'm Done button.</p>\n\n<p>Even though you didn't click I'm Done, the review still counts towards both your statistics and as a review (i.e. the review is removed from the queue, unlike the Skip option). Your comment is also unaffected.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-02-28T15:59:54.523","CommentCount":"0"},{"Id":"1968","PostTypeId":"2","ParentId":"1965","CreationDate":"2014-02-28T18:39:54.457","Score":"3","Body":"<p>I have darkened the bar's background color some. the change will go out after the next production build.</p>\n","OwnerUserId":"6","LastActivityDate":"2014-02-28T18:39:54.457","CommentCount":"1"},{"Id":"1969","PostTypeId":"1","CreationDate":"2014-03-01T11:26:23.383","Score":"1","ViewCount":"29","Body":"<p>I recently made a substantial edit to this question:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/122400/how-do-i-upload-a-new-version-of-an-app-after-an-app-transfer\">How do I upload a new version of an app after an App Transfer?</a></li>\n</ul>\n\n<p><img src=\"https://i.stack.imgur.com/xEEJK.png\" alt=\"My Edit\"></p>\n\n<p>The OP then further edited the post to change an <code>I</code> to an <code>i</code>:</p>\n\n<p><img src=\"https://i.stack.imgur.com/NUhXM.png\" alt=\"OP&#39;s Edit\"></p>\n\n<p>It was a very minor edit and the rollback would be equally minor, so should this be rolled back?</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-03-01T11:26:23.383","Title":"Should I rollback a bad minor edit by the OP?","Tags":"<discussion><editing>","AnswerCount":"0","CommentCount":"3"},{"Id":"1970","PostTypeId":"1","AcceptedAnswerId":"1973","CreationDate":"2014-03-03T14:11:45.720","Score":"3","ViewCount":"27","Body":"<p>Hopefully one day I'll get above 50 rep and it won't matter, but what is the SOP for interacting with questions until then? Only ask new questions and answer old ones?</p>\n","OwnerUserId":"70930","LastActivityDate":"2014-03-04T13:14:05.717","Title":"I can't comment, so should I simply ignore questions that I have questions about?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"2"},{"Id":"1971","PostTypeId":"1","CreationDate":"2014-03-04T07:34:37.190","Score":"0","ViewCount":"23","Body":"<p>This is on both Meta and AskDifferent </p>\n\n<p><img src=\"https://i.stack.imgur.com/zqJKF.png\" alt=\"enter image description here\"></p>\n\n<p>Maybe Mr. CSS can search for the same color being used at multiple places if it occurs more than once :)</p>\n\n<p><strong>EDIT:</strong> This class is missing as it is available <a href=\"https://apple.meta.stackexchange.com/tags\">here</a></p>\n\n<pre><code>    #tags_list .item-multiplier {\ncolor: #666;\n}\n</code></pre>\n","OwnerUserId":"34561","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.967","LastActivityDate":"2014-03-05T15:39:34.557","Title":"Number I've participated in Tags hard to read","Tags":"<bug><status-completed><design>","AnswerCount":"1","CommentCount":"0"},{"Id":"1972","PostTypeId":"2","ParentId":"1086","CreationDate":"2014-03-04T09:24:48.087","Score":"1","Body":"<p>Actually more tooltips are like this, thus it's by design and not a bug.\nIf you hover on the Upvote it displays: </p>\n\n<blockquote>\n  <p>This question shows research effort; it is useful and clear</p>\n</blockquote>\n\n<p>If you hover on the Downvote it displays: </p>\n\n<blockquote>\n  <p>This question does not show any research effort; it is unclear or not\n  useful</p>\n</blockquote>\n\n<p>It does explain you what happens <strong>when you click it</strong>, thus not a bug.</p>\n","OwnerUserId":"34561","LastActivityDate":"2014-03-04T09:24:48.087","CommentCount":"0"},{"Id":"1973","PostTypeId":"2","ParentId":"1970","CreationDate":"2014-03-04T13:14:05.717","Score":"1","Body":"<p>You're over 55 now. The \"able-to-place-comments\"-privilege is actually fully understandable once you get more reputation.\nThe most understandable cause is because if everyone could enter comments from 1 reputation, this SE-platform would be a massive mess with a lot of spam. <strike>(You might see one of these in the future, when you can review first-posts)</strike></p>\n\n<p>If you start by answering a (relatively) easy question, you get 10 points for every upvote, and +15 when an answer (you gave) is accepted.</p>\n\n<p>I hope this answers your question.</p>\n","OwnerUserId":"34561","LastActivityDate":"2014-03-04T13:14:05.717","CommentCount":"0"},{"Id":"1975","PostTypeId":"1","AcceptedAnswerId":"1980","CreationDate":"2014-03-05T15:15:43.190","Score":"3","ViewCount":"52","Body":"<p><img src=\"https://i.stack.imgur.com/MJ7zm.png\" alt=\"enter image description here\"></p>\n\n<p>Or, I guess, what is the difference between that and the number before the tag?</p>\n","OwnerUserId":"70930","LastEditorUserId":"5472","LastEditDate":"2014-03-05T20:41:25.230","LastActivityDate":"2014-03-07T00:08:44.657","Title":"What is the `x2` or `x3` next to a tag in my profile?","Tags":"<discussion><support>","AnswerCount":"2","CommentCount":"0"},{"Id":"1976","PostTypeId":"2","ParentId":"1971","CreationDate":"2014-03-05T15:39:28.213","Score":"1","Body":"<p>I have pushed a darkened text to dev. The change will be on live after our next production build.</p>\n","OwnerUserId":"6","LastActivityDate":"2014-03-05T15:39:28.213","CommentCount":"0"},{"Id":"1977","PostTypeId":"1","CreationDate":"2014-03-05T16:38:53.333","Score":"0","ViewCount":"61","Body":"<p>IMHO there is something wrong with the now available <strong>OS X Server</strong> tags!\nWhen I did some extensive re-taging edits on the 'OSX-Server' tagged Questions I realised that people would mostly not adhere to the given meaning of the <a href=\"http://Apple.StackExchange.com/tags/osx-server/info\">tags-wiki</a> but actually to the naming convention that Apple has chosen for its products.</p>\n\n<p>As of now, Apple calls it \"OS X Server\" and the App to manage the Server is called Server.app &lt;-- So, one is the App and the other is the Server System itself. </p>\n\n<p>If then added the core (Mac) OS X system version name tag (e.g. #Mavericks), we get the full picture of which Operating System we are talking about.</p>\n\n<p><img src=\"https://i.stack.imgur.com/s9o2c.png\" alt=\"Add OS X Server to OS X Mavericks\"></p>\n\n<hr>\n\n<p>But what about the old Mac Server System versions from Apple?</p>\n\n<p>Well, they were called <strong>Mac OS X Server</strong> 10.x and the Software to manage the Server was called 'Server Admin' and 'Workgroup Manager'.</p>\n\n<hr>\n\n<h2>tags needed for 10.0 - 10.6</h2>\n\n<pre><code>- Mac-OS-X-Server (the full Mac Server Version)\n- Server-Admin.app\n- Workgroup-Manager.app\n</code></pre>\n\n<hr>\n\n<h2>tags needed for 10.7 - 10.9</h2>\n\n<pre><code>- OS-X-Server (as an add-on to an installed OS X) \n- Server.app\n</code></pre>\n","OwnerUserId":"71997","LastActivityDate":"2014-05-01T03:01:59.720","Title":"Ask Different needs correct tags for 'Mac OS X Server' (10.0 - 10.6) and 'OS X Server (10.7 - 10.9)","Tags":"<discussion><feature-request><tags><suggested-edits>","AnswerCount":"2","CommentCount":"10","FavoriteCount":"1"},{"Id":"1978","PostTypeId":"1","AcceptedAnswerId":"1981","CreationDate":"2014-03-05T20:27:33.997","Score":"3","ViewCount":"28","Body":"<p>I recently ran across the <a href=\"https://apple.stackexchange.com/questions/tagged/idevice\" class=\"post-tag\" title=\"show questions tagged &#39;idevice&#39;\" rel=\"tag\">idevice</a> tag and was wondering if we could purge that out. Currently there is only one question tagged <a href=\"https://apple.stackexchange.com/questions/tagged/idevice\" class=\"post-tag\" title=\"show questions tagged &#39;idevice&#39;\" rel=\"tag\">idevice</a>.<br>\nI do not think we need this tag, as it is too broad. Tags are meant to narrow down to topics, not such broad overarching tags. <a href=\"https://apple.stackexchange.com/questions/tagged/ios\" class=\"post-tag\" title=\"show questions tagged &#39;ios&#39;\" rel=\"tag\">ios</a> also already covers this, as do the specific tags <a href=\"https://apple.stackexchange.com/questions/tagged/iphone\" class=\"post-tag\" title=\"show questions tagged &#39;iphone&#39;\" rel=\"tag\">iphone</a> <a href=\"https://apple.stackexchange.com/questions/tagged/ipad\" class=\"post-tag\" title=\"show questions tagged &#39;ipad&#39;\" rel=\"tag\">ipad</a> <a href=\"https://apple.stackexchange.com/questions/tagged/ipod\" class=\"post-tag\" title=\"show questions tagged &#39;ipod&#39;\" rel=\"tag\">ipod</a> <a href=\"https://apple.stackexchange.com/questions/tagged/ipod-touch\" class=\"post-tag\" title=\"show questions tagged &#39;ipod-touch&#39;\" rel=\"tag\">ipod-touch</a>.<br>\nSecondly, <a href=\"https://apple.stackexchange.com/questions/tagged/idevice\" class=\"post-tag\" title=\"show questions tagged &#39;idevice&#39;\" rel=\"tag\">idevice</a> is not a word. You never see Apple referring to their product lines with <a href=\"https://apple.stackexchange.com/questions/tagged/idevice\" class=\"post-tag\" title=\"show questions tagged &#39;idevice&#39;\" rel=\"tag\">idevice</a>.<br>\nBased on this, can we purge this tag from the system, and/or create a synonym  to <a href=\"https://apple.stackexchange.com/questions/tagged/ios\" class=\"post-tag\" title=\"show questions tagged &#39;ios&#39;\" rel=\"tag\">ios</a>?</p>\n","OwnerUserId":"7833","LastActivityDate":"2014-03-06T14:22:06.553","Title":"Can we remove the idevice tag?","Tags":"<discussion><tags>","AnswerCount":"2","CommentCount":"0"},{"Id":"1979","PostTypeId":"2","ParentId":"1978","CreationDate":"2014-03-06T07:02:53.207","Score":"2","Body":"<blockquote>\n  <p>can we purge this tag from the system</p>\n</blockquote>\n\n<p>Yes, please. </p>\n\n<blockquote>\n  <p>… create a synonym to iOS?</p>\n</blockquote>\n\n<p><em>idevice</em> is not a word (agreed), so there's no need for it to be a synonym of anything. </p>\n","OwnerUserId":"8546","LastActivityDate":"2014-03-06T07:02:53.207","CommentCount":"1"},{"Id":"1980","PostTypeId":"2","ParentId":"1975","CreationDate":"2014-03-06T07:19:04.943","Score":"2","Body":"<p>The number to the right of the tag is <strong>the number of times you've posted with that tag</strong> — questions with that tag and answers on questions with that tag. Similarly (yet substantially different) is the number on the left: the sum of votes received on the posts.</p>\n\n<hr>\n\n<p>For example, here is one of the tags from my user page:</p>\n\n<p><img src=\"https://i.stack.imgur.com/Dcsnv.png\" width=\"129\"></p>\n\n<p>The right number is calculated based on the total number of interactions I've had with the tag. In the example above, I have asked <a href=\"https://apple.stackexchange.com/search?q=user%3A37797+%5Bosx%5D+is%3Aquestion\">5 questions tagged with osx</a> and <a href=\"https://apple.stackexchange.com/search?q=user%3A37797+%5Bosx%5D+is%3Aanswer\">178 answers to questions tagged with osx</a>. Therefore, I have interacted with the osx tag 183 times, hence the number shown on the right.</p>\n\n<p>The number on the left is the sum of the votes that I have received for my posts. In the example above, <a href=\"https://apple.stackexchange.com/search?q=user%3A37797+%5Bosx%5D+is%3Aquestion+score%3A1\">4 questions have accumulated 12 votes</a> and <a href=\"https://apple.stackexchange.com/search?q=user%3A37797+%5Bosx%5D+is%3Aanswer+score%3A1\">134 answers have accumulated 301 votes</a>. Therefore, my total score for the osx tag is 313, hence the number shown on the left.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-03-06T18:01:58.007","CommentCount":"2"},{"Id":"1981","PostTypeId":"2","ParentId":"1978","CreationDate":"2014-03-06T14:22:06.553","Score":"2","Body":"<p>It's gone (for now). Ping us if it surfaces again after the 24 hour period needed to clean it up now that no questions are using that tag.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-03-06T14:22:06.553","CommentCount":"1"},{"Id":"1982","PostTypeId":"1","AcceptedAnswerId":"1987","CreationDate":"2014-03-06T18:58:58.993","Score":"1","ViewCount":"29","Body":"<p>There are a number of questions that are marked as duplicate of deleted questions:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/9697/will-lion-x-be-downloadable-for-everyone\">Will Lion X be downloadable for everyone?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/10844/how-to-recover-deleted-files-from-iphone-4ios-4-3\">How to recover deleted files from Iphone 4(iOS 4.3)</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/17646/full-wireless-keyboard-for-imac\">full wireless keyboard for iMac</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/17784/how-do-people-who-recently-bought-a-macbook-pro-get-the-free-upgrade-to-lion\">How do people who recently bought a Macbook Pro get the free upgrade to Lion?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/23155/multiple-macs-and-the-os-x-lion-hardware-up-to-date-program\">Multiple Macs and the OS X Lion Hardware Up-to-Date Program?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/79572/new-mac-cannot-read-my-lacie-external-hard-disk-and-cannot-do-backup\">https://apple.stackexchange.com/questions/79572/new-mac-cannot-read-my-lacie-external-hard-disk-and-cannot-do-backup</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/85655/unable-to-update-apps-purchased-earlier-apple-id-changed-recently-not-device\">https://apple.stackexchange.com/questions/85655/unable-to-update-apps-purchased-earlier-apple-id-changed-recently-not-device</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/97465/find-my-iphone-mix-signals\">https://apple.stackexchange.com/questions/97465/find-my-iphone-mix-signals</a></li>\n</ul>\n\n<p>Should they be reopened? Deleted themselves? Left alone?</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-03-10T15:49:17.417","Title":"What should be done with questions marked as duplicates of deleted questions?","Tags":"<discussion><closed-questions><deleted-questions>","AnswerCount":"1","CommentCount":"4"},{"Id":"1983","PostTypeId":"2","ParentId":"1975","CreationDate":"2014-03-07T00:08:44.657","Score":"0","Body":"<p>The <code>x</code> is how many times you have used or interacted that tag. Let's say i use the tag <code>recovery</code> like 5 times. It would say <code>recovery x5</code>.</p>\n\n<hr>\n\n<p><img src=\"https://i.stack.imgur.com/aqY7K.jpg\" alt=\"enter image description here\"></p>\n","OwnerUserId":"67324","LastActivityDate":"2014-03-07T00:08:44.657","CommentCount":"0"},{"Id":"1984","PostTypeId":"1","AcceptedAnswerId":"1986","CreationDate":"2014-03-09T19:47:34.330","Score":"1","ViewCount":"63","Body":"<p>I just found out that someone here does not like me.</p>\n\n<p>There was a targeted negative voting, on the same day (2 days ago), for answers I gave like 6 months ago:</p>\n\n<p><img src=\"https://i.stack.imgur.com/eBLbj.png\" alt=\"enter image description here\"></p>\n\n<p>Is there something I can do about it, such as negotiate, make peace? But for that, I would need to know who it is.</p>\n","OwnerUserId":"46541","LastEditorUserId":"116","LastEditDate":"2014-03-11T02:38:24.047","LastActivityDate":"2014-04-23T08:48:43.713","Title":"What can I do about targeted negative voting?","Tags":"<discussion><support><voting>","AnswerCount":"3","CommentCount":"0"},{"Id":"1985","PostTypeId":"2","ParentId":"1984","CreationDate":"2014-03-09T20:55:47.070","Score":"2","Body":"<p>The first thing to do is wait 24 hours. This allows the serial voting mechanism to undo the votes if you have been a victim of serial voting.</p>\n\n<p>For more information, see this Meta.SO post:</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/126829/what-is-serial-voting-and-how-does-it-affect-me\">What is serial voting and how does it affect me?</a></li>\n</ul>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-03-09T20:55:47.070","CommentCount":"5"},{"Id":"1986","PostTypeId":"2","ParentId":"1984","CreationDate":"2014-03-09T21:31:30.383","Score":"2","Body":"<p>I would say that only three votes could just be a coincidence and not some campaign. Your java post is clearly controversial - with more than a dozen people disagreeing with your stance that installing java is safe (or even a qualified safe thing to do). </p>\n\n<p>Also, voting is anonymous to all users - even elected moderators, so you won't be able to know who votes unless people offer a comment. Even then, they could comment and be an up-voter or non-voter, so not always are critical comments an indication of voting.</p>\n\n<p>You can rest assured, that if one person continues to down vote your content, that pattern will get raised to the moderation team and we will handle that privately - like we handle all vote irregularity situations.</p>\n\n<p>Here is some documentation on serial and targeted voting. (Where serial is targeted voting within a short time span):</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/126829/what-is-serial-voting-and-how-does-it-affect-me\">What is serial voting and how does it affect me?</a></li>\n<li><a href=\"https://meta.stackexchange.com/questions/tagged/serial-voting\">https://meta.stackexchange.com/questions/tagged/serial-voting</a></li>\n<li><a href=\"http://blog.stackoverflow.com/2009/03/the-value-of-downvoting-or-how-hacker-news-gets-it-wrong/\">http://blog.stackoverflow.com/2009/03/the-value-of-downvoting-or-how-hacker-news-gets-it-wrong/</a></li>\n<li><a href=\"http://blog.stackoverflow.com/2009/03/more-voting-anomalies/\">http://blog.stackoverflow.com/2009/03/more-voting-anomalies/</a></li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-03-09T22:25:10.653","CommentCount":"1"},{"Id":"1987","PostTypeId":"2","ParentId":"1982","CreationDate":"2014-03-10T15:49:17.417","Score":"2","Body":"<p>Systematically, I'm not sure there's a tool / method to handle the abstract idea, however all seem manageable with the existing moderator tools on a case by case basis. </p>\n\n<ul>\n<li>Any moderator (user with sufficient reputation) can flag the deleted questions that are savable and flag the questions that are closed as dupe that would be worth reopening. </li>\n</ul>\n\n<p>Again, a closed question is a fine state for a question to sit for months or even an indeterminate amount of time if we don't expect it needing any new answers. Closed questions are still visible to all and can do good.</p>\n\n<p>In the case of the last question, a vote for deletion might be a place to start on reviewing these. </p>\n","OwnerUserId":"5472","LastActivityDate":"2014-03-10T15:49:17.417","CommentCount":"0"},{"Id":"1988","PostTypeId":"2","ParentId":"1984","CreationDate":"2014-03-10T17:10:00.820","Score":"2","Body":"<p>As per your comment on bmikes answer (this is too long for a further comment which is how it started, hence now an answer), there is a <em>sort of possible tedious way</em> of making an educated guess in <em>some circumstances</em>, but it relies on the assumption of at least having a shortlist of who to check based on recent activity, and therefore being able to do the checking immediately after the voting happens, unless you want to monitor everyone's activity at the same time on the fly against your Rep etc which simply isn't practical. I got serially upvoted 5 times in 2 mins not long back and took a stab at rounding it down to 3 or 4 people, but nothing was conclusive.</p>\n\n<p>Unless it's sufficiently targeted for the systems algorithms to pick up (no, don't ask us what they are, we don't know) at which point we get alerted automatically, then no-one can ever conclusively say who voted for who and when.  And this is a good thing, because even if we had the info, what are we going to do about it?  No-one should be forced to explain or justify their participation on an SE site.</p>\n\n<p>I got a downvote on an answer I really liked a while ago, and I'm 100% certain who it was because they left a comment at the same time (be sure, leaving a comment is <em>not</em> a requirement, or even a a polite nicety, but purely optional, just as you can comment without voting); I'd love them to revert it, not because I care about the rep, but because they simply read the answer wrongly and misunderstood it and therefore said it didn't work, which could lead others to think it's a wrong answer too. All I could do was explain as much in a further comment and leave it at that.</p>\n\n<p>You've got close to 4000 rep, therefore you clearly have a lot of posts that someone could downvote.  These 6 points are like not even 0.2% of your Rep.  Each of the answers in question had received at least 1 downvote already, and 1 has had a further on since, so it's reasonable to assume that it's not necessarily a surprise to get them - I suggest you just let it be, and let them go.</p>\n\n<p>My last comment is merely this - if someone downvotes you (the Royal you, i.e. this applies to everyone), please do not comment asking for an explanation, or asking for the voter to own up.  That's not fair, and I would remove any such comments as inappropriate.  Take the rough (there isn't much) with the smooth.</p>\n","OwnerUserId":"9495","LastEditorUserId":"9495","LastEditDate":"2014-03-10T17:36:34.907","LastActivityDate":"2014-03-10T17:36:34.907","CommentCount":"0"},{"Id":"1989","PostTypeId":"1","AcceptedAnswerId":"1990","CreationDate":"2014-03-15T13:46:10.363","Score":"4","ViewCount":"42","Body":"<p>Within a question or answer is it possible to write a footnote?</p>\n\n<p>For example, if I use a tricky term, for many readers, some of them will\nunderstand it at first reading, but some others might prefer a\ncorrect explanation. To do this within web pages or written technical\ndocuments I use footnotes.</p>\n\n<p>Is this possible within StackExchange?</p>\n\n<p>If not, could this feature be added? </p>\n\n<p>What is the relevant StackExchange group wher to ask this question?</p>\n","OwnerUserId":"22003","LastActivityDate":"2014-03-25T00:45:08.063","Title":"Footnote or internal reference?","Tags":"<feature-request><formatting>","AnswerCount":"2","CommentCount":"2"},{"Id":"1990","PostTypeId":"2","ParentId":"1989","CreationDate":"2014-03-15T14:42:50.840","Score":"5","Body":"<p>I've done this a few times using the built-in superscript. For example:</p>\n\n<blockquote>\n  <p>This is an example of additional information<sup>1</sup> being added to a post.</p>\n  \n  <p><sup><sup>1</sup> Here is the additional information.</sup></p>\n</blockquote>\n\n<p><sub>Source:</sub></p>\n\n<pre><code>This is an example of additional information&lt;sup&gt;1&lt;/sup&gt; being added to a post.\n</code></pre>\n\n\n\n<pre><code>&lt;sup&gt;&lt;sup&gt;1&lt;/sup&gt; Here is the additional information.&lt;/sup&gt;\n</code></pre>\n\n<p>This seems to work pretty well for most situations.</p>\n","OwnerUserId":"37797","LastActivityDate":"2014-03-15T14:42:50.840","CommentCount":"1"},{"Id":"1991","PostTypeId":"1","AcceptedAnswerId":"1992","CreationDate":"2014-03-16T13:53:39.650","Score":"0","ViewCount":"40","Body":"<p>Does one gets Negative points for Flagging something to Moderator?</p>\n","OwnerUserId":"46541","LastEditorUserId":"5472","LastEditDate":"2014-03-16T15:20:08.220","LastActivityDate":"2014-03-16T15:20:08.220","Title":"Negative points when Flaging","Tags":"<discussion><flagging><voting>","AnswerCount":"1","CommentCount":"3"},{"Id":"1992","PostTypeId":"2","ParentId":"1991","CreationDate":"2014-03-16T13:56:03.460","Score":"2","Body":"<p>No, see <a href=\"https://apple.stackexchange.com/help/privileges/flag-posts\">Help Center > Privileges > Flag Posts</a> for details.</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-03-16T13:56:03.460","CommentCount":"11"},{"Id":"1993","PostTypeId":"1","CreationDate":"2014-03-17T19:44:13.883","Score":"2","ViewCount":"29","Body":"<p>Perhaps they aren't directly related as the other bronze-silver-gold badge progressions, but it seems like they could be grouped with each other in the list.</p>\n","OwnerUserId":"70930","LastEditorUserId":"70930","LastEditDate":"2014-03-19T16:19:23.377","LastActivityDate":"2014-03-19T16:19:23.377","Title":"Should Civic Duty and Electorate be put between the same hr tags in the Badges list?","Tags":"<feature-request><badges>","AnswerCount":"1","CommentCount":"3"},{"Id":"1994","PostTypeId":"1","CreationDate":"2014-03-17T19:52:52.670","Score":"3","ViewCount":"29","Body":"<p>I realize now I've been a little too liberal in my up-voting.</p>\n\n<p>I would say that answers to questions fall along a spectrum (leaving out clearly bad/offtopic answers and answers) from </p>\n\n<ul>\n<li><p>Well written and might work <strong>edit</strong> <em>but I don't fully understand the process as outlined.</em></p>\n\n<p>to </p></li>\n<li><p>I actually understand and I think will work</p>\n\n<p>to</p></li>\n<li><p>I know they will work</p></li>\n</ul>\n\n<p>I've been voting all of these up as long as they don't fall completely outside of my comprehension. Going forward I think I should probably limit up-voting to the latter two, but do y'all think I should only up-vote if I can actually test and see if the answer works?</p>\n\n<p>For questions, I'm planning on continuing to up-vote any question that seems well written.</p>\n","OwnerUserId":"70930","LastEditorUserId":"9058","LastEditDate":"2014-03-18T19:05:00.710","LastActivityDate":"2014-03-18T19:05:00.710","Title":"Answer Spectrum:","Tags":"<discussion><voting>","AnswerCount":"3","CommentCount":"0"},{"Id":"1995","PostTypeId":"2","ParentId":"1994","CreationDate":"2014-03-17T20:20:52.533","Score":"2","Body":"<p>Answer voting is very simple and I would encourage you to try voting on more and not less.</p>\n\n<p>An up vote means one thing and one thing only here: <strong>This answer is useful</strong>.</p>\n\n<p>It could be because you learned something. It could be because someone took the effort to put something down that's better than the white space that was there. It could even be an incorrect answer that still clarifies the question and will teach others what not to do.</p>\n\n<p>Similarly, a down vote can be a hint that the person answering is missing a very important thing or just that you don't find it useful. </p>\n\n<p>I feel that if more people saw others voting, it might be contagious and the actual role of voting - having an active community of people that together float the things that need to be discounted to the bottom of the heap as well as float up the outstanding contributions so that they can be easier found and used by others that follow in the footsteps of the person that asked the question and those that took time to answer.</p>\n\n<hr>\n\n<p>Once you get the initial reaction taken care of, you can decide whether a comment will help clarify why you found a post useful / not useful since that can when done with kindness, often turn around a post that was getting momentum in the wrong direction.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-03-17T20:20:52.533","CommentCount":"0"},{"Id":"1996","PostTypeId":"2","ParentId":"1993","CreationDate":"2014-03-17T20:35:00.183","Score":"1","Body":"<p>In my eyes they are related, and just a degree of how sustained your moderation efforts on the site relate to the voting buttons.</p>\n\n<p>My hope is that everyone that decides to chase the Electorate badge is then so used to the positive effect of voting, that the site grows people that help moderate what content is featured.</p>\n\n<p>The listing at <a href=\"https://apple.stackexchange.com/help/badges\">https://apple.stackexchange.com/help/badges</a> seems to be organized alphabetically to my eye. ;-)</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-03-17T20:35:00.183","CommentCount":"2"},{"Id":"1997","PostTypeId":"2","ParentId":"1994","CreationDate":"2014-03-17T23:37:16.540","Score":"2","Body":"<p>We have, in general, a voting problem here on AD (there really isn't enough of it, especially question and answer up voting) despite having a fairly decent traffic and posting profile for the site. I'd encourage anything that gets people thinking about voting more and not just in one direction. Up and down votes are good and should be sent out fairly liberally, especially for questions where they don't cost you any rep.</p>\n\n<p>I agree with @bmike: an up vote means an answer was <strong>useful</strong>.</p>\n\n<p>Which is different from <em>most correct</em> or even <em>completely correct</em> really. Though I wouldn't encourage you to up vote anything that was <em>blatantly incorrect</em>.</p>\n","OwnerUserId":"292","LastActivityDate":"2014-03-17T23:37:16.540","CommentCount":"1"},{"Id":"1998","PostTypeId":"1","CreationDate":"2014-03-18T01:21:09.273","Score":"0","ViewCount":"39","Body":"<p>There should be a tag for <a href=\"https://en.wikipedia.org/wiki/Bluetooth_low_energy\" rel=\"nofollow\">Bluetooth Low Energy</a> (distinct from <a href=\"https://en.wikipedia.org/wiki/Bluetooth\" rel=\"nofollow\">Bluetooth</a>). It should include the synonyms: Bluetooth LE, Bluetooth Smart and BLE.</p>\n","OwnerUserId":"3810","LastEditorUserId":"3810","LastEditDate":"2014-03-18T05:41:49.923","LastActivityDate":"2014-03-18T05:41:49.923","Title":"Tag for Bluetooth Low Energy","Tags":"<feature-request><tags>","AnswerCount":"0","CommentCount":"10"}]