[{"Id":"2851","PostTypeId":"1","CreationDate":"2016-08-24T01:16:41.393","Score":"5","ViewCount":"206","Body":"<p>What is the proper way to handle posts and questions having to do with beta- or developer- only released iOS, macOS, tvOS, and watchOS questions? Answer them? Ignore them? Vote them down? Inform the person they might be violating their NDA and leave it at that?</p>\n\n<p>I saw <a href=\"https://apple.meta.stackexchange.com/questions/2707/what-happened-to-the-beta-ban\">this</a> question (and lots of good info) from January 2016, and <a href=\"https://apple.meta.stackexchange.com/questions/573/update-to-faq-regarding-beta-and-pre-release-software\">this</a> update to the FAQ in 2011. These seem to indicate that the posts are allowed, but do not address how other users are expected to respond. </p>\n\n<p>Developers and beta testers are (probably) violating their Non-Disclosure Agreement with Apple by discussing it. My NDA also says I can't post screen shots online of any pre-release firmware, which, in addition to not being able to talk about it, makes walking anyone through a fix really difficult. I've made a judgement call that I won't answer questions having to do with these types of posts. Is it up to each of us to make that call?</p>\n\n<p>I found it interesting that <a href=\"http://www.imore.com/apple-pulls-ifixits-app-ios-store-after-it-published-new-apple-tv-teardown\" rel=\"nofollow noreferrer\">Apple revoked iFixit's iOS app</a> after they took apart an Apple TV and Siri Remote and documented it online. I wondered if StackExchange was worried about having their app pulled because it allowed (if it IS allowed, that is) users to discuss NDA-violating content.</p>\n","OwnerUserId":"181868","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-08-24T11:02:18.853","Title":"Developer and Beta-Tester NDAs and Requests for Help on SE","Tags":"<discussion>","AnswerCount":"2","CommentCount":"2"},{"Id":"2852","PostTypeId":"2","ParentId":"2851","CreationDate":"2016-08-24T03:23:31.477","Score":"5","Body":"<p>Anything covered by an NDA is off-topic and you can flag it to be closed. <a href=\"https://apple.meta.stackexchange.com/questions/573/update-to-faq-regarding-beta-and-pre-release-software\">The FAQ update you pointed out</a> very clearly says NDA-covered topics are still off topic here as they'd obviously violate the NDAs and we're not looking to be a place where that's encouraged or welcome.</p>\n\n<p>Note though that being a developer beta doesn't mean it's under NDA. Apple's beta program has, in recent times, gotten far more inclusive of the general public which is why we added that FAQ change. So make sure it's really NDA-covered before you flag it. We don't do a lot of post-flag checking (and can't because it'd be too arduous on the handful of moderators we have here).</p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-08-24T03:23:31.477","CommentCount":"5"},{"Id":"2853","PostTypeId":"2","ParentId":"2851","CreationDate":"2016-08-24T10:36:59.113","Score":"3","Body":"<p>From a process standpoint - moderators would need to:</p>\n\n<p>a) be privy to the specific NDA agreement between a poster and another third party\nb) be trained in legal contract interpretation - possibly on a worldwide basis to understand what jurisdictional framework and body of law</p>\n\n<p>This isn't the case, so the longstanding process is to delete any comments on the main site asking / complaining / pointing out NDA and bringing that discussion here.</p>\n\n<ul>\n<li><a href=\"https://meta.stackoverflow.com/questions/252216/question-for-technologies-under-nda\">https://meta.stackoverflow.com/questions/252216/question-for-technologies-under-nda</a></li>\n<li><a href=\"https://meta.stackexchange.com/questions/94465/should-moderators-enforce-ndas-for-software-vendors\">Should moderators enforce NDAs for software vendors?</a></li>\n</ul>\n\n<p>So - as far as moderators which include everyone with voting and editing privileges, elected moderators and SE staff with moderator status - the NDA status of a post is generally irrelevant. It's just not practical to police an agreement to which you are not a party.</p>\n\n<p>For Ask Different specifically - lots of good posts:</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/2537/should-beta-os-questions-be-on-topic-due-to-nda-changes-widening-distribution\">Should beta OS questions be on-topic due to NDA changes + widening distribution by Apple</a></li>\n</ul>\n\n<p>I can't speak for SE employees, but they clearly will have a team or person to deal with legal take down requests and can / should be contacted if you specifically have an NDA query that can't be answered here.</p>\n\n<p>In the past, Stack Exchange would close questions based on narrowness - so that was in my eyes, the primary reason why we had prohibitions on beta software. By nature NDA and early betas are restricted and the pool of people to answer was small. It turns out that the assumption that the quality of narrow questions would be lower than other questions was reverse. The quality of narrow questions was actually higher so that general guideline is dropped/retired.</p>\n\n<p>The general guideline is to ask a precise, good question whether or not it's beta or NDA. I personally shy away from participating in any topic where I have an active NDA unless I'm quite certain the topic at hand isn't encumbered by any agreements I have entered into voluntarily.</p>\n\n<p>Someone asking about something that you know is NDA is akin to someone asking about pirated or stolen goods - so I very much appreciate when people steer clear or flag posts like that for moderator attention with an other flag explaining the concern. Feel free to vote and flag as you see fit, but the general guidelines are to not focus on NDA as the sole problem with a post or an answer.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2016-08-24T11:00:51.110","CommentCount":"0"},{"Id":"2854","PostTypeId":"1","CreationDate":"2016-08-27T06:12:55.243","Score":"2","ViewCount":"78","Body":"<p>iPhones have a dedicated Voice Memos app. iPads don't, despite running the same OS and also featuring a built-in microphone. </p>\n\n<p>As an addendum to <a href=\"https://apple.stackexchange.com/questions/250654/voice-memos-on-the-ipad\">this</a> question (which was suggested I move to Meta as per this site's policy), I am super curious what the logic for not making Voice Memos available on the iPad could have been. I was baffled me when I realized it's not available for iPad given that Apple devices are usually designed to work out of the box for a broad range of possible use cases. So Apple must have had a very specific reason for not including it on the iPad. </p>\n\n<p>So if there's anyone who would be able to help me understand what that reason could have been that would be much appreciated! </p>\n","OwnerUserId":"175990","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-02-23T19:26:14.637","Title":"No Voice Memos on the iPad?","Tags":"<discussion><ipad>","AnswerCount":"2","CommentCount":"3"},{"Id":"2855","PostTypeId":"2","ParentId":"2854","CreationDate":"2016-08-27T07:39:03.493","Score":"1","Body":"<p>Meta is for discussions about the site itself, not for questions which are off-topic on the main site. In your case, asking about why Apple does or doesn't do something is off-topic in general, as explained in <a href=\"https://apple.stackexchange.com/help/on-topic\">https://apple.stackexchange.com/help/on-topic</a>:</p>\n\n<blockquote>\n  <p>Please refrain from asking about the following topics as questions with these core subjects are generally closed or deleted:</p>\n  \n  <ul>\n  <li>Pre-release hardware or asking how/why Apple does  </li>\n  <li>[...]</li>\n  </ul>\n  \n  <p>[...] specific questions about what Apple [did|does|thinks|might do] are not helpful in a Q&amp;A setting since they lack a practical problem to be solved.</p>\n</blockquote>\n","OwnerUserId":"9058","LastActivityDate":"2016-08-27T07:39:03.493","CommentCount":"0"},{"Id":"2856","PostTypeId":"2","ParentId":"2854","CreationDate":"2016-08-27T15:17:40.047","Score":"0","Body":"<p>I put a lock on the main question since asking three questions in one muddies the waters. </p>\n\n<p>Looking at this revision:</p>\n\n<p><a href=\"https://apple.stackexchange.com/revisions/250654/2\">https://apple.stackexchange.com/revisions/250654/2</a></p>\n\n<p>Question 1 - Could be edited into a great question. \"Is a jailbreak to add Apple voice memo possible on hardware X at iOS version Y?\" It is practical and will get yes answers, maybe answers and no answers. The voting and comments will quickly establish some answers relating to voice memo on iPad. </p>\n\n<p>Question 2 - asking for lists of X is covered as <a href=\"https://apple.meta.stackexchange.com/questions/2180/how-should-i-ask-about-getting-a-software-recommendation\">How should I ask about getting a software recommendation?</a></p>\n\n<p>Question 3 - off topic - Patrix covers this well</p>\n\n<p>Just keep in mind - even asking several on-topic, great questions together is problematic at best. Once each question is clearly phrased, the site can vote to close or answer. If somethings is voted to close, you can ask here about how or whether to edit it so that it might get reopen votes. </p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-08-27T15:41:04.050","CommentCount":"0"},{"Id":"2857","PostTypeId":"1","CreationDate":"2016-08-27T20:06:27.510","Score":"2","ViewCount":"35","Body":"<p>It would be convenient if the one box code to expand a link in [chat] would handle Apple app store apps, iBooks, Movies, Music, Videos, etc...</p>\n\n<ul>\n<li><a href=\"https://itunes.apple.com/us/app/just-press-record-voice-audio/id1033342465?mt=8\" rel=\"nofollow\">https://itunes.apple.com/us/app/just-press-record-voice-audio/id1033342465?mt=8</a></li>\n</ul>\n\n<p>Thanks for any votes or thought on if this would be a bad thing. My feeling is moderation would be able to handle any abuses of this, but I'm asking here to see if anyone thinks this would be helpful.</p>\n","OwnerUserId":"5472","LastActivityDate":"2016-08-29T16:01:25.707","Title":"Please one box Apple app store apps in chat","Tags":"<feature-request><chat>","AnswerCount":"0","CommentCount":"5"},{"Id":"2859","PostTypeId":"1","AcceptedAnswerId":"2860","CreationDate":"2016-08-31T11:01:53.137","Score":"2","ViewCount":"34","Body":"<p>I'm about to buy this old PowerPC eMac just for nostalgia, some fun and for playing some old games I have.</p>\n\n<p>I know there's a <a href=\"https://retrocomputing.stackexchange.com/\">beta site on retro computing</a>.</p>\n\n<p>However, is there any limit to age of Apple products in Ask Different's scope?</p>\n\n<p>For example OS X versus older operating systems. Or Intel vs. PowerPC vs. Motorola 68040, etc.</p>\n\n<p>To take two extreme examples, would questions about <a href=\"https://en.wikipedia.org/wiki/Apple_Lisa\" rel=\"nofollow noreferrer\">Apple Lisa</a> or the <a href=\"https://en.wikipedia.org/wiki/PowerBook_100\" rel=\"nofollow noreferrer\">PowerBook 100</a> be on-topic?</p>\n\n<p>I realize that in such extreme cases it might be better to ask at the <a href=\"https://retrocomputing.stackexchange.com/\">beta site</a> I referred to earlier, but I'm asking if it's, strictly speaking, off-topic or on-topic.</p>\n\n<p>And, if off-topic, where do you draw the line in terms of hardware and software?</p>\n","OwnerUserId":"153510","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:52:54.530","LastActivityDate":"2016-08-31T11:44:12.900","Title":"Are questions about very old Apple products on-topic?","Tags":"<support><site-scope>","AnswerCount":"1","CommentCount":"0"},{"Id":"2860","PostTypeId":"2","ParentId":"2859","CreationDate":"2016-08-31T11:25:56.153","Score":"2","Body":"<p>Yes - Questions about Motorola and PPC era hardware are on topic. </p>\n\n<p>Apple products and services are considered on topic without regard to them being beta, in production or withdrawn from sale and/or support. </p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/help/on-topic\">https://apple.stackexchange.com/help/on-topic</a></li>\n</ul>\n\n<p>Definitely read through the entire article above - there will be likely questions from that era that will be off topic if they have other faults:</p>\n\n<ul>\n<li>shopping for parts</li>\n<li>why did Apple choose 68000 processor instead of XYZ?</li>\n<li><a href=\"https://apple.stackexchange.com/help/dont-ask\">overly subjective questions</a> in general</li>\n<li><a href=\"https://retrocomputing.stackexchange.com/questions/459/over-its-lifetime-how-many-apple-2s-were-sold\">How many Apple II computers were sold over their lifetime?</a> (I include this since what's off topic here might be not only on-topic elsewhere, but well received and usefully documented and answered)</li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:52:54.530","LastActivityDate":"2016-08-31T11:44:12.900","CommentCount":"5"},{"Id":"2861","PostTypeId":"1","AcceptedAnswerId":"2864","CreationDate":"2016-09-01T15:06:30.883","Score":"2","ViewCount":"17","Body":"<p>Today I encountered <a href=\"https://apple.stackexchange.com/questions/251233/apple-rejected-my-app-twice-citing-a-very-grey-area-violation-but-already-hav\">this question</a> pertaining to \"unfair treatment\" by the App Store Review, and whether the OP should \"appeal\" the decision for his app to be rejected.</p>\n\n<p>Is this kind of question on- or off-topic on this site?</p>\n","OwnerUserId":"152792","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-09-01T21:34:34.007","Title":"Are questions about App Review on-topic?","Tags":"<discussion><site-scope>","AnswerCount":"1","CommentCount":"1"},{"Id":"2862","PostTypeId":"1","CreationDate":"2016-09-01T17:29:41.917","Score":"3","ViewCount":"76","Body":"<p>There seems to be a new one every day.<br>\nThis was today's - <a href=\"https://apple.stackexchange.com/questions/251243/macbook-pro-13-mid-2014-4k-screen-support\">https://apple.stackexchange.com/questions/251243/macbook-pro-13-mid-2014-4k-screen-support</a></p>\n\n<p>I know we shouldn't close as <em>\"Why don't you Google it yourself?\"</em> but we can't even link these as dupes, because they're all subtly different.  </p>\n\n<p>The only similarity they really share is a <strong>total lack of effort</strong>.</p>\n\n<p>Today's I voted to close as \"Customer Support\".</p>\n\n<p>Opinions - do we just keep on posting excerpts &amp; links to Everymac [as I see has been done with this one even as I'm typing this question] or do we ask them to do the minimum of research first?</p>\n\n<p>Straight out of the Help Pages - <a href=\"https://apple.stackexchange.com/help/how-to-ask\">https://apple.stackexchange.com/help/how-to-ask</a> </p>\n\n<blockquote>\n  <p><strong>Search, and research</strong></p>\n  \n  <p>Have you thoroughly searched for an answer before asking your\n  question? Sharing your research helps everyone. Tell us what you found\n  and why it didn’t meet your needs. This demonstrates that you’ve taken\n  the time to try to help yourself, it saves us from reiterating obvious\n  answers, and above all, it helps you get a more specific and relevant\n  answer!</p>\n</blockquote>\n\n<p>I suppose my background for this question is along the lines of :-  </p>\n\n<ul>\n<li>How do we keep newbies?  </li>\n<li>How do we train them?</li>\n<li>Are these people ever going to return anyway?</li>\n<li>Is this type of question ever going to gain us new long-term members, or are they here because it's the first hit on Google &amp; may never find us again?  </li>\n<li>etc etc...</li>\n</ul>\n\n<hr>\n\n<p>Edits...</p>\n\n<hr>\n\n<p>Maybe I'm just getting jaded..\n<a href=\"https://apple.stackexchange.com/questions/251258/mount-android-phone-on-desktop\">Mount Android Phone on Desktop</a> got the comment </p>\n\n<blockquote>\n  <p>Please make an effort to <a href=\"https://apple.stackexchange.com/help/how-to-ask\"><strong>research your\n  question</strong></a> before\n  posting it, and be sure to add as much detail as you can when\n  explaining your problem.</p>\n</blockquote>\n\n<hr>\n\n<p>...and the OP on my prime question showing further signs of entitlement in comments... </p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-09-15T11:19:02.097","Title":"Are we bored of \"What screen resolutions can my Mac XYZ support?\"","Tags":"<discussion>","AnswerCount":"1","CommentCount":"2"},{"Id":"2863","PostTypeId":"2","ParentId":"2862","CreationDate":"2016-09-01T18:55:18.120","Score":"7","Body":"<p>I'm not sure if this community is bored with it. But if it is, then here is what we do at Travel SE. A similar approach may be useful for Ask Different:</p>\n\n<p>There are these questions which can be asked with X and/or Y and there are hundreds if not thousands of variations of X and/or Y.</p>\n\n<p>Often, they are extremely easy to solve, not worthy of having to post them on SE.</p>\n\n<p>So instead of saying \"<strong>I'm voting to close this question as off-topic because google it yourself you lazy/unintelligent slob.</strong>\" we have canonical questions on how to solve the problem very easily, and then we mark them as duplicates of that.</p>\n\n<h2>Some examples</h2>\n\n<p>Lots of people ask \"<strong>What is the weather typically like in location X at time Y?</strong>\" We mark those as duplicates of \"<a href=\"https://travel.stackexchange.com/q/64136/41775\">How can I find out what the weather is like in a given location on a certain month?</a>\" If we didn't there would be hundreds of questions about what the weather would be like, which is extremely easy to look up.</p>\n\n<p>Lots of people ask \"<strong>I'm going from country X to country Y, how should I bring money?</strong>\" We close these as duplicates of: <a href=\"https://travel.stackexchange.com/q/10/41775\">\"When traveling to a country with a different currency, how should you take your money?</a>\"</p>\n\n<p>Finally, one day a guy asked \"<strong>I want to travel to this place pictured in one of the Windows 10 wallpapers, where is it?</strong>\" The question hit the Hot Network Questions, and <a href=\"https://meta.stackexchange.com/q/238420/321647\">a lot of rep was earned from it</a>. Then a bunch of such questions started appearing, all about one of the (many) wallpapers from Windows 10. Turns out it's not very hard to find out where each of the wallpapers from Windows 10 are from. So we created the question: \"<a href=\"https://travel.stackexchange.com/q/74404/41775\">Is there a website listing the location of all the Windows 10 lock screens?</a>\" So now, we close all such questions as duplicates of that.</p>\n\n<p>There might be a dozen or more types of questions where we have taken a similar approach, but I'm not gonna list them all here. You get the idea. Ask Different may be able to incorporate something similar to this. I'm not saying you should, as I'm not very active here and don't feel I should have a strong opinion in the matter. I'm just offering this approach from Travel SE as a potential suggestion for how to deal with it.</p>\n","OwnerUserId":"153510","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:52:01.880","LastActivityDate":"2016-09-15T11:19:02.097","CommentCount":"7"},{"Id":"2864","PostTypeId":"2","ParentId":"2861","CreationDate":"2016-09-01T21:34:34.007","Score":"1","Body":"<p>\"Somebody treated me such-and-such, what should I do\" is practically always off-topic. OTOH, the linked question can be turned into a \"what options do I have if this-and-this fails\" question with a small edit which is on-topic usually.</p>\n","OwnerUserId":"9058","LastActivityDate":"2016-09-01T21:34:34.007","CommentCount":"2"},{"Id":"2865","PostTypeId":"2","ParentId":"2691","CreationDate":"2016-09-01T22:31:21.143","Score":"1","Body":"<p>I guess the best thing to do is comment to the OP. Explain you'd like to make a substantial edit to make this a general question so we can point lots of people to this issue and get the best answers collected under this one post.</p>\n\n<p>They can say yes - now we have a willing participant in editing. The chance of an edit war or second thoughts is low. If they don't answer - we'll know in a week they might not care or even notice if it's edited.</p>\n\n<p>If they say no - we can then ask the question we wanted to have as a canonical candidate and move on - possibly voting to close the \"original\" if the canonical post has better answers.</p>\n","OwnerUserId":"5472","LastActivityDate":"2016-09-01T22:31:21.143","CommentCount":"0"},{"Id":"2868","PostTypeId":"1","CreationDate":"2016-09-06T13:34:37.890","Score":"1","ViewCount":"21","Body":"<p>What are the proper ways to reference Finder and Terminal?</p>\n\n<ul>\n<li><p>Is it \"Finder\" or \"the Finder?\"<br>\n<em>Start by looking in Finder.</em> <strong>OR</strong> <em>Start by looking in <strong>the</strong> Finder.</em>  </p></li>\n<li><p>Is it \"Terminal\" or \"the Terminal?\"<br>\n<em>Open Terminal and type the following.</em> <strong>OR</strong> <em>Open <strong>the</strong> Terminal and type the following.</em></p></li>\n</ul>\n\n<p>I see these used interchangeably. Is there a \"correct\" way to referencing them?</p>\n","OwnerUserId":"181868","LastActivityDate":"2016-09-06T14:41:43.357","Title":"Finder and Terminal Term Usage","Tags":"<discussion><finder><terminal>","AnswerCount":"1","CommentCount":"0"},{"Id":"2869","PostTypeId":"2","ParentId":"2868","CreationDate":"2016-09-06T14:41:43.357","Score":"2","Body":"<p>I'm a big proponent of saying command line when you mean to get a shell running. Terminal app is just one app used to get to the command line, so I strongly prefer tagging those questions with <a href=\"https://apple.stackexchange.com/questions/tagged/command-line\" class=\"post-tag\" title=\"show questions tagged &#39;command-line&#39;\" rel=\"tag\">command-line</a> as opposed to <a href=\"https://apple.stackexchange.com/questions/tagged/terminal\" class=\"post-tag\" title=\"show questions tagged &#39;terminal&#39;\" rel=\"tag\">terminal</a> on this site. I believe this is a little different than Apple's usage since when they tell people to use the command line, they are supporting their tool as opposed to having people need to connect Terminal with being asked to do something on the command line. (or bash / zsh / fish / whatever shell you prefer).</p>\n\n<p>For Apple's usage I look for the latest Apple Publication Style Guide - the latest I know of is:</p>\n\n<ul>\n<li><a href=\"https://help.apple.com/asg/mac/2013/ASG_2013.pdf\" rel=\"nofollow noreferrer\">https://help.apple.com/asg/mac/2013/ASG_2013.pdf</a></li>\n</ul>\n\n<p>Apple prefers:</p>\n\n<blockquote>\n  <p><strong>Finder</strong> Use <em>the</em> with <em>Finder</em> (exception to the rule to not use <em>the</em> with application names).</p>\n</blockquote>\n\n<p>So you would open the Finder or interact with a Finder window. You wouldn't open Finder if you wanted to adhere to the published style guide.</p>\n\n<blockquote>\n  <p><strong>terminal</strong> A device or software for sending commands to a computer. Capitalize when referring to the Terminal application.</p>\n</blockquote>\n","OwnerUserId":"5472","LastActivityDate":"2016-09-06T14:41:43.357","CommentCount":"0"},{"Id":"2870","PostTypeId":"1","CreationDate":"2016-09-06T20:06:46.647","Score":"0","ViewCount":"76","Body":"<p>I flagged <a href=\"https://apple.stackexchange.com/questions/251737/ios-app-that-delivers-push-notifications-for-twitter-hanshtags\">this question</a> and commented that it would be better suited for the <a href=\"https://softwarerecs.stackexchange.com/\">SR</a> site, instead.  </p>\n\n<p>@patrix, and probably others, agreed and put the question on hold.  I was reading the 'hold' wording and realized it didn't mention the SR site at all:</p>\n\n<blockquote>\n  <p>\"Basic Customer Support or <strong>questions asking to recommend or find off-site resources (Mac/book/software/tutorial)</strong> are off-topic for Ask Different as they tend to attract opinionated answers and spam. Instead, edit to clearly describe your problem and the research done so far to solve it.\"</p>\n</blockquote>\n\n<p><em>Emphasis added by me.</em></p>\n\n<p>I didn't know the SR existed until a few weeks ago so I'm sure many others don't realize it, either.  An OP who reads this wouldn't realize there's an entire site dedicated to seeking recommendations; instead, they're directed to edit they're question to describe the problem they're having.  Maybe they don't have a problem and just want a recommendation?</p>\n\n<p>Should the wording of this message be changed to direct the OP to either edit they're question, as it currently says, or ask the question on the SR site?</p>\n","OwnerUserId":"88313","LastActivityDate":"2016-09-13T18:34:05.010","Title":"Rephrase 'Basic Customer Support' off-topic wording","Tags":"<discussion><support><software-recommendation>","AnswerCount":"3","CommentCount":"0"},{"Id":"2871","PostTypeId":"2","ParentId":"2870","CreationDate":"2016-09-08T07:33:15.690","Score":"1","Body":"<p>Given that we also have <a href=\"https://apple.meta.stackexchange.com/questions/2180/how-should-i-ask-about-getting-a-software-recommendation\">How should I ask about getting a software recommendation?</a> (which implies that asking about software recommendation can be on-topic if done properly) the close reason definitively might need need some work here. The goal should be to put questions on hold which basically say \"I need a tool to do xyz\" (see also <a href=\"https://apple.meta.stackexchange.com/questions/2426/adding-a-close-reason-to-explain-why-recommendations-hardware-book-are-off-to?rq=1\">Adding a close reason to explain why recommendations (hardware, book) are Off Topic</a>) and point the asker to a page with advice on how to improve the question.</p>\n\n<p>Any ideas on how this could be written better? Please post as an answer here.</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-09-08T07:33:15.690","CommentCount":"0"},{"Id":"2872","PostTypeId":"2","ParentId":"2870","CreationDate":"2016-09-08T16:22:44.673","Score":"0","Body":"<p>I'm in favor of keeping as simple and as close to the current wording as possible.</p>\n\n<blockquote>\n  <p>\"Basic Customer Support or questions asking to recommend or find off-site resources (Mac/book/software/tutorial) are off-topic for Ask Different as they tend to attract opinionated answers and spam. <a href=\"https://softwarerecs.stackexchange.com/\">Software</a>/<a href=\"https://hardwarerecs.stackexchange.com/\">Hardware</a> recommendations can be asked at their own dedicated sites.  Alternatively, edit to clearly describe your problem and the research done so far to solve it.\"</p>\n</blockquote>\n","OwnerUserId":"88313","LastEditorUserId":"88313","LastEditDate":"2016-09-08T17:16:33.903","LastActivityDate":"2016-09-08T17:16:33.903","CommentCount":"9"},{"Id":"2873","PostTypeId":"2","ParentId":"2870","CreationDate":"2016-09-13T18:34:05.010","Score":"0","Body":"<p>I've added a new answer to keep track of the revisions.  Based on the discussion comments, here's an updated close answer.  I added the last sentence to make sure we're clear in our direction (and avoid frustration on both sides of the question).  </p>\n\n<blockquote>\n  <p>\"Basic Customer Support or questions asking to recommend or find off-site resources (Mac/book/software/tutorial) are off-topic for Ask Different as they tend to attract opinionated answers and spam. Instead, use the <a href=\"https://apple.meta.stackexchange.com/questions/2180/how-should-i-ask-about-getting-a-software-recommendation?noredirect=1&amp;lq=1\">guidelines described here</a> to edit your question, clearly describing the problem you want to solve, the research you've done so far, and what software you've already tried.\"</p>\n</blockquote>\n","OwnerUserId":"88313","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-09-13T18:34:05.010","CommentCount":"3"},{"Id":"2874","PostTypeId":"1","AcceptedAnswerId":"2875","CreationDate":"2016-09-16T22:24:48.990","Score":"4","ViewCount":"34","Body":"<p>It's happened again! Just like <a href=\"https://apple.meta.stackexchange.com/questions/2145/rename-ios8-tag-to-ios-8-and-create-synonym\">last time with iOS 8</a>, can <a href=\"https://apple.stackexchange.com/questions/tagged/ios10\" class=\"post-tag\" title=\"show questions tagged &#39;ios10&#39;\" rel=\"tag\">ios10</a> be renamed to <a href=\"https://apple.stackexchange.com/questions/tagged/ios-10\" class=\"post-tag\" title=\"show questions tagged &#39;ios-10&#39;\" rel=\"tag\">ios-10</a> for consistency with the tags for the other versions of iOS?</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-09-16T23:48:00.097","Title":"Rename [ios10] to [ios-10] for consistency","Tags":"<support><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2875","PostTypeId":"2","ParentId":"2874","CreationDate":"2016-09-16T23:48:00.097","Score":"2","Body":"<p>Yes please and thank you.</p>\n\n<p>I have modified the tags as suggested.</p>\n","OwnerUserId":"5472","LastActivityDate":"2016-09-16T23:48:00.097","CommentCount":"0"},{"Id":"2876","PostTypeId":"1","CreationDate":"2016-09-22T17:14:24.493","Score":"2","ViewCount":"79","Body":"<p>I was looking at the \"score\" at the top of AskDifferent and noticed that the 101 (my score) there looked quite ugly on my Dell u2515h, compared to how it looked looked on most other StackExchange subsites.</p>\n\n<p>This seems to be related to the -webkit-font-smoothing: antialiased; that is being set on the body element. Now I understand that you (might, some like the bolder fonts) want this on retina displays, but it looks just horrible on non retina displays:</p>\n\n<p><a href=\"https://i.stack.imgur.com/hOjWk.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/hOjWk.png\" alt=\"Non Retina antialiased\"></a></p>\n\n<p>With the setting set to the default it looks like:\n<a href=\"https://i.stack.imgur.com/NfMIv.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/NfMIv.png\" alt=\"Non Retina default font rendering\"></a></p>\n\n<p>So perhaps it can be reset to the default behaviour with a @media selector so that it's only active on higher dpi displays? Something like</p>\n\n<pre><code>@media screen\n(-webkit-max-device-pixel-ratio: 1.3), \n(max-resolution: 120dpi) {\n  body { \n    -webkit-font-smoothing: subpixel-antialiased !important;\n  }\n}\n</code></pre>\n","OwnerUserId":"157838","LastActivityDate":"2016-09-22T17:14:24.493","Title":"Do not set -webkit-font-smoothing: antialiased for all displays","Tags":"<feature-request>","AnswerCount":"0","CommentCount":"0"},{"Id":"2877","PostTypeId":"1","CreationDate":"2016-10-03T06:33:24.497","Score":"1","ViewCount":"23","Body":"<p>The <a href=\"https://apple.stackexchange.com/questions/tagged/history\" class=\"post-tag\" title=\"show questions tagged &#39;history&#39;\" rel=\"tag\">history</a> tag is a hodgepodge of all sorts of things but I think it might be better off just deleted if it isn't going to collect <a href=\"https://apple.stackexchange.com/questions/tagged/apple-history\" class=\"post-tag\" title=\"show questions tagged &#39;apple-history&#39;\" rel=\"tag\">apple-history</a> (history of the company, computers, etc.—only found a few of these). Browser history is already covered in <a href=\"https://apple.stackexchange.com/questions/tagged/browser\" class=\"post-tag\" title=\"show questions tagged &#39;browser&#39;\" rel=\"tag\">browser</a>. Logs and bash history are covered in tags related to their apps. </p>\n","OwnerUserId":"21351","LastActivityDate":"2016-10-03T06:33:24.497","Title":"History tag scope","Tags":"<discussion><tags>","AnswerCount":"0","CommentCount":"0"},{"Id":"2878","PostTypeId":"1","CreationDate":"2016-10-11T10:40:19.597","Score":"2","ViewCount":"28","Body":"<p><a href=\"https://i.stack.imgur.com/jaQZB.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/jaQZB.png\" alt=\"enter image description here\"></a></p>\n\n<p>Is this some kind of glitch, or an actual message?<br>\nCan't read it [can't even pronounce cyrillic let alone translate it], can't copy/paste it as the entire message is a link in that drop menu.</p>\n\n<p>Link itself just goes to <a href=\"http://ru.stackoverflow.com\">http://ru.stackoverflow.com</a> not any specific message page.</p>\n\n<p>I'm not signed up to StackOverflow itself, English or Russian so can't really post it to their Meta.</p>\n","OwnerUserId":"85275","LastActivityDate":"2016-10-11T19:56:37.460","Title":"Is this spam? I can't read it","Tags":"<discussion><bug>","AnswerCount":"1","CommentCount":"0"},{"Id":"2879","PostTypeId":"2","ParentId":"2878","CreationDate":"2016-10-11T19:56:37.460","Score":"1","Body":"<p>It's an automated Stack Exchange message asking you to help with Stack Overflow in Russian. These messages are usually sent for events such as a moderator election being held on a site that you have an account on. Receiving a message for a site you don't have an account on seems like a bug, unless this is a special message I'm not aware of.</p>\n\n<p>I seem to recall receiving a similar message about a different site a very long time ago, but perhaps I'm misremembering. Unfortunately these kinds of messages don't appear in the inbox API endpoint, so I can't search my inbox history.</p>\n\n<p>By the way, running the message <a href=\"https://translate.google.co.uk/#ru/en/%D0%A1%D0%BE%D0%BE%D0%B1%D1%89%D0%B5%D0%BD%D0%B8%D0%B5%0AStack%20Overflow%20%D0%BD%D0%B0%20%D1%80%D1%83%D1%81%D1%81%D0%BA%D0%BE%D0%BC%20%D0%BD%D1%83%D0%B6%D0%B4%D0%B0%D0%B5%D1%82%D1%81%D1%8F%20%D0%B2%20%D0%B2%D0%B0%D1%88%D0%B5%D0%B9%20%D0%BF%D0%BE%D0%BC%D0%BE%D1%89%D0%B8!\" rel=\"nofollow\">through Google Translate</a> gives me the following:</p>\n\n<blockquote>\n  <p>Message<br>\n  Stack Overflow in Russian needs your help!</p>\n</blockquote>\n","OwnerUserId":"37797","LastActivityDate":"2016-10-11T19:56:37.460","CommentCount":"1"},{"Id":"2880","PostTypeId":"1","AcceptedAnswerId":"2881","CreationDate":"2016-10-12T15:41:33.357","Score":"2","ViewCount":"21","Body":"<p>I flagged <a href=\"https://apple.stackexchange.com/q/255868/88313\">this question</a> for closure because it's a comment and not a question.  I also left a comment for the OP explaining why I flagged their question.  I understand they can't see the flag but I'm also trying to help them improve their future questions by understanding the reason it was flagged.</p>\n\n<p>A mod let me know that I don't need to leave comments when flagging.  His answer made sense but I can also see it as a teaching experience for the OP.</p>\n\n<p>I then read <a href=\"https://apple.stackexchange.com/q/256949/88313\">this question</a> and saw a mod did the exact same thing I did on the previous question.  </p>\n\n<p>So now I'm a bit confused as to whether or not it's a good practice to leave comments for the OP indicating why their question is being flagged for closure?  Is it just up to the individual mod whether or not to allow/leave these types of comments? If not, is there a Help Center topic that addresses this?</p>\n","OwnerUserId":"88313","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-10-12T16:44:22.470","Title":"Feedback to OP when flagging question","Tags":"<discussion><flagging><close-reasons>","AnswerCount":"1","CommentCount":"0"},{"Id":"2881","PostTypeId":"2","ParentId":"2880","CreationDate":"2016-10-12T16:39:13.297","Score":"2","Body":"<p>Actually no moderator commented on the second question you've linked. The comments have been created automatically based on the actions the reviewers selected for the question in the review queue. </p>\n\n<p>What I intended to explain to you (but maybe didn't do so well) is that there is no need to tell people that a post has been <em>flagged</em>. Comments on how a post can be improved or why a post doesn't fit to the guidelines are welcome. One of the exceptions here are comments recommending people to ask their questions on another SE site, because this may lead to people posting the same question twice (instead of one of the mods <em>moving</em> it to the other site). In such cases just flagging them for mod attention (or proposing a close) is usually the better option</p>\n","OwnerUserId":"9058","LastEditorUserId":"9058","LastEditDate":"2016-10-12T16:44:22.470","LastActivityDate":"2016-10-12T16:44:22.470","CommentCount":"5"},{"Id":"2882","PostTypeId":"1","AcceptedAnswerId":"2883","CreationDate":"2016-10-15T20:28:50.577","Score":"2","ViewCount":"50","Body":"<p>I recently noticed this sentence in the <a href=\"https://apple.stackexchange.com/help/on-topic\">help center</a> under what is <strong>off</strong>-topic:</p>\n\n<blockquote>\n  <p>Installing or using Apple operating systems on non-Apple hardware (and\n  most other explicitly unlicensed use of product)</p>\n</blockquote>\n\n<p>However, I've also noticed this <a href=\"https://apple.meta.stackexchange.com/questions/2/can-one-ask-hackintosh-questions-on-ask-different\">meta thread</a> showing an overwhelming consensus that such questions should be <strong>on</strong>-topic.</p>\n\n<p>Admittedly this is quite an old thread. Is there some newer thread that has passed me by? Or has there been some directive from our SE overlords regarding such policies?</p>\n\n<p>Here's <a href=\"https://apple.meta.stackexchange.com/questions/1722/should-the-help-page-remove-the-prohibition-on-hackintosh\">another thread</a> showing a consensus for that clause to be removed from the help center. So, why hasn't it been done?</p>\n\n<p>Why does the help-center exclude this when the community consensus seems to be for including it?</p>\n","OwnerUserId":"153510","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-10-23T13:45:52.103","Title":"Discrepancy between help-center and community consensus?","Tags":"<discussion><site-scope>","AnswerCount":"3","CommentCount":"0"},{"Id":"2883","PostTypeId":"2","ParentId":"2882","CreationDate":"2016-10-15T20:34:46.163","Score":"3","Body":"<p>There's no directive - we are free to form consensus and self-edit the FAQ.</p>\n\n<p>I was very against closing hacintosh questions when I started in the Ask Different community (and started here as opposed to another site then coming here). The guidelines aren't 100% followed and there is always wiggle room to raise a specific closure or non-closure on meta.</p>\n\n<p>The post you mentioned is one of many and I must say - the vast majority of questions closed under \"hacintosh\" would also be closed as too broad, unclear, </p>\n\n<p>I would say - what we need is some few people to champion these types of questions - clean up any marginal ones. Ask and answer detailed ones. If there is a steady set of useful, detailed, well received posts - that would make it easy to post to meta a request to relax the wording of the FAQ.</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/1722/should-the-help-page-remove-the-prohibition-on-hackintosh\">Should the help page remove the prohibition on hackintosh?</a> (or maybe just a lot more votes on the answer saying yes)</li>\n</ul>\n\n<p>Here in late 2016 - my personal feeling is that we aren't closing useful questions due to that part of the site scope, but I'd be happy to revisit my opinion by looking at specific counter examples to the generalization I made above about questions relating to loading / troubleshooting OS X on non apple hardware being low quality in general.</p>\n\n<p>If someone were to lead with some awesome questions - I'd support reopening them to see how they are received. Please raise a meta question if you spot this close reason being used for something you feel is a good question in all other respects. I'll be glad to help guide these posts or facilitate discussions between people closing since it's \"in the rules\" as opposes to closing since it's not useful.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-10-15T21:39:49.413","CommentCount":"3"},{"Id":"2884","PostTypeId":"2","ParentId":"2882","CreationDate":"2016-10-18T20:06:37.863","Score":"-1","Body":"<p>I tend to agree with <a href=\"https://apple.meta.stackexchange.com/a/1747/88313\">this answer</a> by @daviesgeek and <a href=\"https://apple.meta.stackexchange.com/a/1743/88313\">this answer</a> by @jaume (minus the legality argument).  Both make, what I consider, valid points about the types of questions that will be asked if hackintosh questions are allowed. </p>\n\n<p>At a very simplistic level, I see this as breaking down to 2 main points: </p>\n\n<ol>\n<li>Almost every hackintosh question will be very specific and very unique to the individual questioner.  </li>\n<li>It will ultimately devolve into \"will this configuration work...?\" or \"how do I build...?\" questions and there are already good sites for that.<br><br>\n<strong>EDIT</strong> (10/23/16): In support of my point above, <a href=\"https://apple.stackexchange.com/q/258375/88313\">here's a perfect example</a> of the types of questions that, I believe, we'll be flooded with if the prohibition is lifted.</li>\n</ol>\n\n<p>The first sentence of <a href=\"https://apple.stackexchange.com/help/on-topic\">What topics can I ask here?</a> really boils down why this SE site exists: \"Ask Different is for users of Apple products.\"  A hackintosh is not an Apple product (before you argue with me on the semantics of \"what is an Apple product?\", the most basic answer is \"products made by Apple\").</p>\n\n<p>Right now, I really like this site because every question &amp; answer I see can apply to hundreds or thousands of other people.  They can have the same hardware/software/version and the application of the answer(s) have broad appeal.  Once we start accepting very limited, almost singularly-focused, questions, we lose the broad-base.  Sure, it will help the person asking the question but the odds are very high that it will <em>only</em> help that person and none other.  If that's where we, the community, and SE, the owners, want to focus our efforts then that's ok; we just need to be aware of the potential downside to doing that.</p>\n\n<p>Regarding my point #2, almost every hackintosh question I've seen in my time here has had some part of this mix-and-match type of question.  There could be 1, 10, or a 100 reasons why the OPs particular mix of parts will not work and that could lead us down the a road for days before we realize that where we are has nothing to do with the lone Apple OS they're using.  Once again, while it might help that one OP that one time, it's probably not going to help others at any time (I said 'probably' so please don't accuse me of saying 'never').  </p>\n\n<p>I think where the mods and community are now has taken is a very good place and it helps more people in its current state that it will if changed for this, specific reason.</p>\n","OwnerUserId":"88313","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-10-23T13:45:52.103","CommentCount":"1"},{"Id":"2885","PostTypeId":"2","ParentId":"2882","CreationDate":"2016-10-19T15:12:40.940","Score":"-1","Body":"<p>Currently the wording in the help center says</p>\n\n<blockquote>\n  <p>Installing or using Apple operating systems on non-Apple hardware</p>\n</blockquote>\n\n<p>which may be too strict for a lot of situations.</p>\n\n<ul>\n<li><em>Installing</em> macOS on non-Apple hardware is usually a rather challenging endeavour which requires the right combination of hardware components etc. There are some sites dedicated to these kind of challenges, and the community there is much better suited to help people than AD users can ever be</li>\n<li><em>Using</em> macOS on non-Apple hardware on the other hand isn't too different from using it on Apple hardware. Yes, there may be some kind of situations where the problem may come from such a setup, but most of the problems (especially on user level) are the same. Right now we don't even know whether question comes from a hackintosh background because such questions get shut down rather fast. Wouldn't it be better to allow such kind of questions and expect users to indicate (without penalty) if they are running a hackintosh?</li>\n</ul>\n\n<p>So I would propose to <em>change</em> the wording in the help center to</p>\n\n<blockquote>\n  <p>Installing Apple operating systems on non-Apple hardware</p>\n</blockquote>\n\n<p>and add a section stating that other hackintosh-related questions are ok but must be tagged accordingly.</p>\n","OwnerUserId":"9058","LastActivityDate":"2016-10-19T15:12:40.940","CommentCount":"0"},{"Id":"2887","PostTypeId":"2","ParentId":"2812","CreationDate":"2016-10-20T07:05:32.757","Score":"4","Body":"<p>                                                             <a href=\"https://apple.stackexchange.com/questions/tagged/osx\" class=\"post-tag\" title=\"show questions tagged &#39;osx&#39;\" rel=\"tag\">osx</a> → <a href=\"https://apple.stackexchange.com/questions/tagged/macos\" class=\"post-tag\" title=\"show questions tagged &#39;macos&#39;\" rel=\"tag\">macos</a> ✔︎</p>\n\n<p>Just like that, all 16.5k <a href=\"https://apple.stackexchange.com/questions/tagged/osx\" class=\"post-tag\" title=\"show questions tagged &#39;osx&#39;\" rel=\"tag\">osx</a> questions are now <a href=\"https://apple.stackexchange.com/questions/tagged/macos\" class=\"post-tag\" title=\"show questions tagged &#39;macos&#39;\" rel=\"tag\">macos</a> questions! With what I presume was a chat between moderators outside of this meta question, bmike has reversed the synonym, such that <a href=\"https://apple.stackexchange.com/questions/tagged/osx\" class=\"post-tag\" title=\"show questions tagged &#39;osx&#39;\" rel=\"tag\">osx</a> → <a href=\"https://apple.stackexchange.com/questions/tagged/macos\" class=\"post-tag\" title=\"show questions tagged &#39;macos&#39;\" rel=\"tag\">macos</a>. <a href=\"https://apple.stackexchange.com/help/badges/188/macos?userid=37797\">Enjoy the shiny new badges!</a></p>\n\n<p>Also, since this change occurred quite suddenly, it seems like no-one thought about the tag wiki and of course it's now disappeared. I've updated the tag wiki of <a href=\"https://apple.stackexchange.com/questions/tagged/macos\" class=\"post-tag\" title=\"show questions tagged &#39;macos&#39;\" rel=\"tag\">macos</a> based on the prior tag wiki.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-10-20T12:19:35.547","CommentCount":"1"},{"Id":"2888","PostTypeId":"1","AcceptedAnswerId":"2974","CreationDate":"2016-10-21T07:36:22.040","Score":"2","ViewCount":"41","Body":"<p>The message that appears when hovering the tag badge on a dupehammer close is not styled correctly:</p>\n\n<ul>\n<li>missing the correct font</li>\n<li>not being restrained to a standard width</li>\n<li>not being positioned appropriately for the tag badge, causing flashing when moving the mouse over the overlap</li>\n</ul>\n\n<p><a href=\"https://i.stack.imgur.com/xr1YW.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/xr1YW.png\" alt=\"\"></a></p>\n\n<p>Can this be rectified?</p>\n\n<p><sup>macOS Sierra 10.12<br>\nSafari Version 10.0 (12602.1.50.0.10) or Safari Technology Preview Release 13 (Safari 10.0, WebKit 12603.1.5)</sup></p>\n","OwnerUserId":"37797","LastActivityDate":"2017-02-13T22:22:49.690","Title":"Dupehammer message is not styled correctly","Tags":"<bug><design><dupehammer>","AnswerCount":"1","CommentCount":"1"},{"Id":"2889","PostTypeId":"1","CreationDate":"2016-10-21T09:43:04.040","Score":"2","ViewCount":"69","Body":"<p>Re: BMike's question - <a href=\"https://apple.meta.stackexchange.com/questions/2418/where-is-the-list-of-canonical-questions-stored-for-ask-different\">Where is the list of canonical questions stored for Ask Different?</a></p>\n\n<p>It would seem reasonable that such questions could get their own tag type.</p>\n\n<p>Trying to find them when closing as a dupe is not all that simple. Even when you know the keywords for the dupe search field - for example, I just tested \"bypass activation lock\" &amp; it turned up 9th in the list. If you're less certain of the title it involves digging through meta to find BMike's QA first.</p>\n\n<p>I even tried \"[ios] bypass\"... but it's not tagged iOS, it's iPhone.</p>\n\n<p>If we had a [canonical] or [faq] tag type, it would make things a lot simpler, imo.  </p>\n\n<p>Opinions?</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-10-21T18:35:39.367","Title":"New tag proposal - Canonical or FAQ","Tags":"<discussion><feature-request><canonical-questions>","AnswerCount":"3","CommentCount":"7"},{"Id":"2890","PostTypeId":"2","ParentId":"2889","CreationDate":"2016-10-21T17:32:24.167","Score":"5","Body":"<h1>YES</h1>\n\n<p>Upvote this answer if you support the idea of creating a <code>canonical</code> flag on the main site to identify canonical questions.</p>\n","OwnerUserId":"9058","LastActivityDate":"2016-10-21T17:32:24.167","CommentCount":"3"},{"Id":"2891","PostTypeId":"2","ParentId":"2889","CreationDate":"2016-10-21T17:34:27.917","Score":"1","Body":"<h1>NO</h1>\n\n<p>Upvote this answer if you are against creating a <code>canonical</code> flag on the main site.</p>\n","OwnerUserId":"9058","LastActivityDate":"2016-10-21T17:34:27.917","CommentCount":"0"},{"Id":"2892","PostTypeId":"2","ParentId":"2889","CreationDate":"2016-10-21T18:29:35.650","Score":"1","Body":"<p><strong>Absolutely no.</strong></p>\n\n<p>This proposal is literally opposing the purpose of tagging: categorising the content of questions. Tags should be about the question content, as defined in the first line of the relevant section of the help center. Meta-tags are also specifically mentioned as later on in the article.</p>\n\n<blockquote>\n  <p>A tag is a word or phrase that describes the topic of the question.</p>\n</blockquote>\n\n\n\n<blockquote>\n  <p><strong>Avoid meta-tags</strong><br>\n  Do not use meta-tags in questions. Here are some tips to help you determine whether a tag is a meta-tag:<br>\n  …</p>\n</blockquote>\n\n<p><a href=\"https://apple.stackexchange.com/help/tagging\">https://apple.stackexchange.com/help/tagging</a></p>\n\n<p>Your proposed tag <a href=\"https://apple.stackexchange.com/questions/tagged/canonical\" class=\"post-tag\" title=\"show questions tagged &#39;canonical&#39;\" rel=\"tag\">canonical</a> says nothing about the content of the question. Meta-tagging has been prohibited from Stack Exchange sites for many years now.</p>\n\n<blockquote>\n  <p><strong>meta-tagging is explicitly discouraged</strong></p>\n</blockquote>\n\n\n\n<blockquote>\n  <p>If the tag can't work as the only tag on a question, it's probably a meta-tag.</p>\n</blockquote>\n\n<p><a href=\"https://blog.stackoverflow.com/2010/08/the-death-of-meta-tags/\">https://blog.stackoverflow.com/2010/08/the-death-of-meta-tags/</a></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-10-21T18:35:39.367","CommentCount":"8"},{"Id":"2893","PostTypeId":"1","CreationDate":"2016-10-24T19:51:44.747","Score":"3","ViewCount":"30","Body":"<p>So, the MacPro6,1 doesn't seem to have a tag it belongs to — the <a href=\"https://apple.stackexchange.com/tags/mac-pro/info\">tag wiki for <code>mac-pro</code></a> mentions, by date, all of the models <em>except</em> the new, completely-revised, 2013 model (and with good reason. It's basically an entirely new product line, to be honest. Not a tower, not customizable, no disc drive, no rackmount possibilities … etc etc etc.); which implies to me that it's speaking of the “old form-factor” Mac Pros.</p>\n\n<p>Should we create a new tag for <code>mac-pro-2013</code>, or possibly rename the current one to <code>mac-pro-tower</code> or something like that? If not, the tag-wiki should be updated to make it clear that it also applies to the 2013+ Mac Pro models.</p>\n","OwnerUserId":"15184","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-12-02T19:18:50.217","Title":"Tagging the 2013 MacPro6,1","Tags":"<discussion><tags>","AnswerCount":"2","CommentCount":"0"},{"Id":"2894","PostTypeId":"2","ParentId":"2893","CreationDate":"2016-10-25T12:03:51.697","Score":"2","Body":"<p>The tag wiki is also missing the June 2012 Mac Pro. In my opinion, it's just an outdated tag wiki and <a href=\"https://apple.stackexchange.com/questions/tagged/mac-pro\" class=\"post-tag\" title=\"show questions tagged &#39;mac-pro&#39;\" rel=\"tag\">mac-pro</a> should be used for every Mac Pro including the June 2012 and 2013 models not mentioned on the tag wiki.</p>\n\n<p>I don't think a separate tag is really necessary to distinguish between the legacy Mac Pro models and the current design, but I'm also not against the idea. However, I would prefer tagging questions regarding the legacy design with a renamed tag such as <a href=\"https://apple.stackexchange.com/questions/tagged/mac-pro-legacy\" class=\"post-tag\" title=\"show questions tagged &#39;mac-pro-legacy&#39;\" rel=\"tag\">mac-pro-legacy</a> and the current Mac Pro being tagged with <a href=\"https://apple.stackexchange.com/questions/tagged/mac-pro\" class=\"post-tag\" title=\"show questions tagged &#39;mac-pro&#39;\" rel=\"tag\">mac-pro</a>, since I don't think we should be using anything but the product title for current products.</p>\n\n<p>Side note: Hardware tags are misused as it is — briefly checking the first couple of <a href=\"https://apple.stackexchange.com/questions/tagged/mac-pro\" class=\"post-tag\" title=\"show questions tagged &#39;mac-pro&#39;\" rel=\"tag\">mac-pro</a> questions yields things such as \"How to make Siri available when I open my MacBook?<br>\n<a href=\"https://apple.stackexchange.com/questions/tagged/macbook\" class=\"post-tag\" title=\"show questions tagged &#39;macbook&#39;\" rel=\"tag\">macbook</a><a href=\"https://apple.stackexchange.com/questions/tagged/mac\" class=\"post-tag\" title=\"show questions tagged &#39;mac&#39;\" rel=\"tag\">mac</a><a href=\"https://apple.stackexchange.com/questions/tagged/sierra\" class=\"post-tag\" title=\"show questions tagged &#39;sierra&#39;\" rel=\"tag\">sierra</a><a href=\"https://apple.stackexchange.com/questions/tagged/mac-pro\" class=\"post-tag\" title=\"show questions tagged &#39;mac-pro&#39;\" rel=\"tag\">mac-pro</a><a href=\"https://apple.stackexchange.com/questions/tagged/siri\" class=\"post-tag\" title=\"show questions tagged &#39;siri&#39;\" rel=\"tag\">siri</a>\", where all the hardware tags are inappropriate.</p>\n","OwnerUserId":"37797","LastActivityDate":"2016-10-25T12:03:51.697","CommentCount":"2"},{"Id":"2895","PostTypeId":"2","ParentId":"1722","CreationDate":"2016-11-03T22:31:04.643","Score":"-2","Body":"<p>I personally think that since this is not legal in the sense that apple does not condone nor support this behavior, I'd say delete <em>all</em> questions from the site having to do with the hackentosh.</p>\n","OwnerUserId":"157165","LastActivityDate":"2016-11-03T22:31:04.643","CommentCount":"3"},{"Id":"2896","PostTypeId":"2","ParentId":"2153","CreationDate":"2016-11-13T13:00:58.047","Score":"1","Body":"<p>I think this one has now answered itself. </p>\n\n<p>With some simple tweaks to the original post &amp; a massively comprehensive set of answers (&amp; protected to stop the 'me too' contributors;-), this has become the <em>go-to</em> dupe over the past year.</p>\n\n<p>I've actually just tweaked the question body itself to genericise it still further - iOS 7 is long-gone now, for most people.</p>\n","OwnerUserId":"85275","LastActivityDate":"2016-11-13T13:00:58.047","CommentCount":"0"},{"Id":"2897","PostTypeId":"1","CreationDate":"2016-11-21T18:01:42.787","Score":"7","ViewCount":"150","Body":"<p>These questions get rather tiresome after a while...</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/261859/is-it-possible-to-connect-the-new-dell-31-5-inch-monitor-up3216q-at-3840x2160\">Is it possible to connect the new DELL 31.5-inch monitor (UP3216Q) at 3840x2160 to the new macbook pro (late 2016)?</a></p>\n\n<p>The chances of someone else on Ask Different having exactly the same setup with a brand new Mac &amp; monitor are so remote as to be infinitesimal.  </p>\n\n<p>EveryMac, the usual go-to for these questions, doesn't cover every single possible plug &amp; socket on every possible Mac/monitor configuration. It just gives maximum resolutions.</p>\n\n<p>We're left with, <em>\"Why don't you ask Dell?\"</em></p>\n\n<p>I'm tempted to start closing them as Basic Customer Support.</p>\n\n<p>Any opinions either way?</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-12-06T12:33:17.067","Title":"Why don't you ask Dell?","Tags":"<discussion>","AnswerCount":"2","CommentCount":"5"},{"Id":"2898","PostTypeId":"2","ParentId":"2897","CreationDate":"2016-11-30T18:58:51.790","Score":"-2","Body":"<p>Next time, just link to the dell support website for that monitor ;-)</p>\n","OwnerUserId":"210769","LastActivityDate":"2016-11-30T18:58:51.790","CommentCount":"0"},{"Id":"2899","PostTypeId":"1","AcceptedAnswerId":"2901","CreationDate":"2016-12-01T12:41:49.083","Score":"13","ViewCount":"247","Body":"<p>Each December, the developers run a game / enhancement / treasure hunt that involves hats on avatars.</p>\n\n<ul>\n<li><a href=\"http://winterbash2016.stackexchange.com\" rel=\"nofollow noreferrer\">http://winterbash2016.stackexchange.com</a></li>\n</ul>\n\n<p>The event will run from 19 December 2016 up to and including 08 January 2017. The above site will also have a landing page, explaining the rules and other details of the event. </p>\n\n<p>Individual users who don’t want to participate, don’t want to see hats, and/or are generally anti-hat will have an “I hate hats” option available. And just like last time, at the end of the event, all hats will go back into storage. </p>\n\n<p>The only visual change to the Stack Exchange sites themselves will be the presence of the hats and the “I hate hats” button in the footer.</p>\n\n<p>If anyone has a reason why we should hate hats as a site as opposed to individuals, an answer here is a great place to make that case.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2016-12-17T17:10:03.260","LastActivityDate":"2016-12-19T23:37:32.693","Title":"Should the site opt out of Winter Bash 2016?","Tags":"<discussion>","AnswerCount":"3","CommentCount":"6"},{"Id":"2900","PostTypeId":"2","ParentId":"2897","CreationDate":"2016-12-01T12:49:43.897","Score":"4","Body":"<p>Unless the asker is engaged in a pattern of themselves asking many questions like that - it's best to take the high road and judge that post purely based on that one post and not in relation to many previous posts by other people.</p>\n\n<ul>\n<li>Why don't you ask Apple</li>\n<li>Why don't you ask Dell</li>\n<li>Why don't you ...</li>\n</ul>\n\n<p>All three of the above could be used to shut down just about any question here so I try to dismiss that thought and instead focus on if a question meets the quality standards of the site in general and in specific.</p>\n\n<p>I personally wouldn't down vote <a href=\"https://apple.stackexchange.com/questions/261859/is-it-possible-to-connect-the-new-dell-31-5-inch-monitor-up3216q-at-3840x2160\">your example question it if it had one clear question</a> <em>(n.b. the initial version didn't have one clear question)</em>. Furthermore, if that initial version were closed as basic customer support and the OP edited it to have just one question instead of three - I'd be inclined to cast a binding reopen vote. <em>(which may have come to pass since the original version)</em></p>\n\n<p>In this case - it's really a candidate for closing since it asks three questions. Two of which are bad but not forbidden. (the two bad questions are the yes/no questions on anyone trying it and the basic will it work).</p>\n\n<p>There's a nugget of a good question, so rather than close it now - I'll edit it to surface what I see is it's best form. A question on how to read specs and determine compatibility.</p>\n\n<p>Note - not everyone needs to save a marginal question. It's fine to down vote and forget it. It's fine to leave a comment asking the OP to edit down to one question. It's fine to vote as basic CS to vote as too broad or vote as unclear and move on.</p>\n\n<p>Only moderators or people that cast a single binding close vote should analyze things as deeply as we are here splitting the needle. It's not a great question, but if we can be a little too generous or too kind on one off or first questions - that's not a bad thing.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-12-06T12:33:17.067","CommentCount":"0"},{"Id":"2901","PostTypeId":"2","ParentId":"2899","CreationDate":"2016-12-01T22:22:42.423","Score":"42","Body":"<p>Hats are the best and we want hats.</p>\n\n<p>A vote for this answer is a vote for no.</p>\n","OwnerUserId":"292","LastEditorUserId":"5472","LastEditDate":"2016-12-19T23:37:32.693","LastActivityDate":"2016-12-19T23:37:32.693","CommentCount":"2"},{"Id":"2902","PostTypeId":"2","ParentId":"2893","CreationDate":"2016-12-02T19:18:50.217","Score":"1","Body":"<p>I'm the opinion that we should aggressively flatten all tags for hardware. But I'm open to an explanation of how in practice it works well on another site. Or an example where it works well here.</p>\n\n<p>The example I have is MacBook and MacBook Pro and Air and such. Do you tag the generation or the size of the screen or the CPU or if it has SSD or HDD when that was a thing? It ends up taking two to three tags for the precise questions when you can usually search the MacBook tag and then the term for what you really want.</p>\n\n<p>Thinking more deeply, people really don't often want to ask about a MacBook pro itself - it's almost always going to be about upgrade or port or what not and then we could be tagging on the specific item in question for the best locality if you're looking for a narrow tag to follow or search.</p>\n\n<p>The side effect of general tags is that the wikis require less maintenance if they merit a tag wiki or summary at all. The wikis should be about how to use the tag and duplicating usage for MacPro across all the models Apple has and will release seems like a lot of duplication of work for little payoff.</p>\n\n<p>Good question though +1 for raising the discussion. I can see it might not be an easy one to pick an answer for many. Even though I lean one way - I'm open to new inputs or opinions on this topic specifically and generally.</p>\n","OwnerUserId":"5472","LastActivityDate":"2016-12-02T19:18:50.217","CommentCount":"0"},{"Id":"2903","PostTypeId":"2","ParentId":"609","CreationDate":"2016-12-05T20:50:22.373","Score":"12","Body":"<p>Now it is neither! As of June 13, 2016, the name has been changed to macOS <a href=\"https://www.apple.com/macos/sierra/\" rel=\"nofollow noreferrer\">https://www.apple.com/macos/sierra/</a></p>\n\n<p><a href=\"https://i.stack.imgur.com/yvS4g.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/yvS4g.png\" alt=\"enter image description here\"></a></p>\n\n<blockquote>\n  <p>During the keynote at WWDC on June 13, 2016, Apple announced that OS X would be renamed macOS to stylistically match Apple's other operating systems, such as iOS, watchOS, and tvOS.</p>\n</blockquote>\n","OwnerUserId":"123918","LastEditorUserId":"123918","LastEditDate":"2016-12-22T01:14:12.707","LastActivityDate":"2016-12-22T01:14:12.707","CommentCount":"2"},{"Id":"2906","PostTypeId":"2","ParentId":"2899","CreationDate":"2016-12-06T04:37:48.483","Score":"11","Body":"<p>Why should we opt out Winter Bash? Its always a fun game. Even developers need a little fun some times.</p>\n\n<p>I Love Hats.</p>\n","OwnerUserId":"143535","LastActivityDate":"2016-12-06T04:37:48.483","CommentCount":"1"},{"Id":"2907","PostTypeId":"1","CreationDate":"2016-12-08T23:21:16.570","Score":"2","ViewCount":"38","Body":"<p>In the <a href=\"https://apple.stackexchange.com/help/on-topic\">What topics can I ask about here?</a> page it clearly states that:</p>\n\n<blockquote>\n  <p>Ask Different is for <strong>users of Apple products</strong>. If you have a\n  question about ...</p>\n  \n  <ul>\n  <li>Apple hardware</li>\n  <li>Apple software</li>\n  <li>Apple services including iTunes Connect (selling music, books, apps)</li>\n  <li>third-party hardware, services and software when associated for use with Apple products.</li>\n  </ul>\n  \n  <p>... then you're in the right place to ask your question!</p>\n</blockquote>\n\n<p>Recently <a href=\"https://apple.stackexchange.com/users/5472/bmike\">bmike</a> corrected me because I had assumed a question about a formula in Excel was off-topic. I accepted his correction (obviously, as a moderator with the highest reputation I wasn't going to think he was wrong!), but since then I've seen a number of instances where users have voted to close questions as off-topic because the questions were about third-party software.</p>\n\n<p>This got me to thinking that perhaps the <a href=\"https://apple.stackexchange.com/help/on-topic\">What topics can I ask about here?</a> page could do with some minor revision. It may be something as simple as a formatting change to bold the words \"third-party hardware, services and software\" in the last bullet point.</p>\n\n<p>What do others think?</p>\n","OwnerUserId":"168832","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-12-09T10:01:52.050","Title":"Is a revision required to the \"What topics can I ask about here?\" page in the Help Center?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"2","FavoriteCount":"0"},{"Id":"2908","PostTypeId":"1","CreationDate":"2016-12-09T05:08:15.010","Score":"3","ViewCount":"20","Body":"<p>I'm using Firefox 50.0.2 and noticed the layout in my profile on this site is broken. Something is wrapping or overflowing unexpectedly and it's throwing the whole section off:</p>\n\n<p><a href=\"https://i.stack.imgur.com/FgMGj.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/FgMGj.png\" alt=\"screenshot\"></a></p>\n","OwnerUserId":"3994","LastActivityDate":"2016-12-09T05:08:15.010","Title":"Markup or styling broken on profile page","Tags":"<bug><design>","AnswerCount":"0","CommentCount":"1"},{"Id":"2909","PostTypeId":"2","ParentId":"2907","CreationDate":"2016-12-09T09:49:06.407","Score":"1","Body":"<p>Well, somebody using Excel on macOS <strong>is</strong> a user of an Apple product, and the bullet list makes it rather clear what a question can be about. I partially understand your confusion, but IMHO the wording is rather clear.</p>\n","OwnerUserId":"9058","LastActivityDate":"2016-12-09T09:49:06.407","CommentCount":"2"},{"Id":"2910","PostTypeId":"2","ParentId":"2899","CreationDate":"2016-12-10T11:38:56.223","Score":"-4","Body":"<p>Just for some balance on the voting [&amp; not a reflection of my personal opinion] let's see how much activity this one can generate.  </p>\n\n<p>I don't mind down-votes.</p>\n\n<h1>We do not want hats. Please opt-out.</h1>\n","OwnerUserId":"85275","LastActivityDate":"2016-12-10T11:38:56.223","CommentCount":"5"},{"Id":"2911","PostTypeId":"1","AcceptedAnswerId":"2912","CreationDate":"2016-12-14T21:44:48.650","Score":"3","ViewCount":"28","Body":"<p><a href=\"https://www.libreoffice.org\" rel=\"nofollow noreferrer\">LibreOffice</a> is one word, however the tag <a href=\"https://apple.stackexchange.com/questions/tagged/libre-office\" class=\"post-tag\" title=\"show questions tagged &#39;libre-office&#39;\" rel=\"tag\">libre-office</a> is hyphenated.<br>\nCan the tag be renamed <a href=\"https://apple.stackexchange.com/questions/tagged/libreoffice\" class=\"post-tag\" title=\"show questions tagged &#39;libreoffice&#39;\" rel=\"tag\">libreoffice</a> to reflect the correct word?</p>\n","OwnerUserId":"37797","LastActivityDate":"2016-12-14T21:54:50.903","Title":"Rename [libre-office] to [libreoffice]","Tags":"<support><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2912","PostTypeId":"2","ParentId":"2911","CreationDate":"2016-12-14T21:54:50.903","Score":"3","Body":"<p>Done. Thanks for pointing this out.</p>\n","OwnerUserId":"5472","LastActivityDate":"2016-12-14T21:54:50.903","CommentCount":"0"},{"Id":"2913","PostTypeId":"1","CreationDate":"2016-12-20T13:11:32.133","Score":"10","ViewCount":"87","Body":"<p>Since everyone here plays a part in moderation, I wanted to feature one post on how to ask about software recommendations from meta:</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/2180/how-should-i-ask-about-getting-a-software-recommendation\">How should I ask about getting a software recommendation?</a></li>\n</ul>\n\n<p>Since we don't have a blog, I made a \"community event\" so that there's a note in the side bar for a while.</p>\n\n<p><a href=\"https://i.stack.imgur.com/Mn8RI.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/Mn8RI.png\" alt=\"It&#39;s the season to ask about recommendations - do it well, please.\"></a></p>\n\n<p>If there are other items we should discus - please answer with your topic and we can all be mindful to new users coming to ask and provide the most helpful and detailed advice when we vote to close or comment on what might be a hastily written post that lacks detail to be answerable.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-12-20T13:11:32.133","Title":"Discussion on 2016 Holiday Moderation","Tags":"<discussion>","AnswerCount":"0","CommentCount":"0","FavoriteCount":"1"},{"Id":"2914","PostTypeId":"1","AcceptedAnswerId":"2917","CreationDate":"2016-12-21T22:04:18.977","Score":"1","ViewCount":"39","Body":"<p>I just noticed that this <a href=\"https://apple.stackexchange.com/a/257932/205310\">post</a> was deleted as spam or offensive. I understand the deletion because it's not an \"answer\", but this was NOT SPAM or OFFENSIVE!</p>\n\n<p><strong>Can someone please reverse this, as it affects my reputation and credibility</strong> </p>\n\n<p>I may only be a newbie and still finding my feet but I can't see why this was considered spam or offensive?</p>\n","OwnerUserId":"205310","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-12-21T23:52:37.967","Title":"Why was this Spam or Offensive? Can this be reversed?","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2915","PostTypeId":"1","AcceptedAnswerId":"2916","CreationDate":"2016-12-21T22:49:31.140","Score":"4","ViewCount":"30","Body":"<p>I would like to ask monomeeth if he ever got a solution to his <a href=\"https://apple.stackexchange.com/questions/257175/how-do-i-make-the-users-library-folder-within-a-time-machine-backup-available/257932#257932\">question</a>?</p>\n\n<p>How can I do this?</p>\n\n<p>Also, why did I have to wait 40 mins before I could post this question?!?! </p>\n","OwnerUserId":"205310","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-12-21T22:59:59.727","Title":"How do I ask a user a question?","Tags":"<support>","AnswerCount":"1","CommentCount":"1"},{"Id":"2916","PostTypeId":"2","ParentId":"2915","CreationDate":"2016-12-21T22:59:59.727","Score":"4","Body":"<p>Once you reach 50 reputation, you will be able to comment on any post on the site. You are then able to comment on the question and the original question asker will receive a notification in their inbox.</p>\n\n<p><a href=\"https://apple.stackexchange.com/help/privileges/chat\">At 20 reputation, chat becomes available.</a> Here you can start a conversation with someone. Use the chat link from the Stack Exchange button at the top left to access chat. As of now, you have enough reputation for this!</p>\n\n<p>Stack Exchange has no private messaging system for this purpose.</p>\n\n<p>You had to wait a bit to ask a second question because of the rate limiting in use on every function on the site. As your reputation increases, the rate limits increase but never completely disappear (although they do increase so much that you won't really run into them).</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-12-21T22:59:59.727","CommentCount":"0"},{"Id":"2917","PostTypeId":"2","ParentId":"2914","CreationDate":"2016-12-21T23:52:37.967","Score":"1","Body":"<p>I've edited the post to make it look less like a subtle advert for wondershare and moved it to comments. That's not a normal thing, but you have a reasonable comment and it might help the site get a better answer to the question you linked. </p>\n\n<p>Going forward, try to find some other questions to answer. Once you've gotten a few positive posts (answers specifically) voted - any temporary down side to deleted posts will be a distant memory.</p>\n","OwnerUserId":"5472","LastActivityDate":"2016-12-21T23:52:37.967","CommentCount":"4"},{"Id":"2918","PostTypeId":"1","CreationDate":"2016-12-27T02:35:16.530","Score":"1","ViewCount":"28","Body":"<p>I was googling how to find the location of backups on iTunes and how to change their locations, but the answers are around 3 years old. What is the right approach to getting these updated. </p>\n\n<p>I could add a comment, but I believe that goes to the person who asked the question or answered the questions, but would it make the question visible again?</p>\n\n<p>Questions that made me think of this, there is always the possibility I have not looked far enough through the question, but I think the question remains the same.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/96623/where-on-my-pc-does-itunes-store-the-backup\">Where on my pc does iTunes store the backup?</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/12857/how-to-change-the-location-where-itunes-stores-backups-of-iphones\">How to change the location where iTunes stores backups of iPhones?</a></li>\n</ul>\n","OwnerUserId":"216982","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-12-27T14:04:35.893","Title":"How should we get a question updated for a new version?","Tags":"<discussion><questions>","AnswerCount":"1","CommentCount":"1"},{"Id":"2919","PostTypeId":"2","ParentId":"2918","CreationDate":"2016-12-27T14:03:41.457","Score":"1","Body":"<p>The <a href=\"https://apple.stackexchange.com/help/privileges/set-bounties\">bounty system</a> can draw attention to an outdated Q&amp;A. This allows you to promote the question on the site such that someone may be able to provide a more up-to-date answer or edit an existing answer. There is a specific bounty reason for this:</p>\n\n<blockquote>\n  <p>Current answers are outdated<br>\n  The current answer(s) are out-of-date and require revision given recent changes.</p>\n</blockquote>\n\n<p>You can also ask another question, making sure to link to the previous question and specify how it does not answer your question due to changes. This may lead to the older question being edited to be clear that it is specific to an older version.</p>\n\n<p>For example, a question regarding how to do a certain task ‘on an iPhone’ may be outdated due to an updated version of iOS. By asking a separate question about how to do the task ‘in iOS 10’, the older question can be edited to be specific to how the task is performed ‘on iOS 9’ or such.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-12-27T14:03:41.457","CommentCount":"4"},{"Id":"2920","PostTypeId":"1","CreationDate":"2016-12-27T14:11:29.143","Score":"1","ViewCount":"20","Body":"<p><a href=\"https://apple.stackexchange.com/questions/tagged/energy-saving\" class=\"post-tag\" title=\"show questions tagged &#39;energy-saving&#39;\" rel=\"tag\">energy-saving</a> is already a synonym of <a href=\"https://apple.stackexchange.com/questions/tagged/power-management\" class=\"post-tag\" title=\"show questions tagged &#39;power-management&#39;\" rel=\"tag\">power-management</a>, but <a href=\"https://apple.stackexchange.com/questions/tagged/energy\" class=\"post-tag\" title=\"show questions tagged &#39;energy&#39;\" rel=\"tag\">energy</a> is separate. It is used on a variety of questions, mostly in unison with <a href=\"https://apple.stackexchange.com/questions/tagged/power-management\" class=\"post-tag\" title=\"show questions tagged &#39;power-management&#39;\" rel=\"tag\">power-management</a> for general energy questions, or when talking about the Energy Impact.</p>\n\n<p>Is <a href=\"https://apple.stackexchange.com/questions/tagged/energy\" class=\"post-tag\" title=\"show questions tagged &#39;energy&#39;\" rel=\"tag\">energy</a> supposed to be referring to the Energy Impact? The tag has no wiki or excerpt. If so, could the tag be renamed to <a href=\"https://apple.stackexchange.com/questions/tagged/energy-impact\" class=\"post-tag\" title=\"show questions tagged &#39;energy-impact&#39;\" rel=\"tag\">energy-impact</a> to make that clear? If not, could it be a synonym of <a href=\"https://apple.stackexchange.com/questions/tagged/power-management\" class=\"post-tag\" title=\"show questions tagged &#39;power-management&#39;\" rel=\"tag\">power-management</a>?</p>\n","OwnerUserId":"37797","LastActivityDate":"2016-12-27T14:11:29.143","Title":"Should [energy] be renamed to [energy-impact] or be a synonym of [power-management]?","Tags":"<discussion><tags>","AnswerCount":"0","CommentCount":"0"},{"Id":"2921","PostTypeId":"1","AcceptedAnswerId":"2922","CreationDate":"2016-12-28T20:45:12.297","Score":"8","ViewCount":"129","Body":"<p>I am new here and am a little confused. Why are you allowed to down vote an answer without leaving a comment? That provides me with no information as to how to improve my answer. </p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/266556/is-this-safe-place-to-download/266559#266559\">Is this safe to download and use Gutenprint driver for Mac from their site?</a></p>\n\n<p>Any help is appreciated.</p>\n","OwnerUserId":"217088","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2017-01-02T15:48:42.630","Title":"Why was my answer down voted, and most importantly why did it not require the user to leave a comment?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"2922","PostTypeId":"2","ParentId":"2921","CreationDate":"2016-12-28T23:14:22.337","Score":"12","Body":"<p>The down vote process asks people to consider leaving constructive criticism, but it isn't required. Sometimes there's nothing significant about a vote other than someone, somehwere on the internet didn't like the post. </p>\n\n<p>or a cat is operating someone's browser and can't figure out how to take the down vote back:</p>\n\n<p><a href=\"https://i.stack.imgur.com/lxx2G.jpg\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/lxx2G.jpg\" alt=\"oh noes, what has I done?\"></a></p>\n\n<p>Other times, there's an obvious link to:</p>\n\n<p>A) not enough research shown<br>\nB) not enough specificity<br>\nC) several questions being asked<br>\nD) just not a useful question in one person's eyes</p>\n\n<p>I don't think your answer is nearly as bad as the question. Maybe people felt virus total is spammy?</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2017-01-02T15:48:42.630","LastActivityDate":"2017-01-02T15:48:42.630","CommentCount":"2"},{"Id":"2923","PostTypeId":"1","AcceptedAnswerId":"2924","CreationDate":"2016-12-30T22:34:54.100","Score":"2","ViewCount":"19","Body":"<p>I wanted to search for a special character (<kbd>⇞</kbd>) on Ask Different before answering to a question, but a search returned null results. An answer on <a href=\"https://apple.stackexchange.com/questions/123568/cant-find-symbol-in-keyboard\">Can&#39;t find ⌃ symbol in keyboard</a> contains the character and should be returned.</p>\n","OwnerUserId":"1342","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-12-31T12:16:48.603","Title":"Search for a special character returns no results","Tags":"<support><search>","AnswerCount":"1","CommentCount":"1"},{"Id":"2924","PostTypeId":"2","ParentId":"2923","CreationDate":"2016-12-31T12:15:54.540","Score":"2","Body":"<p>Search ignores non-alphanumeric characters except where those characters have special meaning in advanced search, such as ‘[]’ for tag search. This is <a href=\"/questions/tagged/status-bydesign\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;status-bydesign&#39;\" rel=\"tag\">status-bydesign</a>.</p>\n","OwnerUserId":"37797","LastActivityDate":"2016-12-31T12:15:54.540","CommentCount":"0"},{"Id":"2925","PostTypeId":"1","CreationDate":"2016-12-31T14:56:40.963","Score":"-6","ViewCount":"72","Body":"<p>How is it acceptable to discuss methods of taking over others' devices? Came here looking for help with security and I see inquiries almost all pertaining to taking control over products, aka stealing/theft. </p>\n","OwnerUserId":"217608","OwnerDisplayName":"ShuddaBeenCodin","LastActivityDate":"2017-01-02T02:10:04.330","Title":"Legality of discussions","Tags":"<discussion>","AnswerCount":"1","CommentCount":"4"},{"Id":"2926","PostTypeId":"2","ParentId":"2925","CreationDate":"2017-01-01T02:52:30.643","Score":"4","Body":"<p>You can discuss a lot of things that are illegal without falling afoul of the law. Imagine if you couldn't discuss murder? It'd be really hard to study case law or report the news.</p>\n\n<p>There's also varying laws around the world when it comes to actions. So some action that might be illegal in one country could be perfectly legal in another.</p>\n\n<p>Knowledge isn't illegal to possess or to share.</p>\n","OwnerUserId":"292","LastEditorUserId":"292","LastEditDate":"2017-01-02T02:10:04.330","LastActivityDate":"2017-01-02T02:10:04.330","CommentCount":"4"},{"Id":"2927","PostTypeId":"1","CreationDate":"2017-01-02T13:00:55.890","Score":"12","ViewCount":"137","Body":"<p>The cynic in me wants to post a question &amp; answer</p>\n\n<blockquote>\n  <p><strong><a href=\"http://knowyourmeme.com/memes/i-accidentally\" rel=\"nofollow noreferrer\">I accidentally my hard drive</a>. What do I do now?</strong></p>\n  \n  <p>I accidentally  </p>\n  \n  <ul>\n  <li>Wiped my boot drive  </li>\n  <li>Tried to resize my partition  </li>\n  <li>Tried to fix/adjust my Boot Camp partition from inside Windows  </li>\n  <li>got a blank screen after a failed OS update  </li>\n  <li>typed <code>sudo rm -rf /</code>  </li>\n  <li>chown'd my entire machine  </li>\n  <li>dropped my Mac/pad/phone &amp; now it doesn't work    </li>\n  <li>lent my Mac/phone/pad to someone &amp; they...  </li>\n  <li>disassembled my fusion drive</li>\n  <li>Used beta software/APFS etc on a mission-critical machine</li>\n  <li>Stored my only copy of valuable data on a flash drive</li>\n  <li>etc etc etc</li>\n  </ul>\n</blockquote>\n\n<p>Then simply post the answer</p>\n\n<blockquote>\n  <p>Restore your machine from your last backup</p>\n</blockquote>\n\n<p>mark it as correct &amp; link as a dupe every other question to which it applies.</p>\n\n<p>So... my actual question is...<br>\n<strong>Would this get me a hat?</strong></p>\n\n<p><sup><em>Note: This entire question is not really meant to be taken seriously, but it's hat season, so why not.</em></sup></p>\n\n<p><strong><em>Late Edit</em></strong><br>\nReal-world examples, as I find them</p>\n\n<p>Let these become the Darwin Awards for dead data ;-)</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/286164/trouble-with-encrypted-sd-card\">Trouble with encrypted SD card</a><br>\n<a href=\"https://apple.stackexchange.com/questions/287721/how-to-recover-data-from-a-partition-overwritten-by-an-os-x-installer\">How to recover data from a partition overwritten by an OS X installer?</a><br>\n<a href=\"https://apple.stackexchange.com/questions/287885/how-to-backup-a-mac-which-shows-as-unformatted\">SD card shows up as Internal in Disk Utility</a> which was a follow-up to<br>\n<a href=\"https://apple.stackexchange.com/questions/286480/macbook-wont-boot-after-creating-two-small-partitions\">MacBook wont boot after creating two small partitions</a><br>\n<a href=\"https://apple.stackexchange.com/questions/288392/big-file-folder-icon-at-the-center-of-the-screen-when-tried-macos-high-sierra-pu\">Big file folder icon at the center of the screen when tried macOS high Sierra public beta</a><br>\n<a href=\"https://apple.stackexchange.com/questions/296053/hfs-journaled-and-encrypted-flash-drive-does-not-accept-password\">HFS+ journaled and encrypted flash drive does not accept password</a></p>\n","OwnerUserId":"85275","LastEditorUserId":"85275","LastEditDate":"2017-08-23T07:25:21.953","LastActivityDate":"2017-08-23T07:25:21.953","Title":"Restore from backup?","Tags":"<discussion><questions><canonical-questions>","AnswerCount":"2","CommentCount":"1","FavoriteCount":"1"},{"Id":"2928","PostTypeId":"2","ParentId":"2927","CreationDate":"2017-01-02T15:37:58.827","Score":"6","Body":"<p>Meta hat? Quite possibly. Would be diabolical to make you self Ask anD self answer on meta and on main for a pixel overlay. </p>\n\n<p>I endorse the clear canonical question - especially if it helps get people a clear answer. </p>\n","OwnerUserId":"5472","LastActivityDate":"2017-01-02T15:37:58.827","CommentCount":"0"},{"Id":"2929","PostTypeId":"1","CreationDate":"2017-01-03T05:07:54.317","Score":"8","ViewCount":"136","Body":"<p>I don't know if this is an appropriate question to ask here, but I thought this would be the best place to ask. I have noticed (especially recently) a LOT of spam questions (true spam, like for body-building products or magic ED fixes). I noticed three within the span of a few hours the other day and just flagged another one now. I feel like this site gets more than it should and more than the other site I'm on (photography).</p>\n\n<p>So, my questions are:</p>\n\n<p>1) Am I completely wrong in my assumption that there is way too much spam, or have others noticed it too?</p>\n\n<p>2) Is there anything that can be done to prevent spam questions like these from ever being posted?</p>\n","OwnerUserId":"178418","LastActivityDate":"2017-01-09T15:45:41.287","Title":"Request for spam information","Tags":"<discussion><flagging><spam>","AnswerCount":"4","CommentCount":"4"},{"Id":"2930","PostTypeId":"2","ParentId":"2929","CreationDate":"2017-01-03T05:15:50.870","Score":"10","Body":"<p>Yeah, for whatever reason spammers tend to become attached to specific sites. AD happens to be a lucky winner:</p>\n\n<p><a href=\"https://metasmoke.erwaysoftware.com/graphs\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/dCYmb.png\" alt=\"enter image description here\"></a></p>\n\n<p><sup>Detected spam over the last month</sup></p>\n\n<p>The system has some clever logic in place to block quite a bit of this... but there's a ton coming in anyway, so some will get through. There's also a <a href=\"https://github.com/Charcoal-SE/SmokeDetector\" rel=\"nofollow noreferrer\">community project</a> that does <a href=\"https://metasmoke.erwaysoftware.com/graphs\" rel=\"nofollow noreferrer\">rather well</a>.</p>\n","OwnerUserId":"44427","LastActivityDate":"2017-01-03T05:15:50.870","CommentCount":"0"},{"Id":"2931","PostTypeId":"2","ParentId":"2929","CreationDate":"2017-01-03T05:17:23.433","Score":"4","Body":"<p>This site does get more than  it's fair share of spam at the moment, considering it's size and it's increased of late:.</p>\n\n<p>Last month\n<a href=\"https://i.stack.imgur.com/RQWPf.jpg\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/RQWPf.jpg\" alt=\"enter image description here\"></a></p>\n\n<p>All time:\n<a href=\"https://i.stack.imgur.com/hkg57.jpg\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/hkg57.jpg\" alt=\"enter image description here\"></a></p>\n\n<p>I'm noticing the more popular programming sites tend to get more. And I think spammers see Apple and think - <em>let's go</em> Now that last bit is my opinion as to why.</p>\n\n<p><a href=\"http://chat.stackexchange.com/rooms/11540/charcoal-hq\">Charcoal HQ</a> monitors spam that makes it to the sites. I got these charts courtesy of the metasmoke stats, used in Charcoal HQ. Any spam reported in Charcoal gets deleted with flags. The more people active in the room at the time, the quicker it is deleted.</p>\n","OwnerUserId":"174099","LastEditorUserId":"174099","LastEditDate":"2017-01-03T05:22:55.123","LastActivityDate":"2017-01-03T05:22:55.123","CommentCount":"0"},{"Id":"2932","PostTypeId":"2","ParentId":"2929","CreationDate":"2017-01-03T12:06:56.420","Score":"0","Body":"<p>I really wish there was a one-vote ban-hammer on these - maybe like the gold badge one-vote close.</p>\n\n<p>Maybe you could gain a spam-hammer badge after successfully flagging 100 with no false positives, or an ability added to users over <em>x</em> rep [perhaps with a review queue after the fact, to make sure it's not being mis-used]</p>\n","OwnerUserId":"85275","LastActivityDate":"2017-01-03T12:06:56.420","CommentCount":"2"},{"Id":"2933","PostTypeId":"2","ParentId":"2929","CreationDate":"2017-01-04T01:19:46.927","Score":"3","Body":"<p>The most powerful tool we have for immediate use is for everyone to flag as spam on those posts. That ensures the best improvement on the tools to detect and suppress spam. </p>\n\n<p>You are right. The past month here has more spam than possibly 10 months before. We the elected moderators sincerely thank you all for flagging these ham fisted spam posts so we can get them deleted from view. </p>\n\n<p><em>Here is a search that lets moderators search for the posts fitting his pattern - <a href=\"https://apple.stackexchange.com/search?tab=newest&amp;q=deleted%3a1%20locked%3a1%20migrated%3ano_\">https://apple.stackexchange.com/search?tab=newest&amp;q=deleted%3a1%20locked%3a1%20migrated%3ano</em></a></p>\n\n<p><em>10k users can see deleted posts - once they get the link. Currently, 10k users can only search for their deleted posts - not anyone's posts.</em></p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-01-04T12:49:32.313","CommentCount":"3"},{"Id":"2934","PostTypeId":"2","ParentId":"2927","CreationDate":"2017-01-07T18:10:36.503","Score":"0","Body":"<p>I disagree with creating a canonical question for this. With each one of those cases, whilst ‘restore from backup’ is a suitable answer, there are other answers which apply to specific cases. For example, adjusting Boot Camp partition from Windows has many answers beside restoring from a backup, but those answers wouldn't apply to the other cases. Canonical answers are great, but make sure they only canonicalise those questions which are identical.</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-01-07T18:10:36.503","CommentCount":"1"},{"Id":"2936","PostTypeId":"1","AcceptedAnswerId":"2937","CreationDate":"2017-01-10T11:15:00.133","Score":"4","ViewCount":"32","Body":"<p><a href=\"https://i.stack.imgur.com/0FDKl.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/0FDKl.png\" alt=\"\"></a></p>\n\n<p>Under \"Edit Profile\" should've been an option for leaving the community.</p>\n\n<p>Am I looking in the wrong place?</p>\n","OwnerDisplayName":"user216217","LastEditorUserId":"37797","LastEditDate":"2017-01-10T12:46:37.763","LastActivityDate":"2017-01-10T13:16:37.270","Title":"Why is there no Delete Profile link anymore?","Tags":"<support><user-accounts><profile-page>","AnswerCount":"1","CommentCount":"0"},{"Id":"2937","PostTypeId":"2","ParentId":"2936","CreationDate":"2017-01-10T12:45:45.127","Score":"4","Body":"<p>You can only self-delete your profile if the profile has <strong>never voted</strong> and has <strong>posted at most once</strong> in the history of the account. If this is not true, the Delete Profile link will not be shown.</p>\n\n<p>To delete a profile which does not meet this criteria, use the <a href=\"https://apple.stackexchange.com/contact\">contact us</a> link and choose ‘I need to delete my user profile’.</p>\n\n<p>Practically, it's simpler to just anonymize your profile if that's what you want - deletion just automates the anonymization of your posts and profile. If you're asking about linking accounts - that's a different path: <a href=\"http://stackexchange.com/users/218740/bmike?tab=accounts\">http://stackexchange.com/users/218740/bmike?tab=accounts</a></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-01-10T13:16:37.270","CommentCount":"0"},{"Id":"2938","PostTypeId":"1","CreationDate":"2017-01-10T20:06:18.897","Score":"2","ViewCount":"58","Body":"<p>A post instructs me to post the results of a terminal command, but when I try to add a comment I'm stopped by a 50 reputation requirement. Not a very welcome introduction.</p>\n","OwnerUserId":"219328","OwnerDisplayName":"JoeSantana","LastEditorUserId":"37797","LastEditDate":"2017-01-11T12:04:38.783","LastActivityDate":"2017-01-11T12:04:38.783","Title":"How do I make a comment when I am told I need 50 reputation?","Tags":"<support><comments>","AnswerCount":"1","CommentCount":"4"},{"Id":"2939","PostTypeId":"2","ParentId":"2938","CreationDate":"2017-01-10T22:31:12.307","Score":"3","Body":"<p>Please see <a href=\"https://apple.stackexchange.com/help/privileges/comment\">https://apple.stackexchange.com/help/privileges/comment</a> to understand how the comment system works. You can always comment on your own posts though, so if you are asked to clarify something on your own question or answer you can always do so.</p>\n\n<p>To improve existing questions or answers it is also possible to edit those posts directly (there is an \"edit\" link beneath every post for this).</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-01-10T22:31:12.307","CommentCount":"0"},{"Id":"2940","PostTypeId":"1","CreationDate":"2017-01-10T23:46:53.187","Score":"3","ViewCount":"30","Body":"<p>I asked <a href=\"https://apple.stackexchange.com/questions/268215/\">this question</a> on Ask Different:</p>\n\n<blockquote>\n  <p>I'm looking for one of these types of stylish MacBook keyboard skins [see image in original], but I don't want any of the keys marked. I just want blank keys, without letters/symbols. Do any such products exist?</p>\n</blockquote>\n\n<p>In my opinion, this question is not at all related to customer support (it's directly related to Apple hardware) and it's not opinion-based (it's not as if I'm asking for the <em>prettiest</em> keyboard skin), yet it's on hold for being a basic customer support question.  Yet now it's on hold:</p>\n\n<blockquote>\n  <p>Basic Customer Support or questions asking to recommend or find off-site resources (Mac/book/software/tutorial) are off-topic for Ask Different as they tend to attract opinionated answers and spam. Instead, edit to clearly describe your problem and the research done so far to solve it.</p>\n</blockquote>\n\n<hr>\n\n<p>I feel like both my problem and research done so far are clearly described, and I know this question isn't going to generate opinionated answers; how can a \"this product exists, here is proof\" answer be opinionated?</p>\n","OwnerUserId":"150109","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-01-11T12:02:31.740","Title":"Why is a specific, non-customer support question on hold as basic customer support?","Tags":"<support><close-reasons>","AnswerCount":"2","CommentCount":"1"},{"Id":"2941","PostTypeId":"2","ParentId":"2940","CreationDate":"2017-01-11T05:08:16.893","Score":"2","Body":"<p>The close reason used here has two parts. For your question the second part </p>\n\n<blockquote>\n  <p>[...] or questions <strong>asking to recommend or find off-site resources</strong> (Mac/book/software/tutorial) are off-topic for Ask Different as they tend to attract opinionated answers and spam</p>\n</blockquote>\n\n<p>is more applicable than the customer support part. Based on experience from similar questions in the past, such questions <em>will</em> attract opinionated (aka non-fact based) answers (and potentially spam) and, in the end, most of the answers will just be links to product web sites (making the answers look like the result of a Google search).</p>\n\n<p>AskDifferent (as any other SE site) works best for questions which have clear, fact-based answers. It doesn't work so well for questions where a lot of answers are possible without a clear way to determine their individual merit.</p>\n","OwnerUserId":"9058","LastEditorUserId":"9058","LastEditDate":"2017-01-11T05:43:33.520","LastActivityDate":"2017-01-11T05:43:33.520","CommentCount":"2"},{"Id":"2942","PostTypeId":"1","AcceptedAnswerId":"2943","CreationDate":"2017-01-11T09:59:54.213","Score":"1","ViewCount":"29","Body":"<p>I want to give answers to some questions that I know the answer to, but I don't know how to express my answer. What should I keep in mind when I answer any questions?</p>\n","OwnerUserId":"219119","LastEditorUserId":"37797","LastEditDate":"2017-01-11T11:57:04.890","LastActivityDate":"2017-01-11T11:57:04.890","Title":"How to improve my answers?","Tags":"<discussion><answers>","AnswerCount":"1","CommentCount":"1"},{"Id":"2943","PostTypeId":"2","ParentId":"2942","CreationDate":"2017-01-11T10:30:15.617","Score":"0","Body":"<p>Two good places to start are</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/tour\">Two Minute Tour</a></li>\n<li><a href=\"https://apple.stackexchange.com/help\">Help Center</a></li>\n</ul>\n\n<p>Especially the help center contains a lot of information about how to participate on the site and how the different things work. There is also one page about <a href=\"https://apple.stackexchange.com/help/how-to-answer\">How do I write a good answer?</a>.</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-01-11T10:30:15.617","CommentCount":"0"},{"Id":"2944","PostTypeId":"2","ParentId":"2940","CreationDate":"2017-01-11T12:02:31.740","Score":"1","Body":"<p>I disagree with this question being closed and I voted to ‘leave open’ when I saw the question in the closure queue. Not only have I expressed my distaste for that specific close reason before, I think your question is suitable for the site.</p>\n\n<p>Hardware recommendations, just like software recommendations, can be on-topic on Ask Different, providing they have a clear focus, which your question does. Your question meets all the requirements set out for such questions in the tag wiki, and I don't see how the question can't be objectively answered.</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-01-11T12:02:31.740","CommentCount":"0"},{"Id":"2945","PostTypeId":"1","CreationDate":"2017-01-13T08:42:36.320","Score":"15","ViewCount":"149","Body":"<p>Should the tag <a href=\"https://apple.stackexchange.com/questions/tagged/terminal\" class=\"post-tag\" title=\"show questions tagged &#39;terminal&#39;\" rel=\"tag\">terminal</a> be renamed to <a href=\"https://apple.stackexchange.com/questions/tagged/terminal.app\" class=\"post-tag\" title=\"show questions tagged &#39;terminal.app&#39;\" rel=\"tag\">terminal.app</a>? I think this would help make it clear that the tag should only be used on questions regarding the macOS Terminal.app.</p>\n\n<p>General command line questions not specific to the Terminal app should use <a href=\"https://apple.stackexchange.com/questions/tagged/command-line\" class=\"post-tag\" title=\"show questions tagged &#39;command-line&#39;\" rel=\"tag\">command-line</a>, as mentioned in the tag wiki excerpt for <a href=\"https://apple.stackexchange.com/questions/tagged/terminal\" class=\"post-tag\" title=\"show questions tagged &#39;terminal&#39;\" rel=\"tag\">terminal</a>:</p>\n\n<blockquote>\n  <p>questions narrowly about terminal.app alone should use this tag. Please consider using **command-line** for any question not specifically about the native terminal app</p>\n</blockquote>\n\n<p>However it is still misused heavily. Other macOS app tags have the ‘.app’ extension, however this one doesn't.</p>\n\n<p>Can the tag be renamed?</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-01-16T19:24:08.330","Title":"Rename [terminal] to [terminal.app] to make it clear the tag is for the macOS app","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"7"},{"Id":"2947","PostTypeId":"2","ParentId":"2945","CreationDate":"2017-01-16T18:40:30.343","Score":"15","Body":"<p>I agree with this proposal. 'Terminal.app' makes it clear that it is the app and no the general subject of command line or terminal questions. A synonym defeats this, but renaming the tag should work. </p>\n\n<p>'Command-line' for command line issues, and 'terminal.app' for the program. </p>\n","OwnerUserId":"9388","LastActivityDate":"2017-01-16T18:40:30.343","CommentCount":"5"},{"Id":"2948","PostTypeId":"1","AcceptedAnswerId":"2949","CreationDate":"2017-01-17T21:36:44.857","Score":"2","ViewCount":"42","Body":"<p>On Ask Different especially, a significant proportion of questions are asked by unregistered users who are then unable to accept an answer to their question as correct. This is a massive disincentive to answering questions from unregistered users, given that the probability of reputation gain from that answer is significantly lower.</p>\n\n<p>I have <a href=\"https://apple.stackexchange.com/questions/242711/can-someone-who-registered-my-iphone-read-all-my-text-messages/242715#242715\">one such answer</a> that has been left un-accepted despite receiving 35 upvotes (and 0 downvotes) because the OP is unregistered and thus has no means of accepting it. </p>\n\n<p>Could there be a way to automatically accept answers to unregistered users' questions once they reach, say, +5 votes? This rule would remove the disincentive of answering many of Ask Different's questions, and get users well-earned reputation points.</p>\n","OwnerUserId":"180636","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-01-18T15:03:56.790","Title":"Method to get answers accepted if OP is unregistered","Tags":"<discussion><feature-request><accepted-answer>","AnswerCount":"1","CommentCount":"6"},{"Id":"2949","PostTypeId":"2","ParentId":"2948","CreationDate":"2017-01-18T15:03:56.790","Score":"4","Body":"<p>Short answer, no.</p>\n\n<p>You would need to ask for this change on the main stack exchange meta to change the code across the entire site.</p>\n\n<p>Long answer - people voting for useful answers gives 10 rep to the people so the +5 for the tick mark is a little like a cherry on top of the sundae. Voting, putting a bounty on a really great answer are much more meaningful to give rep and draw attention to useful answers regardless of the OP coming back to participate. Voting up the question also helps others find the good answer you voted up.</p>\n","OwnerUserId":"5472","LastActivityDate":"2017-01-18T15:03:56.790","CommentCount":"0"},{"Id":"2950","PostTypeId":"1","AcceptedAnswerId":"2951","CreationDate":"2017-01-18T18:02:53.213","Score":"-3","ViewCount":"37","Body":"<p>I have been seeing a lot of questions like: \"I want to install El Capitan, but I never got it from the App Store. How can I do this?\"</p>\n\n<p>The best option for this is \"Get a friend with the installer.\" I have installers going back to Mavericks. Would it be useful and legal for me to create a Google Drive account where I could post these installers? The idea would be that I could create a canonical question/answer so that each time a question like this comes up, we can mark it as a duplicate of the question with a link to all of the installers.</p>\n","OwnerUserId":"178418","LastEditorUserId":"37797","LastEditDate":"2017-01-18T21:47:51.883","LastActivityDate":"2017-01-18T21:47:51.883","Title":"Create a canonical Q&A for installing a blank OS without MAS with a link to a hosted copy of the installers","Tags":"<discussion><canonical-questions>","AnswerCount":"1","CommentCount":"5"},{"Id":"2951","PostTypeId":"2","ParentId":"2950","CreationDate":"2017-01-18T21:33:44.057","Score":"6","Body":"<p>Getting an illegal copy off a random person is <strong>not</strong> the best way. One should use the official links from Apple to obtain a copy, or there are alternative methods such as Internet Recovery.</p>\n\n<p>Any such questions can be marked as duplicate of the existing questions with viable questions.</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-01-18T21:33:44.057","CommentCount":"0"},{"Id":"2952","PostTypeId":"1","AcceptedAnswerId":"2954","CreationDate":"2017-01-23T07:34:07.587","Score":"1","ViewCount":"32","Body":"<p>Rather ironically, the OP on this question misspelled <a href=\"https://apple.stackexchange.com/questions/tagged/spelling\" class=\"post-tag\" title=\"show questions tagged &#39;spelling&#39;\" rel=\"tag\">spelling</a> so we now have a tag called <a href=\"https://apple.stackexchange.com/questions/tagged/spelign\" class=\"post-tag\" title=\"show questions tagged &#39;spelign&#39;\" rel=\"tag\">spelign</a>.</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/269923/verify-the-automatic-language-detection\">Verify the automatic language detection</a></p>\n\n<p>How are these dealt with?  </p>\n\n<p>I didn't just want to retag it <a href=\"https://apple.stackexchange.com/questions/tagged/spelling\" class=\"post-tag\" title=\"show questions tagged &#39;spelling&#39;\" rel=\"tag\">spelling</a> or <a href=\"https://apple.stackexchange.com/questions/tagged/spell-check\" class=\"post-tag\" title=\"show questions tagged &#39;spell-check&#39;\" rel=\"tag\">spell-check</a> as I'm not sure what that would then do with the orphaned tag.</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2017-01-23T16:13:18.527","Title":"Misspelled tags, how to fix?","Tags":"<support><tags>","AnswerCount":"2","CommentCount":"0"},{"Id":"2953","PostTypeId":"2","ParentId":"2952","CreationDate":"2017-01-23T08:43:39.067","Score":"0","Body":"<p>Tag merging to the rescue!</p>\n\n<p>Fixed, thanks.</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-01-23T08:43:39.067","CommentCount":"6"},{"Id":"2954","PostTypeId":"2","ParentId":"2952","CreationDate":"2017-01-23T16:13:00.777","Score":"1","Body":"<p>You don't need to open a meta question or ask a mod for help with this kind of thing — just retag the question with the correct tag spelling. At 3:00 UTC all tags with zero questions are automatically deleted. A mod using the tag merge functionality creates a tag synonym, which is obviously incorrect in this scenario.</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-01-23T16:13:00.777","CommentCount":"0"},{"Id":"2955","PostTypeId":"1","CreationDate":"2017-01-24T09:17:47.737","Score":"1","ViewCount":"80","Body":"<p>I've recently created the little snitch tag and I observed that it has been made synonym with firewall. Probably to be consistent with the already existing synonym relationship between pf and firewall. <a href=\"https://apple.stackexchange.com/search?q=little-snitch+is%3Aquestion\">Searching for <code>little-snitch is:question</code></a> returns 117 results. Some of these results are questions about little snitch such as :</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/54872/little-snitch-and-different-network-profiles\">Little snitch and different network profiles</a></li>\n</ul>\n\n<p>and some other questions are not directly about Little Snitch but mention it in the question such as :</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/63540/what-is-gs-loc-apple-com\">What is gs-loc.apple.com?</a></li>\n</ul>\n\n<p>I think it would be nice to have a Little Snitch tag in order to regroup all questions directly about Little Snitch. The same reasoning can be done about pf.</p>\n\n<p>Now both the Little Snitch tag and the pf tag are synonyms to the firewall tag. I think this situation is not ideal because:</p>\n\n<p>1) pf and Little Snitch are not really synonyms of firewall but rather \"instance of\" firewall. </p>\n\n<p>2) Little Snitch is an application firewall and has a different usage than firewalls such as pf.</p>\n\n<p>3) better precision could be gained by having stand alone tags for pf and Little Snitch.</p>\n\n<p>I propose to remove the synonym relationship between Little Snitch and firewall and between pf and firewall and let the tags Little Snitch and pf be stand-alone tags.  </p>\n","OwnerUserId":"106452","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-01-25T13:51:32.760","Title":"Should [pf] and [little-snitch] be synonyms of [firewall]?","Tags":"<discussion><tags>","AnswerCount":"2","CommentCount":"2"},{"Id":"2956","PostTypeId":"2","ParentId":"2955","CreationDate":"2017-01-24T09:49:02.650","Score":"2","Body":"<p>IMHO having less but broad tags is better than getting too fine granular (because the more granular tags get the bigger the risk that people will use the wrong tag or no tag at all). Also the more tags we have the more effort there is to keep usage in line with the tag description (otherwise having the tag will not be of any use).</p>\n\n<p>In the specific case, questions about \"pf\" and \"Little Snitch\" should <em>also</em> have the <a href=\"https://apple.stackexchange.com/questions/tagged/firewall\" class=\"post-tag\" title=\"show questions tagged &#39;firewall&#39;\" rel=\"tag\">firewall</a> tag anyway, so the synonym kind of ensures that they get categorized correctly even if that part gets forgotten. And if the question really is about something specific to \"Little Snitch\" it will be mentioned in the question text and can easily be found (as shown in the query used in the question above).</p>\n","OwnerUserId":"9058","LastEditorUserId":"9058","LastEditDate":"2017-01-24T15:09:42.367","LastActivityDate":"2017-01-24T15:09:42.367","CommentCount":"3"},{"Id":"2957","PostTypeId":"2","ParentId":"2955","CreationDate":"2017-01-24T14:38:41.400","Score":"1","Body":"<p>Let's look at the questions you cited (and thanks for putting specific examples in the question).</p>\n\n<ol>\n<li><p><a href=\"https://apple.stackexchange.com/questions/54872/little-snitch-and-different-network-profiles\">Little snitch and different network profiles</a> - This question isn't even getting the correct network / firewall tag. Adding flavors of firewall seem very low hanging fruit when the basic tags that will let people follow things they choose to answer aren't even being used.</p></li>\n<li><p><a href=\"https://apple.stackexchange.com/questions/63540/what-is-gs-loc-apple-com\">What is gs-loc.apple.com?</a> - this is tagged well and also shows that additional tags of <a href=\"https://apple.stackexchange.com/questions/tagged/pf\" class=\"post-tag\" title=\"show questions tagged &#39;pf&#39;\" rel=\"tag\">pf</a> or <a href=\"https://apple.stackexchange.com/questions/tagged/little-snitch\" class=\"post-tag\" title=\"show questions tagged &#39;little-snitch&#39;\" rel=\"tag\">little-snitch</a> would not make any improvement in search-ability that I can see.</p></li>\n</ol>\n\n<p>Having too many tags is harmful to the site. Until there's a large volume of potential posts and it helps people know how to ask - I'm generally for merging down (with synonyms where it's really needed) as opposed to making tags for specific titles. Keep in mind - we don't have a <a href=\"https://apple.stackexchange.com/questions/tagged/microsoft-word\" class=\"post-tag\" title=\"show questions tagged &#39;microsoft-word&#39;\" rel=\"tag\">microsoft-word</a> or <a href=\"https://apple.stackexchange.com/questions/tagged/microsoft-excel\" class=\"post-tag\" title=\"show questions tagged &#39;microsoft-excel&#39;\" rel=\"tag\">microsoft-excel</a> tag in favor of collecting them under the office umbrella. Please let us know in the comments if there some case where a tag will improve asking or finding questions to answer. I'm open to revisiting the general thinking I've shared here on when to make a synonym or merge vs when to let a tag exist as a stand alone tag.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-01-25T13:51:32.760","CommentCount":"5"},{"Id":"2958","PostTypeId":"2","ParentId":"2037","CreationDate":"2017-01-25T19:14:36.747","Score":"-2","Body":"<p>For what it's worth, I think you end up losing a lot of potential contributors coming in with potentially valuable input on specific problems they're facing by requiring them to answer other questions just in order to leave a comment.</p>\n\n<p>Potential new contributors are going to come into the site by clicking through google search results describing a problem they're having and finding an SE question along the same lines.  They've likely got an immediately pressing issue they're actively trying to solve. So, the idea that they're going to go answer some other un-related questions ... ?</p>\n\n<p>In my case, I was <a href=\"https://apple.stackexchange.com/questions/269483/vim-the-editor-keeps-crashing-on-sierra/270138#comment338830_269483\">attempting to provide some feedback on a specific issue</a> I was facing, describing some things I'd already tried.  <em>This is a normal part of diagnosing an issue and it's valuable, even if you don't have a final answer.</em>  I couldn't comment, so I left it as an answer.  An initial editor kindly moved it to a comment before deleting it.</p>\n\n<p>However, <a href=\"https://apple.stackexchange.com/review/suggested-edits/193213\">a follow-up comment that I tried to leave</a> (responding to a suggestion in another comment) was summarily deleted.  Again, I couldn't leave it as a comment, so it was left as an answer in the hopes that an editor would again move it to the comment thread.</p>\n\n<p>When one's feedback gets deleted like that, one is not particularly inclined to go try to answer some other questions not related to the issue at hand just to leave one's feedback.</p>\n","OwnerUserId":"156885","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2017-01-25T19:14:36.747","CommentCount":"1"},{"Id":"2960","PostTypeId":"1","CreationDate":"2017-01-30T16:01:29.337","Score":"1","ViewCount":"71","Body":"<p><a href=\"https://apple.stackexchange.com/questions/134598/is-it-possible-to-use-macbook-with-0-health/134600#134600\">Is it possible to use Macbook with 0% health?</a></p>\n\n<p>The first is </p>\n\n<blockquote>\n  <p>what you mean by \"accu\" ?</p>\n</blockquote>\n\n<p>and the second </p>\n\n<blockquote>\n  <p>The battery. I thought it was a word in English, my bad </p>\n</blockquote>\n\n<p>I have use flag for both with \"obsolete\". Cause there is not word \"accu\" anymore there. It was replaced more than 2 years before I have flagged it. </p>\n\n<p>Aren't this comments obsolete?\nWhy are the flags declined?</p>\n","OwnerUserId":"220880","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-08-24T17:35:21.907","Title":"Why are my comment flags (obsolete) declined?","Tags":"<discussion><flagging><comments>","AnswerCount":"1","CommentCount":"7","FavoriteCount":"0"},{"Id":"2961","PostTypeId":"1","AcceptedAnswerId":"2962","CreationDate":"2017-01-31T13:20:19.813","Score":"-3","ViewCount":"21","Body":"<p>I was just wondering if we can move the logout button from the Stack Exchange drop down menu to an <code>onHover:active</code> dropdown in the sticky bar. It's kind of hard for some new users to find.</p>\n","OwnerUserId":"110485","LastEditorUserId":"37797","LastEditDate":"2017-01-31T15:24:31.883","LastActivityDate":"2017-01-31T15:28:37.840","Title":"Moving logout button to be easier to find","Tags":"<feature-request><user-accounts>","AnswerCount":"1","CommentCount":"0"},{"Id":"2962","PostTypeId":"2","ParentId":"2961","CreationDate":"2017-01-31T15:28:37.840","Score":"0","Body":"<p>Using a hover event would make accidentally opening the panels on the top bar a more common occurrence. Furthermore, I fail to see how that would make the logout link easier to find either. The user would still have to hover over the required area.</p>\n\n<p>Changing from a click to a hover wouldn't help users find it accidentally since when a panel opens through hover, no-one's going to spend the time to read it but rather be annoyed by the intrusion.</p>\n\n<p>The log out link is not the hardest thing to find. Before reading your question body I tried to find the link by myself (having never logged out of Stack Exchange) and the Stack Exchange button was the first place I tried. I'm not sure how much of a problem finding the button is anyway, but regardless this isn't the right solution.</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-01-31T15:28:37.840","CommentCount":"0"},{"Id":"2963","PostTypeId":"2","ParentId":"2960","CreationDate":"2017-01-31T23:47:09.477","Score":"1","Body":"<p>I believe I declined your flags. In general, comments moderate themselves and for posts more than 90 days old, a comment standing by itself (as we see in the screen when we handle them) needs to be really bad for me to cast a binding delete vote. </p>\n\n<p>In general, a question with dozens of votes might merit the time to go to the post, look at why the comment might be obsolete and might need to be cleaned up is worth the time. </p>\n\n<p>Comments also show how edits make posts better - I'm on the fence if they do more good than harm in the case of the flags you raised. Please comment here if I missed something harmful about the two posts. I'm open to re-evaluating them if needed. </p>\n\n<p>To incorporate your excellent comments below - there are discussions similar to ours on the main meta:</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/207962/could-we-have-some-consensus-on-how-to-flag-bunches-of-obsolete-comments\">Could we have some consensus on how to flag bunches of obsolete comments?</a></li>\n<li><a href=\"https://meta.stackexchange.com/questions/182684/flagging-obsolete-comment-conversations\">Flagging obsolete comment conversations</a></li>\n<li><a href=\"https://meta.stackexchange.com/questions/261009/cmon-please-give-us-a-hint-how-authoritative-is-that-obsolete-comment-flag\">C&#39;mon, please give us a hint: how authoritative is that &quot;obsolete comment&quot; flag?</a></li>\n<li><a href=\"https://meta.stackexchange.com/questions/252844/make-comment-flags-less-stupid\">Make comment flags less stupid</a></li>\n</ul>\n\n<p>The first two share your confusion / dis-satisfaction on the process and you are not alone / wrong from my standpoint. The second two discuss the moderation side - where <a href=\"https://meta.stackexchange.com/a/261071/165931\">one quote is <strong>\"I'm skeptical that these flags are the right way to handle these comments period: they require entirely too much work for the potential benefit in most cases.\"</strong></a></p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2017-02-01T14:11:57.747","CommentCount":"5"},{"Id":"2964","PostTypeId":"1","CreationDate":"2017-02-02T14:12:28.973","Score":"5","ViewCount":"228","Body":"<p>It is a bit late into this new year, being that we're already in the second month, but we are now cycling the Community Promotion Ads for 2017!</p>\n\n<h3>What are Community Promotion Ads?</h3>\n\n<p>Community Promotion Ads are community-vetted advertisements that will show up on the main site, in the right sidebar. The purpose of this question is the vetting process. Images of the advertisements are provided, and community voting will enable the advertisements to be shown.</p>\n\n<h3>Why do we have Community Promotion Ads?</h3>\n\n<p>This is a method for the community to control what gets promoted to visitors on the site. For example, you might promote the following things:</p>\n\n<ul>\n<li>interesting apple related open source apps</li>\n<li>the site's twitter account</li>\n<li>script packs or power tools</li>\n<li>cool events or conferences</li>\n<li>anything else your community would genuinely be interested in</li>\n</ul>\n\n<p>The goal is for future visitors to find out about <em>the stuff your community deems important</em>. This also serves as a way to promote information and resources that are <em>relevant to your own community's interests</em>, both for those already in the community and those yet to join. </p>\n\n<h3>Why do we reset the ads every year?</h3>\n\n<p>Some services will maintain usefulness over the years, while other things will wane to allow for new faces to show up. Resetting the ads every year helps accommodate this, and allows old ads that have served their purpose to be cycled out for fresher ads for newer things. This helps keep the material in the ads relevant to not just the subject matter of the community, but to the current status of the community. We reset the ads once a year, every December.</p>\n\n<p>The community promotion ads have no restrictions against reposting an ad from a previous cycle. If a particular service or ad is very valuable to the community and will continue to be so, it is a good idea to repost it. It may be helpful to give it a new face in the process, so as to prevent the imagery of the ad from getting stale after a year of exposure.</p>\n\n<h3>How does it work?</h3>\n\n<p>The answers you post to this question <em>must</em> conform to the following rules, or they will be ignored. </p>\n\n<ol>\n<li><p>All answers should be in the exact form of:</p>\n\n<pre><code>[![Tagline to show on mouseover][1]][2]\n\n   [1]: http://image-url\n   [2]: http://clickthrough-url \n</code></pre>\n\n<p>Please <strong>do not add anything else to the body of the post</strong>. If you want to discuss something, do it in the comments.</p></li>\n<li><p>The question must always be tagged with the magic <a href=\"/questions/tagged/community-ads\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;community-ads&#39;\" rel=\"tag\">community-ads</a> tag. In addition to enabling the functionality of the advertisements, this tag also pre-fills the answer form with the above required form.</p></li>\n</ol>\n\n<h3>Image requirements</h3>\n\n<ul>\n<li>The image that you create must be 300 x 250 pixels, or double that if high DPI.</li>\n<li>Must be hosted through our standard image uploader (imgur)</li>\n<li>Must be GIF or PNG</li>\n<li>No animated GIFs</li>\n<li>Absolute limit on file size of 150 KB</li>\n<li>If the background of the image is white or partially white, there must be a 1px border (2px if high DPI) surrounding it.</li>\n</ul>\n\n<h3>Score Threshold</h3>\n\n<p>There is a <strong>minimum score threshold</strong> an answer must meet (currently <strong>6</strong>) before it will be shown on the main site.</p>\n\n<p>You can check out the ads that have met the threshold with basic click stats <a href=\"https://apple.meta.stackexchange.com/ads/display/2964\">here</a>.</p>\n","OwnerUserId":"8994","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2017-07-22T08:27:56.423","Title":"Community Promotion Ads - 2017","Tags":"<discussion><community-ads>","AnswerCount":"4","CommentCount":"0","FavoriteCount":"1"},{"Id":"2965","PostTypeId":"2","ParentId":"2964","CreationDate":"2017-02-02T14:12:28.973","Score":"3","Body":"<p><a href=\"http://twitter.com/askdifferent\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/0hCGV.png\" alt=\"Follow us on Twitter\"></a></p>\n","OwnerUserId":"8994","LastActivityDate":"2017-02-02T14:12:28.973","CommentCount":"1"},{"Id":"2966","PostTypeId":"1","CreationDate":"2017-02-02T16:53:38.360","Score":"0","ViewCount":"39","Body":"<p>I put this comment </p>\n\n<blockquote>\n  <p>Because of the amount of time passing since this question was posted, it would probably be best to ask a new question with updated information. Obviously you can't add a bounty since that takes lots of rep. Just link to the old question in your new question. It may end up getting marked as duplicate, but if you include enough new information it should stand on its own</p>\n</blockquote>\n\n<p>on this thread <a href=\"https://apple.stackexchange.com/questions/169326/apple-os-x-yosemite-email-viewing-preferences/271398#comment341166_271398\">Apple OS X Yosemite Email Viewing Preferences</a></p>\n\n<p>when a person posted a \"I'm having this issue too\" answer. I'm wondering if this is good advice, or if it would be better to say something along the lines of \"edit this question with new information instead of posting a non-answer answer.\"</p>\n\n<p>The current stock answer that tells them they can post a bounty if they have enough reputation is not too helpful for most of these situations.</p>\n","OwnerUserId":"70930","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-02-02T18:49:36.317","Title":"Old unanswered questions and comments as Answers","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2967","PostTypeId":"2","ParentId":"2964","CreationDate":"2017-02-02T18:37:19.160","Score":"8","Body":"<p><a href=\"https://apple.stackexchange.com/?tab=featured\"><img src=\"https://stack-exchange-dynamic-ads.herokuapp.com/apple.stackexchange.com/bounty.png\" alt=\"Current Ask Different bounties\"></a></p>\n","OwnerUserId":"37797","LastEditorUserId":"121968","LastEditDate":"2017-07-22T08:27:56.423","LastActivityDate":"2017-07-22T08:27:56.423","CommentCount":"1"},{"Id":"2968","PostTypeId":"2","ParentId":"2966","CreationDate":"2017-02-02T18:49:36.317","Score":"2","Body":"<p><strong>Specifically for the question at hand</strong></p>\n\n<p>If the \"me too\" poster is using Yosemite a new question with the same topic will (correctly IMHO) be closed as a duplicate. If they have additional information, they can edit it directly into the question. But Yosemite probably isn't used very much anymore, so I doubt Darryl will get an answer anyway.</p>\n\n<p><strong>Generally speaking</strong></p>\n\n<p>The topic has come up before, see <a href=\"https://apple.meta.stackexchange.com/questions/2788/should-i-answer-an-existing-old-question-or-ask-answer-my-own-new-question?rq=1\">Should I answer an existing old question or ask/answer my own new question?</a> </p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2017-02-02T18:49:36.317","CommentCount":"4"},{"Id":"2969","PostTypeId":"2","ParentId":"2964","CreationDate":"2017-02-03T04:59:27.310","Score":"9","Body":"<p><a href=\"http://vi.stackexchange.com\"><img src=\"https://i.stack.imgur.com/kXWI6.png\" alt=\"Vi and Vim Stack Exchange\"></a></p>\n","OwnerUserId":"205028","LastActivityDate":"2017-02-03T04:59:27.310","CommentCount":"1"},{"Id":"2970","PostTypeId":"2","ParentId":"2964","CreationDate":"2017-02-04T13:30:21.657","Score":"6","Body":"<p><a href=\"http://iot.stackexchange.com\"><img src=\"https://i.stack.imgur.com/4pLqq.png\" alt=\"Internet of Things\"></a></p>\n","OwnerUserId":"223329","LastActivityDate":"2017-02-04T13:30:21.657","CommentCount":"0"},{"Id":"2971","PostTypeId":"1","AcceptedAnswerId":"2972","CreationDate":"2017-02-07T20:34:20.887","Score":"2","ViewCount":"37","Body":"<p>I flagged <a href=\"https://apple.stackexchange.com/a/272082/88313\">an answer</a> as abusive because of the derogatory language the author used to reference another user (the answer has since been edited but you can see the original text in the edit history).  I was using <a href=\"https://meta.stackexchange.com/questions/58032/what-are-the-spam-and-rude-or-abusive-offensive-flags-and-how-do-they-wor/58035#58035\">this post</a> as my guide for what constitutes 'abuse'.</p>\n\n<p>The flag reviewer responded with a question to me:\n<a href=\"https://i.stack.imgur.com/hoDQi.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/hoDQi.png\" alt=\"enter image description here\"></a></p>\n\n<p>I don't want the reviewer to think I'm an idiot and I want them to know why I flagged it as I did (I don't want to argue that it was declined, that's within their right).</p>\n\n<p>How do I respond and answer the question?</p>\n","OwnerUserId":"88313","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-02-07T20:45:08.840","Title":"How do I respond to Mod question?","Tags":"<support><flagging>","AnswerCount":"1","CommentCount":"1"},{"Id":"2972","PostTypeId":"2","ParentId":"2971","CreationDate":"2017-02-07T20:45:08.840","Score":"2","Body":"<p>Basically flags are for things where the normal tools cannot fix the issue. In this case, an edit handled it which is why the flag was declined. </p>\n\n<p>Keep in mind, when we review flags we see the current post and not the original. The behavior was both rude and offensive so I've suspended the account in question temporarily. </p>\n","OwnerUserId":"5472","LastActivityDate":"2017-02-07T20:45:08.840","CommentCount":"4"},{"Id":"2973","PostTypeId":"1","CreationDate":"2017-02-13T09:29:50.043","Score":"4","ViewCount":"25","Body":"<p><a href=\"https://www.omnigroup.com/omnifocus\" rel=\"nofollow noreferrer\">OmniFocus</a> is one word, however the tag <a href=\"https://apple.stackexchange.com/questions/tagged/omni-focus\" class=\"post-tag\" title=\"show questions tagged &#39;omni-focus&#39;\" rel=\"tag\">omni-focus</a> is hyphenated.<br>\nCan the tag be renamed <a href=\"https://apple.stackexchange.com/questions/tagged/omnifocus\" class=\"post-tag\" title=\"show questions tagged &#39;omnifocus&#39;\" rel=\"tag\">omnifocus</a> to reflect the correct word?</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-02-13T09:29:50.043","Title":"Rename [omni-focus] to [omnifocus]","Tags":"<support><tags>","AnswerCount":"0","CommentCount":"5"},{"Id":"2974","PostTypeId":"2","ParentId":"2888","CreationDate":"2017-02-13T22:22:49.690","Score":"1","Body":"<p>Finally fixed today, <a href=\"/questions/tagged/status-completed\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;status-completed&#39;\" rel=\"tag\">status-completed</a>.</p>\n\n<p>Discussed on Meta.SE at <a href=\"https://meta.stackexchange.com/a/290979/222623\">Missing font on some error and dupehammer info popups</a>.</p>\n\n<p><a href=\"https://i.stack.imgur.com/xmRZw.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/xmRZw.png\" alt=\"\"></a></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2017-02-13T22:22:49.690","CommentCount":"0"},{"Id":"2975","PostTypeId":"1","CreationDate":"2017-02-15T01:23:15.013","Score":"2","ViewCount":"36","Body":"<p>I've not had much to do with bounties (though I've read the <a href=\"https://apple.stackexchange.com/help/bounty\">bounty docs</a>), and would like to understand better...</p>\n\n<p>The following question that I once asked <a href=\"https://apple.stackexchange.com/questions/91501/how-to-disable-default-alt-left-alt-right-keyboard-shortcuts-for-numbers-app\">How to disable default alt-left / alt-right keyboard shortcuts for Numbers.app</a> had a bounty applied after quite some time with the note that the answers were 'no longer correct' or 'out of date' (sorry can't remember the wording), so I added an updated answer.  </p>\n\n<p>This question on meta seems relevant: <a href=\"https://apple.meta.stackexchange.com/questions/2278/bounty-expired-without-good-answers-so-did-some-digging-and-found-the-correct-a\">Bounty expired without good answers, so did some digging and found the correct answer. Now what?</a>, but in my case, I added a new answer in response to the bounty. I would have thought the bounty would have been auto awarded.</p>\n\n<p>I saw the bounty expire, but can't see it having been awarded to either of the answers. Can someone explain the process here?</p>\n","OwnerUserId":"6126","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-02-16T02:18:22.020","Title":"What happened to the bounty on this question?","Tags":"<support><bounty>","AnswerCount":"1","CommentCount":"0"},{"Id":"2976","PostTypeId":"2","ParentId":"2975","CreationDate":"2017-02-15T03:22:37.697","Score":"4","Body":"<p>The bounty started January 31 and ran the normal time. No answers after the bounty period qualified and the person issuing the bounty didn't award it manually. </p>\n\n<p>If a bounty expires (including the 24 hour grace period) and no answer has two upvotes or more, the bounty will expire without any points being awarded (the bountier will not recoup any of the points either). If one of the answers has more two upvotes or more, it will receive half of the bounty points if the bounty expires without being awarded.</p>\n\n<p>As per <a href=\"https://apple.stackexchange.com/help/bounty\">these docs</a>.</p>\n","OwnerUserId":"180636","LastEditorUserId":"5472","LastEditDate":"2017-02-16T02:18:22.020","LastActivityDate":"2017-02-16T02:18:22.020","CommentCount":"0"},{"Id":"2977","PostTypeId":"1","CreationDate":"2017-02-21T13:25:41.190","Score":"1","ViewCount":"32","Body":"<p><a href=\"https://apple.stackexchange.com/questions/273707/if-i-use-cmd-c-on-my-iphone-the-information-is-stored-even-after-restart-but\">If I use CMD + C on my iPhone the information is stored even after restart. But not on Notebook. Why?</a></p>\n\n<p>The question is about the situation - where the same action works differently on iPhone and MacBook.</p>\n\n<p>If someone know the difference of OS implementation for iPhone and MacBook for this case he can also answer this question. If not - than the question cannot be answered.</p>\n\n<p>There is nothing to do with different opinions.</p>\n","OwnerUserId":"220880","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-02-21T15:22:29.063","Title":"Question was put on hold as opinion based","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2978","PostTypeId":"2","ParentId":"2977","CreationDate":"2017-02-21T15:22:29.063","Score":"1","Body":"<p>Only Apple employees know why Apple decides to do something one way or the other, and they usually are not talking about it. That's why questions about why Aplle does this or that are off-topic (as documented in the help center). </p>\n\n<p>Specifically for the linked question: this can be answered with \"because Apple decided to implement it that way\". You probably agree that this isn't really helpful. </p>\n","OwnerUserId":"9058","LastActivityDate":"2017-02-21T15:22:29.063","CommentCount":"4"},{"Id":"2979","PostTypeId":"1","CreationDate":"2017-02-24T01:07:28.827","Score":"0","ViewCount":"42","Body":"<p>I think there should be a tag that can be used for questions that are about using apple's adapters, e.g. ethernet to thunderbolt for example.</p>\n\n<p>Questions that might benefit:</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/262354/can-i-charge-a-macbook-pro-2016-with-a-macbook-power-adapter\">Can I charge a MacBook Pro 2016 with a MacBook power adapter?</a><br>\n<a href=\"https://apple.stackexchange.com/questions/214995/how-to-use-3rd-party-usb-ethernet-adapter-with-el-capitan\">How to use 3rd-party USB Ethernet adapter with El Capitan</a><br>\n<a href=\"https://apple.stackexchange.com/questions/229103/how-can-i-troubleshoot-or-reset-a-thunderbolt-ethernet-adapter\">How can I troubleshoot or reset a Thunderbolt Ethernet adapter?</a><br>\n<a href=\"https://apple.stackexchange.com/questions/225339/magsafe-to-usb-c-converter-for-charging-macbook-pro-2016\">Magsafe to USB-C converter for charging Macbook Pro 2016</a><br>\n<a href=\"https://apple.stackexchange.com/questions/233798/can-one-buy-an-ethernet-and-hdmi-thunderbolt-adapter\">Can one buy an Ethernet and HDMI Thunderbolt adapter?</a><br>\n<a href=\"https://apple.stackexchange.com/questions/54808/apple-usb-ethernet-adapter-is-not-detected\">Apple USB ethernet adapter is not detected</a><br>\n<a href=\"https://apple.stackexchange.com/questions/274156/does-gigabit-ethernet-to-thunderbolt-adapter-work-with-old-ethernet\">Does gigabit ethernet to thunderbolt adapter work with old ethernet?</a><br>\n<a href=\"https://apple.stackexchange.com/questions/54137/do-any-usb-3-0-to-gigabit-ethernet-adapter-work-with-os-x\">Do any USB 3.0 to Gigabit Ethernet adapter work with OS X?</a><br>\n<a href=\"https://apple.stackexchange.com/questions/252752/mac-screen-goes-off-and-on-after-hdmi-to-vga-adapter-is-connected-no-image\">Mac screen goes off and on after HDMI to VGA adapter is connected - no image</a><br>\n<a href=\"https://apple.stackexchange.com/questions/94402/force-os-x-to-use-bluetooth-dongle-instead-of-built-in-controller\">Force OS X to use Bluetooth dongle instead of built in controller</a>  </p>\n","OwnerUserId":"150109","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-02-26T04:59:22.497","Title":"Generic dongle/adapter tag?","Tags":"<feature-request><tags>","AnswerCount":"1","CommentCount":"4"},{"Id":"2981","PostTypeId":"1","CreationDate":"2017-02-25T22:51:49.867","Score":"3","ViewCount":"32","Body":"<p>I presume it is some kind of mechanism to help me keep track of things for later revisiting.  I see I can click to change the state of the star.  But I don't think star is the right name for this thing, as I can't find \"star\" in the help or Meta.  I've looked in my profile too.  </p>\n\n<p>I am most interested in going back to the questions that I have clicked the star in earlier.</p>\n\n<p><a href=\"https://i.stack.imgur.com/Bu0jB.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/Bu0jB.png\" alt=\"screen shot with star highlighted\"></a></p>\n","OwnerUserId":"33075","LastActivityDate":"2017-02-25T22:59:54.700","Title":"What is the star I see under the question down arrow?","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2982","PostTypeId":"2","ParentId":"2981","CreationDate":"2017-02-25T22:53:15.527","Score":"6","Body":"<p>The star indicates things that are called <strong>favourites</strong> (\"or <strong>favorites</strong>\") in the documentation and interface.  </p>\n\n<p>The help guide explains how to search within your favorites: <a href=\"https://apple.stackexchange.com/help/searching\">https://apple.stackexchange.com/help/searching</a></p>\n","OwnerUserId":"33075","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-02-25T22:59:54.700","CommentCount":"3"},{"Id":"2983","PostTypeId":"2","ParentId":"2979","CreationDate":"2017-02-26T04:59:22.497","Score":"2","Body":"<p>Tags exist to help with filtering: people who want to find or not see questions about particular topics use tags to do this. While it is quite conceivable that someone might be an expert on or uninterested in Thunderbolt or USB or Ethernet, I don't see who the population would be that would be interested or uninterested in dongles generically.  This, I suggest that in the absence of evidence demonstrating that population exists, we are better off without this tag. </p>\n","OwnerUserId":"9388","LastActivityDate":"2017-02-26T04:59:22.497","CommentCount":"4"},{"Id":"2984","PostTypeId":"1","AcceptedAnswerId":"2987","CreationDate":"2017-03-01T18:32:51.947","Score":"3","ViewCount":"54","Body":"<p>I had asked a question on the IoT and they immediately migrated it over to Ask Different, where it sat for a while (almost 2 weeks) and no answers.</p>\n\n<p>A moderator from Ask Different thought it should be asked again in IoT and told me how to do it, which I did. I flagged my question, deleted it, and when that happened, I reopened the question \"A splitter to carry more than just audio\"</p>\n\n<p>Well today I was beaten up pretty bad, from asking a duplicate question to being off topic, then when asked what I though IoT meant I answered it and was, well, told lawyering will not help.</p>\n\n<p>I'm a member of very small group of developers, including the creator of SpriteBASIC and Mike Westerfield, who wrote techBASIC, and basically wrote the book on IoT.</p>\n\n<p>I knew he was trying very hard to finish his new book, and I had already wrote him a lengthy paper about math and number in techBASIC, but I decided that I needed an expert to see if there was an answer, so I asked him the question as written here and he responded back.</p>\n\n<p>I flagged the moderator telling what happened over at IoT and that I had an answer. It isn't pretty but a starting point, and asked for him to undelete and unlock so I can anwser the question here.</p>\n\n<p>However, my question is still locked.</p>\n\n<p>How do I go about getting it unlocked so I can answer the question which may start more people helping me or at least I will have an answer to close out the question and get my dignity back (I lost all my reputation points in the IoT, I will not repeat any comments as this is not the place for it).</p>\n\n<p>I would like a positive outcome on this.</p>\n\n<p>Also, besides writing a request here, it there a way that the person who asked the question can request it be unlocked by allowing him to flag the unlock itself? Or something that would be done in a way that would not require a request here or in a chat (not everyone has chat privileges).</p>\n","OwnerUserId":"223717","LastEditorUserId":"37797","LastEditDate":"2017-03-01T19:25:42.147","LastActivityDate":"2017-03-01T20:41:11.333","Title":"Migration rejection followed by repost on original site closed as duplicate, how do I proceed?","Tags":"<discussion><support><questions><asking-questions>","AnswerCount":"1","CommentCount":"10"},{"Id":"2985","PostTypeId":"1","CreationDate":"2017-03-01T19:01:39.107","Score":"2","ViewCount":"30","Body":"<p>It is discouraging to type all your work in the comment field, and then have it time out.  It legitimately took me that long because I was doing some research.  </p>\n\n<p>There's no timer or progress bar, so you don't know there's a limit until you're over it. </p>\n\n<p>I understand the need for some sort of timeout, but could it please be a bit longer?  I imagine 5 minutes is difficult for disabled people who have trouble typing rapidly. </p>\n","OwnerUserId":"104492","LastEditorUserId":"37797","LastEditDate":"2017-03-01T19:04:08.613","LastActivityDate":"2017-03-01T19:04:08.613","Title":"What's up with the 5 minute limit on editing a comment?","Tags":"<feature-request><comments>","AnswerCount":"1","CommentCount":"0"},{"Id":"2986","PostTypeId":"2","ParentId":"2985","CreationDate":"2017-03-01T19:03:59.163","Score":"4","Body":"<p>If you really need more than 5 minutes to edit a comment, delete the comment and comment again. The limit is there to prevent people rewriting history, by altering a comment which has already been replied to or to which other action has been taken because of it. The 5 minute limit matches the grace period for post edits that don't cause a revision.</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-03-01T19:03:59.163","CommentCount":"1"},{"Id":"2987","PostTypeId":"2","ParentId":"2984","CreationDate":"2017-03-01T19:07:24.797","Score":"5","Body":"<p>Sorry, the locking was my mistake. I was handling the flag while on the commute back home and didn't realize that the question was both deleted <em>and</em> locked. It's unlocked now.</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-03-01T19:07:24.797","CommentCount":"2"},{"Id":"2989","PostTypeId":"1","AcceptedAnswerId":"2990","CreationDate":"2017-03-06T02:03:20.223","Score":"9","ViewCount":"133","Body":"<p>After digging around on the badges page, I came across the fact that there hasn't been an election on the site since 2013. Is there a reason for that or is it just an error?</p>\n","OwnerUserId":"191432","LastEditorUserId":"37797","LastEditDate":"2017-03-12T20:42:12.900","LastActivityDate":"2017-03-12T20:42:12.900","Title":"No more elections?","Tags":"<discussion><moderators><election>","AnswerCount":"1","CommentCount":"10"},{"Id":"2990","PostTypeId":"2","ParentId":"2989","CreationDate":"2017-03-06T20:21:35.403","Score":"6","Body":"<p>Just to answer this and summarize what already came up in the comments:</p>\n\n<ul>\n<li>Different SE sites have different number of moderators, there is no fixed number of moderator slots. The size of the moderator team is primarily driven by the overall workload of moderating the site (which again depends on the activity level of the site itself, the number of higher-rep users doing mod duties etc.). StackOverflow currently has 22 moderators :-) </li>\n<li><p><a href=\"https://meta.stackexchange.com/questions/99512/when-do-moderator-elections-take-place\">When do moderator elections take place?</a> has more detail, especially</p>\n\n<blockquote>\n  <p>Most elections are scheduled as a result of moderators reaching out to Stack Exchange to ask for additional help.</p>\n</blockquote></li>\n<li>Also, <a href=\"https://meta.stackexchange.com/questions/278633/moderators-are-elected-for-life-yet-we-hold-regular-elections-how-come\">Moderators are elected for life, yet “We hold regular elections”. How come?</a> might give some more information on this</li>\n</ul>\n\n<p>Specifically for AskDifferent, the mod workload is rather low, especially thanks to all the higher-rep users who take a lot of work off our shoulders. Unless this changes (and/or unless one or two of the current mods decide to step down) there isn't an urgent need to grow the moderator team.</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2017-03-06T20:21:35.403","CommentCount":"3"},{"Id":"2991","PostTypeId":"1","AcceptedAnswerId":"2992","CreationDate":"2017-03-13T06:17:07.720","Score":"2","ViewCount":"33","Body":"<p><strong>I've only been having this problem for the past few days</strong>, but since it hasn't resolved itself I thought I'd post here to see if it's been reported.</p>\n\n<p>Basically, my review counter seems to be out of whack. For example, I refer to the image below:</p>\n\n<p><a href=\"https://i.stack.imgur.com/0pRae.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/0pRae.png\" alt=\"enter image description here\"></a></p>\n\n<p>As you can see, it's showing nine items in the queue. However, when I go in to review the items, I see a tally of zero next to all the review queues. In some cases there are some items to review, but these do not add to the total shown in the counter (but this I understand as the queue may just be getting cleared).</p>\n\n<p>However, I know there is an issue here because as I type this, the review counter is still showing 9 but upon going to review the items they all have a tally of zero (and I've tested this fact in multiple browsers on multiple Macs).</p>\n\n<p>So, has this been reported? Is it only affecting Ask Different, or is it across the Stack Exchange network?</p>\n","OwnerUserId":"168832","LastEditorUserId":"41177","LastEditDate":"2017-03-13T13:56:17.227","LastActivityDate":"2017-03-13T13:56:17.227","Title":"Incorrect review 'counter'","Tags":"<support><review-page>","AnswerCount":"1","CommentCount":"4"},{"Id":"2992","PostTypeId":"2","ParentId":"2991","CreationDate":"2017-03-13T08:39:38.647","Score":"5","Body":"<p>The top bar counter isn't specific to your user, whilst the /review page counters are. This means…</p>\n\n<ul>\n<li>Reviewing a post in the queue that still requires 1+ other users review too, you won't see the review task any more on /review but it'll still increment the top bar counter.</li>\n<li>If you've reviewed a post outside of a queue, you won't be able to review it again.</li>\n<li>This doesn't apply to you, but also &lt;5k reputation users see tag wiki suggested edits increment the top bar but won't be shown in /review.</li>\n<li>…and of course some <a href=\"http://shouldiblamecaching.com\" rel=\"nofollow noreferrer\">copious caching</a>.</li>\n</ul>\n\n<p><a href=\"/questions/tagged/status-bydesign\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;status-bydesign&#39;\" rel=\"tag\">status-bydesign</a></p>\n","OwnerUserId":"37797","LastActivityDate":"2017-03-13T08:39:38.647","CommentCount":"2"},{"Id":"2993","PostTypeId":"1","CreationDate":"2017-03-23T02:24:40.753","Score":"2","ViewCount":"32","Body":"<p>It is a minor matter of comfort, but can I customize the Markdown editor on Ask Different?</p>\n\n<p>In part of my research, I clicked my avatar at the top and then Settings > Preferences.  On that page there is a Keyboard shortcuts option, but that is not what I am after.  </p>\n\n<p>I am very used to the key bindings that Safari provides on other sites, or even in the \"Search Q&amp;A\" box and the Title on Stack Exchange sites.  Some work but others do not.  For example, Control-K to kill to the end of the line gets intercepted for entering preformatted text, and Control-B to move Backward one character gets intercepted for strong text.  I am afraid I am an old school Emacser who prefers Control-B to left-arrow sometimes.  </p>\n\n<p>I have some tolerable work-arounds for this, so I guess I'm mainly interested if there is a setting I haven't found, or if it is worthwhile making a feature request to our gracious hosts.  </p>\n","OwnerUserId":"33075","LastEditorUserId":"37797","LastEditDate":"2017-03-25T17:21:19.847","LastActivityDate":"2017-03-25T17:21:19.847","Title":"Can I customize the Markdown editor's keyboard shortcuts?","Tags":"<feature-request><editor>","AnswerCount":"1","CommentCount":"4","FavoriteCount":"1"},{"Id":"2994","PostTypeId":"2","ParentId":"2993","CreationDate":"2017-03-25T17:20:44.950","Score":"2","Body":"<p>This is what I have found so far. The WMD's event listener function is anonymous, which means it can't be removed with <code>.removeEventListener(type, listener)</code>, and jQuery's <code>.off()</code> doesn't seem to have any effect, but I don't have enough experience with jQuery.</p>\n\n<p>To remove all event listeners, I can use <code>$0.outerHTML = $0.outerHTML;</code> to replace the element, however this breaks the buttons on the toolbar.</p>\n\n<p>The relevant section of code from the WMD (beautified) is:</p>\n\n\n\n<pre><code>var y = \"keydown\";\ng.isOpera &amp;&amp; (y = \"keypress\"), c.addEvent(v, y, function(e) {\n    if ((e.ctrlKey || e.metaKey) &amp;&amp; !e.altKey &amp;&amp; !e.shiftKey) {\n        var t = e.charCode || e.keyCode,\n            n = String.fromCharCode(t).toLowerCase();\n        switch (n) {\n        […]\n        case \"k\":\n            l(b.code);\n            break;\n        case \"g\":\n            l(b.image);\n            break;\n        […]\n        default:\n            return\n        }\n        e.preventDefault &amp;&amp; e.preventDefault(), window.event &amp;&amp; (window.event.returnValue = !1)\n    }\n})\n</code></pre>\n","OwnerUserId":"37797","LastActivityDate":"2017-03-25T17:20:44.950","CommentCount":"0"},{"Id":"2995","PostTypeId":"1","CreationDate":"2017-03-28T20:33:16.720","Score":"7","ViewCount":"180","Body":"<p><a href=\"https://apple.stackexchange.com/questions/277800/why-does-the-larger-ipad-pro-support-fewer-lte-bands-than-the-smaller-one\">Why does the larger iPad pro support fewer LTE bands than the smaller one?</a></p>\n\n<p>This was VTC'd despite not being \"based on opinion, rather than facts, references, or specific expertise.\" In specific, the accepted answer <strong>which was accepted before the last two close votes came in</strong>, is purely factual and not opinion based in any way.</p>\n\n<p>I take issue with the idea of a discussion about hardware design, something that's as concrete as it gets, being closed in this fashion, especially when the answer boils down to \"it's an older device\". Also acceptable would have been size/battery life/etc concerns, but you'll note that neither of those are opinion based either.</p>\n","OwnerUserId":"50295","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-04-03T21:34:48.480","Title":"Why was my question closed asking why Apple didn’t implement a hardware feature in a specific device?","Tags":"<discussion><closed-questions>","AnswerCount":"5","CommentCount":"1"},{"Id":"2996","PostTypeId":"2","ParentId":"2995","CreationDate":"2017-03-28T20:53:37.907","Score":"3","Body":"<p>\"Why does Apple do this or that\" kind of questions are off-topic because nobody outside Apple knows for sure and any answer given is a speculation (or sometimes a lucky guess) and therefore an opinion. Even the answer to your now-closed question suggests that only Apple knows for sure.</p>\n\n<p>Sometimes these kind of questions can be rewritten in a form which doesn't rely on insider information from Apple to given an answer. I can only encourage everybody asking a \"why does Apple do things the way they do\" to consider that approach. In your case this could be something like asking for specific differences in the the models which influence the number of supported bands, or asking for limiting factors regarding of number of bands. </p>\n","OwnerUserId":"9058","LastEditorUserId":"9058","LastEditDate":"2017-03-29T05:48:21.820","LastActivityDate":"2017-03-29T05:48:21.820","CommentCount":"0"},{"Id":"2998","PostTypeId":"2","ParentId":"2995","CreationDate":"2017-03-29T08:01:42.430","Score":"1","Body":"<p><a href=\"https://apple.stackexchange.com/review/close/200176\">I voted to leave this question open in the queue</a> and have voted to reopen again now. I disagree that this question is opinion-based and when I saw the question in the review queue I was going to answer with something similar to the answer that was given. The question <em>can</em> be read as asking why Apple made some design decision, which is likely opinion-based, however this question is not written like this.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2017-03-29T08:01:42.430","CommentCount":"3"},{"Id":"2999","PostTypeId":"2","ParentId":"2995","CreationDate":"2017-03-29T14:01:27.723","Score":"7","Body":"<p>I voted to close the question as primarily opinion based.</p>\n\n<p>When I reviewed the question, I saw that you pointed out two iPads with 'theoretical maximums' and asked 'why is the larger unit restricted?'.</p>\n\n<p>My reading of that was that it could only be answered by someone who participated in the design and development of those devices.  That would be Apple.  As such, the question was considered off-topic because questions regarding why Apple does/doesn't do this as well as why they do what they do can only be answered by Apple.</p>\n","OwnerUserId":"88313","LastActivityDate":"2017-03-29T14:01:27.723","CommentCount":"1"},{"Id":"3000","PostTypeId":"2","ParentId":"2995","CreationDate":"2017-03-30T05:46:09.593","Score":"-3","Body":"<p>Just rephrase it as \"Are there any objective reasons why the larger iPad Pro would support fewer LTE bands than the smaller one?\" Then it's immune to being closed as subjective or opinion-based, since you've ruled out that kind of answer.</p>\n","OwnerUserId":"2201","LastActivityDate":"2017-03-30T05:46:09.593","CommentCount":"1"},{"Id":"3001","PostTypeId":"5","CreationDate":"2017-03-30T11:49:16.767","Score":"0","Body":"","OwnerUserId":"-1","LastEditorUserId":"-1","LastEditDate":"2017-03-30T11:49:16.767","LastActivityDate":"2017-03-30T11:49:16.767","CommentCount":"0"},{"Id":"3002","PostTypeId":"4","CreationDate":"2017-03-30T11:49:16.767","Score":"0","Body":"For questions about the bounty system, which allows users to spend some of their reputation in order to draw more attention to a question.","OwnerUserId":"121968","LastEditorUserId":"121968","LastEditDate":"2017-04-06T10:56:00.887","LastActivityDate":"2017-04-06T10:56:00.887","CommentCount":"0"},{"Id":"3003","PostTypeId":"1","CreationDate":"2017-04-02T03:50:11.980","Score":"2","ViewCount":"45","Body":"<p><a href=\"https://apple.stackexchange.com/questions/278369/mac-os-10-11-6-no-activity-monitor\">mac os 10.11.6 no activity monitor</a></p>\n\n<p>A very simple question with a very simple answer, yet for some reason, both answers are being provided in the question comments. Both users have a ton of rep (5k and 8k). </p>\n\n<p>Why not just give the answer the usual way? I see this happen a lot, and I'm tempted to just drop a duplicate in the answer box just to boost the all important score. Bad form or..?</p>\n","OwnerUserId":"50295","LastActivityDate":"2017-04-02T16:14:20.227","Title":"Why do people answer questions in the comment box?","Tags":"<discussion>","AnswerCount":"3","CommentCount":"1"},{"Id":"3004","PostTypeId":"2","ParentId":"3003","CreationDate":"2017-04-02T04:12:52.237","Score":"4","Body":"<p>I can't speak for others, but I know I do this when I I am not positive that the answer I give will yield a result. Basically whenever I am suggesting steps to attempt to solve the solution. Sometimes those steps resolve the problem, and thus, I've provided an answer in a comment.</p>\n","OwnerUserId":"178418","LastActivityDate":"2017-04-02T04:12:52.237","CommentCount":"0"},{"Id":"3005","PostTypeId":"2","ParentId":"3003","CreationDate":"2017-04-02T11:02:43.703","Score":"1","Body":"<p>The question you link to is rather unclear actually: is the user not finding Activity Monitor (as the first sentence implied) or are they looking for ways to solve the actual problem of the computer running hot? So it's kind of understandable that people use the comment section to get basic issues out of the way and then focus on the actual problem in the answer.</p>\n\n<p>In other words: Answers in the comment section are a good indicator that the question needs to be improved by editing.</p>\n","OwnerUserId":"9058","LastEditorUserId":"9058","LastEditDate":"2017-04-02T12:16:20.283","LastActivityDate":"2017-04-02T12:16:20.283","CommentCount":"1"},{"Id":"3006","PostTypeId":"2","ParentId":"3003","CreationDate":"2017-04-02T16:14:20.227","Score":"1","Body":"<p>I made my suggestion in the comments and also included a link to an Apple support page because I wasn't sure what the OP's actual problem was.  I was trying to help the OP learn where to find resources to answer their questions (the unedited question stated they were new to Mac).</p>\n\n<p>Should I have asked more probing questions to get a better handle on the question?  Maybe I should've done that and it's a good learning point for me.</p>\n","OwnerUserId":"88313","LastActivityDate":"2017-04-02T16:14:20.227","CommentCount":"0"},{"Id":"3007","PostTypeId":"2","ParentId":"2995","CreationDate":"2017-04-03T21:34:48.480","Score":"1","Body":"<p>I posted the answer and I agree with the closing. In re-reading my answer even it was opinion-based due to the opinion-based nature of the question. When I have to couch an answer with, \"only Apple knows for sure,\" it's a pretty clear flag it's opinion based.</p>\n","OwnerUserId":"122324","LastActivityDate":"2017-04-03T21:34:48.480","CommentCount":"0"},{"Id":"3008","PostTypeId":"1","AcceptedAnswerId":"3009","CreationDate":"2017-04-03T23:48:59.353","Score":"8","ViewCount":"67","Body":"<p>I've been wondering this for a while and thought it was time I sought some guidance. </p>\n\n<p>Often when I review a low quality post I will add a comment such as the one below:</p>\n\n<blockquote>\n  <p>Welcome to Ask Different and thank you for your answer. :) Unfortunately, short answers such as this don't really provide enough detail or context to help many users. If possible, it'd be good if you could add some more info on how tabbing 20 or so times will address this issue. Also, you may want to read <a href=\"https://apple.stackexchange.com/questions/how-to-answer\">How to Answer</a> for tips on providing answers here.</p>\n</blockquote>\n\n<p>Now, after adding the comment I still have to choose between: </p>\n\n<ul>\n<li>Looks OK</li>\n<li>Edit</li>\n<li>Recommend Deletion, or </li>\n<li>Skip.</li>\n</ul>\n\n<p>Obviously to me the answer is not okay, and I can't edit it because I haven't come across this 'solution' before. I also don't want to Skip this as I feel it needs addressing. So this leaves me with no choice but to recommend deletion.</p>\n\n<p>My concern is, if I select Recommend Deletion then perhaps we end up deleting an answer that actually resolves the issue for the OP. And, we potentially delete an answer before the user gets the chance to edit/improve it.</p>\n\n<p>So I guess I'm after guidance on what has been established as best practice in these situations?</p>\n","OwnerUserId":"168832","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-04-04T06:24:16.597","Title":"Reviewing 'low quality posts' - when to recommend deletion of answer","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"3009","PostTypeId":"2","ParentId":"3008","CreationDate":"2017-04-04T06:24:16.597","Score":"9","Body":"<p>\"It's ok\" is sometimes more a \"I'm done with reviewing this post\" than a \"The post is ok\".</p>\n\n<p>You think the post is valid but may need some editing, so leave a comment and move on. Flagging it for deletion <em>will</em> lead to deletion (at least if other users agree), if that is not what you want don't click on it :-)</p>\n\n<p>The basic rule I usually apply is: \"is the user trying to move the topic forward by at least attempting to provide an answer.\" If yes, then there is no reason to delete the answer. </p>\n","OwnerUserId":"9058","LastActivityDate":"2017-04-04T06:24:16.597","CommentCount":"2"},{"Id":"3010","PostTypeId":"1","CreationDate":"2017-04-04T16:13:53.280","Score":"-3","ViewCount":"49","Body":"<p>Instead of doing sftp, we can go to Finder and connect to server using <code>ftps://somesite.com</code>.  So <a href=\"https://apple.stackexchange.com/questions/tagged/ftps\" class=\"post-tag\" title=\"show questions tagged &#39;ftps&#39;\" rel=\"tag\">ftps</a> should be a valid tag if the user is inquiring about it.</p>\n\n<p>The question is at: <a href=\"https://apple.stackexchange.com/questions/278627/after-connecting-to-a-server-using-ftps-somesite-com-the-files-cannot-be-dragg\">After connecting to a server using ftps://somesite.com the files cannot be dragged and dropped there?</a></p>\n","OwnerUserId":"2334","LastEditorUserId":"37797","LastEditDate":"2017-04-05T14:57:06.740","LastActivityDate":"2017-04-05T14:57:06.740","Title":"Should we have an [ftps] tag?","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"4"},{"Id":"3011","PostTypeId":"2","ParentId":"3010","CreationDate":"2017-04-05T14:48:51.993","Score":"4","Body":"<p>I don't think we need a specific <a href=\"https://apple.stackexchange.com/questions/tagged/ftps\" class=\"post-tag\" title=\"show questions tagged &#39;ftps&#39;\" rel=\"tag\">ftps</a> tag right now. The question you linked just happens to be using FTPS, rather than being about FTPS. There's no questions I can find which are specific to the secure version of FTP — only about FTP in general. The standard tag of <a href=\"https://apple.stackexchange.com/questions/tagged/ftp\" class=\"post-tag\" title=\"show questions tagged &#39;ftp&#39;\" rel=\"tag\">ftp</a> will suffice.</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-04-05T14:48:51.993","CommentCount":"2"},{"Id":"3012","PostTypeId":"1","AcceptedAnswerId":"3013","CreationDate":"2017-04-09T23:25:25.570","Score":"5","ViewCount":"40","Body":"<p>I'm trying to familiarise myself with how Chat works and came across the ability to view a transcript. I noticed, however, this appears to only be a day-by-day view of the chat transcript.</p>\n\n<p>This got me wondering whether it was possible to actually download a transcript? If so, how?</p>\n\n<p>My thinking is that in some cases users may want to peruse a transcript while offline, or perhaps want to view a transcript for a particular month rather than a single day, that sort of thing.</p>\n","OwnerUserId":"168832","LastEditorUserId":"37797","LastEditDate":"2017-04-10T17:56:59.183","LastActivityDate":"2017-04-10T17:56:59.183","Title":"Downloading chat transcripts","Tags":"<support><chat>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"3013","PostTypeId":"2","ParentId":"3012","CreationDate":"2017-04-09T23:56:58.057","Score":"5","Body":"<p>There is no easy way to do it. Right now your sole option is to visit the transcript(s) you want to download then save the pages themselves locally through your browser (<em>File &rarr; Save As</em> or whatever). You'll have to do this individually for every day you want to save.</p>\n\n<p>The general form of the transcript URLs (that the <em>View Transcripts</em> link takes you to), if you ever want to visit one directly, is:</p>\n\n<pre><code>http://chat.meta.stackexchange.com/transcript/89/2017/4/6/0-21\n</code></pre>\n\n<p>Where, taking the parts of that example:</p>\n\n<ul>\n<li><code>chat.meta.stackexchange.com</code> is the chat server (SE has a few).</li>\n<li><code>89</code> is the chat room ID.</li>\n<li><code>2017</code> is the year.</li>\n<li><code>4</code> is the month.</li>\n<li><code>6</code> is the day.</li>\n<li><code>0-21</code> is the time of day to view the transcript for.</li>\n</ul>\n\n<p>So one tiny trick you can use is for busy rooms where the transcript of a day is divided into time blocks, just use <code>0-24</code> on the end and you can view the whole day. That's about as much as you get in terms of shortcuts.</p>\n\n<p>That said, incidentally, I wrote a utility to scrape <em>all</em> the transcripts of a given room recently, and plan on creating a little web application in the very near future to let folks browse chat transcripts and search chat more easily (and pull fun stats, like emoji leader boards and such). I'll try to remember to post back here when I do, or just ping me in <a href=\"http://chat.meta.stackexchange.com/rooms/89/tavern-on-the-meta\">The Tavern</a>.</p>\n\n<p>But, other than writing your own tool to scrape transcripts, no, there's no way to mass download transcripts aside from visiting each day and just saving the page (which might be just fine for your needs).</p>\n\n<p>Note that there's also a <em>Load to my last message</em> button on the main chat window, so if you're trying to catch up, sometimes that button is helpful (but not always), and you can save the web page to your computer if you want to read it later.</p>\n","OwnerUserId":"99938","LastActivityDate":"2017-04-09T23:56:58.057","CommentCount":"2"},{"Id":"3014","PostTypeId":"1","CreationDate":"2017-04-18T11:55:42.587","Score":"3","ViewCount":"56","Body":"<p><a href=\"https://apple.stackexchange.com/questions/279056/how-to-stop-macos-sierra-from-using-background-data\">How to Stop MacOS sierra from using background Data?</a> is the only question to have the tag <a href=\"https://apple.stackexchange.com/questions/tagged/untagged\" class=\"post-tag\" title=\"show questions tagged &#39;untagged&#39;\" rel=\"tag\">untagged</a>.</p>\n\n<p>As this tag makes no sense I tried to do the normal edit of the question to tag it correctly.</p>\n\n<p>However as it is locked I can't. Can a moderator please remove the tag?</p>\n","OwnerUserId":"237","LastEditorUserId":"37797","LastEditDate":"2017-04-18T12:11:35.657","LastActivityDate":"2017-08-16T15:24:11.730","Title":"Remove [untagged] tag from locked question","Tags":"<support><tags>","AnswerCount":"1","CommentCount":"2","FavoriteCount":"0"},{"Id":"3015","PostTypeId":"2","ParentId":"3014","CreationDate":"2017-04-18T12:57:28.913","Score":"0","Body":"<p>Thanks. This happens when a question is migrated in to the site. The system makes an \"untagged\" tag if none exist so us deleting the tag isn't going to prevent this tomorrow when the next migration happens.</p>\n\n<p>The best thing for you and others to do is to edit the question to have the correct tags for here - anyone can do that. If the question needs other edits to clarify or fix syntax, do that as well.</p>\n\n<p>Worst case - you can vote to close the question if it's not up to the site standards or ask here like you did.</p>\n\n<p>Thanks for the heads up the question needs an edit. If it's not already fixed, I'll have a pass at editing / closing it.</p>\n","OwnerUserId":"5472","LastActivityDate":"2017-04-18T12:57:28.913","CommentCount":"3"},{"Id":"3016","PostTypeId":"1","AcceptedAnswerId":"3017","CreationDate":"2017-04-20T14:56:56.357","Score":"2","ViewCount":"57","Body":"<p>The OP created multiple questions for the same issue.  I flagged <a href=\"https://apple.stackexchange.com/questions/281314/how-can-i-tell-if-my-iphone-has-been-hacked-or-tampered-with\">this one</a> for mod attention with the comment: </p>\n\n<blockquote>\n  <p>This question is a repost of the OPs same question:\n  apple.stackexchange.com/questions/281274/…</p>\n</blockquote>\n\n<p>The flag was declined with the explanation:</p>\n\n<blockquote>\n  <p>declined - Duplicate only applies if the original question has\n  answers.</p>\n</blockquote>\n\n<p>I didn't think I flagged it as 'duplicate', because the original question didn't have an answer, but maybe I did (if so, that was a mistake).  </p>\n\n<p>The question is now closed as a duplicate which is why I flagged it for Mod attention in the first place.</p>\n\n<p>Can I get the 'declined' flag off my account?</p>\n","OwnerUserId":"88313","LastEditorUserId":"37797","LastEditDate":"2017-04-21T11:12:34.190","LastActivityDate":"2017-04-23T18:31:16.200","Title":"'Mod attention' flag declined for question marked as Duplicate","Tags":"<support><flagging>","AnswerCount":"1","CommentCount":"1","FavoriteCount":"1"},{"Id":"3017","PostTypeId":"2","ParentId":"3016","CreationDate":"2017-04-21T19:01:35.510","Score":"2","Body":"<p>I probably would have accepted it, as did the mod who handled the second \"duplicate\" flag. It mainly shows that mods are humans too :-)</p>\n\n<p>As for the declined flag: Declined flags can't be removed, see <a href=\"https://meta.stackexchange.com/questions/138674/can-a-flag-decision-be-reversed\">Can a flag decision be reversed?</a> and <a href=\"https://meta.stackexchange.com/questions/136876/can-a-declined-flag-be-reverted-or-removed-from-history\">Can a declined flag be reverted or removed from history?</a> for details. You shouldn't worry about any negative effects here. The badges we have for flagging only count helpful flags, and if you keep flagging well this won't matter at all. I have a few declined flags myself, and they didn't hurt me in any way.</p>\n","OwnerUserId":"9058","LastEditorUserId":"37797","LastEditDate":"2017-04-23T18:31:16.200","LastActivityDate":"2017-04-23T18:31:16.200","CommentCount":"1"},{"Id":"3018","PostTypeId":"1","AcceptedAnswerId":"3019","CreationDate":"2017-05-15T13:48:07.130","Score":"0","ViewCount":"12","Body":"<p><a href=\"https://unix.stackexchange.com/questions/364976/how-to-change-bsds-file-birth-time-aka-btime\">https://unix.stackexchange.com/questions/364976/how-to-change-bsds-file-birth-time-aka-btime</a></p>\n\n<p>I posted a Q about how to set btime (BSD's file Birth time) on files. I'm wondering if the community here thinkgs this might be a better fit here. No one has close voted over on Unix, but I don't want to just cross post it here :)</p>\n","OwnerUserId":"90218","LastEditorUserId":"37797","LastEditDate":"2017-05-15T14:05:30.967","LastActivityDate":"2017-05-15T14:05:30.967","Title":"Question about setting btime - would this question I posted over on the Unix stack be better here?","Tags":"<discussion><site-scope>","AnswerCount":"1","CommentCount":"2"},{"Id":"3019","PostTypeId":"2","ParentId":"3018","CreationDate":"2017-05-15T13:56:02.867","Score":"1","Body":"<p>Thanks for asking, and for avoiding a cross-post.</p>\n\n<p>Generally the question seems to be on-topic on both sites (at least as long as you are looking for end user solutions and don't want to develop your own piece of code). So if you don't get an answer on the Unix site, please flag it and have a moderator over there migrate it to AD.</p>\n\n<p>PS: And yes, seems like you've already found the two questions relating to the topic :-)</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-05-15T13:56:02.867","CommentCount":"1"},{"Id":"3020","PostTypeId":"1","AcceptedAnswerId":"3021","CreationDate":"2017-05-15T13:46:01.643","Score":"2","ViewCount":"41","Body":"<p>I just opened a account here on apple.stackexchange.com. I know the rules and was ready to answer some questions when I noticed that I am not allowed to answer any questions at all. </p>\n\n<p>In the following picture I circled what I see: the link leads me to questions where all of them have this warning. Basically it's a loop. It leads me to questions that I can't answer because the community blocked low rep people. I can't find a single question that isn't blocked.</p>\n\n<p><a href=\"https://i.stack.imgur.com/SNfmc.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/SNfmc.png\" alt=\"\"></a></p>\n\n<p>If someone could please confirm this and help me with this it would awesome. </p>\n","OwnerUserId":"237754","OwnerDisplayName":"DeerSpotter","LastEditorUserId":"37797","LastEditDate":"2017-05-15T16:15:37.920","LastActivityDate":"2017-05-15T16:17:08.807","Title":"I can't answer anything on Apple.SE so there is no way to gain reputation now","Tags":"<support><questions>","AnswerCount":"1","CommentCount":"3"},{"Id":"3021","PostTypeId":"2","ParentId":"3020","CreationDate":"2017-05-15T15:57:04.053","Score":"3","Body":"<p>You can answer questions, except for a tiny percentage which are protected.</p>\n\n<p>The question in your screenshot was protected automatically since there were many answers posted to that question which did not answer the question (spam, \"me too\", \"thanks\", etc) and have since been removed.</p>\n\n<p>For more information about protected questions, see <a href=\"https://meta.stackexchange.com/questions/52764/what-is-a-protected-question\">What is a “protected” question?</a>.</p>\n\n<p>If you want to provide an answer to a protected question, ask in <a href=\"http://chat.stackexchange.com/rooms/38/ask-different-chat\">chat</a> for it to be unprotected. Otherwise, look for other questions which are not protected. You can find unprotected questions by searching for ‘<a href=\"https://apple.stackexchange.com/search?tab=newest&amp;q=is%3aquestion%20hasnotice%3ano\">is:question hasnotice:no</a>’.</p>\n","OwnerUserId":"37797","OwnerDisplayName":"grgarside","LastEditorUserId":"37797","LastEditDate":"2017-05-15T16:17:08.807","LastActivityDate":"2017-05-15T16:17:08.807","CommentCount":"1"},{"Id":"3022","PostTypeId":"1","CreationDate":"2017-05-17T10:12:26.810","Score":"15","ViewCount":"139","Body":"<p>Users who have joined Ask Different will see the <em>Answers for your Apple questions</em> description at top left of all Ask Different pages (see below):</p>\n\n<p><a href=\"https://i.stack.imgur.com/flXC6.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/flXC6.png\" alt=\"enter image description here\"></a></p>\n\n<p>However, new users looking through the list of all Stack Exchange sites see the following description instead:</p>\n\n<p><a href=\"https://i.stack.imgur.com/uEroT.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/uEroT.png\" alt=\"enter image description here\"></a></p>\n\n<p>As you can see, the description they see is: <em>Q&amp;A for power users of Apple hardware and software</em>.</p>\n\n<p>I propose that we change the description used for Ask Different so that potential new users are not scared off from joining/asking questions simply because they think the site is for 'power users'.</p>\n\n<p>More specifically, I propose either of the following:</p>\n\n<p><s> <strong>Proposal 1</strong> - Replace the description on the list of sites so that it matches the description used on the actual site (i.e. we use <em>Answers for your Apple questions</em> as the description in both locations).</s></p>\n\n<ul>\n<li><p><strong>Proposal 2</strong> - Edit the description on the list of sites so that the word 'power' is removed and it now reads <em>Q&amp;A for users of Apple hardware and software</em>.</p></li>\n<li><p><strong>Proposal 3</strong> - Edit the description on the list of sites so that it now reads <em>Q&amp;A for enthusiasts and power users of Apple hardware and software</em>.</p></li>\n</ul>\n\n<p><strong>UPDATE</strong></p>\n\n<ul>\n<li><p>I have removed Proposal 1 based on <a href=\"https://apple.meta.stackexchange.com/a/3024/168832\">grgarside's answer</a>.</p></li>\n<li><p>I have added Proposal 3.</p></li>\n<li><p>Below is some context on why I started thinking about this.</p></li>\n</ul>\n\n<p>Yesterday I answered this <a href=\"https://apple.stackexchange.com/q/283887/168832\">question</a>. It's since been edited, but originally it ended with:</p>\n\n<blockquote>\n  <p>I’m sorry to ask such a newbie question, so if this isn’t the site (your description says “Q&amp;A for power users of Apple hardware and software” and I am no power user), then a link to a resource for Mac newbies would be appreciated.</p>\n</blockquote>\n\n<p>My reading of this is that the OP was hesitant to ask their question here. And, if they felt this way based on our description, then how many others might there be?</p>\n\n<p>Finally, when a new user first goes to sign up, the description appears immediately above the <kbd>sign up</kbd> button (see below) and this may act as a final hurdle.</p>\n\n<p><a href=\"https://i.stack.imgur.com/WYSNI.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/WYSNI.png\" alt=\"enter image description here\"></a></p>\n","OwnerUserId":"168832","LastEditorUserId":"168832","LastEditDate":"2017-05-17T21:45:47.257","LastActivityDate":"2017-05-17T22:05:31.910","Title":"Proposal to change the 'Ask Different' site description on the Stack Exchange list of sites","Tags":"<discussion><site-promotion>","AnswerCount":"4","CommentCount":"8"},{"Id":"3023","PostTypeId":"2","ParentId":"3022","CreationDate":"2017-05-17T17:09:48.000","Score":"0","Body":"<h2>Proposal 1 -- Answers for your Apple questions</h2>\n\n<p>Replace the description on the list of sites so that it matches the description used on the actual site.</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-05-17T17:09:48.000","CommentCount":"1"},{"Id":"3024","PostTypeId":"2","ParentId":"3022","CreationDate":"2017-05-17T19:01:16.747","Score":"1","Body":"<h2>Proposal 0 — It remains as it is.</h2>\n\n<ol>\n<li><p>Proposal 1 isn't suitable: the list of site descriptions are always of the form ‘Q&amp;A for [scope]’.</p></li>\n<li><p>Proposal 2 might be ok, but I don't think it's necessary. Many site descriptions use ‘power’ for the reasons discussed in:</p>\n\n<ul>\n<li><a href=\"https://webmasters.meta.stackexchange.com/questions/1070/why-pro-in-pro-webmasters\">Why “Pro” in “Pro Webmasters”</a>.</li>\n</ul></li>\n</ol>\n\n<p>As for me, (the newly added) <a href=\"https://apple.meta.stackexchange.com/a/3026/37797\">proposal 3</a> sounds good.</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2017-05-17T22:05:31.910","LastActivityDate":"2017-05-17T22:05:31.910","CommentCount":"3"},{"Id":"3025","PostTypeId":"2","ParentId":"3022","CreationDate":"2017-05-17T21:48:04.920","Score":"8","Body":"<h2>Proposal 2 -- Q&amp;A for users of Apple hardware and software</h2>\n\n<p>Edit the description on the list of sites so that the word 'power' is removed and it now reads Q&amp;A for users of Apple hardware and software.</p>\n","OwnerUserId":"168832","LastActivityDate":"2017-05-17T21:48:04.920","CommentCount":"1"},{"Id":"3026","PostTypeId":"2","ParentId":"3022","CreationDate":"2017-05-17T21:49:24.120","Score":"16","Body":"<h2>Proposal 3 -- Q&amp;A for enthusiasts and power users of Apple hardware and software</h2>\n\n<p>Edit the description on the list of sites so that it now reads Q&amp;A for enthusiasts and power users of Apple hardware and software.</p>\n","OwnerUserId":"168832","LastActivityDate":"2017-05-17T21:49:24.120","CommentCount":"0"},{"Id":"3027","PostTypeId":"1","AcceptedAnswerId":"3029","CreationDate":"2017-05-18T21:23:57.077","Score":"5","ViewCount":"56","Body":"<ul>\n<li><a href=\"http://askdifferent.com\">http://askdifferent.com</a> performs a 301 redirect to <a href=\"http://apple.stackexchange.com\">http://apple.stackexchange.com</a>.</li>\n<li><a href=\"https://askdifferent.com\">https://askdifferent.com</a> doesn't work: connection refused.</li>\n</ul>\n\n<p>With the move to HTTPS across Stack Exchange, can the HTTPS redirection be functional?</p>\n\n<p>A more minor related issue: can the redirect from the HTTP redirect <em>directly</em> to the HTTPS URL?</p>\n","OwnerUserId":"37797","LastEditorUserId":"573","LastEditDate":"2017-05-19T14:25:52.627","LastActivityDate":"2017-05-22T16:50:52.987","Title":"askdifferent.com does not redirect when HTTPS","Tags":"<bug><status-planned><https>","AnswerCount":"3","CommentCount":"1"},{"Id":"3028","PostTypeId":"2","ParentId":"3027","CreationDate":"2017-05-18T23:18:08.663","Score":"1","Body":"<p>Let's get this over to the main thread for https transition. </p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/292058/network-wide-https-its-time\">Network-wide HTTPS: It&#39;s time</a></li>\n</ul>\n\n<p>According to the main post we should be <strong>status: done</strong> with only chat not on https. </p>\n","OwnerUserId":"5472","LastActivityDate":"2017-05-18T23:18:08.663","CommentCount":"2"},{"Id":"3029","PostTypeId":"2","ParentId":"3027","CreationDate":"2017-05-19T14:25:44.843","Score":"5","Body":"<p>TL;DR: This will happen as a result of mostly unrelated cleanup efforts.</p>\n\n<hr>\n\n<p>To clarify our position here: there were no plans to make the redirect-only domains available over <code>https://</code>. They were never at any point in time supported, nor do we generate links to them - so all links in existence should be <code>http://</code>.</p>\n\n<p>Even if they were <code>https://</code>, they wouldn't get the benefits of <code>https://</code> anyway, since they're just 301s to the site's real domain). There's really very little reason to take on the certificate complexity and cost to add these additional domains.</p>\n\n<p>Not that being said, this will eventually happen anyway for other reasons. As simply as a side-effect of us shuffling redirects between <a href=\"https://www.name.com/\" rel=\"nofollow noreferrer\">name.com</a> servers and <a href=\"https://www.cloudflare.com/\" rel=\"nofollow noreferrer\">Cloudflare</a> for redirects. We did this for <a href=\"https://miyodeya.com\">miyodeya.com</a> for the purposes of <em>existing</em> SE 1.0 links - since they ever existed, not supporting this on name.com's redirect service was causing (effectively) 404s to actual content.</p>\n\n<p>We moved them to our miscellaneous Cloudflare account for the purposes of redirects, supporting <code>https://</code> is only a side-effect. But, maintaining 2 ways of doing something when 1 is saner/easier (we're almost done automating this) is just silly. So the plan is to move all these domains to Cloudflare. Here's the list:</p>\n\n<ul>\n<li>nothingtoinstall.com</li>\n<li>seasonedadvice.com</li>\n<li>crossvalidated.com</li>\n<li>basicallymoney.com</li>\n<li>chiphacker.com</li>\n<li>brewadvice.com</li>\n<li>askpatents.com</li>\n<li>miyodeya.com</li>\n</ul>\n\n<p>I don't have an exact timeline as the main dev on the sync bits for Cloudflare/page rules is currently moving and out for a little while. Roughly, I'd say in the next month or two.</p>\n","OwnerUserId":"573","LastActivityDate":"2017-05-19T14:25:44.843","CommentCount":"1"},{"Id":"3030","PostTypeId":"1","CreationDate":"2017-05-22T10:08:08.530","Score":"17","ViewCount":"277","Body":"<p>From some brief comments in AD Chat, it appears we currently have one spare slot for a new close reason.</p>\n\n<p>I would like to propose a 'zero research' type reason - though I'm open to suggestions on the precise wording.</p>\n\n<p><a href=\"https://apple.meta.stackexchange.com/users/37797/grgarside\">grgarside</a> mentioned that he already has a standard comment he uses for 'no research on code/applescript' type questions...</p>\n\n<blockquote>\n  <p>Questions asking for code must demonstrate a minimal understanding of the problem being solved. Include attempted solutions, why they didn't work, and the expected results.</p>\n</blockquote>\n\n<p>which I think is fine for that specific case, but I think we need something more generic to cover the 'really didn't bother' questions on all topics.</p>\n\n<p>The <a href=\"https://apple.stackexchange.com/help/how-to-ask\">How to Ask</a> page is already the best place to point these, as research is the opening section, but we have just the already very broad Basic Customer Support close reason pointing to it, which I don't think we need to add more sub-clauses to.</p>\n\n<p>I'm assuming it would need to go in the off-topic closure, which feels a bit odd, but if <em>customer support</em> fits there, then I guess <em>no research</em> could too.</p>\n\n<p>I propose something along the lines of </p>\n\n<blockquote>\n  <p>Questions must demonstrate a reasonable amount of research &amp; understanding of the problem being solved. Please edit to clearly describe your problem and the research done so far to solve it, including attempted solutions, why they didn't work, and the expected results.</p>\n</blockquote>\n\n<p>which is, of course, borrowing heavily from the above.</p>\n\n<p>The floor is open for better suggestions.</p>\n\n<p>Pic of CS close added, just for easy ref &amp; so we can see how it actually looks in situ, rather than just the text.</p>\n\n<p><a href=\"https://i.stack.imgur.com/vugss.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/vugss.png\" alt=\"enter image description here\"></a></p>\n\n<p><strong><em>Edit 29 May:</em></strong></p>\n\n<p>I'm going to keep adding zero effort examples as I find them...</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/285135/combine-merge-two-separate-image-files-of-the-same-thingnewspaper-page-taken-i\">Combine/merge two separate image files of the same thing(newspaper page) taken in half</a></p>\n","OwnerUserId":"85275","LastEditorUserId":"5472","LastEditDate":"2017-06-15T03:38:38.213","LastActivityDate":"2017-06-15T03:38:38.213","Title":"New \"No Research\" close reason?","Tags":"<discussion><feature-request>","AnswerCount":"3","CommentCount":"13"},{"Id":"3031","PostTypeId":"2","ParentId":"3030","CreationDate":"2017-05-22T11:27:57.593","Score":"18","Body":"<p>Proposal ported to answer space for voting purposes/comments...</p>\n\n<blockquote>\n  <p>Questions must demonstrate a reasonable amount of research &amp; understanding of the problem being solved. Please edit to clearly describe your problem and the research done so far to solve it, including attempted solutions, why they didn't work, and the expected results.</p>\n</blockquote>\n","OwnerUserId":"85275","LastActivityDate":"2017-05-22T11:27:57.593","CommentCount":"3"},{"Id":"3032","PostTypeId":"2","ParentId":"3027","CreationDate":"2017-05-22T16:50:52.987","Score":"2","Body":"<p>I have finished automating this, and askdifferent.com redirects should be working much better than they were. I expect all of these urls to properly redirect properly over http and https(possibly pending DNS ttl expiry):</p>\n\n<ul>\n<li><a href=\"https://askdifferent.com/questions/9659\">https://askdifferent.com/questions/9659</a></li>\n<li><a href=\"https://meta.askdifferent.com/questions/3027\" rel=\"nofollow noreferrer\">https://meta.askdifferent.com/questions/3027</a></li>\n<li><a href=\"https://chat.askdifferent.com\" rel=\"nofollow noreferrer\">https://chat.askdifferent.com</a></li>\n</ul>\n","OwnerUserId":"238347","LastActivityDate":"2017-05-22T16:50:52.987","CommentCount":"2"},{"Id":"3033","PostTypeId":"1","CreationDate":"2017-05-22T22:05:34.207","Score":"6","ViewCount":"32","Body":"<p>So, the question is not so much about the rainbow itself (I see it as a reminder of the old Apple logo I grew up with), but more about why it appears sometimes and not other times?</p>\n\n<p>Below is a screenshot of what I mean:</p>\n\n<p><a href=\"https://i.stack.imgur.com/MT4YN.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/MT4YN.png\" alt=\"enter image description here\"></a></p>\n\n<p>And, as you can see, it's totally different to what I <em>usually</em> see:</p>\n\n<p><a href=\"https://i.stack.imgur.com/7Qq4j.jpg\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/7Qq4j.jpg\" alt=\"enter image description here\"></a></p>\n\n<p>In the second screenshot above you do see a very thin rainbow, so is the first screenshot just indicative of some rendering problem with the browser?</p>\n\n<p>I have noticed this in multiple browsers, so I know it's not browser specific. And on multiple machines, although I must admit I haven't tracked this (i.e. I juggle multiple devices, browsers and operating systems, and  haven't kept a record of when the big rainbow appears).</p>\n\n<p>Is this just a rendering problem? Or is something else at play here?</p>\n\n<p><strong>Note:</strong> In the absence of a more appropriate tag, I've used the 'bug' tag for this question although it's probably not really a bug.</p>\n","OwnerUserId":"168832","LastEditorUserId":"41177","LastEditDate":"2017-05-23T08:27:08.000","LastActivityDate":"2017-05-23T11:01:10.470","Title":"Why do I occasionally get a big rainbow in the top banner?","Tags":"<bug><design>","AnswerCount":"1","CommentCount":"0"},{"Id":"3034","PostTypeId":"2","ParentId":"3033","CreationDate":"2017-05-23T11:01:10.470","Score":"3","Body":"<p>The rainbow is always there and the black gets drawn on top. My hunch is something is happening on the network or in the browser to drop the connection when you don't get the whole page rendered.</p>\n\n<p>This brings to mind a saying I'll paraphrase poorly:</p>\n\n<blockquote>\n  <p>I never learn things when things work. It's only when they break that you can easily peek inside and see what connects where, how the whole is assembled and how it was designed to work together as one. Be sure to pay attention when things break, because that's when the learning comes more easily.</p>\n</blockquote>\n\n<p>Also, hopefully someone with more expertise can come in and illuminate my broken answer. There's probably a great explanation for how the page is built other than \"probably network since you have multiple devices / browsers\" seeing the same breakage. You could also ask on the main site how to inspect the page to pick apart what resources / scripts do what. The steps are a little different based on Safari/Chrome or particular OS in play.</p>\n","OwnerUserId":"5472","LastActivityDate":"2017-05-23T11:01:10.470","CommentCount":"4"},{"Id":"3035","PostTypeId":"2","ParentId":"3030","CreationDate":"2017-05-23T11:17:45.817","Score":"7","Body":"<p>I'm tempted to try and roll this in to the Basic Customer support close reason. That close reason isn't here, so you can use this and other in the mean time:</p>\n\n<blockquote>\n  <p>I'm voting to close this question as off-topic because it's a <a href=\"https://apple.meta.stackexchange.com/questions/2508/why-were-not-customer-support-for-company-x-or-product-y\">Basic Customer support question</a>. Please see the meta post linked above for details on how to proceed if you can edit the post and have the hold reviewed. </p>\n</blockquote>\n\n<p>We currently have these two custom options:</p>\n\n<ul>\n<li><p>Questions asking to <a href=\"http://meta.stackoverflow.com/questions/254393/\">recommend or find a Mac, book, tool, tutorial or other off-site resource</a> are off-topic for Ask Different as they tend to attract opinionated answers and spam. Instead, edit this question to <a href=\"http://apple.stackexchange.com/help/how-to-ask\">describe the problem and what research</a> has been done so far to solve it.</p></li>\n<li><p>Questions about software development are off-topic here, but can be asked on <a href=\"https://stackoverflow.com/about\">Stack Overflow</a>.</p></li>\n</ul>\n\n<p>The Basic Customer Support wording is removed from the \"off site\" resource close reason since people felt odd choosing it when both didn't apply as well as people with closed questions didn't get that they had to only fix half of the problems - not address both \"support\" and \"research\" constraints.</p>\n\n<p>Since we only get three custom close reasons - do we still need this second  \"not enough research\" reason?</p>\n\n<p>I could see adding some of the proposed wording here to \"basic customer support\" close reason so we have used all 3 of 3 custom close reasons.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2017-05-24T00:49:12.897","LastActivityDate":"2017-05-24T00:49:12.897","CommentCount":"4"},{"Id":"3036","PostTypeId":"1","CreationDate":"2017-05-24T01:47:13.413","Score":"8","ViewCount":"71","Body":"<p>Today I came across the <a href=\"http://apple.blogoverflow.com\" rel=\"nofollow noreferrer\">Ask Different Blog</a>, something I had no idea even existed.</p>\n\n<p>Noting that the last entry is dated 6 October 2015, I started to wonder whether it had quietly died at some point, so I searched around Meta and found these three posts:</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/666/is-anyone-interested-in-starting-managing-and-or-writing-for-an-ask-different-b\">Is anyone interested in starting, managing and/or writing for an Ask Different blog?</a></li>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/974/can-we-make-the-askdifferent-blog-more-easily-accessible\">Can we make the AskDifferent blog more easily accessible?</a></li>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/811/the-ask-different-blog-is-looking-for-contributors\">The Ask Different Blog is looking for contributors</a></li>\n</ul>\n\n<p>I didn't seem to find anything that related to us no longer having a blog.</p>\n\n<p>Obviously I don't know the history of the blog, (heck, I still feel like a newbie around here), but I've taken the time today to have a good look around and it seems to me to have once been a valuable resource. </p>\n\n<p>In fact, the site even used it to run competitions (with real prizes) and at some point even had Ask Different gift swags (shirts, stickers, etc). And, for a while we even had a series of Ask Different <a href=\"http://apple.blogoverflow.com/category/podcast/\" rel=\"nofollow noreferrer\">podcasts</a> being produced.</p>\n\n<p>Now, I am <strong>not</strong> saying we should go back to running competitions and offering prizes, or producing podcasts (I know these things require time and money), but my point is that presumably at some point the blog was quite active and successful (it even had a dedicated Ask Different <a href=\"http://chat.stackexchange.com/rooms/1408/ask-different-blog\">Blog chat</a>). And it <em>may</em> have even been a good promotional/marketing tool for Ask Different as a whole (e.g. this Ask Different <a href=\"http://apple.blogoverflow.com/2012/03/keyboard-ninja-working-with-text-screencast/\" rel=\"nofollow noreferrer\">screencast</a> on Vimeo seems to have been a <em>Vimeo staff pick</em> at one time). </p>\n\n<p>My questions are:</p>\n\n<ol>\n<li>Do we actually still have a blog?</li>\n<li>If no, (i) when did it stop; and (ii) why did it stop (i.e. low readership, not enough contributors, etc)?</li>\n<li>If yes, (i) how do we get involved; and (ii) how can we promote it?</li>\n</ol>\n\n<p>In summary, it seems to me that getting the blog going again <em>may be possible</em> as we've got more users joining the site daily and some of these have been very active in the period since the last blog post.</p>\n\n<p><strong>I for one would be more than happy to get involved.</strong></p>\n\n<p><strong>[UPDATE 1]</strong></p>\n\n<p>Since posting the question I've found and discovered some history to all this.</p>\n\n<p>This blog... </p>\n\n<blockquote>\n  <p>...was originally a part of Blog Overflow, a network of blogs linked to\n  Stack Exchange sites. Blog Overflow has since been discontinued, but\n  the written articles will remain here for future readers.</p>\n</blockquote>\n\n<p>For full details you can read <a href=\"https://meta.stackexchange.com/questions/291741/we-will-no-longer-be-hosting-blog-overflow\">We will no longer be hosting Blog Overflow</a>.</p>\n\n<p>In summary, the three main reasons were:</p>\n\n<ul>\n<li>The vast majority of blogs weren't really active</li>\n<li>WordPress is a meaty beast to sustain as a self-hosted service and not worth the effort for something that resulted in little activity</li>\n<li>Blogs can work with us while being external to us.</li>\n</ul>\n\n<p>In light of this, I guess if the demand was there, we could create a blog offsite. So, my question could become a discussion on whether doing so was something this community wanted to do?</p>\n\n<p><strong>[Update 2]</strong></p>\n\n<p>Added three <em>polling</em> answers. Please vote for whichever answer represents your view. </p>\n\n<p><strong>No need for any down votes - just up vote one of the polls only.</strong></p>\n","OwnerUserId":"168832","LastEditorUserId":"168832","LastEditDate":"2017-05-24T02:37:25.163","LastActivityDate":"2017-05-24T23:43:13.040","Title":"Poll: Ask Different Blog","Tags":"<discussion>","AnswerCount":"4","CommentCount":"4"},{"Id":"3037","PostTypeId":"2","ParentId":"3036","CreationDate":"2017-05-24T02:25:42.787","Score":"4","Body":"<p>We do not have a blog.</p>\n\n<p>It stopped in March: <a href=\"https://meta.stackexchange.com/questions/291741/we-will-no-longer-be-hosting-blog-overflow\">We will no longer be hosting Blog Overflow</a></p>\n\n<p>The reasoning is three-fold in basic:</p>\n\n<ol>\n<li>The vast majority of blogs aren't really active. </li>\n<li>WordPress is meaty to sustain self-hosted.</li>\n<li>Blogs can continue externally - they allowed each site to export data if requested.</li>\n</ol>\n\n<p>For us specifically, the <em>Ask Different Blog</em> was very not active. We spent more time moderating spam comments than creating content, we didn't export the data since it exists statically hosted for scraping if someone wants to start up an external blog for the site.</p>\n","OwnerUserId":"5472","LastActivityDate":"2017-05-24T02:25:42.787","CommentCount":"1"},{"Id":"3038","PostTypeId":"2","ParentId":"3036","CreationDate":"2017-05-24T02:31:52.953","Score":"3","Body":"<h2>Poll -- Yes, we should have an external blog for the site, and I can contribute</h2>\n\n<p>Yes, we should have a blog and I would be happy to contribute.</p>\n\n<p><strong>Note:</strong> If you're upvoting this, please add a comment so we can get in touch later if we explore this further.</p>\n","OwnerUserId":"168832","LastEditorUserId":"168832","LastEditDate":"2017-05-24T23:43:13.040","LastActivityDate":"2017-05-24T23:43:13.040","CommentCount":"3"},{"Id":"3039","PostTypeId":"2","ParentId":"3036","CreationDate":"2017-05-24T02:32:55.443","Score":"5","Body":"<h2>Poll -- Yes, we should have an external blog for the site, but I can't contribute</h2>\n\n<p>Yes, we should have a blog but I can't contribute.</p>\n","OwnerUserId":"168832","LastActivityDate":"2017-05-24T02:32:55.443","CommentCount":"0"},{"Id":"3040","PostTypeId":"2","ParentId":"3036","CreationDate":"2017-05-24T02:33:57.347","Score":"6","Body":"<h2>Poll -- No, we should not have a blog for the site</h2>\n\n<p>No, we should not have a blog.</p>\n","OwnerUserId":"168832","LastActivityDate":"2017-05-24T02:33:57.347","CommentCount":"0"},{"Id":"3041","PostTypeId":"1","CreationDate":"2017-05-25T11:08:02.133","Score":"10","ViewCount":"175","Body":"<p>As most of us know, each year Apple hosts its Worldwide Developers Conference (WWDC). Typically, Apple launches the WWDC with a keynote address during which it introduces upcoming software and hardware. </p>\n\n<p>This year the conference will be held in San Jose, California, from Monday 5 June until Friday 9 June.</p>\n\n<p>Below is part of the invite Apple issued for the event:</p>\n\n<p><a href=\"https://i.stack.imgur.com/H3VDe.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/H3VDe.png\" alt=\"enter image description here\"></a></p>\n\n<p>My proposal is that we hold a live chat event right here using <a href=\"http://chat.stackexchange.com/rooms/38/ask-different-chat\">Ask Different Chat</a>. The way I see this working is that we invite users to join us in chat as the WWDC announcements unfold.</p>\n\n<p><strong>Expected announcements</strong> </p>\n\n<ul>\n<li>iOS 11</li>\n<li>macOS 10.13</li>\n<li>tvOS 11</li>\n<li>watchOS 4.</li>\n</ul>\n\n<p><strong>Rumoured announcements</strong> </p>\n\n<ul>\n<li>Revised MacBook, MacBook Pro and MacBook Air models</li>\n<li>A totally new Siri Smart Speaker (similar to Amazon Echo or Google Home)</li>\n<li>A new 10.5\" iPad Pro.</li>\n</ul>\n\n<p><strong>Surprise announcements</strong></p>\n\n<ul>\n<li>Let's have a live chat event and find out together! :)</li>\n</ul>\n\n<p><strong>Time of Keynote address</strong></p>\n\n<p>The Keynote address is scheduled for 10am on Monday 5 June (Pacific Time). This equates to:</p>\n\n<ul>\n<li><strong>Adelaide</strong> - 2.30am, Tuesday 6 June</li>\n<li><strong>Amsterdam</strong> - 7.00pm, Monday 5 June</li>\n<li><strong>Auckland</strong> - 5.00am, Tuesday 6 June</li>\n<li><strong>Beijing</strong> - 1.00am, Tuesday 6 June</li>\n<li><strong>Berlin</strong> - 7.00pm, Monday 5 June</li>\n<li><strong>Hong Kong</strong> - 1.00am, Tuesday 6 June</li>\n<li><strong>Jerusalem</strong> - 8.00pm, Monday 5 June</li>\n<li><strong>London</strong> - 6.00pm, Monday 5 June</li>\n<li><strong>Moscow</strong> - 8.00pm, Monday 5 June</li>\n<li><strong>New Delhi</strong> - 10.30pm, Monday 5 June</li>\n<li><strong>New York</strong> - 1.00pm, Monday 5 June</li>\n<li><strong>Paris</strong> - 7.00pm, Monday 5 June</li>\n<li><strong>Perth</strong> - 1.00am, Tuesday 6 June</li>\n<li><strong>Rio de Janeiro</strong> - 2.00pm, Monday 5 June</li>\n<li><strong>Rome</strong> - 7.00pm, Monday 5 June</li>\n<li><strong>Singapore</strong> - 1.00am, Tuesday 6 June</li>\n<li><strong>Sydney</strong> - 3.00am, Tuesday 6 June</li>\n<li><strong>Tokyo</strong> - 2.00am, Tuesday 6 June</li>\n</ul>\n\n<p><strong>You can also check your local timezone</strong> <a href=\"https://www.timeanddate.com/worldclock/fixedtime.html?msg=Ask%20Different%20WWDC%20Live%20Chat%20Event&amp;iso=20170605T10&amp;p1=283\" rel=\"nofollow noreferrer\">here</a>.</p>\n\n<p>So, for some of us (me included) it'll be a very late night or a very early morning!</p>\n\n<p>To vote for or against this proposal, <strong>please upvote the appropriate answer below</strong> (i.e. you only need to upvote one answer - upvote 'yes' if we should do this, upvote 'no' if we should not).</p>\n\n<p>Also, please feel free to offer comments in support of your vote.</p>\n","OwnerUserId":"168832","LastEditorUserId":"5472","LastEditDate":"2017-06-07T02:16:42.017","LastActivityDate":"2017-06-07T02:16:42.017","Title":"Proposal: WWDC Keynote Live Chat Event","Tags":"<discussion>","AnswerCount":"2","CommentCount":"5"},{"Id":"3042","PostTypeId":"2","ParentId":"3041","CreationDate":"2017-05-25T11:08:30.890","Score":"17","Body":"<h2>Yes -- we should hold a WWDC live event chat via Ask Different Chat</h2>\n","OwnerUserId":"168832","LastActivityDate":"2017-05-25T11:08:30.890","CommentCount":"2"},{"Id":"3043","PostTypeId":"2","ParentId":"3041","CreationDate":"2017-05-25T11:09:56.387","Score":"-6","Body":"<h2>No -- we should not hold a WWDC live event chat via Ask Different Chat</h2>\n","OwnerUserId":"168832","LastActivityDate":"2017-05-25T11:09:56.387","CommentCount":"3"},{"Id":"3044","PostTypeId":"2","ParentId":"3030","CreationDate":"2017-05-26T07:45:41.587","Score":"7","Body":"<p>We currently have a a whole bunch of things mixed into the custom close reasons</p>\n\n<ul>\n<li>Questions about software development</li>\n<li>Basic customer support questions (where the question should first go to the vendor, as described in <a href=\"https://apple.meta.stackexchange.com/questions/2508/why-were-not-customer-support-for-company-x-or-product-y\">Why we&#39;re not customer support for [company X or product Y]</a> </li>\n<li>Recommend or find stuff (aka \"please google for me\")</li>\n<li>Questions which don't show any research done, are basically \"write this script for me\" and similar (which often are hard to distinguish from \"unclear what you are asking\" or \"too broad\" type of question)</li>\n</ul>\n\n<p>This basically means that we have four different (but not totally unrelated) things squeezed into three close reasons. Which obviously doesn't work out so well sometimes.</p>\n\n<p>One way forward would be to rely more on the fact that we already have meta posts explaining the reasoning behind the basic customer support and the recommendation close reason and use this to keep the close reason to the point. So we could go with</p>\n\n<ul>\n<li>Questions must demonstrate a reasonable amount of research &amp; understanding of the problem being solved. Please edit to clearly describe your problem and the research done so far to solve it, including attempted solutions, why they didn't work, and the expected results.</li>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/2508/why-were-not-customer-support-for-company-x-or-product-y\">Basic customer support questions</a> and questions asking to <a href=\"http://meta.stackoverflow.com/questions/254393/\">recommend or find a Mac, book, tool, tutorial or other off-site resource</a> are off-topic. Please refer to the information in the appropriate post linked above for details on how to proceed. If applicable you can edit your question and have the hold reviewed.</li>\n<li>Questions about software development are off-topic here, but can be asked on <a href=\"https://stackoverflow.com/about\">Stack Overflow</a></li>\n</ul>\n\n<p>We may need to have an AD-specific version of the recommendation meta-post for this, but that's something we can tackle if we agree on going with these three reasons.</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-05-26T07:45:41.587","CommentCount":"2"},{"Id":"3045","PostTypeId":"1","CreationDate":"2017-05-28T14:29:03.327","Score":"1","ViewCount":"35","Body":"<p>How do I change my profile pic in my account or avatar?  I signed up under my email for the account and I can't figure out how to change it from the current profile pic/avatar.</p>\n","OwnerUserId":"239495","OwnerDisplayName":"Jason Lanier Brown","LastEditorUserId":"37797","LastEditDate":"2017-05-28T15:46:17.847","LastActivityDate":"2017-05-28T15:47:37.810","Title":"Change stackexchange.com user profile picture","Tags":"<support><profile-page>","AnswerCount":"1","CommentCount":"0"},{"Id":"3046","PostTypeId":"2","ParentId":"3045","CreationDate":"2017-05-28T14:45:18.507","Score":"3","Body":"<p>Four simple steps...</p>\n\n<ol>\n<li><p>Click your 'Reputation', top right.</p></li>\n<li><p>Click 'Edit Profile &amp; Settings</p></li>\n<li><p>Click 'Change picture' at the bottom of your existing avatar</p></li>\n<li><p>Upload a new picture or change Identicon</p>\n\n<p><a href=\"https://i.stack.imgur.com/6uXob.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/6uXob.png\" alt=\"\"></a></p>\n\n<p>Oops, don't forget  </p></li>\n<li><p>Click Save for this site or entire SE network at the bottom of the page.</p>\n\n<p><a href=\"https://i.stack.imgur.com/NsgVs.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/NsgVs.png\" alt=\"Save\"></a></p></li>\n</ol>\n","OwnerUserId":"85275","OwnerDisplayName":"Tetsujin","LastEditorUserId":"37797","LastEditDate":"2017-05-28T15:47:37.810","LastActivityDate":"2017-05-28T15:47:37.810","CommentCount":"0"},{"Id":"3047","PostTypeId":"1","CreationDate":"2017-06-05T22:02:23.253","Score":"2","ViewCount":"18","Body":"<p>What's wrong with the database/website engine?</p>\n\n<p>The edit window differs from the saved <a href=\"https://apple.stackexchange.com/a/285890/93229\">answer</a>:</p>\n\n<p><strong>Edit window with preview:</strong></p>\n\n<p><a href=\"https://i.stack.imgur.com/vhy9N.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/vhy9N.png\" alt=\"enter image description here\"></a></p>\n\n<p><strong>After saving any modification the 120g is automagically replaced with 100%:</strong></p>\n\n<p><a href=\"https://i.stack.imgur.com/thhKk.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/thhKk.png\" alt=\"enter image description here\"></a></p>\n\n<p>In the <strong>edit history</strong> everything is <a href=\"https://apple.stackexchange.com/posts/285890/revisions\">fine</a>. Emptying browser caches doesn't help.</p>\n","OwnerUserId":"93229","LastActivityDate":"2017-06-05T22:02:23.253","Title":"Edited vs. saved answer differs","Tags":"<bug>","AnswerCount":"0","CommentCount":"1"},{"Id":"3048","PostTypeId":"1","CreationDate":"2017-06-06T02:12:08.763","Score":"1","ViewCount":"10","Body":"<p><strong><a href=\"https://apple.stackexchange.com/questions/tagged/watchos-3\" class=\"post-tag\" title=\"show questions tagged &#39;watchos-3&#39;\" rel=\"tag\">watchos-3</a> is currently a tag synonym of <a href=\"https://apple.stackexchange.com/questions/tagged/watchos\" class=\"post-tag\" title=\"show questions tagged &#39;watchos&#39;\" rel=\"tag\">watchos</a>.</strong> In less technical terms, this means any posts tagged with <a href=\"https://apple.stackexchange.com/questions/tagged/watchos-3\" class=\"post-tag\" title=\"show questions tagged &#39;watchos-3&#39;\" rel=\"tag\">watchos-3</a> are actually tagged with <a href=\"https://apple.stackexchange.com/questions/tagged/watchos\" class=\"post-tag\" title=\"show questions tagged &#39;watchos&#39;\" rel=\"tag\">watchos</a>. Think of it like a website redirecting you, but instead it's a tag.</p>\n\n<p>Anyways, <a href=\"https://apple.stackexchange.com/questions/tagged/watchos-2\" class=\"post-tag\" title=\"show questions tagged &#39;watchos-2&#39;\" rel=\"tag\">watchos-2</a>, <a href=\"https://apple.stackexchange.com/questions/tagged/watchos-3\" class=\"post-tag\" title=\"show questions tagged &#39;watchos-3&#39;\" rel=\"tag\">watchos-3</a>, and <a href=\"https://apple.stackexchange.com/questions/tagged/watchos-4\" class=\"post-tag\" title=\"show questions tagged &#39;watchos-4&#39;\" rel=\"tag\">watchos-4</a>, all existing versions of <a href=\"https://apple.stackexchange.com/questions/tagged/watchos\" class=\"post-tag\" title=\"show questions tagged &#39;watchos&#39;\" rel=\"tag\">watchos</a>, are not tag synonyms for it. I think this should be updated to clear confusion and make everything more uniform.</p>\n","OwnerUserId":"154794","LastEditorUserId":"37797","LastEditDate":"2017-06-07T10:27:46.377","LastActivityDate":"2017-06-07T10:27:46.377","Title":"Make [watchos-*] tag synonyms of [watchos] to be consistent with [watchos-3]'s status","Tags":"<feature-request><tags>","AnswerCount":"2","CommentCount":"0"},{"Id":"3049","PostTypeId":"2","ParentId":"3048","CreationDate":"2017-06-06T02:13:46.103","Score":"2","Body":"<h1>Yes, let's do this and make <a href=\"https://apple.stackexchange.com/questions/tagged/watchos-4\" class=\"post-tag\" title=\"show questions tagged &#39;watchos-4&#39;\" rel=\"tag\">watchos-4</a> (and other version tags) synonyms of <a href=\"https://apple.stackexchange.com/questions/tagged/watchos\" class=\"post-tag\" title=\"show questions tagged &#39;watchos&#39;\" rel=\"tag\">watchos</a>.</h1>\n\n<p>This, as shown in the feature request, would make the tagging consensus more uniform and would cause less confusion. There shouldn't only be one version-specific tag that is a synonym!</p>\n","OwnerUserId":"154794","LastActivityDate":"2017-06-06T02:13:46.103","CommentCount":"0"},{"Id":"3050","PostTypeId":"2","ParentId":"2623","CreationDate":"2017-06-06T02:15:05.813","Score":"0","Body":"<p><strong>Yes, this should happen, since people would be able to search with <code>[mail] [ios]</code> or similar.</strong> The search term would mean that all posts found would have both tags.</p>\n\n<p>You can even test it out using <a href=\"https://apple.stackexchange.com/questions/tagged/imac+memory\">this search query</a> for <a href=\"https://apple.stackexchange.com/questions/tagged/imac\" class=\"post-tag\" title=\"show questions tagged &#39;imac&#39;\" rel=\"tag\">imac</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/memory\" class=\"post-tag\" title=\"show questions tagged &#39;memory&#39;\" rel=\"tag\">memory</a>-tagged posts.</p>\n","OwnerUserId":"154794","LastActivityDate":"2017-06-06T02:15:05.813","CommentCount":"0"},{"Id":"3051","PostTypeId":"1","AcceptedAnswerId":"3052","CreationDate":"2017-06-06T02:37:54.603","Score":"2","ViewCount":"49","Body":"<p>I just noticed this iOS 11 related question <a href=\"https://apple.stackexchange.com/questions/285902/how-do-i-enable-the-one-handed-keyboard\">How do I enable the one-handed keyboard?</a> on Apple.SE, Is this allowed already?</p>\n","OwnerUserId":"49189","LastEditorUserId":"37797","LastEditDate":"2017-06-06T08:11:13.730","LastActivityDate":"2017-06-07T11:29:53.043","Title":"Can we ask iOS 11 related questions already?","Tags":"<discussion><site-scope>","AnswerCount":"1","CommentCount":"0"},{"Id":"3052","PostTypeId":"2","ParentId":"3051","CreationDate":"2017-06-06T04:18:32.903","Score":"3","Body":"<h1>YES</h1>\n\n<p>See <a href=\"https://apple.meta.stackexchange.com/questions/2707/what-happened-to-the-beta-ban\">What happened to the &quot;beta ban&quot;?</a> for details. </p>\n","OwnerUserId":"9058","LastEditorUserId":"9058","LastEditDate":"2017-06-07T11:29:53.043","LastActivityDate":"2017-06-07T11:29:53.043","CommentCount":"1"},{"Id":"3053","PostTypeId":"2","ParentId":"3048","CreationDate":"2017-06-07T02:25:06.897","Score":"0","Body":"<p>I'm tempted to just merge all the watchOS versions down to watchOS and leave no synonyms.</p>\n\n<ol>\n<li>There have been 47 questions ever with any flavor of watchOS tag, ever.</li>\n<li>One time the watchOS-3 synonym was used, ever.</li>\n</ol>\n\n<p>For such a low volume, adding a bunch of synonyms seems a low return for effort.</p>\n","OwnerUserId":"5472","LastActivityDate":"2017-06-07T02:25:06.897","CommentCount":"0"},{"Id":"3054","PostTypeId":"1","AcceptedAnswerId":"3055","CreationDate":"2017-06-11T09:09:35.630","Score":"2","ViewCount":"42","Body":"<p>Today I spotted a question closed as dupe - <a href=\"https://apple.stackexchange.com/questions/286234/increase-size-of-bootcamp-partition\">Increase size of Bootcamp partition?</a> </p>\n\n<p>The original, however - whilst perfectly correct at the time - is now actually dangerously out of date.</p>\n\n<p>iPartition is well past its sell-by date, can't handle CoreStorage &amp; hasn't been updated in a long time.  </p>\n\n<p>The new kid on the block is <a href=\"https://www.paragon-software.com/home/hdm-mac/\" rel=\"nofollow noreferrer\">Paragon Hard Disk Manager</a>, with a feature set far above that iPartition ever had, including tools dedicated to backing up, moving, repairing, resizing Bootcamp partitions seamlessly.</p>\n\n<p>Incidentally, it's also half the price of iPartition.</p>\n\n<p>So, I feel the need to go round finding all the old questions to which \"use iPartition\" was the perfectly correct answer at the time &amp; 'fixing' this.</p>\n\n<p>Adding a new answer, especially on high vote questions is going to leave it struggling at the bottom of the pile.</p>\n\n<p>Marking them all as dupes might work - but perhaps we need to generate one new canonical QA to link them to.</p>\n\n<p>Any ideas/suggestions/potential wording for the new Question, or can anyone find an older QA that this could be merged into in some way?  </p>\n\n<p>I don't want to go at this unilaterally.</p>\n","OwnerUserId":"85275","LastActivityDate":"2017-06-11T09:32:09.633","Title":"iPartition vs Paragon Hard Disk Manager","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"3055","PostTypeId":"2","ParentId":"3054","CreationDate":"2017-06-11T09:32:09.633","Score":"3","Body":"<p>The great thing about having already linked the questions as duplicates is that there (should be) one location to fix. Provide an answer to the question which is the destination of the duplicates and it will be voted to the top. I don't think there's any need to do anything differently for this case in particular.</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-06-11T09:32:09.633","CommentCount":"3"},{"Id":"3057","PostTypeId":"1","CreationDate":"2017-06-19T19:08:13.050","Score":"4","ViewCount":"19","Body":"<p>I asked a <a href=\"https://apple.stackexchange.com/questions/287299/monitor-elements-of-a-webpage-receive-real-time-alerts\">question about extension/app/freeware options on a mac</a> for a particular use case, and a user suggested I might be better off at Software Recommendations. </p>\n\n<p>I didn't know about that site at the time of writing, but it seems like it might be a better fit. My question then is twofold; is my question actually better suited for that site? And if so, how do I go about getting it migrated?</p>\n","OwnerUserId":"229713","LastEditorUserId":"37797","LastEditDate":"2017-06-19T19:41:22.440","LastActivityDate":"2017-06-20T00:00:57.947","Title":"How to get a question migrated?","Tags":"<support><questions><migration>","AnswerCount":"2","CommentCount":"0"},{"Id":"3058","PostTypeId":"2","ParentId":"3057","CreationDate":"2017-06-19T19:41:10.667","Score":"3","Body":"<p>You can use the ‘flag’ link under the question, choose ‘in need of moderator intervention’, then describe the problem including which site you would like the question migrated to and why.</p>\n\n<p><a href=\"https://i.stack.imgur.com/CIm7H.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/CIm7H.png\" alt=\"in need of moderator intervention\"></a></p>\n\n<p>In general on other Stack Exchange sites, this is usually not necessary. Instead, you would choose ‘close’/‘flag’, then ‘off-topic because’ ‘This question belongs on another site in the Stack Exchange network’ and select the site from the list. Ask Different does not have any migration paths preconfigured, so a moderator is required to handle migrations manually, using the flag system described.</p>\n\n<hr>\n\n<p>In terms of when to migrate though, there is an important rule of thumb:</p>\n\n<blockquote>\n  <ul>\n  <li><strong>Don't migrate for the sake of migration</strong>. We only migrate questions because they are off-topic on the original site. It is perfectly possible for a question to be on-topic on multiple sites, but that is not a reason to migrate it elsewhere, unless the OP requests migration. As a general rule, if someone asks a question here, and it's on-topic here, it should stay here.</li>\n  </ul>\n</blockquote>\n\n<p><a href=\"https://meta.stackexchange.com/q/10249/222623\">What is migration and how does it work?</a></p>\n\n<p>Sometimes, though, Ask Different goes against this guideline — due to the low-traffic nature of some parts of this site, it may be beneficial to the question for it to be elsewhere. This is on a case-by-case basis and the guidelines on Meta.SE still take priority.</p>\n","OwnerUserId":"37797","LastActivityDate":"2017-06-19T19:41:10.667","CommentCount":"0"},{"Id":"3059","PostTypeId":"1","CreationDate":"2017-06-19T20:18:35.590","Score":"10","ViewCount":"130","Body":"<p>Ask Different is scheduled for an election <a href=\"https://apple.stackexchange.com/election/4\">next week, June 26th</a>.In connection with that, we will be holding a Q&amp;A with the candidates.  This will be an opportunity for members of the community to pose questions to the candidates on the topic of moderation.  Participation is completely voluntary.</p>\n\n<blockquote>\n  <p><strong>The purpose of this thread was to collect questions for the questionnaire. The questionnaire is now live, and you may find it <a href=\"https://apple.meta.stackexchange.com/questions/3083/2017-moderator-election-qa-questionnaire\">here</a>.</strong></p>\n</blockquote>\n\n<p>Here's how it'll work:</p>\n\n<ul>\n<li><p>Until the nomination phase, (so, until Monday, June 26th at 20:00:00Z UTC, or 4:00 PM EST on the same day, give or take time to arrive for closure), this question will be open to collect potential questions from the users of the site. Post answers to this question containing any questions you would like to ask the candidates. Please only post <em>one question per answer</em>.</p></li>\n<li><p>We, the Community Team, will be providing a small selection of generic questions. The first two will be guaranteed to be included, the latter ones are if the community doesn't supply enough questions. This will be done in a single post, unlike the prior instruction.</p></li>\n<li><p>If your question contains a link, please use the syntax of <code>[text](link)</code>, as that will make it easier for transcribing for the finished questionnaire.</p></li>\n<li><p>This is a perfect opportunity to voice questions that are specific to your community and issues that you are running into at current.</p></li>\n<li><p>At the start of the nomination phase, the Community Team will select <strong>up to 8 of the top voted questions submitted by the community</strong> provided in this thread, to use in addition to the aforementioned 2 guaranteed questions. We reserve some editorial control in the selection of the questions and may opt not to select a question that is tangential or irrelevant to moderation or the election. That said, if I have concerns about any questions in this fashion, I will be sure to point this out in comments before the decision making time.</p></li>\n<li><p>Once questions have been selected, a new question will be opened to host the actual questionnaire for the candidates, typically containing 10 questions in total.</p></li>\n<li><p>This is not the only option that users have for gathering information on candidates. As a community, you are still free to, for example, hold a live chat session with your candidates to ask further questions, or perhaps clarifications from what is provided in the Q&amp;A.</p></li>\n</ul>\n\n<p>If you have any questions or feedback about this process, feel free to post as a comment here.</p>\n","OwnerUserId":"52123","LastEditorUserId":"52123","LastEditDate":"2017-06-26T20:06:51.870","LastActivityDate":"2017-06-26T20:06:51.870","Title":"2017 Moderator Election Q&A - Question Collection","Tags":"<discussion><election>","AnswerCount":"11","CommentCount":"0"},{"Id":"3060","PostTypeId":"2","ParentId":"3059","CreationDate":"2017-06-19T20:18:35.590","Score":"5","Body":"<p>Here is a set of general questions, gathered as very common questions asked every election. As mentioned in the instructions, the first two questions are guaranteed to show up in the Q&amp;A, while the others are if there aren't enough questions (or, if you like one enough, you may split it off as a separate answer for review within the community's 8). </p>\n\n<ul>\n<li>How would you deal with a user who produced a steady stream of valuable answers, but tends to generate a large number of arguments/flags from comments? </li>\n<li>How would you handle a situation where another mod closed/deleted/etc a question that you feel shouldn't have been?</li>\n</ul>\n\n<hr>\n\n<ul>\n<li>In your opinion, what do moderators do? </li>\n<li>A diamond will be attached to everything you say and have said in the past, including questions, answers and comments. Everything you will do will be seen under a different light. How do you feel about that? </li>\n<li>In what way do you feel that being a moderator will make you more effective as opposed to simply reaching 10k or 20k rep? </li>\n</ul>\n","OwnerUserId":"52123","LastActivityDate":"2017-06-19T20:18:35.590","CommentCount":"0"},{"Id":"3061","PostTypeId":"1","AcceptedAnswerId":"3063","CreationDate":"2017-06-19T23:07:28.013","Score":"4","ViewCount":"35","Body":"<p>I feel the <a href=\"https://apple.stackexchange.com/help/on-topic\">What topics can I ask about here?</a> page needs a minor edit. At present, this page still contains a link to the no-longer active blog (see screenshot below):</p>\n\n<p><a href=\"https://i.stack.imgur.com/6zNXJ.jpg\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/6zNXJ.jpg\" alt=\"enter image description here\"></a></p>\n\n<p>While linking to the blog itself is not necessarily a problem, I do feel it is a problem <em>within</em> this context. The reason being that the whole purpose of this paragraph is to help users understand the Q&amp;A setting of Ask Different is best suited to questions about practical problems, rather than to <em>discussion</em> type questions. It then refers users to the chat room and blog if they have an opinion-based post (at least that's how I'm interpreting it).</p>\n\n<p>I propose we remove the link so that this sentence now reads:</p>\n\n<p><em>We do have a <a href=\"http://chat.stackexchange.com\">chat room</a> for opinion-based posts.</em></p>\n\n<p>Or, something similar to the above.</p>\n","OwnerUserId":"168832","LastEditorUserId":"168832","LastEditDate":"2017-06-20T00:23:25.497","LastActivityDate":"2017-06-20T17:32:53.873","Title":"Does the \"What topics can I ask about here?\" page need a minor edit","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"3062","PostTypeId":"2","ParentId":"3057","CreationDate":"2017-06-20T00:00:57.947","Score":"2","Body":"<p>Although the question is on topic here, I’ve migrated it away and asked (via a flag) for the comments to get cleared on the new site. If the migration is rejected, please flag for re-opening here. </p>\n","OwnerUserId":"5472","LastActivityDate":"2017-06-20T00:00:57.947","CommentCount":"0"},{"Id":"3063","PostTypeId":"2","ParentId":"3061","CreationDate":"2017-06-20T17:32:53.873","Score":"3","Body":"<p>Fixed, thanks for spotting this.</p>\n","OwnerUserId":"9058","LastActivityDate":"2017-06-20T17:32:53.873","CommentCount":"0"}]