[{"Id":"1999","PostTypeId":"1","AcceptedAnswerId":"2000","CreationDate":"2014-03-18T09:49:14.817","Score":"11","ViewCount":"118","Body":"<p>I asked <a href=\"https://apple.stackexchange.com/questions/113160/how-can-i-make-you-tube-full-screen-on-my-ipad-when-using-safari\">this question</a> a while ago and it has garnered no upvotes and a single upvoted answer.  The answer is correct and useful so I accepted it.  </p>\n\n<p>Today I happened back onto this question and see that it was \"protected\" to prevent answers by users with &lt; 10 rep.  My understanding of the use of \"protection\" is to prevent pile-on when questions go viral.</p>\n\n<p>Why would such a low activity question get protected?</p>\n","OwnerUserId":"15565","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-03-18T10:21:08.370","Title":"Why was this low activity question \"protected\"?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2000","PostTypeId":"2","ParentId":"1999","CreationDate":"2014-03-18T10:21:08.370","Score":"13","Body":"<p>The question has attracted a bunch of \"me too\" answers which have been deleted (and which you can't see). The software behind AskDifferent automatically sets a topic to \"protected\" if the ratio between deleted and non-deleted questions gets too high.</p>\n\n<p>I've unprotected it again for the moment, if it keeps attracting \"me too\" answers it will get procted again automatically.</p>\n","OwnerUserId":"9058","LastActivityDate":"2014-03-18T10:21:08.370","CommentCount":"3"},{"Id":"2001","PostTypeId":"2","ParentId":"1994","CreationDate":"2014-03-18T13:06:48.003","Score":"1","Body":"<p>The idea that an answer is useful is not what I think of but it does make sense,\nMy criteria is dies it add more relevant correct information </p>\n\n<p>I do vote but only if I think it will work and the answer is understandable. Thus only in your last two cases, if I have to guess then I would either ask for more information or leave it.</p>\n\n<p>As for questions I only vote if they make me think, i.e. if I can answer immediately then I tend not to up vote as the OP should have read the manual or some other research but I might still answer as getting the answer here is a useful goal. If they are about something I am interested in or should know something about I should up vote but I think I don't up vote question enough.</p>\n","OwnerUserId":"237","LastActivityDate":"2014-03-18T13:06:48.003","CommentCount":"0"},{"Id":"2002","PostTypeId":"1","AcceptedAnswerId":"2003","CreationDate":"2014-03-19T04:49:56.317","Score":"0","ViewCount":"39","Body":"<p>I saw in many profile that they have K with point, so my question is that how can i get such type of image.</p>\n\n<p>For example i saw someones's  profile<br>\n<img src=\"https://i.stack.imgur.com/3mVGa.png\" alt=\"enter image description here\"></p>\n\n<p>But my is<br>\n<img src=\"https://i.stack.imgur.com/4N6UE.png\" alt=\"enter image description here\"></p>\n\n<p>Even i have many link account compare to Divya.</p>\n","OwnerUserId":"45688","OwnerDisplayName":"Rajneesh071","LastActivityDate":"2014-03-19T17:04:35.450","Title":"How to get image of our point with K?","Tags":"<discussion><osx><graphics>","AnswerCount":"1","CommentCount":"0"},{"Id":"2003","PostTypeId":"2","ParentId":"2002","CreationDate":"2014-03-19T05:07:04.837","Score":"0","Body":"<p>Answer questions! Vote! Participate!</p>\n\n<p>The 1.8k in that user's profile badge is short form for 1800. Where 1800 is their reputation score on the Ask Different site. They've earned that reputation by participating in the site. Rep is mainly gained by answering questions correctly and having those answered voted up and accepted as the most correct answer for questions. But you also get rep for questions that are voted up. And other actions on the site can earn you rep too like peer reviewing pending edits and suggesting tag wikis and so on.</p>\n\n<p>As for the flair badge for the site:</p>\n\n<blockquote>\n  <p>(please note that only sites where you have more than 200 reputation will appear, and that flair is only updated once every 24-36 hours.)</p>\n</blockquote>\n\n<p>This is from the flair page itself. You can see it here for your user account: <a href=\"https://stackoverflow.com/users/1369972/rajneesh071/flair\">https://stackoverflow.com/users/1369972/rajneesh071/flair</a></p>\n\n<p>You don't have enough rep on Ask Different yet to get a flair badge. You need +200 rep on any site for a badge. Keep going! You're almost there!</p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-05-23T11:33:34.410","LastActivityDate":"2014-03-19T17:04:35.450","CommentCount":"5"},{"Id":"2004","PostTypeId":"1","CreationDate":"2014-03-19T07:28:28.680","Score":"4","ViewCount":"38","Body":"<p><a href=\"https://apple.stackexchange.com/questions/124269/why-sometimes-my-launchpad-does-not-show-application-icons\">My question</a> has just 4 views, I think my problem will be very common, but it just got 4 views, how could it be?</p>\n","OwnerUserId":"35562","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-04-05T13:56:52.783","Title":"Why no one view this question?","Tags":"<discussion>","AnswerCount":"3","CommentCount":"1"},{"Id":"2005","PostTypeId":"1","AcceptedAnswerId":"2012","CreationDate":"2014-03-19T07:32:47.990","Score":"4","ViewCount":"37","Body":"<p>Is it possible for SE to correct words according to a list or something?</p>\n\n<p>Example:</p>\n\n<ul>\n<li>IOS, Ios ios should be iOS</li>\n<li>IPAD, ipad, Ipad, IPad etc should be iPad</li>\n<li>apple should be Apple</li>\n</ul>\n\n<p>These \"mistakes\" occur many times resulting in edits. I don't mind editing them, but if it is technically possible...?</p>\n","OwnerUserId":"34561","LastActivityDate":"2014-03-19T17:15:46.733","Title":"Is it possible to autocorrect words?","Tags":"<feature-request><editing>","AnswerCount":"1","CommentCount":"2"},{"Id":"2006","PostTypeId":"2","ParentId":"2004","CreationDate":"2014-03-19T07:37:20.820","Score":"3","Body":"<p>Please take in mind some users just follow certain tags. If you asked your question along with several users asking a question at the same time, your question might not hit the top of the page. Personally I look at the top and scroll down a bit - but yes, it's possible to miss questions.</p>\n\n<p>If you want to draw more attention, you can <strong>start a Bounty</strong>.</p>\n","OwnerUserId":"34561","LastActivityDate":"2014-03-19T07:37:20.820","CommentCount":"0"},{"Id":"2007","PostTypeId":"2","ParentId":"2004","CreationDate":"2014-03-19T11:24:51.410","Score":"4","Body":"<p>The site only guarantees that new users posts get looked at. </p>\n\n<p>In specific, your question is going to be extremely hard for someone to search for. It is tagged MacBook Air but it has nothing to do with the MacBook Air - that detail is secondary to the real issue you face. </p>\n\n<p>I would tag it troubleshooting because you haven't documented any amount of troubleshooting and you might need that help the most. The next tag would be the specific component it's not working for you, LaunchPad. I would probably remove the MacBook air tag and replace it with OS X. </p>\n\n<p>At that point someone only looking at tags for unanswered questions might eventually see your question. You would want to share a link to your question on Facebook or some social media and ask your friends to help you out. (See the share button next to the edit button for your post). </p>\n\n<p>If then after a week, you are still not getting views then you might try to solve the problem yourself. You could edit how you try to solve the problem into the question and maybe someone would then be able to understand what little tidbit of advice they could offer to help you get closer to the solution. </p>\n","OwnerUserId":"5472","LastActivityDate":"2014-03-19T11:24:51.410","CommentCount":"0"},{"Id":"2008","PostTypeId":"1","CreationDate":"2014-03-19T15:14:11.613","Score":"3","ViewCount":"35","Body":"<p>I've a couple of times gotten feedback on flags where I selected \"not an answer\" which says \"...should possibly be an edit, comment, another question, or deleted altogether...\" and (for example the most recent time) the reviewer declined the flag, commenting that they weren't comfortable deleting it. In this particular situation it should probably be converted to a comment, not deleted.</p>\n\n<p>I seem to do better selecting \"other\" and specifically saying \"this should be a comment\" but after reading the small print on \"not an answer\" I thought I'd just go with that one. </p>\n\n<p>Which is best? Selecting other and pointing out the reason, or selecting the correct flag type and getting declined. </p>\n\n<p><strong>Edit:</strong> </p>\n\n<p>To be clear, I'm not offended that my flag was declined, I just don't want to irritate the flag reviewers. </p>\n","OwnerUserId":"70930","LastEditorUserId":"5472","LastEditDate":"2014-03-19T16:01:19.213","LastActivityDate":"2014-03-19T17:09:48.407","Title":"Flagging best practices","Tags":"<support><flagging><best-practices>","AnswerCount":"2","CommentCount":"5"},{"Id":"2009","PostTypeId":"2","ParentId":"2008","CreationDate":"2014-03-19T16:04:24.093","Score":"2","Body":"<p>If there is a built in or predefined option, use it. Simple as that. If a flag is ultimately handled differently to what you want or were expecting, then rest assured it won't be down to the method you used to flag.</p>\n","OwnerUserId":"9495","LastActivityDate":"2014-03-19T16:04:24.093","CommentCount":"0"},{"Id":"2010","PostTypeId":"2","ParentId":"2008","CreationDate":"2014-03-19T17:09:48.407","Score":"1","Body":"<p>I don't really pay attention to who flagged an answer but I am, more and more, declining to remove bad or wrong answers that are flagged because that's not what flagging is supposed to be used for.</p>\n\n<p>There's even a canned response to flags that says \"Flags should not be used to flag answers with technical inaccuracies or that are altogether incorrect\".</p>\n\n<p>You should be down voting those.</p>\n\n<p>Only in cases where comments were clearly posted as answers do I take action and mark it as helpful.</p>\n\n<p>As @bmike says in <a href=\"https://apple.meta.stackexchange.com/questions/1629/why-was-my-flag-for-not-an-answer-declined\">this meta Q&amp;A over here</a>:</p>\n\n<blockquote>\n  <p>Even if an answer is totally wrong, that's not enough for us to delete it. It has to be unsaveable by an edit and we like to see that the bad answer has a down vote or two and hopefully a constructive comment before we like to step in and summarily delete an answer. Even totally wrong answers with a polite, concrete rebuttal is of great use to the community.</p>\n</blockquote>\n\n<p>We want to encourage a community that talks. Where answers that aren't great are commented on so new users learn how to make great answers.</p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2014-03-19T17:09:48.407","CommentCount":"0"},{"Id":"2011","PostTypeId":"2","ParentId":"2004","CreationDate":"2014-03-19T17:13:46.180","Score":"1","Body":"<p>Sometimes you have to self-promote to get an answer!</p>\n\n<p>You have promotion options available from within the question to help get more visibility on it. Just below the body of the question, before the comments on the question itself start, you'll see:</p>\n\n<blockquote>\n  <p>share edit close delete flag</p>\n</blockquote>\n\n<p>Clickable text links like that. Click the 'share' link and you'll be given a direct link to the question that you can use to promote it on social media sites. There's also fast sharing icons for Google+, Twitter and Facebook available to quickly share the question on those social media sites.</p>\n\n<p>I've had great luck driving answers to some of my tougher questions by promoting them on App.Net and Twitter. It helps if you have a reasonable following of Mac-savvy people on your social media outlets.</p>\n","OwnerUserId":"292","LastEditorUserId":"34561","LastEditDate":"2014-04-05T13:56:52.783","LastActivityDate":"2014-04-05T13:56:52.783","CommentCount":"0"},{"Id":"2012","PostTypeId":"2","ParentId":"2005","CreationDate":"2014-03-19T17:15:46.733","Score":"2","Body":"<p>As cosmetically-infuriating as these typos can be, they don't obscure the meaning or intent behind a question or answer so I would just: don't sweat it. I think you'll go a little crazy trying to right all those wrongs on this site if you can't find a way to live with them.</p>\n","OwnerUserId":"292","LastActivityDate":"2014-03-19T17:15:46.733","CommentCount":"1"},{"Id":"2013","PostTypeId":"2","ParentId":"1629","CreationDate":"2014-03-19T18:04:17.637","Score":"11","Body":"<p>As a counterpoint (I would just comment, but I can't put images in comments):</p>\n\n<p>This is what we see on the flagging page:</p>\n\n<p><img src=\"https://i.stack.imgur.com/7J5Pq.png\" alt=\"enter image description here\"></p>\n\n<p>Under \"it is not an answer\" we see \"It should possibly be an edit, a comment, another question, or deleted altogether\". It sounds like you are considering all the flags as requests for deletion when the flagging page mentions 3 other options. </p>\n\n<p>I will try to start commenting and voting rather than flagging (except for spam) but I am confused about the phrasing the flagging interface offers.</p>\n\n<p>I think a tangential confusion stems from new users not being able to comment and so they go to the answer field (or maybe they don't even see the comment option, but even if they did it isn't an option)</p>\n\n<p><sub> and yes, this should probably be flagged because it isn't an answer :D</sub></p>\n","OwnerUserId":"70930","LastActivityDate":"2014-03-19T18:04:17.637","CommentCount":"1"},{"Id":"2014","PostTypeId":"1","AcceptedAnswerId":"2033","CreationDate":"2014-03-24T08:25:23.243","Score":"1","ViewCount":"55","Body":"<p>I've casted 40 votes on last saturday, and I didn't receive Vox Populi.</p>\n\n<p>How is this possible? I've received the warning I couldn't cast any vote for the next <em>10 hours</em> that saturday.</p>\n","OwnerUserId":"34561","LastActivityDate":"2014-04-04T12:56:17.510","Title":"Vox Populi not awarded","Tags":"<bug><badges>","AnswerCount":"3","CommentCount":"0"},{"Id":"2015","PostTypeId":"2","ParentId":"2014","CreationDate":"2014-03-24T11:47:12.970","Score":"2","Body":"<p>Badges can take a while to award. The 10 hours wait lets you know when the daiy script will run and post a badge that gets checked but once a day.</p>\n\n<p>Let us know if it's not happened in a dozen minutes after you can vote again.</p>\n","OwnerUserId":"9495","LastEditorUserId":"5472","LastEditDate":"2014-03-24T17:56:29.117","LastActivityDate":"2014-03-24T17:56:29.117","CommentCount":"1"},{"Id":"2016","PostTypeId":"1","AcceptedAnswerId":"2017","CreationDate":"2014-03-24T12:26:18.647","Score":"3","ViewCount":"28","Body":"<p>I understand that you don't get reputation in Meta as it's a part of AskDifferent, and meta.stackoverflow is a bigger \"independent\" site which does.</p>\n\n<p>But why doesn't it show badges from main site here?</p>\n","OwnerUserId":"34561","LastActivityDate":"2014-03-24T22:22:27.780","Title":"Why does Meta award badges and inherit reputation?","Tags":"<discussion><reputation><badges>","AnswerCount":"2","CommentCount":"0"},{"Id":"2017","PostTypeId":"2","ParentId":"2016","CreationDate":"2014-03-24T17:39:28.883","Score":"2","Body":"<p>Badges on Meta mean different things — for example, the answer badges on Meta means that you've answered a question regarding how the site functions, not the site itself. This is substantially different due to the difference in subject matter.</p>\n\n<p><sup>As an aside, <a href=\"https://apple.meta.stackexchange.com/help/badges/25/mortarboard\">reputation is tracked independently on Meta</a>, just not shown.</sup></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2014-03-24T17:39:28.883","CommentCount":"0"},{"Id":"2018","PostTypeId":"2","ParentId":"2016","CreationDate":"2014-03-24T22:22:27.780","Score":"0","Body":"<p>My view is that the badges do depend on the meta or non meta site so can be split up - the rep does not give any extra privileges to the meta site so there is no point in a separate reputation here.</p>\n\n<p>I would note that meta.stackoverflow is getting changed so that there will be a site for StackOverflow and an overall site for all Stackexchange sites </p>\n","OwnerUserId":"237","LastActivityDate":"2014-03-24T22:22:27.780","CommentCount":"0"},{"Id":"2019","PostTypeId":"1","CreationDate":"2014-03-25T00:31:00.190","Score":"0","ViewCount":"36","Body":"<p>I’m using an old version of IOS Safari (original iPad).  Of course, there a lot of minor irritations with the UI.  One of them is that on all SE sites, selecting a suggested tag takes anywhere from two taps to more than I’m willing to retry.</p>\n\n<p>Except here.  Here, “it just works.”</p>\n\n<p>Is it different JavaScript?<br>\n<hr>\n(edit)<br />\nSigh.  Never mind.  Until now, I selected a tag with one tap every time in the site only.  This time, I gave up after ten taps.</p>\n","OwnerUserId":"65467","LastEditorUserId":"37797","LastEditDate":"2014-05-26T18:09:59.013","LastActivityDate":"2014-05-26T18:09:59.013","Title":"Does Ask Different have a different tag-suggester than other SE sites?","Tags":"<support><tags><editing><asking-questions>","AnswerCount":"0","CommentCount":"2"},{"Id":"2020","PostTypeId":"2","ParentId":"1989","CreationDate":"2014-03-25T00:45:08.063","Score":"-1","Body":"<p>On MacOS, I’ve used Unicode Hex Input to enter them.</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Unicode_subscripts_and_superscripts\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Unicode_subscripts_and_superscripts</a></p>\n","OwnerUserId":"65467","LastActivityDate":"2014-03-25T00:45:08.063","CommentCount":"0"},{"Id":"2021","PostTypeId":"1","AcceptedAnswerId":"2022","CreationDate":"2014-03-25T14:08:53.160","Score":"4","ViewCount":"41","Body":"<p><strong>Review low quality posts</strong></p>\n\n<p>Sometimes I see one of those one-line-answers and I write a comment below.\nBut after reviewing I have to click one of these options: <strong>Looks good</strong> - <strong>Edit</strong> - <strong>Improve</strong> - <strong>Skip</strong></p>\n\n<p>What should I click after adding a comment?\nIs that <strong>Looks good</strong> because I don't want the answer to be removed?\nOr is it <strong>Skip</strong>?</p>\n\n<p>Both doesn't look right to me, as I wrote a comment thus not skipping that review.</p>\n","OwnerUserId":"34561","LastActivityDate":"2014-04-23T10:20:12.213","Title":"Review low quality posts [ looks good ]","Tags":"<support><review-page>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"2022","PostTypeId":"2","ParentId":"2021","CreationDate":"2014-03-25T15:27:31.180","Score":"3","Body":"<p>I agree the naming of the options is confusing here. </p>\n\n<p>The solution you want is Looks Good.</p>\n\n<p>Basically Looks Good means I have reviewed the post and taken all the actions I can do. Skip always means I don't know what do to here - leave this in queue for another reviewer. </p>\n\n<p>See this <a href=\"https://meta.stackexchange.com/questions/143469/in-the-new-review-beta-what-does-the-looks-good-button-actually-do\">question</a> about what the buttons do and this <a href=\"https://meta.stackexchange.com/questions/147867/late-answers-and-first-posts-encouraging-unnecessary-actions\">one</a> for why this came about</p>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-04-23T10:20:12.213","CommentCount":"1"},{"Id":"2023","PostTypeId":"1","AcceptedAnswerId":"2024","CreationDate":"2014-03-27T16:57:46.983","Score":"0","ViewCount":"29","Body":"<p>I was about to offer a bounty on a question and noticed that the 50 point bounty is not available anymore. </p>\n\n<p>I think before I was offered the option between 50, 100, and 150. Now it is 100 - 500 in various increments.</p>\n\n<p>Is this because I have a bounty out already, or was there a site wide change?</p>\n","OwnerUserId":"70930","LastActivityDate":"2014-03-27T19:47:54.760","Title":"Bounty reward amounts","Tags":"<support><bounty>","AnswerCount":"1","CommentCount":"0"},{"Id":"2024","PostTypeId":"2","ParentId":"2023","CreationDate":"2014-03-27T19:47:54.760","Score":"2","Body":"<p>Two factors will increase the minumum bounty. </p>\n\n<ul>\n<li>If you answered the question, you start at 100 for a bounty. </li>\n<li>If you offer multiple bounties on one post, it increases exact iteration. </li>\n</ul>\n","OwnerUserId":"5472","LastActivityDate":"2014-03-27T19:47:54.760","CommentCount":"1"},{"Id":"2025","PostTypeId":"2","ParentId":"2014","CreationDate":"2014-03-28T12:46:51.917","Score":"1","Body":"<p>We cannot view your voting page to corroborate your voting numbers - Mods cannot easily see how many times you voted, and certainly not who you voted for.  Once it's more than a day old, the best we can do is see how times you have voted in the current week/month.</p>\n\n<p>In this instance checking your profile page suggests you have made 27 votes this week, but it sounds as though your voting spree took place last week.  Your monthly figure of 127 votes suggests you have made enough votes to potentially receive the badge, but does not confirm that 40 of them were made on the same day.</p>\n\n<p>If you can take a proper look at your own personal voting page at <a href=\"https://apple.stackexchange.com/users/34561/rob?tab=votes&amp;sort=all&amp;page=2\">here</a> and count that you definitely made 40 in 1 day, then we can perhaps look into it as a bug etc, but there's not a lot else we can do to explain why you have not received the badge although it is possible that a vote you cast was essentially \"voided\" if the post it was one was subsequently removed before the daily badge run completed.</p>\n","OwnerUserId":"9495","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-03-28T15:29:07.620","CommentCount":"0"},{"Id":"2026","PostTypeId":"1","CreationDate":"2014-03-29T22:41:11.937","Score":"1","ViewCount":"74","Body":"<p>I've put a hold on this question:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/125358/does-anyone-know-any-good-diagnostic-tools\">Does anyone know any good Diagnostic tools?</a></li>\n</ul>\n\n<p>It strikes me as something we want on the site, but as worded, it's far too vague to be searchable IMO. </p>\n\n<p>We don't have a specific ban on software-recommendataion questions, but the general advice from Stack Overflow is still helpful to me in deciding when to step in and pause a question:</p>\n\n<blockquote>\n  <p>Questions asking us to recommend or find a tool, library or favorite off-site resource are off-topic for Stack Overflow as they tend to attract opinionated answers and spam. Instead, describe the problem and what has been done so far to solve it.</p>\n</blockquote>\n\n<p>This question could easily be reopened if there is an actual problem being solved. If so, let's edit it to <strong>describe the problem</strong> and then document <strong>what has been done so far to solve it</strong>.</p>\n\n<p>If it's meant to be a subjective question, it might need some significant tightening of scope. From our help center:</p>\n\n<blockquote>\n  <ul>\n  <li>every answer is equally valid: “What’s your favorite ______?”</li>\n  <li>your answer is provided along with the question, and you expect more answers: “I use ______ for ______, what do you use?”</li>\n  <li>there is no actual problem to be solved: “I’m curious if other people feel like I do.”</li>\n  <li>you are asking an open-ended, hypothetical question: “What if ______ happened?”</li>\n  </ul>\n</blockquote>\n\n<p>To relate those words to the post in question. It seems like the following is happening:</p>\n\n<ul>\n<li><em>What's your favorite diagnostic tool for Mac?</em></li>\n<li>It's not actually stating a tool, but the answers read like what I would expect if someone posted \"I use AHT for diagnosing Mac, what do you use?\"</li>\n<li>I think a more precise statement of what problem needs diagnosis, this could be reopened rapidly with an edit and then cleaning the commentary and answers that are now obsolete / not relating to the actual problem</li>\n</ul>\n\n<p>Basically, it seems a community discussion of an open-ended \"diagnosis\" topic.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-05-01T15:07:22.860","Title":"What can be done to improve this question?","Tags":"<discussion><closed-questions><close-reasons>","AnswerCount":"1","CommentCount":"1"},{"Id":"2027","PostTypeId":"2","ParentId":"1977","CreationDate":"2014-03-31T23:48:14.510","Score":"0","Body":"<p>For simplicity I sugest using the old tags and give them the proper meaning and just add one new tag:</p>\n\n<hr>\n\n<h2>tags for Mac OS X Server 10.0 - 10.6</h2>\n\n<pre><code>- Mac-OSX-Server (new tag for 'Legacy' full Mac Server Versions)\n- ServerAdmin\n- Workgroup-Manager.app\n</code></pre>\n\n<hr>\n\n<h2>tags for OS X Server 10.7 - 10.9</h2>\n\n<pre><code>- OSX-Server (as an add-on to an installed OS X) \n- Server.app\n</code></pre>\n","OwnerUserId":"71997","LastEditorUserId":"71997","LastEditDate":"2014-04-01T01:42:50.787","LastActivityDate":"2014-04-01T01:42:50.787","CommentCount":"0"},{"Id":"2028","PostTypeId":"2","ParentId":"1977","CreationDate":"2014-04-01T02:49:58.957","Score":"2","Body":"<p>For simplicity I suggest what the tag wikis currently say. </p>\n\n<ul>\n<li>Sever.app for 10.7 and up where you just instal the app on top of normal OSX. </li>\n<li>OSX-server for 10.6 and below where you need a license key and separate install media to install the sever build instead of the client/workstation build of OSX. </li>\n</ul>\n","OwnerUserId":"5472","LastActivityDate":"2014-04-01T02:49:58.957","CommentCount":"0"},{"Id":"2029","PostTypeId":"2","ParentId":"2026","CreationDate":"2014-04-01T09:19:30.483","Score":"-1","Body":"<p>It is not a answer to your specific question, just brainstorming:</p>\n\n<p>I am \"still\" in favor of a pop up when asking a question, with some basic information to be filled in, ie model, OS, maybe some basic categories like, repair, improve, unknown error ect. that would help with many questions missing that. </p>\n\n<p>This would eliminate many questions from moderators attention for been vague.</p>\n\n<p>In this case it would be not possible to ask a question spanning over the whole family of Apple products, that are usually open ended questions, since only one model can be entered.</p>\n\n<p>Here is another example:</p>\n\n<p><img src=\"https://i.stack.imgur.com/NRJEp.png\" alt=\"example of bad question\"></p>\n\n<p>5 people looked and took the action of voting it down! even a moderator got involved to put it on hold?</p>\n\n<p>Since the user only has 1 point anyway what does that do?</p>\n\n<p>Having some sort of minimum to be filled out (as option) could prevent the fuss.</p>\n\n<p>I do not know the solution, but seen the April joke in working, I wonder if same method could be used.</p>\n\n<p>This will not eliminate the open field for asking questions, but will prevent the bad one.</p>\n","OwnerUserId":"46541","LastEditorUserId":"46541","LastEditDate":"2014-04-01T14:45:33.407","LastActivityDate":"2014-04-01T14:45:33.407","CommentCount":"6"},{"Id":"2030","PostTypeId":"1","AcceptedAnswerId":"2032","CreationDate":"2014-04-01T10:54:34.837","Score":"1","ViewCount":"60","Body":"<p>I used the Uniconis to make modifications but now I do not like what I got.</p>\n\n<p>Is there a way to undo the modifications like scrolling title bar ect.</p>\n\n<p>What is Unicoins:</p>\n\n<p>It is a popup on the right hand site top on the ask differant and it looks like this.</p>\n\n<p><img src=\"https://i.stack.imgur.com/i2oLZ.png\" alt=\"Unicoins\"></p>\n\n<p>More about Unicoins:</p>\n\n<p><img src=\"https://i.stack.imgur.com/3w6oN.png\" alt=\"about unicoins\"></p>\n","OwnerUserId":"46541","LastEditorUserId":"5472","LastEditDate":"2014-04-01T11:47:50.267","LastActivityDate":"2014-04-23T08:48:43.713","Title":"How to undo Unicoins changes","Tags":"<discussion><support>","AnswerCount":"2","CommentCount":"5"},{"Id":"2031","PostTypeId":"2","ParentId":"2030","CreationDate":"2014-04-01T11:25:04.063","Score":"1","Body":"<p>It's indeed the Aprils Fools joke of SE this year.</p>\n\n<p>You can follow the humor, discussion and confusion at <a href=\"https://meta.stackexchange.com/questions/tagged/unicoins\">SO Meta</a> and by logging out of the site, you will see that nothing has actually changed on your account. </p>\n","OwnerUserId":"34561","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-04-01T11:59:56.240","CommentCount":"0"},{"Id":"2032","PostTypeId":"2","ParentId":"2030","CreationDate":"2014-04-02T18:14:50.880","Score":"1","Body":"<p>You can remove a power by 'recycling' the power — this costs 10 coins though.</p>\n","OwnerUserId":"37797","LastActivityDate":"2014-04-02T18:14:50.880","CommentCount":"0"},{"Id":"2033","PostTypeId":"2","ParentId":"2014","CreationDate":"2014-04-04T12:56:17.510","Score":"1","Body":"<p>I think some questions/answers I've down or upvoted have been removed. Because if I count the questions and answers right now, it's missing 4.</p>\n\n<p>I think that's why I didn't get the badge.</p>\n","OwnerUserId":"34561","LastActivityDate":"2014-04-04T12:56:17.510","CommentCount":"0"},{"Id":"2035","PostTypeId":"1","CreationDate":"2014-04-06T23:19:34.040","Score":"2","ViewCount":"25","Body":"<p>I’ve just proposed an answer to  <a href=\"https://apple.stackexchange.com/questions/126687/which-macbook-screen-should-i-buy/126717\">Which MacBook screen should I buy?</a> Because it seemed to me the underlying question went well before the scope of what the OP was asking, I took the liberty of writing the question <a href=\"https://apple.stackexchange.com/questions/126715/how-to-identify-which-model-is-my-mac/126716#126716\">How to identify which model is my Mac?</a> (and proposing an answer to it).</p>\n\n<p>My answer to <a href=\"https://apple.stackexchange.com/questions/126687/which-macbook-screen-should-i-buy/126717\">Which MacBook screen should I buy?</a> is thus little more (well, still <em>more</em>, but not much at all) than a link to the other question.</p>\n\n<p>Is this an acceptable way to proceed or should I avoid it in the future?</p>\n","OwnerUserId":"59012","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-04-07T00:22:15.120","Title":"Is it bad taste to refer to a question you’ve just written yourself to answer someone?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"2036","PostTypeId":"2","ParentId":"2035","CreationDate":"2014-04-07T00:22:15.120","Score":"1","Body":"<p>I think it's very hard to give a general rule here outside of: if your answer serves to address the question, it's a good thing to do. And in your specific case I believe that to be true. You've given the answer the user needs to move forward and solve their problem. I don't see any problem with this and wouldn't request to you avoid it.</p>\n\n<p>There's a general dislike of links on the Stack Exchange network because they rot and you lose the answers, but in this case you're linking to another AD answer so no need to worry about rot.</p>\n","OwnerUserId":"292","LastActivityDate":"2014-04-07T00:22:15.120","CommentCount":"2"},{"Id":"2037","PostTypeId":"1","CreationDate":"2014-04-07T21:31:03.963","Score":"4","ViewCount":"79","Body":"<p>this is my first visit here and my attempts to comment on a certain Siri post were halted by a prompt for registration. Upon meeting that requirement, my efforts were subsequently derailed by yet another prompt saying that said I needed 50 \"reputation\". It kind of reminds me of bronchitis... Ain't nobody got time for that. </p>\n\n<p>Now, is my opinion that the requirements for new users to participate in this forum are inane and exorbitant. I'm sure once I ask a few questions it will be smooth sailing, however, I can't muster up a single Apple questions so this question is my attempt to gain some reputation as well as share my opinion.</p>\n\n<p>I understand that one need 15 reputation points to rate a comment up and 50 to even post a comment. This is most likely set in place to protect the integrity of the content, however, I don't think it's working...  One of your users asked if <a href=\"https://apple.stackexchange.com/questions/118332/is-there-a-siri-on-mac-os-x\">Siri was available for Mac</a> and they rated his question <strong>DOWN</strong>. Who does that? Where I come from, the only stupid question is the one not asked (and maybe this one).</p>\n\n<p>As for myself, I am an engineer, Apple certified technician, computer store franchise owner, IOS dev and 3-time world karate champion. I didn't join to ask questions, but rather to help. Alas, if asking questions is how one gains \"reputation\", then you can expect questions like this from me. I'm just saying, I'm a seasoned pro. The multiple certifications on my wall is my \"reputation\". </p>\n","OwnerDisplayName":"user75089","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2017-01-25T19:14:36.747","Title":"Why can't I do anything on this site?","Tags":"<discussion>","AnswerCount":"3","CommentCount":"0","FavoriteCount":"1"},{"Id":"2038","PostTypeId":"2","ParentId":"2037","CreationDate":"2014-04-07T22:07:08.323","Score":"7","Body":"<p>Start here: <a href=\"https://apple.stackexchange.com/help/whats-reputation\">https://apple.stackexchange.com/help/whats-reputation</a>.</p>\n\n<p>You earn Rep by people voting on your contribution.  Initially that's Questions and Answers.  Doesn't matter which.  As you warn more Rep, you gain greater privileges that allow you to comment and so on.</p>\n\n<p>This is in order to gradually break users into how the site works, and to prevent people from providing answers in comments and all sorts of other behaviour that is well intended but not a good fit for how the site works.  Once you have gained sufficient rep on any Stack Exchange Site, you automatically get 101 starter rep on other sites to prevent you having to go through this hoop more than once.</p>\n\n<p>As for voting, people are free to vote up or down as they see fit.  We rely on consensus to  ensure the good stuff is up voted, and the bad stuff voted down.  Usually it works great.  Sometimes is throws out odd results, especially on posts with little voting.  We cannot see, even as moderators, who voted for who or what, and we certainly never ask why.  If you think it's a good question, go vote it up!  However, see @grgarside's comment; the poster of the question appears to have posted a \"jeopardy\" style questions purely to promote a product.  In this case, a flag to the Mod team is appropriate (and was received) in addition to the down vote.</p>\n\n<p>I hope you get into how things work, there is a good logic to most of it, and by and large it's all about getting quality content and avoiding discussions, commentary and disagreements that can make other sites a pain to use.</p>\n\n<p>As a last point to note, I moved this into \"Meta\", which is where we go to ask questions <em>about</em> the site, rather then <em>on</em> it.</p>\n","OwnerUserId":"9495","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-04-07T22:13:02.783","CommentCount":"0"},{"Id":"2039","PostTypeId":"2","ParentId":"2037","CreationDate":"2014-04-07T22:10:34.363","Score":"6","Body":"<p>You primarily gain reputation by answering questions. </p>\n\n<p>I did feel a little constrained when I first joined, but by answering a few easy questions I got above 50 rep in my first day of effort. Each up vote of a question or answer is worth 10 points. </p>\n\n<p>Rather than needing people to take exams or have certificates, the community gives reputation to those that put out useful content.</p>\n","OwnerUserId":"70930","LastEditorUserId":"5472","LastEditDate":"2014-04-08T01:50:11.207","LastActivityDate":"2014-04-08T01:50:11.207","CommentCount":"1"},{"Id":"2040","PostTypeId":"1","CreationDate":"2014-04-08T08:11:08.683","Score":"3","ViewCount":"43","Body":"<p>I just wanted to flag <a href=\"https://apple.stackexchange.com/questions/126842/wi-fi-network-created-but-not-shown-on-other-devices\">https://apple.stackexchange.com/questions/126842/wi-fi-network-created-but-not-shown-on-other-devices</a> as being off-topic for not running on Apple hardware.</p>\n\n<p>But there's no option for it.</p>\n\n<p>However, the other question of this user has been put <strong>on-hold</strong> for this off-topic reason.</p>\n\n<p>Why is it a reason, but can't I flag for it?</p>\n\n<p><img src=\"https://i.stack.imgur.com/jOZci.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"34561","LastEditorUserId":"4604","LastEditDate":"2014-04-14T01:35:55.750","LastActivityDate":"2014-04-14T01:40:53.167","Title":"Please add textbox for Off-Topic flagging","Tags":"<support><status-bydesign><flagging>","AnswerCount":"2","CommentCount":"5"},{"Id":"2041","PostTypeId":"2","ParentId":"2040","CreationDate":"2014-04-08T14:44:55.270","Score":"1","Body":"<p>Here is how I would expect a user to handle that question: </p>\n\n<ol>\n<li>Select the close reason (it's better to just close than flag if you have that option)</li>\n<li>&nbsp; <img src=\"https://i.stack.imgur.com/kcZcM.png\" alt=\"Closing\"></li>\n<li>Select either unclear (it could after all still be about Apple hardware or software and need an edit to clarify the link) or off-topic using the default close reason about scope as documented in the [help]. </li>\n<li>&nbsp; <img src=\"https://i.stack.imgur.com/d3gc8.png\" alt=\"Flagging &gt; Closing\"></li>\n<li>Close for other:</li>\n<li>&nbsp; <img src=\"https://i.stack.imgur.com/FFB5g.png\" alt=\"Flagging &gt; Closing &gt; Off-Topic\"></li>\n</ol>\n\n<p>I'll ping the SE employees to ask if the last picture above can get coded to include the custom close reason text with a radio button to indicate simply that <strong>This question does not appear to be about Apple hardware or software within the scope defined in the <a href=\"https://apple.stackexchange.com/help/on-topic\">help center</a>.</strong></p>\n\n<p>As things are coded, you might need to choose \"Other\" and copy/paste or re-type the default close reason. Here's something you can copy below:</p>\n\n<blockquote>\n  <p>This question does not appear to be about Apple hardware or software within the scope defined in the [help center](<a href=\"https://apple.stackexchange.com/help/on-topic\">https://apple.stackexchange.com/help/on-topic</a>).</p>\n</blockquote>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-04-08T15:09:24.440","CommentCount":"3"},{"Id":"2042","PostTypeId":"1","CreationDate":"2014-04-09T14:17:52.873","Score":"1","ViewCount":"38","Body":"<p>I note that all the most interesting questions are about Clash of Clans and possibly ids. Which rather removes other questions</p>\n\n<p>Could mass updates like these please be done over a few days so not all the questions are the same and let some other questions stay at the top (I think this has been raised on met stack exchange before)</p>\n\n<p>The number suggests that there might be a few duplicates</p>\n","OwnerUserId":"237","LastEditorUserId":"37797","LastEditDate":"2014-05-24T19:15:17.597","LastActivityDate":"2014-05-24T19:15:17.597","Title":"Mass edit and front page","Tags":"<discussion><editing>","AnswerCount":"1","CommentCount":"0"},{"Id":"2043","PostTypeId":"1","AcceptedAnswerId":"2045","CreationDate":"2014-04-09T15:03:41.973","Score":"0","ViewCount":"50","Body":"<p>I find this person appearing and doing edits, mostly turning them in to garbage.</p>\n\n<p>Who is it ?</p>\n\n<p><img src=\"https://i.stack.imgur.com/5exzR.png\" alt=\"anonim\"></p>\n\n<p>The latest sample (not so bad as previous ones), where your system actualy tells me it thinks this is a scam!\n<a href=\"https://apple.stackexchange.com/review/suggested-edits/58367\">https://apple.stackexchange.com/review/suggested-edits/58367</a></p>\n","OwnerUserId":"46541","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-04-09T19:39:11.867","Title":"Who is Anonimous User","Tags":"<discussion><user-accounts>","AnswerCount":"1","CommentCount":"0"},{"Id":"2044","PostTypeId":"2","ParentId":"2042","CreationDate":"2014-04-09T15:09:15.693","Score":"2","Body":"<p>I was aware that it would flood the page and did the changes nonetheless. Unless someone wants to volunteer to take retag work and spread it out, it sometimes happens like that.</p>\n\n<p>The upside is people that notice can vote to close as dupe / edit / answer and I was hoping that the upside of having 20 questions tagged properly and the opportunity for fresh eyes to clean some of them up would outweigh whatever other questions would have been \"active\" for this short time period.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-04-09T15:09:15.693","CommentCount":"0"},{"Id":"2045","PostTypeId":"2","ParentId":"2043","CreationDate":"2014-04-09T15:10:22.847","Score":"2","Body":"<p>The site allows people to perform some actions without logging in. Anonymous means a user that wasn't logged in made that action.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-04-09T15:10:22.847","CommentCount":"7"},{"Id":"2046","PostTypeId":"1","AcceptedAnswerId":"2047","CreationDate":"2014-04-10T14:18:11.223","Score":"5","ViewCount":"89","Body":"<p>Having just surpassed 500 helpful flags (and got a wonderful gold badge!) I'm wondering how my accuracy in flagging is compared to the average user.</p>\n\n<p><strong>Where can I look for average percentages of declined to helpful flags for the various categories of flag?</strong></p>\n\n<p>In case numbers can't be disclosed, here is my current flagging history to allow for comments such as 'high'/'low':</p>\n\n<p><img src=\"https://i.stack.imgur.com/tCVWR.png\" width=\"206\"></p>\n","OwnerUserId":"37797","LastActivityDate":"2014-04-10T14:45:04.880","Title":"What is the average helpful/declined flag rate?","Tags":"<discussion><flagging>","AnswerCount":"1","CommentCount":"1"},{"Id":"2047","PostTypeId":"2","ParentId":"2046","CreationDate":"2014-04-10T14:45:04.880","Score":"5","Body":"<p>Short Answer: You can't.</p>\n\n<p>Long Answer: I'm afraid you can't ;)</p>\n\n<p>Flags is like votes, you can see your own, we can't.  You have access to the raw data, and can compile stats from it, but there's no handy page, not even for a Mod, that will do it.</p>\n","OwnerUserId":"9495","LastActivityDate":"2014-04-10T14:45:04.880","CommentCount":"4"},{"Id":"2048","PostTypeId":"1","CreationDate":"2014-04-10T18:34:11.547","Score":"2","ViewCount":"24","Body":"<p>On the main site's <a href=\"https://apple.stackexchange.com/users?tab=moderators\">/users?tab=moderators</a> it shows the year that the user was elected as a moderator under their reputation.</p>\n\n<p><img src=\"https://i.stack.imgur.com/C9wAQ.png\" width=\"507\"></p>\n\n<p>However, on meta's <a href=\"https://apple.meta.stackexchange.com/users?tab=moderators\">/users?tab=moderators</a> the year of election is missing.</p>\n\n<p><img src=\"https://i.stack.imgur.com/t6RYr.png\" width=\"512\"></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-04-10T19:06:59.523","Title":"Missing elected year on moderators' users page in meta","Tags":"<bug><status-bydesign><design><users>","AnswerCount":"0","CommentCount":"2"},{"Id":"2049","PostTypeId":"1","CreationDate":"2014-04-12T11:17:26.343","Score":"-6","ViewCount":"65","Body":"<p>Was wondering if it would be helpful to moderators and to keep this site cleaner to do following.</p>\n\n<p>On each negative Vote on the Question the Font gets reduced in gray scale color.</p>\n\n<p>So for example on this one:</p>\n\n<p><img src=\"https://i.stack.imgur.com/2zQkq.png\" alt=\"gray scale\"></p>\n\n<p>With 5 down votes the text should be barley visible ?</p>\n\n<p>It is a shame the Spammer gets more that 30 minutes of promotion and advertisement without been able to do much until a moderator takes action.</p>\n\n<p>UPDATE:</p>\n\n<p>Statistical it happens more and more and as you can see 4 down votes and not one FLAG ? Means 4 users had to open the question and then all they did is downvote.</p>\n\n<p><img src=\"https://i.stack.imgur.com/ilkFa.png\" alt=\"scam\"></p>\n\n<p>EDIT:</p>\n\n<p>Well in conclusion let it just put this way</p>\n\n<p>It is not acceptable in 21 century on a high profile and high traffic web site to have Spams just sitting there for a hour or more.</p>\n\n<p>The current system </p>\n\n<blockquote>\n  <p>There is an automated system - it requires 6 flags and not votes see\n  this meta answer –  Mark</p>\n</blockquote>\n\n<p>needs some overhaul.</p>\n","OwnerUserId":"46541","LastEditorUserId":"46541","LastEditDate":"2014-04-17T11:35:09.660","LastActivityDate":"2014-04-23T08:48:43.713","Title":"Introduce a Gray Scale to Negative Voted Questios","Tags":"<discussion><voting><spam>","AnswerCount":"1","CommentCount":"18"},{"Id":"2050","PostTypeId":"2","ParentId":"2049","CreationDate":"2014-04-12T13:35:31.397","Score":"2","Body":"<p>I do not think this is required.</p>\n\n<p>The main issue is that people need to flag this as spam, down votes have no effect.</p>\n\n<p>After 3 flags it will not be on the front page - so takes less effort by us that your suggestion</p>\n\n<p>From meta stackexchnage <a href=\"https://meta.stackexchange.com/a/58035/136010\">answer</a></p>\n\n<blockquote>\n  <p>The spam flag is designed to eliminate posts with no relevant content and to penalize the authors:</p>\n  \n  <ul>\n  <li>3 flags (spam or offensive): post is banished from the front page.</li>\n  <li>6 flags (spam or offensive): post is locked, deleted, and the first revision owner loses 100 reputation.</li>\n  <li>1 flag from a moderator has the same effect as 6 flags from normal users: instant destruction.</li>\n  <li>Because a question with 6 flags is locked and deleted by the Community user, a 10k reputation user cannot undelete it.</li>\n  <li>Each flag carries an implicit downvote for calculating the post's score (it does not affect the user's reputation).</li>\n  </ul>\n</blockquote>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-04-12T13:35:31.397","CommentCount":"2"},{"Id":"2051","PostTypeId":"2","ParentId":"2040","CreationDate":"2014-04-14T01:40:53.167","Score":"6","Body":"<p>We removed the \"Other\" option for users who don't yet have the <a href=\"https://apple.stackexchange.com/help/privileges/close-questions\">cast close votes</a> privilege. Trusting folks who haven't yet gained the system's trust to even <em>know</em> what's on- and off-topic, much less write helpful comments to this end, is pretty risky. </p>\n\n<p>Removing the option to flag <em>blatantly</em> off-topic stuff isn't great either though. I tend to think the best option here would be to just add an \"other\" option <em>without</em> offering the chance to enter a comment. </p>\n\n<p>Until we get around to doing that, you can back out to the main flag dialog and choose \"other (needs ♦ moderator attention)\" and just explain the problem there.</p>\n","OwnerUserId":"4604","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-04-14T01:40:53.167","CommentCount":"0"},{"Id":"2053","PostTypeId":"2","ParentId":"1719","CreationDate":"2014-04-15T13:11:26.670","Score":"2","Body":"<p>Not sure when this happened (<a href=\"https://meta.stackexchange.com/questions/59445/recent-feature-changes-to-stack-exchange\">didn't seem to be specifically documented</a>) but it did happen<br>\n(at least before December 2013):</p>\n\n<p><img src=\"https://i.stack.imgur.com/7OczJ.png\" alt=\"Find a question to answer, or ask your own | See new questions | Ask a question | Looking for more in-depth information on the site? Visit the Help Center\"></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-04-15T13:11:26.670","CommentCount":"0"},{"Id":"2054","PostTypeId":"1","AcceptedAnswerId":"2055","CreationDate":"2014-04-15T13:11:34.990","Score":"3","ViewCount":"29","Body":"<p>I was looking at Ask Different's About page and saw the following question as our example:</p>\n\n<p><img src=\"https://i.stack.imgur.com/UhQto.png\" width=\"529\"></p>\n\n<p>Why don't we have a 'proper' question? I'm sure we used to, right?</p>\n","OwnerUserId":"37797","LastEditorUserId":"5472","LastEditDate":"2014-04-15T14:19:38.117","LastActivityDate":"2014-04-15T14:19:38.117","Title":"Why don't we have an actual question on our About page?","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2055","PostTypeId":"2","ParentId":"2054","CreationDate":"2014-04-15T14:18:29.217","Score":"2","Body":"<p>I don't know why it got de-selected, but I have chosen a new question from the ones we get to pick. </p>\n","OwnerUserId":"5472","LastActivityDate":"2014-04-15T14:18:29.217","CommentCount":"2"},{"Id":"2056","PostTypeId":"1","AcceptedAnswerId":"2057","CreationDate":"2014-04-15T20:25:47.513","Score":"3","ViewCount":"31","Body":"<p>I have often seen, on the front page, a question from years ago showing up as “Active” due to an update made by “Community ♦”. Specifically, <a href=\"https://apple.stackexchange.com/questions/94156/iphone-3gs-turning-off-randomly-while-being-used/?lastactivity\">this question</a> does not show any activity with <code>?lastactivity</code> (accessible from the front page by clicking the link that looks like “24m ago”).</p>\n\n<p>The revision histories of <a href=\"https://apple.stackexchange.com/posts/75005/revisions\">the question</a> and <a href=\"https://apple.stackexchange.com/posts/75006/revisions\">both</a> <a href=\"https://apple.stackexchange.com/posts/83937/revisions\">answers</a> show nothing indicating an edit.</p>\n\n<p>I don't know why it shows up in the “Active” section if the changes made are silent.</p>\n","OwnerUserId":"67260","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-04-16T14:52:23.220","Title":"Why do silent changes made by “Community ♦” show up in the front page?","Tags":"<support><community-user>","AnswerCount":"1","CommentCount":"0"},{"Id":"2057","PostTypeId":"2","ParentId":"2056","CreationDate":"2014-04-15T20:58:01.503","Score":"3","Body":"<p>Questions with no or no upvoted answers (as the one referenced in the question) will get reinfected into the front page a few times automatically to get more attention. As no user is involved the user is shown as \"community\". </p>\n\n<p>Like many users, community has a profile page that explains what they like to do on the site. In this case, community is a robot that randomly pokes these questions:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/users/-1/community\">https://apple.stackexchange.com/users/-1/community</a></li>\n</ul>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-04-16T14:52:23.220","CommentCount":"4"},{"Id":"2058","PostTypeId":"1","AcceptedAnswerId":"2059","CreationDate":"2014-04-16T12:04:44.967","Score":"1","ViewCount":"25","Body":"<p><img src=\"https://i.stack.imgur.com/iI4uV.png\" alt=\"scam\"></p>\n\n<p>Just Reject, since there is no Delete option ?</p>\n","OwnerUserId":"46541","LastActivityDate":"2014-04-16T12:06:49.103","Title":"What is the best way to handle this Scam","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2059","PostTypeId":"2","ParentId":"2058","CreationDate":"2014-04-16T12:06:49.103","Score":"3","Body":"<p>\"Reject\" means \"Delete the edit\" in this case, so yes, \"Reject\" is the right thing to do.</p>\n","OwnerUserId":"9058","LastActivityDate":"2014-04-16T12:06:49.103","CommentCount":"2"},{"Id":"2060","PostTypeId":"1","CreationDate":"2014-04-16T19:27:52.723","Score":"4","ViewCount":"50","Body":"<p>How is it that a <a href=\"https://apple.stackexchange.com/help/badges/94/custodian?userid=75812\">new user with 1 reputation has a badge for reviewing suggested edits</a> and when I go to review, I see \"You need at least 2k reputation to review suggested edits.\"</p>\n","OwnerUserId":"70930","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-04-23T08:48:43.713","Title":"How can a user review a suggested edit without having access to the suggested edit review queue?","Tags":"<support><reputation><review-page>","AnswerCount":"2","CommentCount":"3"},{"Id":"2061","PostTypeId":"2","ParentId":"2060","CreationDate":"2014-04-16T19:37:45.283","Score":"3","Body":"<p>You are always allowed to review pending suggested edits on your own posts. In this case, the user reviewed one of your edits to their question:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/review/suggested-edits/59018\">https://apple.stackexchange.com/review/suggested-edits/59018</a></li>\n</ul>\n\n<p>The user will have received a notification like this in their inbox notifying them that their post has got a pending suggested edit:</p>\n\n<p><img src=\"https://i.stack.imgur.com/jw0H9.png\" width=\"373\"></p>\n\n<p>Clicking this item in their inbox goes to the suggested edit queue where the suggested edit is shown in the same way that any other reviewer may review the edit. They may approve or reject the edit and have a binding vote similar to a diamond moderator's binding vote.</p>\n\n<p>As shown in the review history, the user who reviewed it has the blue background on their username indicating that they are the post owner and therefore have the authority to have a binding vote on the suggested edit.</p>\n\n<p><img src=\"https://i.stack.imgur.com/xrMS0.png\" width=\"324\"></p>\n\n<p>The suggested edit can still be reviewed by others in the meantime…</p>\n\n<ul>\n<li><p>If the suggested edit is approved by someone with access to the suggested edit review queue before they have the chance to review it themselves, they receive a normal inbox notification informing them that their post has been edited. This is the same notification that a user receives if someone with >2k edits their post normally.</p>\n\n<p><img src=\"https://i.stack.imgur.com/o1a86.png\" width=\"374\"></p></li>\n<li><p>If the suggested edit is rejected before they review it, they do not receive any further notifications.</p></li>\n</ul>\n\n<p>The user does not have access to the suggested edit queue outside of any pending suggested edits on their own posts. Once they have exhausted all the pending suggested edits they will be informed that the suggested edit queue requires 2k reputation — the same message a user without the reputation to review posts in the suggested edit queue and without any pending suggested edits.</p>\n\n<p>Even though the user is the post owner and does not have access to the review queue, their approval or rejection of the suggested edit is still shown normally in the suggested edit review queue history, both in the suggested edit queue history (available at 10k)…</p>\n\n<p><img src=\"https://i.stack.imgur.com/vv1of.png\"></p>\n\n<p>…and in the suggested edit history in the mod tools…</p>\n\n<p><img src=\"https://i.stack.imgur.com/Pp9E0.png\" width=\"473\"></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-04-16T20:03:10.177","CommentCount":"4"},{"Id":"2062","PostTypeId":"2","ParentId":"2060","CreationDate":"2014-04-16T19:39:56.067","Score":"0","Body":"<p>He earned the badge for <a href=\"https://apple.stackexchange.com/review/suggested-edits/59018\">reviewing and accepting a suggested, pending edit</a> on his own question.</p>\n\n<p>According to <a href=\"https://meta.stackexchange.com/questions/76251/how-do-suggested-edits-work\">How do suggested edits work?</a>:</p>\n\n<blockquote>\n  <h2>Who can vote on a suggested edit?</h2>\n  \n  <ul>\n  <li>The owner of a post may cast a binding vote to accept or reject any modification of their post.</li>\n  </ul>\n</blockquote>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-04-16T19:39:56.067","CommentCount":"0"},{"Id":"2063","PostTypeId":"1","AcceptedAnswerId":"2064","CreationDate":"2014-04-17T19:45:30.650","Score":"5","ViewCount":"147","Body":"<p>For certain questions, there may be multiple ways of doing something. This is the question that persuaded me to write this:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/127716/fastest-way-to-get-a-photo-from-iphone-to-mac\">Fastest way to get a photo from iPhone to Mac?</a></li>\n</ul>\n\n<p>My existing answer is a way to get the photo to the Mac over Photo Stream using a folder. However, I also have a second way, completely unrelated to Photo Stream yet still a very quick way to transfer photos.</p>\n\n<p>How should I include this second answer? Should I edit my existing answer to include a second answer, in this way:</p>\n\n<blockquote>\n  <h3>Photo Stream method</h3>\n  \n  <p>[content]</p>\n  \n  <h3>App method</h3>\n  \n  <p>[content]</p>\n</blockquote>\n\n<p>Alternatively, should I write a second answer?</p>\n\n<blockquote>\n  <p>[content mentioning Photo Stream method]</p>\n</blockquote>\n\n\n\n<blockquote>\n  <p>[content mentioning app method]</p>\n</blockquote>\n\n<p>…and if so, should I introduce the answers with a title?</p>\n\n<blockquote>\n  <h3>Photo Stream method</h3>\n  \n  <p>[content]</p>\n</blockquote>\n\n\n\n<blockquote>\n  <h3>App method</h3>\n  \n  <p>[content]</p>\n</blockquote>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-04-17T19:49:59.693","Title":"When and how should I write two answers?","Tags":"<discussion><answers><formatting>","AnswerCount":"1","CommentCount":"0"},{"Id":"2064","PostTypeId":"2","ParentId":"2063","CreationDate":"2014-04-17T19:49:59.693","Score":"7","Body":"<p>In short, don't sweat it.  I have used both methods.  Sometimes I choose which is most appropriate based on the particular wording of the question, so in this instance is says \"What's the fastest way\", well if I have two ways, only one can be fastest <em>to me</em>, but someone else may find the other one faster.  In this case I might present multiple answers.  If it was worded <em>is there a fast way to..</em> then I might include them both in one.</p>\n\n<p>There's no hard and fast rule, it's just what you feel is appropriate.  If, for example I have an answer that has votes, and maybe even an accept, and I come up with an alternate way some time down the line, it's a little disingenuous to edit it in to the existing answer, so I would normally add another, for example.</p>\n","OwnerUserId":"9495","LastActivityDate":"2014-04-17T19:49:59.693","CommentCount":"3"},{"Id":"2065","PostTypeId":"1","CreationDate":"2014-04-18T10:43:58.750","Score":"1","ViewCount":"55","Body":"<p>For some time now, I've had a retina avatar, but no longer.</p>\n\n<p>I didn't change anything, but for apparently no reason my avatar is now very pixelated everywhere but my profile (and the top bar because it's scaled so small that it looks retina).</p>\n\n<p>I've tried changing my avatar to my Gravatar and back to an uploaded image, and to an Identicon (I've never had a retina Identicon — some people do though) but none of these are retina.</p>\n\n<p>What happened? How can I get my retina avatar back?</p>\n\n<p><sup>It's still retina in chat though…</sup></p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-04-18T15:54:21.323","LastActivityDate":"2014-04-26T12:49:33.960","Title":"My retina avatar is no longer retina","Tags":"<support><users><images>","AnswerCount":"1","CommentCount":"3"},{"Id":"2066","PostTypeId":"2","ParentId":"1446","CreationDate":"2014-04-21T12:15:32.943","Score":"3","Body":"<p>Yes you can, since 15th July 2013. Click the close button again after voting to close and you have the option to retract your vote.</p>\n\n<p>                            <img src=\"https://i.stack.imgur.com/iAFYN.png\" width=\"451\"></p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2015-05-27T19:08:44.770","LastActivityDate":"2015-05-27T19:08:44.770","CommentCount":"0"},{"Id":"2067","PostTypeId":"1","CreationDate":"2014-04-21T12:16:58.577","Score":"3","ViewCount":"44","Body":"<p>I've just reached 20k and got the ability to <a href=\"https://apple.stackexchange.com/help/privileges/trusted-user\">vote to delete posts that are -1 or below</a>.<br>\nI don't understand the purpose of this, or how I should be using it.</p>\n\n<p>Currently, when I see an answer by a new user that is NAA, I flag as such and add a comment explaining where they've gone wrong and what they should do instead. Then, once a moderator comes along, the flag is seen and the answer is deleted.</p>\n\n<p>Now, according to the privileges page, I should vote to delete when…</p>\n\n<blockquote>\n  <p>The answer doesn't attempt to answer the question; it may be a comment or a separate question altogether.</p>\n</blockquote>\n\n<p>Therefore, as far as I know, I should be voting to delete such answers, which is fine. However, this means I have to downvote the answer — should I be doing this? I haven't been doing this before for new users' NAAs as I thought it'd put them off participating further, yet voting to delete requires the answer must be downvoted.</p>\n\n<p>Also, should I be voting to delete <em>instead</em> of flagging as NAA, or <em>as well as</em>? Flags go into the flag queue which are immediately noticeable on the top bar, yet voting to delete goes to a relatively hidden part of the 10k tools. Do ♦︎ moderators see delete votes differently to how the 10k tools hides them?</p>\n\n<p><strong>Finally, taking a step back, what's the point of all this?</strong> There are currently 4 other users with 20k, one of which has binding votes anyway. It takes 3 delete votes to delete an answer, therefore it needs 3 of us to be online at some point, open the 10k tools, go to the pending deletion votes and take action, or <a href=\"https://apple.stackexchange.com/review/low-quality-posts/stats\">be active in the Low Quality Post review queue</a> all before one of the many excellent timely moderators swoops in and kills the post anyway.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-04-21T19:47:11.957","Title":"What's the point of voting to delete?","Tags":"<discussion><support><voting>","AnswerCount":"2","CommentCount":"2"},{"Id":"2068","PostTypeId":"2","ParentId":"2067","CreationDate":"2014-04-21T15:32:56.327","Score":"2","Body":"<p>I'll try to address what I see as the main thrust is that the Stack Exchange idea is that the community and not elected moderators should be able to handle the majority of the moderation.</p>\n\n<p>Yes, the site had a period where we didn't have enough users to vote to close without a binding vote by a moderator (elected or employee). Now we're at the stage where that happens without a moderator needing to act. As the high rep user base grows, the deletion will also follow to be something that can happen without needing a flag or a moderator to cast a binding vote.</p>\n\n<p>Looking at forest and not the trees - delete content that is so bad that you feel no normal user should even have to see it.</p>\n\n<p>Posts that should be deletes are where the only content is:</p>\n\n<ul>\n<li>offensive (racist, homophobic, juvenile, curse)</li>\n<li>in no way on topic (astrology adverts, soccer match, handbag sales, etc...)</li>\n<li>completely redundant and inferior to an existing answer/post</li>\n</ul>\n\n<p>If you can remove the problem parts of a post by editing, that is the way to go and not deletion. Also, since the deletion tools put the items in the delete queue, it's probably better for you to use that instead of flagging since we know a high rep user can only cast a delete vote, but when we're processing NAA queues, it's more mixed in with anything that could be flagged.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-04-21T15:32:56.327","CommentCount":"2"},{"Id":"2069","PostTypeId":"2","ParentId":"2067","CreationDate":"2014-04-21T19:47:11.957","Score":"1","Body":"<p>If you vote to delete at 20k, I think it just deletes it as if you were a Mod (is this right?).  In my mind there is no need to down vote if you are deleting, but I would always comment why you are deleting, and where possible use a generic templates response that shows the OP what happened without it looking like you got personal.  Here's my default response, which OSX and iOS expands when I type \"<em>rnaa</em>\":</p>\n\n<p><em>Hi, I removed this as it is not an answer to the question. Answers that are discussion/commentary/another question/me too/thanks etc are against the sites posting policy in order to maintain a focus on high quality answers.</em></p>\n\n<p>Others use similar versions (If your vote isn't immediately binding, I could have that wrong, then adjust your language accordingly), it doesn't matter what but do try to include something to let the OP know.  Some of us tailor the response, but I find that can result in discussion, so I leave if for them to work out what's wrong with it - self education generally works better ;) :</p>\n\n<p>\"<em>Your post is another question</em>\"</p>\n\n<p>\"<strong>No it isn't, it's just asking for clarification because my X is similar to his Y</strong>\"</p>\n\n<p>If you use this, don't double mod the post by flagging too.  This is flagging of a sort, just specialised.</p>\n\n<p>As to the point?  Well, often the other sites that have a more rigorous Mod team involvement leave this sort of stuff to the high rep non mods to sort out, and only step in for the more serious offenders, luckily we don't really have any issues or at least enough of them often enough to make the Mods need to ring fence their time to operate on the worst cases, so we often dip into the normal review queues and hit stuff with the mod hammer before waiting for user vote accumulation, which as you say may take a while because we are also historically a low voting and hence low rep site.</p>\n","OwnerUserId":"9495","LastActivityDate":"2014-04-21T19:47:11.957","CommentCount":"3"},{"Id":"2070","PostTypeId":"1","CreationDate":"2014-04-22T13:55:44.313","Score":"4","ViewCount":"100","Body":"<p>I just joined apple.stackexchange.com, where I signed up so I could <a href=\"https://apple.stackexchange.com/questions/36569/\">take part in a question that is of interest to me</a>.</p>\n\n<p>The first and only answer given was not an answer at all, but a statement to the OP to give up his quest of achieving something he asked help on.  I also need the same information the OP asked for.</p>\n\n<p>However, because I don't have any rep, I could not post a comment, nor could I even down vote the answer described above. And thus I decided that I wanted to be heard and posted my comment as an answer.</p>\n\n<p>Shortly there after, an admin came along and deleted my post.  Why didn't he delete the 'so called' answer given?  So, what do I do now?  Leave the site?   That's really not fair.</p>\n\n<p>The implementation of what privileges are available based on reputation points is kind of skew-if.  It doesn't make sense and works against the boards intentions.  </p>\n\n<p>I'm posting this here because its not the first time I've found myself in that awkward situation.  It just makes me feel like leaving and never coming back.</p>\n\n<p>Respectfully,\nNap</p>\n","OwnerUserId":"76402","OwnerDisplayName":"Nap","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-04-22T15:25:59.470","Title":"Reputation scores get in the way of using the forum","Tags":"<discussion>","AnswerCount":"2","CommentCount":"0"},{"Id":"2071","PostTypeId":"2","ParentId":"2070","CreationDate":"2014-04-22T14:26:32.770","Score":"2","Body":"<p>I was on the fence trying to figure out how to convert your post into an actual answer. Why not start with answering the question and let's leave aside why the other answerer is so wrong. </p>\n\n<p>I've undeleted your post since clearly you are interested in helping out. Let's work on getting you some reputation so you can comment constructively (telling someone their post is wrong is encouraged - especially when backed up with facts or at least an opinion that can be understood.)</p>\n\n<p>Can you clean up the answer to be sure to address first the question at hand and then perhaps an aside as to why and how the other answer is not helpful.</p>\n\n<p>If your post only is \"me too\", no matter how eloquent, it will get removed again since that's just not how the site works - high reputation or low reputation. Your best bet would be to ask a new question explaining you want to do surface mount soldering and ask for details. Then we could have a question for what most people do - go get a component level repair and what you seem to be seeking - how to repair a damaged/failed component.</p>\n\n<p>Basically - the dealer might replace the engine in a car under warranty, but a car enthusiast might rebuild the engine of a car - especially when the engines are no longer being made.</p>\n\n<hr>\n\n<p>Meta note - Thanks for asking - do realize that this is exactly how the sites are designed to work to start people on asking/answering and then only allowing comments once you've gotten the hang of each site. Also, this isn't a forum in the sense that there are no norms and rules - so please have a look at the <a href=\"https://apple.stackexchange.com/help\">Help Center</a> which tries to explain how the system allows others to vote you the privilege of commenting in general.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-04-22T14:34:16.477","CommentCount":"5"},{"Id":"2072","PostTypeId":"2","ParentId":"2070","CreationDate":"2014-04-22T14:40:40.700","Score":"4","Body":"<p>You're in the right place to ask this sort of thing here, much better than editing  similar questions into a deleted post which only you and the Moderators can see anyway.</p>\n\n<p>The most basic answer is that your answer was deleted because it was not an answer, which you are already aware of.  As such it was flagged by another user of the site (actually it was flagged twice by different users) which brings it onto our review queue.  @bmike was merely the first person with the authority to handle the flag who saw it, and he removed it as per our posting guidelines, because answers that are commentary/discussion/me too/thanks/another question etc are not valid ones, and he indicated as such in a comment to explain why he removed it.  I just need to make sure you understand that an Admin didn't \"just come along and remove it\" for no reason, it went through our proper flag and review process, and I would have reached the same conclusion and removed it also.</p>\n\n<p>Now, as for why you had to do it this way because of your low reputation score, that's another story.  I have to disagree with you when you say \"It doesn't make sense and works against the boards intentions\".  To my mind, it makes perfect sense, and that's only partly because I get to see <em>everything</em> that is posted, including all the stuff we have to remove regularly to keep the site on topics and used as it is meant to be used.  It takes <a href=\"https://apple.stackexchange.com/help/privileges\">very little effort</a> to earn enough rep to be able to vote and comment, and you should really try to gain these privileges in order to then progress your own questions properly.  The privileges are earned in a way that allows you to contribute properly and to guide your contributions to ensure they are appropriate by not allowing your to, for example, engage in lengthy discussions in comments (Not saying you would have, but it happens, and when such stuff is then subsequently flagged, I can almost guarantee it's a low rep user who hasn't quite got it etc).  Making you earn your privileges avoids a <em>lot</em> of clean up required by the Moderators.</p>\n\n<p>Now, finally as to the existing answer, and why it wasn't removed you just need to consider that when a contribution is flagged, there is no requirement for whichever of us <em>volunteer</em> Mods to then go and perform a full audit of the Question and all it's Answers that haven't been flagged.  It's there still because no-one has flagged it, because it's got votes, and because while it's not a solution to the OP, it is still a <em>valid answer</em> to my mind.  If you don;t think it is, you only need 15 rep to flag it to us in the same way your post was flagged, and we'll review it.  Please consider that this isn't a personal tech helpdesk service where we have to answer your question the way you want it in a \"customer is always right\" sort of scenario.  Everything on the site, from the moment it leaves your keyboard, is community owned and community edited and moderated.  While the answer might not be what the OP and yourself are looking for, if we feel it may well help <em>other people</em> in the future, we can leave it there.  The community will up and down vote and flag as appropriate to ensure that answers are <em>useful overall</em>, and very often a *\"You can't do that\" is appropriate.  In this particular scenario, while I imagine that a couple of people may have the skills to identify and solder individual components onto a motherboard without damaging it, I imagine there are also a lot more people who would appreciate being told that this is the only way and the replacement at a part level is maybe a better solution for those of us without mad skills with the flux.</p>\n\n<p>Anyway, I hope this explains the general reasoning behind why what was removed was removed, and why what is still there is still there.  Please just take the time to look around for a couple of questions to answer.  Just 2 upvotes will give you more rep to do more things on the site.  </p>\n","OwnerUserId":"9495","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-04-22T14:40:40.700","CommentCount":"5"},{"Id":"2073","PostTypeId":"1","CreationDate":"2014-04-26T12:44:13.247","Score":"2","ViewCount":"27","Body":"<p>Sometimes <strong>Community</strong> (diamond) bumps questions which not have had an accepted answer to the top of the questions queue. However, some questions of these are over 2 or 3 years old. </p>\n\n<p>Sometimes I'm close to putting a comment to an answer/a question and then see last second before posting it, the answer was about 2-3 years ago (and so was the question).\nThe comment is irrelevant at that point because example now; someone was explaining Windows XP in bootcamp, which isn't supported for a long time anymore (at least since OS X 10.6)</p>\n\n<p>Could it be an option to display the date (on the bottom of a question and answer) in red if the date is 2 or more years old?</p>\n","OwnerUserId":"34561","LastActivityDate":"2014-04-26T12:44:13.247","Title":"Display date as red if it's longer than 2 years ago","Tags":"<feature-request>","AnswerCount":"0","CommentCount":"3"},{"Id":"2074","PostTypeId":"2","ParentId":"2065","CreationDate":"2014-04-26T12:49:33.960","Score":"1","Body":"<p>I see a difference in Urls when I select them using F12 in Chrome.</p>\n\n<p>This is your chat URL <code>http://i.stack.imgur.com/dYszY.png?s=128&amp;g=1&amp;g&amp;s=32</code>\nand this is your current (at least for me visible) question URL <code>http://i.stack.imgur.com/dYszY.png?s=32&amp;g=1</code></p>\n\n<p>The URL is the same, but the s = size if I'm correct and might have something to do with it.</p>\n\n<p>This was too long to comment, and I'm sorry if this does not point anyone in the right direction for solving the issue regarding your issue.</p>\n","OwnerUserId":"34561","LastActivityDate":"2014-04-26T12:49:33.960","CommentCount":"1"},{"Id":"2075","PostTypeId":"1","CreationDate":"2014-04-27T00:22:43.293","Score":"-5","ViewCount":"75","Body":"<p>The name \"AskDifferent\" is downright confusing and not useful.</p>\n\n<p>Change it to something more useful like:</p>\n\n<p>AskApple</p>\n\n<p>AskOSX</p>\n\n<p>AskiOS</p>\n\n<p>AskMac</p>\n\n<p>AppleExchange</p>\n\n<p>MacExchange</p>\n\n<p>etc.</p>\n\n<p>If the site is to remain about anything-apple, then I like AppleExchange. However, I feel the different devices/os's are different enough to warrant their own exchanges. I would like to see them broke out into an iOS exchange, and a Mac/OSX exchange.</p>\n","OwnerUserId":"76788","OwnerDisplayName":"SnakeDoc","LastActivityDate":"2014-04-27T16:19:23.747","Title":"Change exchange Name to be more Descriptive","Tags":"<discussion>","AnswerCount":"2","CommentCount":"3"},{"Id":"2076","PostTypeId":"2","ParentId":"2075","CreationDate":"2014-04-27T15:40:58.780","Score":"4","Body":"<p>Anyone with a little bit of Apple history knows that it is  merely an allusion to the Think Different marketing campaigns that Apple used to run.</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Think_different\" rel=\"nofollow noreferrer\">http://en.wikipedia.org/wiki/Think_different</a></p>\n\n<blockquote>\n  <p>\"Here’s to the crazy ones. The misfits. The rebels. The troublemakers. The round pegs in the square holes.</p>\n  \n  <p>The ones who see things differently. They’re not fond of rules. And they have\n  no respect for the status quo. You can quote them, disagree with them,\n  glorify or vilify them.</p>\n  \n  <p>But the only thing you can’t do is ignore them. Because they change\n  things. They invent. They imagine. They heal. They explore. They\n  create. They inspire. They push the human race forward.</p>\n  \n  <p>Maybe they have to be crazy.</p>\n  \n  <p>How else can you stare at an empty canvas and see a work of art? Or\n  sit in silence and hear a song that’s never been written? Or gaze at a\n  red planet and see a laboratory on wheels?</p>\n  \n  <p>We make tools for these kinds of people.</p>\n  \n  <p>While some see them as the crazy ones, we see genius. Because the\n  people who are crazy enough to think they can change the world, are\n  the ones who do.\"</p>\n</blockquote>\n\n<p><img src=\"https://i.stack.imgur.com/hB32b.png\" alt=\"enter image description here\"></p>\n\n<p>Any choice of name would be down to personal opinion and preference, but I think it's far better than any of your suggestions which are all too narrow in there descriptive ability  other than AskApple, which has trademark and copyright issues. Using \"exchange\" brings to mind Microsoft, to me.  As you can see, logos and slogans etc have to be chosen very carefully.</p>\n","OwnerUserId":"9495","LastEditorUserId":"9495","LastEditDate":"2014-04-27T15:46:17.867","LastActivityDate":"2014-04-27T15:46:17.867","CommentCount":"2"},{"Id":"2077","PostTypeId":"2","ParentId":"2075","CreationDate":"2014-04-27T15:48:13.770","Score":"4","Body":"<p>One could say the name \"Apple\" is downright confusing and not useful — it's a fruit, and it doesn't suggest the products they actually sell. But it's the name of the company.  Similarly, <em>Ask Different</em> is the name of this community. Names aren't descriptions; they're identifiers.</p>\n\n<p>I'm troubled, though, that you would wander into a community and, without getting to know anyone or participating in the community, tell us that we need to change our name. If someone took a plane to New York and, upon arriving, started asking people to rename the city to something else, they would rightly be laughed out of town. This community was named by its participants early in its history. There were indeed discussions at that point about what an appropriate name for the community was (and we were originally called apple.stackexchange.com). But proposals for something as drastic as renaming a community really should only come from people who are deeply involved in the life of that community. </p>\n","OwnerUserId":"9388","LastActivityDate":"2014-04-27T15:48:13.770","CommentCount":"8"},{"Id":"2078","PostTypeId":"1","CreationDate":"2014-04-27T16:53:48.780","Score":"1","ViewCount":"57","Body":"<ul>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/pc\" class=\"post-tag\" title=\"show questions tagged &#39;pc&#39;\" rel=\"tag\">pc</a> — 37 tagged, 15 this year</p>\n\n<blockquote>\n  <p><em>no tag wiki/excerpt</em></p>\n</blockquote></li>\n</ul>\n\n<p>As far as I see, it serves no purpose and seems to be randomly tagged on <a href=\"https://apple.stackexchange.com/questions/tagged/pc\">a wide variety of questions</a> that already seem suitably tagged without the need for the \"pc\" tag.</p>\n\n<p>Should it be burninated?</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-04-27T22:59:18.173","Title":"Burninate the \"pc\" tag?","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2079","PostTypeId":"2","ParentId":"2078","CreationDate":"2014-04-27T22:59:18.173","Score":"3","Body":"<p>I'm all in favor of killing it (and adding a requirement that new tags can only be created by people with >15k rep), but my main concern about killing off tags is the bump to the top of the queue of all the edited posts. I'm utterly convinced that we're better off without that tag, though.</p>\n","OwnerUserId":"9388","LastActivityDate":"2014-04-27T22:59:18.173","CommentCount":"7"},{"Id":"2080","PostTypeId":"1","AcceptedAnswerId":"2082","CreationDate":"2014-04-29T19:32:30.560","Score":"6","ViewCount":"62","Body":"<p>The following answer was posted as an answer to <a href=\"https://apple.stackexchange.com/questions/124937/iphone-4s-grayed-out-wi-fi-and-bug-report-exists-for-it\">this question</a>:</p>\n\n<pre><code>This is an old problem, that Apple doesn't really care about. So sadly, we need to make\nsome noise to be listened and have our problems solved. This is a petition, please read\nbefore sign it: \n[Petition][1]\nYours sincerely.\n\n  [1]: http://www.change.org/petitions/apple-to-get-apple-to-replace-all-units-affected-\nnegatively-by-the-update-of-ios7-or-patch-an-update-that-will-remedy-the-issues-many-\nloyal-customers-are-experiencing?share_id=EWvbUpSNtW&amp;utm_campaign=mailto_link&amp;utm_medium=\nemail&amp;utm_source=share_petition\n</code></pre>\n\n<p>Are answers such as this worthy of being flagged NAA and deleted?</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-04-30T16:14:57.470","Title":"Should answers promoting a petition be flagged/deleted?","Tags":"<discussion><flagging><answers>","AnswerCount":"2","CommentCount":"0"},{"Id":"2081","PostTypeId":"2","ParentId":"2080","CreationDate":"2014-04-29T19:59:57.137","Score":"6","Body":"<p>It doesn't answer the question so flagging/deleting definitively is in order. In this case it does have some merits as a comment. </p>\n","OwnerUserId":"9058","LastActivityDate":"2014-04-29T19:59:57.137","CommentCount":"0"},{"Id":"2082","PostTypeId":"2","ParentId":"2080","CreationDate":"2014-04-30T16:09:55.187","Score":"3","Body":"<p>I would say the mentioning of a petition isn't the reason to delete a post. It's when there's no answer to be seen and all the post does is petition / advertise. Just like spam solicitations are out of bounds, spam solicitations are similarly not primarily in the interest of collecting knowledge and solving an issue as opposed to raising awareness of a project, effort or tool.</p>\n\n<p>I would say a post like that clearly could be edited into shape, so a down vote, a comment, an edit would all be great initial actions rather than needing a moderator to step in and delete. <em>(However, no one is under obligation to step in and save a post that could be saved, just pointing out the possibility.)</em></p>\n\n<p>Of course we can and should delete posts that clearly are not an answer as the linked item as posted is. I also wanted to encourage people to try to save posts by new users rather than just writing them off for deletion rather than exhausting the normal means to moderate a post.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2014-04-30T16:14:57.470","LastActivityDate":"2014-04-30T16:14:57.470","CommentCount":"0"},{"Id":"2083","PostTypeId":"1","AcceptedAnswerId":"2084","CreationDate":"2014-05-07T17:19:22.543","Score":"1","ViewCount":"33","Body":"<p>I just got this message in my inbox that there had been a comment that I should be aware of.</p>\n\n<p><img src=\"https://i.stack.imgur.com/0TK1F.png\" alt=\"comment\"></p>\n\n<p>When I click on it, it leads me to the <a href=\"https://apple.stackexchange.com/questions/128757/contacts-have-unsolicited-entries\">right question</a>, but there is no comment there?</p>\n","OwnerUserId":"46541","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-05-07T19:54:16.390","Title":"'Ghost' inbox message","Tags":"<support><comments><inbox>","AnswerCount":"1","CommentCount":"0"},{"Id":"2084","PostTypeId":"2","ParentId":"2083","CreationDate":"2014-05-07T17:21:44.197","Score":"3","Body":"<p>The comment has been deleted after your message was sent and before you got a chance to check it out.  The system isn't clever enough to recall or cancel the message, so it sends you to where is was, even if it's gone.</p>\n\n<p>I've deleted your subsequent reply as is is now out of context.</p>\n","OwnerUserId":"9495","LastActivityDate":"2014-05-07T17:21:44.197","CommentCount":"5"},{"Id":"2085","PostTypeId":"1","AcceptedAnswerId":"2086","CreationDate":"2014-05-08T10:48:57.893","Score":"-2","ViewCount":"27","Body":"<p>How can a <a href=\"https://apple.stackexchange.com/users/17456/null\">user with 26 reputation</a> call a 100 reputation Bounty on a question as seen <a href=\"https://apple.stackexchange.com/questions/106670/disable-mouse-interference-in-cmd-tab-overlay\">here</a>?</p>\n\n<p>As far I know 100 reputation would be deducted from my account if I do that?</p>\n","OwnerUserId":"46541","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-05-08T17:30:59.813","Title":"Bounty without having enough reputation to spend","Tags":"<discussion><reputation><bounty>","AnswerCount":"1","CommentCount":"0"},{"Id":"2086","PostTypeId":"2","ParentId":"2085","CreationDate":"2014-05-08T11:40:40.717","Score":"5","Body":"<p>26 is what is left after the bounty.  A bounty is removed from your rep the moment you offer it, not when you award it to an answer.  You lose that rep <em>even if you don't then offer it to anyone</em>.</p>\n\n<p>Essentially the user gets 1 rep when joining, received an association bonus of 100 for having sufficient rep on another SE site, earned 25 points on AD to total 126, then gave 100 away for the bounty.</p>\n","OwnerUserId":"9495","LastActivityDate":"2014-05-08T11:40:40.717","CommentCount":"1"},{"Id":"2087","PostTypeId":"1","AcceptedAnswerId":"2089","CreationDate":"2014-05-08T17:25:55.857","Score":"9","ViewCount":"107","Body":"<p>Look for an official launch blog post next week if no show stoppers are found, however, you can download the Stack Exchange app now from the App Store.</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/questions/231233/was-the-ios-app-officially-launched\">MSE: Was the iOS App Officially Launched</a> </li>\n</ul>\n\n<p>Get the app - <a href=\"https://itunes.apple.com/us/app/stack-exchange/id871299723?mt=8\" rel=\"nofollow noreferrer\">https://itunes.apple.com/us/app/stack-exchange/id871299723?mt=8</a></p>\n","OwnerUserId":"5472","OwnerDisplayName":"bmike","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-05-10T03:26:52.173","Title":"FYI - the Stack Exchange iOS app has soft launched","Tags":"<discussion>","AnswerCount":"3","CommentCount":"4","FavoriteCount":"1"},{"Id":"2088","PostTypeId":"2","ParentId":"137","CreationDate":"2014-05-08T18:25:33.487","Score":"1","Body":"<p>Clicking your reputation is no longer sufficient with the advent of the new top bar.</p>\n\n<p>Go to your user page, either by clicking yourself in the top bar or through any other means, then click the privileges link next to the profile edit link.</p>\n\n<p><img src=\"https://i.stack.imgur.com/Z1eL7.png\" alt=\"\"></p>\n","OwnerUserId":"37797","LastActivityDate":"2014-05-08T18:25:33.487","CommentCount":"0"},{"Id":"2089","PostTypeId":"2","ParentId":"2087","CreationDate":"2014-05-08T19:55:27.840","Score":"2","Body":"<p>The blog post has all the details. Get some!</p>\n\n<p><a href=\"http://blog.stackoverflow.com/2014/05/stack-exchange-for-iphone-is-here/\">http://blog.stackoverflow.com/2014/05/stack-exchange-for-iphone-is-here/</a></p>\n","OwnerUserId":"5472","LastActivityDate":"2014-05-08T19:55:27.840","CommentCount":"0"},{"Id":"2090","PostTypeId":"2","ParentId":"2087","CreationDate":"2014-05-08T21:48:06.990","Score":"1","Body":"<p>Using it now, the only SE client that is superior to just using the mobile web view. Download it! (No offence to the developers of other clients I have beta tested!)</p>\n","OwnerUserId":"9495","LastActivityDate":"2014-05-08T21:48:06.990","CommentCount":"0"},{"Id":"2091","PostTypeId":"1","CreationDate":"2014-05-09T16:29:05.937","Score":"1","ViewCount":"25","Body":"<p>Per the <a href=\"https://apple.stackexchange.com/help/badges/11/taxonomist\">Taxonomist badge page</a>, the requirement for obtaining the badge is:</p>\n\n<blockquote>\n  <p>Created a tag used by 50 questions.</p>\n</blockquote>\n\n<p>If I were to edit a post to add a new tag, would I be accredited with the tag's creation or would the system attribute this to the question owner?</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-05-09T16:29:05.937","Title":"Who is the creator of a tag if a question is edited to include a new one?","Tags":"<support><tags>","AnswerCount":"0","CommentCount":"0"},{"Id":"2092","PostTypeId":"2","ParentId":"2087","CreationDate":"2014-05-10T03:26:52.173","Score":"0","Body":"<p>FYI <a href=\"http://stackreaderapp.com/\" rel=\"nofollow\">StackReader</a>, is currently free ($2 off) on the <a href=\"http://itunes.apple.com/us/app/stackreader/id481243590\" rel=\"nofollow\">App Store</a> right now.</p>\n","OwnerUserId":"76213","LastActivityDate":"2014-05-10T03:26:52.173","CommentCount":"0"},{"Id":"2093","PostTypeId":"1","CreationDate":"2014-05-13T07:44:41.277","Score":"8","ViewCount":"162","Body":"<p>Sometimes questions on the main site are vague and/or missing essential details required for answering them correctly. There has been some discussions about this already before, e.g.</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/1669/a-moderator-closed-my-question-and-asked-me-to-edit-rework-it-so-what-should-i/1707#1707\">A moderator closed my question and asked me to edit/rework it, so what should I do?</a></li>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/916/if-the-original-poster-op-question-is-unclear-is-it-ok-to-ask-op-question-to\">If the original poster (OP) question is unclear, is it OK to ask OP question to clarify in order to provide a better answer?</a></li>\n</ul>\n\n<p>and commenting/flagging/putting on hold are kind of standard practice in this cases, especially to prevent people from putting a lot of effort into guessing the OPs intention.</p>\n\n<p>I'm curious on why we think this is the best way to handle these situations and whether anybody sees other ways to handle situations like that- Please add your opinion as answers below.</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2014-08-12T22:36:28.640","Title":"What should I do if I see an vague question?","Tags":"<discussion><questions>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"1"},{"Id":"2094","PostTypeId":"2","ParentId":"2093","CreationDate":"2014-05-13T08:24:04.003","Score":"2","Body":"<p>However sometimes the question and the problem describe show that the OP does not know how to ask the right question based on the problem. </p>\n\n<p>I would say that in those case it is OK to answer the question based on the problem described rather then on the question asked.</p>\n\n<p>Or alternatively use Edit to improve the question asked. I tend to avoid doing that since some OP are sensitive to changing they question to that degree (that is not what I have asked ect..). To avoid that kind of conflicts I just give the answer based on the actual problem described even if it does not fit the question asked.</p>\n\n<p>Mostly those problems are in the Title of the Question.</p>\n","OwnerUserId":"46541","LastEditorUserId":"46541","LastEditDate":"2014-05-13T08:29:49.257","LastActivityDate":"2014-05-13T08:29:49.257","CommentCount":"4"},{"Id":"2095","PostTypeId":"2","ParentId":"2093","CreationDate":"2014-05-13T15:37:28.337","Score":"6","Body":"<p>This is what I do based on what I've seen other more experienced users do, including yourself :)</p>\n\n<ol>\n<li><p>If a question is vague based on how it's written, I'll usually edit it, with a comment such as:</p>\n\n<blockquote>\n  <p>I've edited your question in an attempt to clarify a few details regarding [type here] — please edit further to extenuate any details and further clarify the problem.</p>\n</blockquote></li>\n<li><p>If a question is vague because it's missing essential details, I'll usually write a comment myself from scratch explaining what's missing then vote to close as unclear.</p></li>\n<li><p>However, there are some questions that need a general assistance in being written. If I think a link to the How to Ask page would be useful, I'll comment the following, then VTC:</p>\n\n<blockquote>\n  <p>Please clarify your specific problem or add additional details to highlight exactly what you need. As it's currently written, it’s hard to tell exactly what you're asking. See the [ask] page for help clarifying this question.</p>\n</blockquote>\n\n<p>This is usually prepended automatically with 'Welcome to Ask Different!' as the user is usually new in this case. ARC is a wonderful thing :) If anyone's interested, here's my <a href=\"http://georgegarside.com/o/se/arc.html\" rel=\"nofollow\">comments that I use for reviewing posts on Stack Exchange</a>.</p></li>\n<li><p>This isn't really a case like the others above and doesn't happen often, but something that can make a question unclear: a title and body that doesn't match. If the body is longer than the title, I usually edit the title to match the body, adding the following comment when I do so:</p>\n\n<blockquote>\n  <p>Your title and body seemed contradictory, showing two different problems. I've edited the title to fit the body, but feel free to re-edit and clarify the situation.</p>\n</blockquote>\n\n<p>I am more reluctant to change a body to match a title.</p></li>\n</ol>\n\n<p>In summation, I believe the above works generally well and although some data would be helpful here, it seems that…</p>\n\n<ul>\n<li>in the first case the question usually gets a suitable answer, either from myself or from someone else,</li>\n<li>in the second case the OP either edits before the question gets closed and so avoids closure or edits after closure and is reopened either by someone seeing the question or from the Reopen queue,</li>\n<li>in the third case the user either edits their question or never comes back and the question gets auto deleted, and</li>\n<li>in the fourth case, nothing else really happens and people carry on as if the title had been written originally.</li>\n</ul>\n\n<p>In rare cases, I'll sometimes do one of the above and also answer myself based on educated guesses. This is either approved by the OP and I edit the original question based on the information that I've presumed, or is declined by the OP and lets them see exactly how their question <em>could</em> be perceived, which is generally different to how they believe they've portrayed their problem and is the reason for the lack of clarity.</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-08-12T22:34:56.697","LastActivityDate":"2014-08-12T22:34:56.697","CommentCount":"2"},{"Id":"2096","PostTypeId":"2","ParentId":"1950","CreationDate":"2014-05-14T18:51:15.877","Score":"1","Body":"<p>Seems it's been done — it now exists as of rev 2014.5.14.1605:</p>\n\n<p><img src=\"https://i.stack.imgur.com/vJQCc.png\" width=\"156\"></p>\n","OwnerUserId":"37797","LastActivityDate":"2014-05-14T18:51:15.877","CommentCount":"3"},{"Id":"2097","PostTypeId":"1","CreationDate":"2014-05-14T19:29:58.647","Score":"1","ViewCount":"23","Body":"<p>Using <code>[meta-tag:status-completed]</code> or any other mod tag shows it red: <a href=\"/questions/tagged/status-completed\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;status-completed&#39;\" rel=\"tag\">status-completed</a></p>\n\n<p>However, in chat, this isn't the case:</p>\n\n<p><img src=\"https://i.stack.imgur.com/zFQEg.png\" width=\"179\"></p>\n","OwnerUserId":"37797","LastActivityDate":"2014-05-14T19:29:58.647","Title":"Moderator meta tags don't show red in chat","Tags":"<bug><tags><chat>","AnswerCount":"0","CommentCount":"1"},{"Id":"2098","PostTypeId":"1","CreationDate":"2014-05-15T06:07:18.250","Score":"1","ViewCount":"38","Body":"<p>The <a href=\"https://apple.stackexchange.com/review/low-quality-posts/61228\">answer below</a> was marked a low quality. Why? It's one of the most complete answers..</p>\n\n<p><img src=\"https://i.stack.imgur.com/dj7A6.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"34561","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-05-15T14:50:27.947","Title":"Why was this answer low quality?","Tags":"<support><review-page>","AnswerCount":"1","CommentCount":"0"},{"Id":"2099","PostTypeId":"2","ParentId":"2098","CreationDate":"2014-05-15T06:21:08.490","Score":"3","Body":"<p>The exact algorithm used to denote whether a post is low quality has not been released publicly to prevent gaming the system.</p>\n\n<p>However, from the little information released on Meta.SE, it seems each post is given a score based on its content. Good things increase the score and bad things decrease it. The old 10k tools used to show this raw score directly, however as the 10k flags have been obliterated, it's no longer possible to see (except diamond mods).</p>\n\n<p>With the above answer, I'd hypothesise that it was just on the boundary, with titles that didn't start with capitals, multiple links and 'advertising' of a 30 day trial.</p>\n","OwnerUserId":"37797","LastActivityDate":"2014-05-15T06:21:08.490","CommentCount":"2"},{"Id":"2100","PostTypeId":"1","AcceptedAnswerId":"2101","CreationDate":"2014-05-17T03:15:56.797","Score":"4","ViewCount":"38","Body":"<p>How would I get <strong><code>⌥⌘</code></strong> to appear as the keyboard characters themselves which I see often embedded in responses?</p>\n","OwnerUserId":"62132","LastEditorUserId":"37797","LastEditDate":"2014-05-17T12:01:11.300","LastActivityDate":"2014-05-17T13:50:08.707","Title":"How do you insert keyboard characters into questions/responses?","Tags":"<support><formatting>","AnswerCount":"1","CommentCount":"2"},{"Id":"2101","PostTypeId":"2","ParentId":"2100","CreationDate":"2014-05-17T08:05:47.617","Score":"4","Body":"<p>Wrap your characters as follows:</p>\n\n<p>&lt;kbd>Esc&lt;/kbd> = <kbd>Esc</kbd></p>\n\n<p>To type the characters themselves in the first place depends upon the OS you are using. Android and iOS have different keyboards and unicode entry methods. Same for windows and Mac. There is a feature request to add the Mac typical characters to the text entry and formatting controls, but it doesn't have enough votes or developer support to get implemented yet.</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/756/feature-request-add-editor-buttons-for-symbols-common-to-the-subject\">Feature Request: Add editor buttons for symbols common to the subject</a></li>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/683/put-the-characters-somewhere-for-people-to-copy-paste\">Put the ⌃⌥⇧⌘⎋⏏⌫↑⇡↖⇞⇥ characters somewhere for people to copy/paste</a></li>\n</ul>\n\n<p>For now, you can bookmark either of those and use it to copy/paste if your preferred keyboard doesn't have these readily available.</p>\n","OwnerUserId":"9495","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2014-05-17T13:50:08.707","CommentCount":"0"},{"Id":"2104","PostTypeId":"1","AcceptedAnswerId":"2106","CreationDate":"2014-05-19T08:33:37.320","Score":"5","ViewCount":"46","Body":"<p>Can we change the chat to be accessible for writing at +5 rep for AskDifferent? If it's based on a \"permanent\" number, could SE maybe update this so it's variable for each different site?</p>\n\n<p>I think it's enough to have +5 on AskDifferent as we have awesome mods who will delete a user if he starts spamming our AskDifferent chatroom.</p>\n","OwnerUserId":"34561","LastActivityDate":"2014-05-19T12:24:36.363","Title":"Helping new guy, need 20 rep to join chat","Tags":"<feature-request><chat>","AnswerCount":"2","CommentCount":"3"},{"Id":"2105","PostTypeId":"2","ParentId":"2104","CreationDate":"2014-05-19T09:32:54.607","Score":"3","Body":"<p>I agree, that in some circumstances it's needlessly difficult for a new user to be able to contact and communicate with other users.  We have this weird situation where a user can create a chat account and log in, but only read, and I've seen conversations carried on where the OP talks in comments which he then deletes, and others reply in Chat, creating a disjointed approach that encourages the uses to use the bad habits (extended discussions in comments) that we try to avoid.</p>\n\n<p>20 isn't a particularly difficult target to hit, but when it's your first question it seems massively complex to have to have these things explained when we don't have a way for them to participate in a 2 way chat.</p>\n\n<p>Not sure how to fix it, I imagine that the points/privileges system is cast on stone for all SE sites, and we can't unilaterally change it for AD, but perhaps it could be considered for change site wide.</p>\n\n<p>Here's an example of an user answering via comments:\n<img src=\"https://i.stack.imgur.com/V7ESt.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"9495","LastEditorUserId":"34561","LastEditDate":"2014-05-19T09:39:10.633","LastActivityDate":"2014-05-19T09:39:10.633","CommentCount":"0"},{"Id":"2106","PostTypeId":"2","ParentId":"2104","CreationDate":"2014-05-19T12:24:36.363","Score":"2","Body":"<p>Thanks to <a href=\"https://apple.meta.stackexchange.com/users/237/mark\">Mark</a> I don't even have to do the research any more :-)</p>\n\n<p>There are valid reasons why a small amount of reputation is required for users to join chat (see the answers to <a href=\"https://meta.stackexchange.com/questions/74086/so-chat-why-is-it-that-only-members-of-stack-overflow-with-at-least-20-reputat\">SO Chat: Why is it that &quot;Only members of Stack Overflow with at least 20 reputation may talk...&quot;?</a> for instance). And as the mods can (with some collaboration from the user side) also invite users below 20 rep points to the main or any other chat, a feasible way to handle this (rather) rare case would be to flag such questions for moderator attention so one of us can push the user into chat.</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-05-19T12:24:36.363","CommentCount":"0"},{"Id":"2107","PostTypeId":"1","AcceptedAnswerId":"2109","CreationDate":"2014-05-20T12:48:56.097","Score":"6","ViewCount":"103","Body":"<p>I'm an iOS developer and I used to pass a lot of time on <a href=\"https://stackoverflow.com/\">Stack Overflow</a>. Recently I have seen a Stack Exchange site called <a href=\"https://android.stackexchange.com/\">Android Enthusiasts</a> and it seems to me that it's only for \"Android Developers\" as their community. So I am just wondering…</p>\n\n<p><strong>Is there any Group like that (Android Enthusiasts) only for iOS developers who write code in Objective-C?</strong></p>\n\n<p>I also notice that when an Android developer of Stack Overflow signs in that group, he/she suddenly gets 100 bonus reputation in Stack Overflow as an Association bonus. I also got a similar 100 association bonus earlier when signing in to Stack Exchange. Now my question is:</p>\n\n<p><strong>How many \"Associate Group\" exist around there and from where can I get an association bonus in my Stack Overflow account just like two of these?</strong></p>\n","OwnerUserId":"70691","OwnerDisplayName":"Tulon","LastEditorUserId":"-1","LastEditDate":"2017-05-23T12:40:12.040","LastActivityDate":"2014-05-20T15:49:41.580","Title":"Similar Group like \"Android Enthusiasts\" for Objective-C in Stack Overflow","Tags":"<discussion><support><site-scope>","AnswerCount":"2","CommentCount":"0"},{"Id":"2108","PostTypeId":"2","ParentId":"2107","CreationDate":"2014-05-20T13:15:19.447","Score":"3","Body":"<p>First to note StackExchange works by everyone uses the same rules - so down vote is the only way to show that a question or answer is not good. This question is better asked on a meta site which talks about how StackExchange works (This question will probably me moved to AskDifferent's <a href=\"http://meta.apple.stackexchange.com\">meta</a> site). On these sites a down vote means that a person disagrees with the question. All information is public and direct conversation to a user is not supported.</p>\n\n<p>Android Enthusiasts is not for Android developers from the site's <a href=\"https://android.stackexchange.com/help/on-topic\">help centre</a> </p>\n\n<blockquote>\n  <p>Android Enthusiasts Stack Exchange is for enthusiasts, power users, and regular people who use the Android operating system.</p>\n</blockquote>\n\n<p>Development code issues are off topic it seems and should ono be on <a href=\"http://stackoverflow.com\">StackOverflow</a> (there is a heavily used android tag)</p>\n\n<p>For iOS devices this site AskDifferent is the equivalent to Android Enthusiasts although we also cover other Apple devices and software. Like the Android site development and especially Objective C issues are off topic here and should be asked on <a href=\"http://stackoverflow.com\">StackOverflow</a></p>\n\n<p>To see what sites Stack Exchange has either look at the bottom of every page or the drop down box at the top left found by clicking on Stack Exchange there.</p>\n","OwnerUserId":"237","OwnerDisplayName":"Mark","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:18:19.563","LastActivityDate":"2014-05-20T13:15:19.447","CommentCount":"3"},{"Id":"2109","PostTypeId":"2","ParentId":"2107","CreationDate":"2014-05-20T13:30:35.820","Score":"7","Body":"<p>Welcome to the site!  I'll try to answer your questions.</p>\n\n<p>OK, you have a little misunderstanding about the nature of Stack Exchange sites.  Stack Overflow was the first and original site, and then Stack Exchange was setup to create further sites along different topics.  These days there are SE sites for everything from coding to parenting via philosophy and bicycling.  You can see a <a href=\"http://stackexchange.com/sites\">full list here</a>.</p>\n\n<p>We don't have <em>groups</em>, as such, but each sub-site (usually called sitename.stackexchange.com e.g. apple.stackexchange.com but sometimes with their own redirecting URL such as askdifferent.com for our site etc) is essentially a wholly seperate entity, with their own topics and their own rules for what is on-topic etc.  Clearly asking about nappies on a Ubuntu site is not appropriate! ;)</p>\n\n<p>What can link them, is you - your user account can be linked to many such sites, you have a profile on each site, and nominate one (usually your first) to be your <em>parent profile</em> under which all others are linked.</p>\n\n<p>When you do this, if your reputation score on one SE site is sufficient, you can a 100 <em>association bonus</em>, the purpose of this is to remove the early privilege limitations whereby you need to earn reputation in order to do more than the basics - as the message says when you are awarded the bonus, you are trusted to know how to use an SE site, and don't need to prove that again.  The reputation is added to the profile in the site you just joined, purely to remove the new user restrictions - you can't add it to your rep from another site.  Overall, it is calculated in your total rep across all sites, but you cannot, for example, join 50 sites and get a 5000 bonus on your primary profile...</p>\n\n<p>Now, as for Objective-C programming, the main coding site is still Stack Overflow.  There is an Apple group, as you have found, but programming in anything other than user facing utilities like Automator, AppleScript, and a bit of Terminal is off topic here.  Likewise, a similar restriction applies to the Android site.</p>\n\n<p>The Stack Overflow site is the primary source for all programming questions, regardless of your platform or language of choice.  You can filter by tags to ensure you only see questions which are appropriately tagged with Objective-C or Xcode etc, but they are still all included in the same site.</p>\n","OwnerUserId":"9495","LastEditorUserId":"37797","LastEditDate":"2014-05-20T15:49:41.580","LastActivityDate":"2014-05-20T15:49:41.580","CommentCount":"4"},{"Id":"2110","PostTypeId":"1","AcceptedAnswerId":"2111","CreationDate":"2014-05-20T13:57:59.913","Score":"1","ViewCount":"25","Body":"<p>Is this expected behavior? </p>\n\n<p>When I click on the link on the homepage it brings me to meta, but why does the link stay behind?</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/131360/similar-group-like-android-enthusiasts-for-objective-c-in-stackoverflow\">https://apple.stackexchange.com/questions/131360/similar-group-like-android-enthusiasts-for-objective-c-in-stackoverflow</a></p>\n","OwnerUserId":"70930","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-05-20T16:20:57.900","Title":"Question migrated to meta and remains on homepage","Tags":"<support><questions><closed-questions><migration>","AnswerCount":"2","CommentCount":"0"},{"Id":"2111","PostTypeId":"2","ParentId":"2110","CreationDate":"2014-05-20T14:03:58.233","Score":"3","Body":"<p>Migrated questions leave a trail. It's been like that as long as I can remember.</p>\n","OwnerUserId":"292","LastActivityDate":"2014-05-20T14:03:58.233","CommentCount":"1"},{"Id":"2112","PostTypeId":"2","ParentId":"2110","CreationDate":"2014-05-20T15:43:52.180","Score":"1","Body":"<p>The link remains as the original question remains on the original site post migration.</p>\n\n<p>The original question is not deleted when a question is migrated, unless the question is manually deleted or automatically deleted at a later date; the migration itself is not responsible for deleting the original question. If a question is migrated to another site and is refused (subsequently closed) then the original question may still be useful and deleting it doesn't help those who are unable to view deleted questions.</p>\n\n<p>Appending <code>?noredirect=1</code> to the end of a url to a redirecting link will force it to show the original content, which in this case is here:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/131360/similar-group-like-android-enthusiasts-for-objective-c-in-stackoverflow?noredirect=1\">https://apple.stackexchange.com/questions/131360/similar-group-like-android-enthusiasts-for-objective-c-in-stackoverflow?noredirect=1</a></li>\n</ul>\n\n<p><img src=\"https://i.stack.imgur.com/DjYhY.png\" alt=\"\"></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-05-20T15:43:52.180","CommentCount":"0"},{"Id":"2113","PostTypeId":"5","CreationDate":"2014-05-20T16:15:16.027","Score":"0","Body":"<p>The profile page is the page which contains various information about a specific user, including reputation and badges, as well as questions, answers, participated tags and linked accounts. It is available at /users/userid.</p>\n\n<p>This tag is for questions relating to anything on the aforementioned page, including bugs in both design and functionality, and support questions.</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T16:15:16.027","LastActivityDate":"2014-05-20T16:15:16.027","CommentCount":"0"},{"Id":"2114","PostTypeId":"4","CreationDate":"2014-05-20T16:15:16.027","Score":"0","Body":"Page containing various information about a user, available at /users/userid","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T16:15:16.027","LastActivityDate":"2014-05-20T16:15:16.027","CommentCount":"0"},{"Id":"2115","PostTypeId":"5","CreationDate":"2014-05-20T16:17:34.320","Score":"0","Body":"<p>Every question asked on Stack Exchange can have up to five tags that categorize the question.</p>\n\n<p>Meta sites have tags that need to be present in the question, which are <a href=\"/questions/tagged/bug\" class=\"post-tag required-tag\" title=\"show questions tagged &#39;bug&#39;\" rel=\"tag\">bug</a>, <a href=\"/questions/tagged/support\" class=\"post-tag required-tag\" title=\"show questions tagged &#39;support&#39;\" rel=\"tag\">support</a>, <a href=\"/questions/tagged/discussion\" class=\"post-tag required-tag\" title=\"show questions tagged &#39;discussion&#39;\" rel=\"tag\">discussion</a> and <a href=\"/questions/tagged/feature-request\" class=\"post-tag required-tag\" title=\"show questions tagged &#39;feature-request&#39;\" rel=\"tag\">feature-request</a>; there are also tags that can be added only from moderators, such as <a href=\"/questions/tagged/faq\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;faq&#39;\" rel=\"tag\">faq</a>, <a href=\"/questions/tagged/featured\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;featured&#39;\" rel=\"tag\">featured</a>, and <a href=\"/questions/tagged/status-declined\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;status-declined&#39;\" rel=\"tag\">status-declined</a>, which are shown with a red background.</p>\n\n<p>For more information see the section on tagging in the <a href=\"http://meta.stackexchange.com/questions/7931/faq-for-stack-exchange-sites\">FAQ</a>.</p>\n\n<p><sup>This tag wiki is from the Meta.SE tags.</sup></p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T16:17:34.320","LastActivityDate":"2014-05-20T16:17:34.320","CommentCount":"0"},{"Id":"2116","PostTypeId":"4","CreationDate":"2014-05-20T16:17:34.320","Score":"0","Body":"Tags are keywords or labels that categorize and group your question with other, similar questions.","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T16:17:34.320","LastActivityDate":"2014-05-20T16:17:34.320","CommentCount":"0"},{"Id":"2117","PostTypeId":"5","CreationDate":"2014-05-20T16:56:41.733","Score":"0","Body":"","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T16:56:41.733","LastActivityDate":"2014-05-20T16:56:41.733","CommentCount":"0"},{"Id":"2118","PostTypeId":"4","CreationDate":"2014-05-20T16:56:41.733","Score":"0","Body":"For questions regarding asking questions or otherwise interacting with questions on Ask Different","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T16:56:41.733","LastActivityDate":"2014-05-20T16:56:41.733","CommentCount":"0"},{"Id":"2119","PostTypeId":"5","CreationDate":"2014-05-20T16:57:04.780","Score":"0","Body":"","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T16:57:04.780","LastActivityDate":"2014-05-20T16:57:04.780","CommentCount":"0"},{"Id":"2120","PostTypeId":"4","CreationDate":"2014-05-20T16:57:04.780","Score":"0","Body":"The reputation is a measurement of a user's contributions to the site, and the extent to which the community \"trusts\" that user with extra privileges.","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T16:57:04.780","LastActivityDate":"2014-05-20T16:57:04.780","CommentCount":"0"},{"Id":"2121","PostTypeId":"5","CreationDate":"2014-05-20T16:57:38.520","Score":"0","Body":"","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T16:57:38.520","LastActivityDate":"2014-05-20T16:57:38.520","CommentCount":"0"},{"Id":"2122","PostTypeId":"4","CreationDate":"2014-05-20T16:57:38.520","Score":"0","Body":"For questions about the flagging process, how flags are handled, etc.","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T16:57:38.520","LastActivityDate":"2014-05-20T16:57:38.520","CommentCount":"0"},{"Id":"2123","PostTypeId":"5","CreationDate":"2014-05-20T16:58:28.360","Score":"0","Body":"<p>For questions about the process of editing, how edits work, and other general inquiries about the edit system. For questions regarding suggested edits, see <a href=\"/questions/tagged/suggested-edits\" class=\"post-tag\" title=\"show questions tagged &#39;suggested-edits&#39;\" rel=\"tag\">suggested-edits</a>.</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T16:58:28.360","LastActivityDate":"2014-05-20T16:58:28.360","CommentCount":"0"},{"Id":"2124","PostTypeId":"4","CreationDate":"2014-05-20T16:58:28.360","Score":"0","Body":"For questions about the process of editing, how edits work, and other general inquiries about the edit system.","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T16:58:28.360","LastActivityDate":"2014-05-20T16:58:28.360","CommentCount":"0"},{"Id":"2125","PostTypeId":"5","CreationDate":"2014-05-20T16:58:45.220","Score":"0","Body":"<p>Voting is a mechanic on this site used to identify if a question, answer or comment are helpful or not. When a post gets up-voted, the author recieves reputation as an indication that his post was helpful to someone. When your post gets downvoted, you lose some reputation as a notification to try harder or fix some inaccuracies on your post. </p>\n\n<p>Upvoting requires 15 reputation, and downvoting requires 125 reputation. When you downvote, you should put a comment why you downvote, and downvoting on answers takes 1 reputation from you, so use it wisely. On the meta, upvoting on feature requests also indicates that you agree with the suggestion.</p>\n\n<p>If you vote and leave it for some time, your vote gets locked. This means that you cannot change your vote, unless the question is edited.</p>\n","OwnerUserId":"37797","LastEditorUserId":"121023","LastEditDate":"2015-06-15T11:52:42.530","LastActivityDate":"2015-06-15T11:52:42.530","CommentCount":"0"},{"Id":"2126","PostTypeId":"4","CreationDate":"2014-05-20T16:58:45.220","Score":"0","Body":"Peer voting on questions and answers is the primary way users gain reputation, and also how many items are sorted to the top.","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-05-20T16:58:45.220","LastActivityDate":"2014-05-20T16:58:45.220","CommentCount":"0"},{"Id":"2127","PostTypeId":"1","AcceptedAnswerId":"2128","CreationDate":"2014-05-20T19:16:05.173","Score":"5","ViewCount":"77","Body":"<p><a href=\"https://apple.stackexchange.com/questions/12417/what-different-stack-exchange-apps-exist-for-ios\">What different Stack Exchange apps exist for iOS?</a></p>\n\n<p>The question is no longer relevant (in that it says there is no official app) and someone edited it to add that.  A mod removed the edit. Just curious why... seems like it would be helpful to future visitors to know that this question is not relevant today.</p>\n","OwnerUserId":"40","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-05-24T19:14:23.633","Title":"Is there a policy against an edit to add clarification to a question that is now out of date?","Tags":"<discussion><questions><editing>","AnswerCount":"2","CommentCount":"0"},{"Id":"2128","PostTypeId":"2","ParentId":"2127","CreationDate":"2014-05-20T19:22:17.897","Score":"4","Body":"<p>I did (or rather undid) the edit because answers shouldn't be included in the question but posted as real answers below (and there already was an answer for the official app anyway). I did miss the the part about the nonexistence of an official app though, going to fix this afterwards. Thanks for pointing it out.</p>\n\n<p>In general I would lean towards closing outdated questions with a comment stating the close reason. This way they stay on the site (and are still searchable).</p>\n","OwnerUserId":"9058","LastActivityDate":"2014-05-20T19:22:17.897","CommentCount":"0"},{"Id":"2129","PostTypeId":"2","ParentId":"2127","CreationDate":"2014-05-20T19:31:56.253","Score":"2","Body":"<p>There's no policy, but as Patrix points out (and its especially relevant when you read the question title standalone which just asks \"What software do people use\" indicating the lack of an official one as a side note in effect during the question) the information that an official client is available has been included and is currently the highest voted answer, and the OP has been informed by other regular users to perhaps change his accepted answer.</p>\n\n<p>That's where things get tricky.  With some subjects, things get out of date real quick.  And this is one of those.  Personally the preferred solution for me personally was if the person providing the new answer when the official client came out just didn't answer - it wasn't an active question at that time being 3 years old but now there is a fresh answer it becomes active, and now becomes a sort of Zombie question brought back to life due to new information.  In the perfect world, this old question would not have been resurrected <em>for me</em>, but when they are, we have to try to tread the line between <em>updating the question to make it relevant</em>, which risks making <em>existing answers and votes irrelevant</em>.</p>\n\n<p>A tough one.</p>\n","OwnerUserId":"9495","LastActivityDate":"2014-05-20T19:31:56.253","CommentCount":"0"},{"Id":"2130","PostTypeId":"1","AcceptedAnswerId":"2131","CreationDate":"2014-05-21T16:00:17.200","Score":"6","ViewCount":"111","Body":"<p>Take <a href=\"https://apple.stackexchange.com/questions/131467/missing-a-lot-of-options-from-finders-right-click-context-menu\">this question</a> for example. It's a good question, but there's no definitive answer without going through some of the initial troubleshooting steps I point out in my comments in order to isolate the problem. </p>\n\n<p>We are encouraged only to <strong>answer</strong> questions in our replies, rather than respond with speculations as to the problem - but in this case, and in many cases, isolating the problem using the comment section is crucial to actually delivering an answer. Should there not be a \"reward?\"</p>\n","OwnerUserId":"62132","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-05-21T20:37:48.960","Title":"Why don't \"up-votes\" received for a comment contribute to reputation scores?","Tags":"<discussion><reputation><comments>","AnswerCount":"1","CommentCount":"3"},{"Id":"2131","PostTypeId":"2","ParentId":"2130","CreationDate":"2014-05-21T16:04:09.720","Score":"7","Body":"<p>Because comments are transitory, and should be used to indicate clarification etc. An upvote on a comment is further evidence to the OP that it's a good one that may allow them to amend their question/answer.  If that results in an improvement etc, then the vote should be applied to the question/answer (if that's not already been done), not the comment, which should then be removed.</p>\n\n<p>Essentially, comments are post it notes.  In the ideal world, they all get binned once they have served their purpose to further the efforts to improve a contribution.  Comments can spill over into chat if too many are created, and as such it's just like starring a chat comment - it signifies it adds something, but it isn't a formal part of the q or a.</p>\n\n<p>On extremely busy posts, votes push up the best comments while the rest are hidden from view, so votes on comments aren't in the same rep giving class as actual posts. </p>\n","OwnerUserId":"9495","LastEditorUserId":"5472","LastEditDate":"2014-05-21T17:19:11.143","LastActivityDate":"2014-05-21T17:19:11.143","CommentCount":"1"},{"Id":"2132","PostTypeId":"2","ParentId":"1639","CreationDate":"2014-05-21T17:23:08.773","Score":"1","Body":"<p>Like any shopping question, prices often can change. </p>\n\n<p>The best answer is to just talk to a sales person at these contact points. Ad sales is at the bottom of the page. </p>\n\n<p><a href=\"http://stackexchange.com/about/contact\">http://stackexchange.com/about/contact</a></p>\n","OwnerUserId":"5472","LastActivityDate":"2014-05-21T17:23:08.773","CommentCount":"0"},{"Id":"2134","PostTypeId":"1","AcceptedAnswerId":"2135","CreationDate":"2014-05-23T09:18:03.143","Score":"-2","ViewCount":"27","Body":"<p>Quicklook seems to be the official name for the preview.app functionality.</p>\n\n<p>Please merge them, it's displaying me it needs at least+5 score in the tag to merge.</p>\n","OwnerUserId":"34561","LastEditorUserId":"5472","LastEditDate":"2014-05-23T12:25:03.777","LastActivityDate":"2014-05-23T12:25:03.777","Title":"Merge Quicklook and preview","Tags":"<feature-request><status-declined><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2135","PostTypeId":"2","ParentId":"2134","CreationDate":"2014-05-23T09:38:38.930","Score":"7","Body":"<ul>\n<li>Quicklook is what you get if you press <kbd>Space</kbd> in Finder to view the content of a file</li>\n<li>Preview.app is an application on its own</li>\n</ul>\n\n<p>Unless I misunderstood your intention I don't think these two tags should get merged.</p>\n","OwnerUserId":"9058","LastActivityDate":"2014-05-23T09:38:38.930","CommentCount":"2"},{"Id":"2136","PostTypeId":"1","AcceptedAnswerId":"2137","CreationDate":"2014-05-23T19:08:55.207","Score":"5","ViewCount":"69","Body":"<p>Currently, the \"off-topic\" flag presents to me three options:</p>\n\n<ul>\n<li>Software development questions should go on Stack Overflow</li>\n<li>Pre-release questions are off-topic</li>\n<li>It should go on another site</li>\n</ul>\n\n<p>When flagging <a href=\"https://apple.stackexchange.com/questions/131691/long-list-page-design-in-android\">this question</a>, I clicked the third option, and it only showed up with the meta site. I was hoping to see the UX site, but it did not appear and I ended up clicking the first option (Stack Overflow), after looking at <a href=\"https://apple.meta.stackexchange.com/a/1770/67260\">the answer here</a>.</p>\n\n<p>I understand that this issue doesn't come up very often, but I honestly think it's kind of dumb to have a site selector there with only one option.</p>\n","OwnerUserId":"67260","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-05-31T10:20:35.540","Title":"Why can't I flag a question to go to another Stack Exchange site?","Tags":"<support><questions><flagging>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"2137","PostTypeId":"2","ParentId":"2136","CreationDate":"2014-05-23T20:36:06.970","Score":"6","Body":"<p>Ask Different doesn't seem to migrate many questions anywhere very often; in the last 90 days, 7 questions were migrated to SO and 1 to SU (and 6 to the child meta).</p>\n\n<blockquote>\n  <p>Migration paths are only created when there is a history of many good migrations having happened between site A and site B.</p>\n</blockquote>\n\n<p><sup>Source: <a href=\"https://apple.meta.stackexchange.com/a/817/\">Can we have StackOverflow added as a site we can migrate questions to</a></sup></p>\n\n<p>There hasn't been a migration to UX in the last 90 days (I can't go back further in time, but I don't recall any others that have been migrated).</p>\n\n<p>You can always flag for a moderator to migrate it though:</p>\n\n<blockquote>\n  <p>you can flag a post for moderator attention and a moderator can migrate it to any SE site if it needs to be moved</p>\n</blockquote>\n\n<p><sup>Source: <a href=\"https://apple.meta.stackexchange.com/a/267/\">Closing question as should be on other SE site</a></sup></p>\n\n<hr>\n\n<p>With regard to the specific post in question, I saw your off-topic flag and voted to close the question with a custom reason (which you can do at 3k)—you can see the reason that I gave as it is added as a comment: I mentioned UX as a possible destination to the question. If the question is closed, the user is free to ask the question on UX anyway, if they wish, or request that the question be migrated themselves by flagging their own question.</p>\n\n<p>In this case, as your off-topic flag doesn't 'count' it doesn't really matter which reason you give, as the reason for the closure (shown in the blue post notice) will be determined by those who actually <em>vote</em> to close the post (whether that be 5 users or a ♦ moderator) rather than those who have flagged as off-topic. Your flag simply brings it to the attention of other users who have greater than 3k reputation. When you reach 3k, you will be able to <a href=\"https://apple.stackexchange.com/help/privileges/close-questions\">cast your own votes to close questions</a> (and also view the <a href=\"https://apple.stackexchange.com/review/close/\">Close Votes review queue</a>). You will then be able to write a custom reason in the free-form off-topic box which can be used as the actual reason for the closure:</p>\n\n<p><img src=\"https://i.stack.imgur.com/IpWlV.png\"></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-05-31T10:20:35.540","CommentCount":"1"},{"Id":"2139","PostTypeId":"1","AcceptedAnswerId":"2140","CreationDate":"2014-05-26T19:53:34.693","Score":"0","ViewCount":"37","Body":"<p>The OP has <a href=\"https://apple.stackexchange.com/a/128973/46541\">marked my answer as correct</a> but I did not get the bounty!</p>\n\n<p>What happened here? Who decides who gets the rewards?</p>\n","OwnerUserId":"46541","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-05-27T23:50:36.423","Title":"Answer was accepted but bounty was not received","Tags":"<support><bounty>","AnswerCount":"2","CommentCount":"0"},{"Id":"2140","PostTypeId":"2","ParentId":"2139","CreationDate":"2014-05-26T20:03:39.240","Score":"2","Body":"<p>The OP has to award the bounty, and it is not linked to acceptance. It's a separate process, and it's entirely possible to award it to an unrelated answer.</p>\n\n<p>Because they are not linked, the OP will instead be told when it has expired that he has a couple of days to award it, and will get bugged to do so. I think if the OP does not specifically award it, it can be auto awarded to the highest scoring answer if it's above a certain level, I don't recall the exact mechanism.</p>\n\n<p>Check the question, if the bounty is still active, then just have patience until it's expired and the OP gets prompted.</p>\n","OwnerUserId":"9495","LastActivityDate":"2014-05-26T20:03:39.240","CommentCount":"1"},{"Id":"2141","PostTypeId":"2","ParentId":"2139","CreationDate":"2014-05-26T20:13:02.997","Score":"3","Body":"<p>The asker of the question decides whether and to whom to assign the \"accepted answer\" checkbox. The issuer of a bounty decides whether and to whom to assign the bounty. These are separate decisions, even in the case where the asker and the poster of the bounty are the same person. In this case, the poster actually left a note:</p>\n\n<p>\"Update 2: The bounty and the accepted answer are both great - couldn't decide so I split the accept and the bounty between them.\"</p>\n","OwnerUserId":"9388","LastEditorUserId":"9388","LastEditDate":"2014-05-27T23:50:36.423","LastActivityDate":"2014-05-27T23:50:36.423","CommentCount":"2"},{"Id":"2142","PostTypeId":"2","ParentId":"1678","CreationDate":"2014-06-01T11:16:32.350","Score":"2","Body":"<p>With the new top bar, the log out link has been moved. Now, click the Stack Exchange button on the top left, then select log out.</p>\n\n<p><img src=\"https://i.stack.imgur.com/5nVnM.png\" width=\"382\"></p>\n","OwnerUserId":"37797","LastActivityDate":"2014-06-01T11:16:32.350","CommentCount":"0"},{"Id":"2143","PostTypeId":"1","AcceptedAnswerId":"2144","CreationDate":"2014-06-03T00:01:01.950","Score":"11","ViewCount":"214","Body":"<p>Maliciously wrong answers, which do something unexpected and harmful to the user, should be flag-worthy.</p>\n\n<p>For example, if someone asked:</p>\n\n<blockquote>\n  <p>How do I change the permissions of a directory?</p>\n</blockquote>\n\n<p>Then the following answer should be flag-worthy, because it does something unexpected and harmful:</p>\n\n<blockquote>\n  <p>Do <code>rm -rf directory</code></p>\n</blockquote>\n\n<p>By contrast, the following is incorrect (the command name is mis-spelt), but wouldn't be flag-worthy:</p>\n\n<blockquote>\n  <p>Use the <code>changemod</code> command</p>\n</blockquote>\n\n<p>I recently flagged an <a href=\"https://apple.stackexchange.com/a/68906/691\">answer</a> as maliciously wrong, but was declined for doing so.</p>\n\n<p>It said:</p>\n\n<blockquote>\n  <p>You just click on the red maximize button</p>\n</blockquote>\n\n<p>The red button doesn't maximize a window, but closes it instead, which is unexpected and harmful behaviour.</p>\n","OwnerUserId":"691","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-06-08T22:03:18.747","Title":"Maliciously wrong answers should be flag-worthy","Tags":"<discussion><flagging>","AnswerCount":"2","CommentCount":"4","FavoriteCount":"1"},{"Id":"2144","PostTypeId":"2","ParentId":"2143","CreationDate":"2014-06-03T00:35:20.680","Score":"6","Body":"<p>Thanks for raising the issue.</p>\n\n<p>I examined the account and the post. I don't think it's overly malicious - especially with a slightly more verbose comment (I edited yours to show you what I mean).</p>\n\n<blockquote>\n  <p>This answer is potentially maliciously wrong. Pressing the red button will close the window or application and in some cases, you could lose data if the app doesn't save periodically or restore it's state when you re-launch it.     </p>\n</blockquote>\n\n<p>But, the answer is just noise, so a low quality flag would be sufficient to get that post deleted. It's cleaned up now - again thanks for raising this on meta -the perfect venue for this sort of discussion and clean-up.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2014-06-03T01:02:27.780","LastActivityDate":"2014-06-03T01:02:27.780","CommentCount":"4"},{"Id":"2145","PostTypeId":"1","AcceptedAnswerId":"2146","CreationDate":"2014-06-03T14:29:54.043","Score":"1","ViewCount":"46","Body":"<p>Tags exist for each version of iOS have hyphens in their name, such as <a href=\"https://apple.stackexchange.com/questions/tagged/ios-7\" class=\"post-tag\" title=\"show questions tagged &#39;ios-7&#39;\" rel=\"tag\">ios-7</a>, with synonyms for the tag without the hyphen.</p>\n\n<p>However, with iOS 8, the <a href=\"https://apple.stackexchange.com/questions/tagged/ios-8\" class=\"post-tag\" title=\"show questions tagged &#39;ios-8&#39;\" rel=\"tag\">ios-8</a> does not exist and instead the only tag is <a href=\"https://apple.stackexchange.com/questions/tagged/ios8\" class=\"post-tag\" title=\"show questions tagged &#39;ios8&#39;\" rel=\"tag\">ios8</a>.</p>\n\n<p>Can this be rectified to be in the same style as the other versions of iOS?</p>\n","OwnerUserId":"37797","LastEditorUserId":"5472","LastEditDate":"2014-06-03T14:33:59.710","LastActivityDate":"2014-06-03T14:33:59.710","Title":"Rename \"ios8\" tag to \"ios-8\" and create synonym","Tags":"<support><status-completed><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2146","PostTypeId":"2","ParentId":"2145","CreationDate":"2014-06-03T14:32:17.267","Score":"1","Body":"<p>You're right. I've made the rename and synonym. Thanks </p>\n","OwnerUserId":"5472","LastActivityDate":"2014-06-03T14:32:17.267","CommentCount":"0"},{"Id":"2147","PostTypeId":"1","CreationDate":"2014-06-03T15:50:45.417","Score":"4","ViewCount":"111","Body":"<p>I have been seeing questions about the Swift programming language here and on StackOverflow, and other technologies that are currently under NDA. Should these be flagged or closed since Swift falls under the Apple Developer NDA?</p>\n\n<p>If so, what category should be used for the reason?</p>\n","OwnerUserId":"2313","LastActivityDate":"2014-06-04T16:34:18.770","Title":"How should questions about the Swift Programming Language be dealt with?","Tags":"<discussion><yosemite>","AnswerCount":"1","CommentCount":"1"},{"Id":"2148","PostTypeId":"2","ParentId":"2147","CreationDate":"2014-06-03T15:54:36.713","Score":"3","Body":"<p>No - we don't really enforce NDA directly so that's generally not a good reason to flag anything. Also, as Daniel explained in a comment - the language itself is documented publicly in an iBook without any NDA required to learn the syntax. Similarly, all of Cocoa with the exception of pre-release API and changes are all available on <a href=\"http://developer.apple.com\" rel=\"nofollow\">http://developer.apple.com</a> with no NDA or account needed to learn / discuss / use Cocoa API.</p>\n\n<p>All the swift questions I've seen so far are clearly code level programming questions and/or vague requests for classes / books and those aren't really on topic here or SO per both site's help center guidelines. So, I'd say the generic programming close reason is how you might handle most Swift questions in the future.</p>\n\n<p>If you want to suggest some specific questions to discuss the proper close reasons, we can add them as comments here or an edit to your question, but there's little to discuss here until Xcode itself is generally released as it's unlikely Swift will be on topic here any more than Objective-C and C++ and Ruby are today.</p>\n\n<p>If it turns out that Swift is actually some form of scripting, then we would probable allow those questions once some version of the language ships on an OS or Xcode that's available to anyone that chooses to download it. At present, I'm only aware of Xcode for developers which is both NDA + Pre-Release with the Pre-Release being the primary reason it's OT here today as opposed to the NDA directly.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2014-06-04T16:34:18.770","LastActivityDate":"2014-06-04T16:34:18.770","CommentCount":"3"},{"Id":"2150","PostTypeId":"2","ParentId":"2143","CreationDate":"2014-06-08T22:03:18.747","Score":"3","Body":"<p>The problem with this is that it requires the moderators to both recognize wrong answers and determine malicious intent in order to handle the flag. Some answers are wrong; some spectacularly so. I agree that it would be a good thing to draw people's attention to answers that are spectacularly bad advice. Comment and downvote. Beyond that, if it's really important, raise the issue in chat to recruit other people to downvote. The problem with flagging it is that flags aren't really an ideal medium to communicate detailed information. If it isn't obvious to the moderators why an answer is spectacularly bad, there aren't a lot of characters in a flag to make your case, and the default is going to be to <strong>not</strong> delete things.</p>\n\n<p>I'm not saying a flag is inappropriate, but the threshold for instant deletion of an on-topic but wrong answer is pretty high. If an appropriate edit, comment, or vote can fix the problem, I'd encourage you to do that.</p>\n","OwnerUserId":"9388","LastActivityDate":"2014-06-08T22:03:18.747","CommentCount":"0"},{"Id":"2151","PostTypeId":"1","CreationDate":"2014-06-09T10:12:54.417","Score":"5","ViewCount":"47","Body":"<p>I've just typed an answer on AD and it's way slower than typing a question or answer on this meta for example.</p>\n\n<p>I am using Mobile Safari browser and not enabling the mobile theme - so it's basically the full site css/js on the iOS 7 mobile Safari that is not performing well when typing.</p>\n\n<p>Can the custom font be disabled for the textareas please?</p>\n\n<p><strong>Important edit:</strong> please note I'm not 100% sure it is the font. Both are <strong><em>consolas</em></strong>, but something is causing this. Someone who could troubleshoot this, would be awesome.</p>\n","OwnerUserId":"34561","LastEditorUserId":"34561","LastEditDate":"2014-06-09T15:01:10.100","LastActivityDate":"2014-06-09T15:01:10.100","Title":"Typing question/answer via iPhone very slow","Tags":"<discussion><bug><design>","AnswerCount":"0","CommentCount":"8"},{"Id":"2152","PostTypeId":"1","CreationDate":"2014-06-11T11:33:21.883","Score":"0","ViewCount":"52","Body":"<p>I've seen a default \"Not about Apple products and not in scope of this site etc.\" as closing reason.\nIt does not show up in my options, is it diamond mod only?</p>\n\n<p>Can you add it to the 3k rep closing vote?</p>\n\n<p>Thanks</p>\n\n<p><strong>EDIT</strong> This is what I see:\n<img src=\"https://i.stack.imgur.com/jfy7Y.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"34561","LastEditorUserId":"34561","LastEditDate":"2014-06-12T16:46:50.720","LastActivityDate":"2014-06-12T16:46:50.720","Title":"Closing Off-topic please add \"Not about Apple products\"","Tags":"<discussion><close-reasons>","AnswerCount":"0","CommentCount":"9"},{"Id":"2153","PostTypeId":"1","AcceptedAnswerId":"2896","CreationDate":"2014-06-11T21:32:00.240","Score":"7","ViewCount":"76","Body":"<p>The question in question is [revised title] <a href=\"https://apple.stackexchange.com/questions/102928/downgrading-to-a-previous-ios-version\">Can I install any iOS version I wish by picking and choosing which firmware to restore?</a>. I usually just mark anything that has to do with installing different iOS versions as a duplicate of that question. The answer I have on that question covers all scenarios including upgrading and downgrading. However, the question specifically asks for a downgrade.</p>\n\n<p>I come here again asking about this because of the short conversation I had with Mark on this question here that specifically asks for an iOS upgrade <a href=\"https://apple.stackexchange.com/questions/133322/can-you-update-an-iphone-4-on-ios-6-1-2-to-7-0-6-using-an-ipsw-file\">Can you update an iPhone 4 on iOS 6.1.2 to 7.0.6 using an IPSW file?</a>. I tried marking that question as a duplicate of <a href=\"https://apple.stackexchange.com/questions/102928/downgrading-to-a-previous-ios-version\">Can I install any iOS version I wish by picking and choosing which firmware to restore?</a>, but Mark seemed to disagree with me.</p>\n\n<p>The real problem is that all of these questions can be answered with my one answer.</p>\n\n<p>At one point, I did make my own generic question and answered it myself, but the mods marked it as a duplicate of <a href=\"https://apple.stackexchange.com/questions/102928/downgrading-to-a-previous-ios-version\">Can I install any iOS version I wish by picking and choosing which firmware to restore?</a>.</p>\n\n<p>Can we make this question more generic to include all unorthodox installations of iOS? If not, can I make a question that actually is generic and move my answer to it and not have it marked as a duplicate?</p>\n\n<p><strong>Update:</strong> Can we revisit this? We seem to get duplicates of these iOS upgrade/downgrade/reinstall questions three to four times per month.</p>\n","OwnerUserId":"18387","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-11-13T13:00:58.047","Title":"Should we make this question about downgrading iOS more generic?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2155","PostTypeId":"1","AcceptedAnswerId":"2156","CreationDate":"2014-06-17T01:24:53.003","Score":"10","ViewCount":"99","Body":"<p>I've always wondered what the proper way to go about this is.</p>\n\n<p>I posted a question on both Apple Support Communities and Ask Different. I got a response on the Support Communities first and it solved my problem.  Is it right for me to go ahead and put the solution to my problem in the Ask Different question?  For some reason I feed wrong doing it.</p>\n","OwnerUserId":"28424","LastActivityDate":"2014-06-17T03:06:52.110","Title":"Answering your own question","Tags":"<discussion><questions><answers><accepted-answer>","AnswerCount":"1","CommentCount":"1"},{"Id":"2156","PostTypeId":"2","ParentId":"2155","CreationDate":"2014-06-17T03:06:52.110","Score":"12","Body":"<p>From <a href=\"https://apple.stackexchange.com/help/self-answer\">the FAQ:</a></p>\n\n<blockquote>\n  <p>Yes! Stack Exchange has always explicitly encouraged users to answer their own questions. If you have a question that you already know the answer to, and you would like to document that knowledge in public so that others (including yourself) can find it later, it's perfectly okay to ask and answer your own question on a Stack Exchange site.</p>\n</blockquote>\n\n<p>So please go ahead and fill in an answer with a solution that works. There's a grace period before your own answer becomes something you can accept but otherwise it's a-okay.</p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-06-17T03:06:52.110","CommentCount":"1"},{"Id":"2157","PostTypeId":"1","AcceptedAnswerId":"2158","CreationDate":"2014-06-17T10:47:29.257","Score":"1","ViewCount":"40","Body":"<p>I occasionally see questions that have been cross-posted. For example, <a href=\"https://apple.stackexchange.com/questions/135259/disable-discrete-gpu-in-single-user-mode-install-partition\">this question</a> was <a href=\"https://superuser.com/questions/769826/disable-discrete-gpu-in-single-user-mode-osx-10-10-install-partition\">also posted on SU</a> at approximately the same time.</p>\n\n<p>In the past, I usually flag such cross-posts with a custom reason, but is this the best way to deal with it? Recently, I've been adding comments to the effect of…</p>\n\n<blockquote>\n  <p>Please don't cross post :) If you don't get the response desired from [xpost], request a moderator migrate it rather than reposting the question yourself.</p>\n</blockquote>\n\n<p>How should cross posts be dealt with?</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-06-17T11:14:01.240","Title":"What is the correct response to cross-posted questions?","Tags":"<discussion><questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"2158","PostTypeId":"2","ParentId":"2157","CreationDate":"2014-06-17T11:14:01.240","Score":"5","Body":"<p>In general commenting and flagging are both valid options in these situations.</p>\n","OwnerUserId":"9058","LastActivityDate":"2014-06-17T11:14:01.240","CommentCount":"0"},{"Id":"2159","PostTypeId":"1","AcceptedAnswerId":"2161","CreationDate":"2014-06-19T06:03:10.530","Score":"3","ViewCount":"55","Body":"<p>How many times have I seen questions such as <a href=\"https://apple.stackexchange.com/questions/135461/characters-do-not-echo-in-os-x-terminal-unless-i-hit-the-delete-key#135469\">this</a> in my few months participating in the community? <strong>Too many times.</strong> </p>\n\n<p>I brought up a <a href=\"https://apple.meta.stackexchange.com/questions/2130/why-dont-up-votes-received-for-a-comment-contribute-to-reputation-scores\">similar issue</a> on meta before, regarding the value of comments leading to solutions vs. speculative answers in replying to a question. </p>\n\n<p>In a way, it's the nature of the beast. We are, after all, not asking about <a href=\"http://english.stackexchange.com\">English Language &amp; Usage</a>, but asking.......<em>\"differently:</em>\" outside of the box. </p>\n\n<p>By the same token, it's a plague. </p>\n\n<p>I believe there is a fundamental dilemma with Ask Different's moderation system (note, I mean 'moderation' in a broader sense - not in regards to the current mods., whom I find excellent). </p>\n\n<p>The fundamental issue is that <strong><em>too many questions require clarification and more detail on behalf of the OP.</em></strong></p>\n\n<p>As a growing SE site, part of me believes it's not appropriate to place more stringent requirements on questions. Naturally, participants will be less inclined to participate in this community if they are even hesitant to ask a question. <strong>Membership and participation is paramount.</strong> </p>\n\n<p>The other half of me feels constant frustration when reading through some (most) questions, which require <em>more work to clarify a question</em> than to eventually provide its solution. To boot, <strong>I believe this has brought about <em>a culture of speculative and often innacurate answers</em></strong>-even from notable, experienced members. This, in my opinion, is detrimental to the community as a whole. </p>\n\n<p>I joined Ask Different, partly, because I was sick of the continuously mundane questions (along with close minded 'fan-boy' ideology) over at <a href=\"https://discussions.apple.com/backsoon/discussionstempaway.html\" rel=\"nofollow noreferrer\">Apple Support Communities</a> that could be answered with a simple <kbd>Command</kbd>+<kbd>C</kbd> of my previous responses.</p>\n\n<p>1) Do you agree there is an issue?</p>\n\n<p>2) If so, who does the burden fall on?</p>\n\n<p>3) What steps can (or should) be taken to ameliorate the issue? </p>\n","OwnerUserId":"62132","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-06-19T16:36:02.637","Title":"To answer or comment? The plight of the troubleshoot when faced with ambiguity (and then some)","Tags":"<discussion><support><feature-request>","AnswerCount":"2","CommentCount":"1","FavoriteCount":"1"},{"Id":"2160","PostTypeId":"2","ParentId":"2159","CreationDate":"2014-06-19T11:40:54.257","Score":"2","Body":"<p>Interesting post.  I think we have covered it a few times before, but I don't feel like hunting for duplicates, I think engaging users in fresh conversation on such topics in Meta is more important than pointing them to what has been said before.  Not like this place is high enough traffic to worry about the odd duplicate.</p>\n\n<p>I won't answer your 3 questions directly (well; yes, everyone, not many) but rather discuss a few things about this site which might well result in a few insights why I genuinely think that Ask Different <em>really is different</em> from most of the other SE sites.</p>\n\n<p>Let's go to other sites first.  Here, for example are a list of a few other other sites I use; Bicycles, Arqade, Science Fiction &amp; Fantasy.  I use those sites differently to how I use this one (even before I was a Mod too) - those sites are centred about topics for which the majority of users share not just a common interest, but a common passion.  For many of the other more IT related sites (Ubuntu, Super-User) those people too are there not just because they have a problem, but because they have a passion for their subjects, or in the least for the technical IT sites are at least <em>skilled and knowledgeable</em> enough to be able to participate.</p>\n\n<p>Now, with Ask Different, things are different.  We don't have such a well defined audience of people (either passionate or highly skilled).  A lot of our users are here not out of a passion for Apple, but out of frustration due to not being able to do <em>something</em> as a normal everyday person.  And that <em>something</em> is such a wide remit.  We are here to discuss \"Apple\", the company and anything it's name can be loosely associated with.  And these days, that covers so much stuff:</p>\n\n<p>Hardware:</p>\n\n<ul>\n<li><p>Desktops</p>\n\n<ul>\n<li><p>Servers</p></li>\n<li><p>All-in-ones</p></li>\n</ul></li>\n<li><p>Laptops</p></li>\n<li><p>Monitors</p></li>\n<li><p>Tablets</p></li>\n<li><p>Phones</p></li>\n<li><p>iPods (from nano to Classic via Touch)</p></li>\n<li><p>Headphones</p></li>\n<li><p>Peripherals, Mice, Keyboards etc</p></li>\n<li><p>Routers</p></li>\n<li><p>Backup Systems (Time Capsules)</p></li>\n<li><p>Accessories, from covers to cases to docks etc</p></li>\n<li><p>Apple TVs</p></li>\n</ul>\n\n<p><strong>And these are just the first party hardware topics</strong>  Imagine if I bothered to create a list of the software topics, everything from Apple Script to ZFS...</p>\n\n<p>This is the key, our focus is so <em>overly broad</em> that while we can and do have a core membership of highly skilled, experienced, and generally perceptive users, our core membership consists of people that bought something in a shop and can't get it to do what they want.  And basically, most Apple stuff these days is by and large a commodity product.</p>\n\n<p>It's the difference between having a site revolving about engine tuning and performance upgrading etc, and one for \"Ford\".  We are guaranteed to get the dumber questions, the ill-informed users, the poorly thought out content.  It's just the nature of the massively wide audience we have.  Other sites take the cream off the top of their particular areas of interest, and gather them together to form a community.  We simply take in randoms off the street, people who aren't here to stay here, but people who want to get in, get help, and get out.</p>\n\n<p>Now is this a problem?  Yes in many ways, I doo feel our participation levels and community feel seems <em>lesser</em> than many of the other sites we use</p>\n\n<p>Who's burden is it?  Well, it's everyone's, but being practical it's really (and unfairly) on the Mods, the High Level users, the Long Term users to try to corral everything into something like quality content, and we simply don't have enough of those as a percentage of all users like other sites do.</p>\n\n<p>What can we do?  Keep calm, and carry on.</p>\n\n<p>As an aside, the first link you direct us to about the Terminal problem, I think is actually a good question.  It's a genuine problem, well described with enough info to ensure it get's a proper answer.  And I suspect that is where some of the frustration behind your question comes from (good frustration, expressed properly, not having a go here).  You and I probably know where to look or how to have a quick Google to fix that in seconds.  You're obviously a skilled and experience IT guy.  But the OP?  Chances are he's a guy who bought an iMac after loving his iPhone, has played about in Terminal so see what it is and such, maybe fiddled with settings, and now has gotten stuck.  He's just a guy off the street with an IT problem.  He's not an IT guy on an IT site participating in an IT community.</p>\n\n<p>It's a tough one, and hits at the heart of the biggest problem with this site.  I don't see a fix.</p>\n","OwnerUserId":"9495","LastActivityDate":"2014-06-19T11:40:54.257","CommentCount":"1"},{"Id":"2161","PostTypeId":"2","ParentId":"2159","CreationDate":"2014-06-19T16:21:13.740","Score":"2","Body":"<p>I'm going to answer with something that I've found to work well for me on the site.</p>\n\n<p>When I get a vague question, I pass it through three filters:</p>\n\n<ol>\n<li>Is this problem common enough to be useful to 10 or perhaps 100-1000 people in the coming years?</li>\n</ol>\n\n<p>If the answer is yes, I then ask myself:</p>\n\n<ol>\n<li>Did this person provide enough information for someone to actually answer it?</li>\n</ol>\n\n<p>All the questions that aren't going to be useful <em>(in my opinion of course)</em> I usually comment with a hint and/or a short sentence to point the way to how to troubleshoot and/or to the [help] which describes how to ask a good question.</p>\n\n<p>It's important to me to not spend more time answering / commenting than the effort the asker put into the question. It makes no sense to over-answer until I start the conversation with the OP - often they are highly motivated and edit the question into an awesome one and we gain a great user to the site. Other times, it's a drive by question and the OP never even logs in again to the site.</p>\n\n<p>The second category - questions with enough detail to answer.</p>\n\n<p>I usually take a stab at answering unless the site will benefit most from a guide how to troubleshoot that issue. For example - when MobileMe was duplicating people's contacts and calendar entries - I would probably launch in to a pretty detailed troubleshooting process - linking to Apple KB rather than just answer the OP's narrow question.</p>\n\n<p>Since thousands of people are going to need help and not all of them might be as precise as the OP - I might actually answer for others and not the OP directly. I would also typically provide the OP with the precise answer they need in the comments to my answer.</p>\n\n<p>The one last piece of advice is that I would challenge anyone to decide early with each question. Choose to either answer it directly or answer it with a troubleshooting procedure. Mixing the both tends to get messy and confusing to others - especially people that come later with the same problem. Having two answers on a question - one with a definitive answer that ABC fixed this problem for the OP and a general - here's how to see if your problem is the same and troubleshoot it is of the most benefit for the site as well as for the answerer and asker. <em>(IMHO)</em></p>\n","OwnerUserId":"5472","LastActivityDate":"2014-06-19T16:21:13.740","CommentCount":"0"},{"Id":"2162","PostTypeId":"1","CreationDate":"2014-06-22T03:54:52.460","Score":"1","ViewCount":"36","Body":"<p>There is a little yet annoying bug in the site.</p>\n\n<p>I am writing a (big) answer.</p>\n\n<p>In the text area, I have the view at the top. The cursor is at the end.</p>\n\n<p>With the handle, I make the text area taller.</p>\n\n<p><strong>Expected behaviour : </strong> The text area gets taller. And that’s it.</p>\n\n<p><strong>Actual behaviour : </strong> The text area gets taller. But the view jumps to the end of the text area.</p>\n\n<p><em>There is also a variant of the bug :</em></p>\n\n<p>In the text area, I have the view at the end. The cursor is at the beginning.</p>\n\n<p>With the handle, I make the text area taller.</p>\n\n<p><strong>Expected behaviour : </strong> The text area gets taller. And that’s it.</p>\n\n<p><strong>Actual behaviour : </strong> The text area gets taller. But the view jumps to the beginning of the text area.</p>\n\n<p><em>End of the variant.</em></p>\n\n<p>The native resize handle of Safari for text areas does not have this bug. This bug is especially annoying, because the text areas of the site do not have the native resize handle of Safari — the site overrides it.</p>\n\n<p>The bug also occurs when I am writing a question.</p>\n\n<p>It would be nice to fix this bug. Thank you.</p>\n\n<p>I have Safari 7 Mac.</p>\n","OwnerUserId":"38177","LastActivityDate":"2014-06-22T03:54:52.460","Title":"Stop the height handle from making the view jump to the cursor","Tags":"<bug><questions><answers><user-interface>","AnswerCount":"0","CommentCount":"3","FavoriteCount":"1"},{"Id":"2163","PostTypeId":"1","AcceptedAnswerId":"2164","CreationDate":"2014-06-23T19:37:03.580","Score":"4","ViewCount":"48","Body":"<ul>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/store\" class=\"post-tag\" title=\"show questions tagged &#39;store&#39;\" rel=\"tag\">store</a> — 21 tagged, 5 this year</p>\n\n<blockquote>\n  <p><em>no tag wiki/excerpt</em></p>\n</blockquote></li>\n</ul>\n\n<p>This extremely broad tag seems to be on a variety of questions where existing, more specific tags serve a much better, specific purpose.</p>\n\n<p>The store tag seems to have been used to mean both the <a href=\"https://apple.stackexchange.com/questions/tagged/ios-appstore\" class=\"post-tag\" title=\"show questions tagged &#39;ios-appstore&#39;\" rel=\"tag\">ios-appstore</a> and the <a href=\"https://apple.stackexchange.com/questions/tagged/mac-appstore\" class=\"post-tag\" title=\"show questions tagged &#39;mac-appstore&#39;\" rel=\"tag\">mac-appstore</a>, as well as the <a href=\"https://apple.stackexchange.com/questions/tagged/itunes-store\" class=\"post-tag\" title=\"show questions tagged &#39;itunes-store&#39;\" rel=\"tag\">itunes-store</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/ibookstore\" class=\"post-tag\" title=\"show questions tagged &#39;ibookstore&#39;\" rel=\"tag\">ibookstore</a>, and not forgetting the physical <a href=\"https://apple.stackexchange.com/questions/tagged/apple-store\" class=\"post-tag\" title=\"show questions tagged &#39;apple-store&#39;\" rel=\"tag\">apple-store</a>.</p>\n\n<p>Should it be burninated?</p>\n","OwnerUserId":"37797","LastActivityDate":"2014-06-27T17:44:10.987","Title":"Burninate the \"store\" tag?","Tags":"<discussion><tags>","AnswerCount":"2","CommentCount":"3"},{"Id":"2164","PostTypeId":"2","ParentId":"2163","CreationDate":"2014-06-23T20:43:48.757","Score":"5","Body":"<p>Yes. Burn it. Burn it with fire.</p>\n","OwnerUserId":"292","LastActivityDate":"2014-06-23T20:43:48.757","CommentCount":"3"},{"Id":"2165","PostTypeId":"1","AcceptedAnswerId":"2166","CreationDate":"2014-06-25T07:13:36.807","Score":"1","ViewCount":"99","Body":"<p>Will Ask Different Community support Emoji in replies and answers? </p>\n","OwnerUserId":"49189","LastActivityDate":"2014-06-25T17:07:39.293","Title":"Emojis usage in Comments and Answers?","Tags":"<feature-request>","AnswerCount":"1","CommentCount":"2","FavoriteCount":"1"},{"Id":"2166","PostTypeId":"2","ParentId":"2165","CreationDate":"2014-06-25T17:07:39.293","Score":"5","Body":"<p>Given that <a href=\"https://apple.stackexchange.com/questions/41228/why-do-emoji-like-%EF%BF%BD%EF%BF%BD-appear-when-i-use-safari-but-not-chrome/41347#41347\">emoji support is not uniform across all browsers</a> I would caution anyone attempting to use them in a question or answer to think carefully before doing so. Unless it adds a serious bit of relevant context to your question or answer, my advice would be to avoid them.</p>\n\n<p>Sorry to ☔️ on your parade.</p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-06-25T17:07:39.293","CommentCount":"2"},{"Id":"2167","PostTypeId":"1","AcceptedAnswerId":"2170","CreationDate":"2014-06-27T17:15:26.240","Score":"3","ViewCount":"26","Body":"<ul>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/3g\" class=\"post-tag\" title=\"show questions tagged &#39;3g&#39;\" rel=\"tag\">3g</a> — 34 tagged, 9 this year</p>\n\n<blockquote>\n  <p>3G - when used as a single word - stands for the third generation of cellular wireless standards.</p>\n</blockquote></li>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/3g-internet\" class=\"post-tag\" title=\"show questions tagged &#39;3g-internet&#39;\" rel=\"tag\">3g-internet</a> — 19 tagged, 1 this year</p>\n\n<blockquote>\n  <p><em>no tag wiki/excerpt</em></p>\n</blockquote></li>\n</ul>\n\n<p>Whilst I understand that the internet is a subset of 3G, questions tagged with <a href=\"https://apple.stackexchange.com/questions/tagged/3g-internet\" class=\"post-tag\" title=\"show questions tagged &#39;3g-internet&#39;\" rel=\"tag\">3g-internet</a> have either also been tagged with <a href=\"https://apple.stackexchange.com/questions/tagged/3g\" class=\"post-tag\" title=\"show questions tagged &#39;3g&#39;\" rel=\"tag\">3g</a> or refer to 3G in general.</p>\n","OwnerUserId":"37797","LastActivityDate":"2014-06-27T17:47:19.460","Title":"Merge the \"3g\" and \"3g-internet\" tags","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2168","PostTypeId":"1","CreationDate":"2014-06-27T17:19:58.807","Score":"4","ViewCount":"40","Body":"<ul>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/data\" class=\"post-tag\" title=\"show questions tagged &#39;data&#39;\" rel=\"tag\">data</a> — 41 tagged, 21 this year</p>\n\n<blockquote>\n  <p><em>no tag wiki/excerpt</em></p>\n</blockquote></li>\n</ul>\n\n<p>This extremely broad tag seems to be on a variety of questions where existing, more specific tags serve a much better, specific purpose.</p>\n\n<p>In most cases, the tag seems to be referring to <a href=\"https://apple.stackexchange.com/questions/tagged/cellular-data\" class=\"post-tag\" title=\"show questions tagged &#39;cellular-data&#39;\" rel=\"tag\">cellular-data</a>, but the tag also seems be used for <a href=\"https://apple.stackexchange.com/questions/tagged/data-transfer\" class=\"post-tag\" title=\"show questions tagged &#39;data-transfer&#39;\" rel=\"tag\">data-transfer</a> or <a href=\"https://apple.stackexchange.com/questions/tagged/data-synchronization\" class=\"post-tag\" title=\"show questions tagged &#39;data-synchronization&#39;\" rel=\"tag\">data-synchronization</a>, as well as <a href=\"https://apple.stackexchange.com/questions/tagged/data-recovery\" class=\"post-tag\" title=\"show questions tagged &#39;data-recovery&#39;\" rel=\"tag\">data-recovery</a> and the (more general but still more specific) <a href=\"https://apple.stackexchange.com/questions/tagged/metadata\" class=\"post-tag\" title=\"show questions tagged &#39;metadata&#39;\" rel=\"tag\">metadata</a>.</p>\n\n<p>Should it be burninated?</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-06-27T18:07:12.490","LastActivityDate":"2014-06-28T11:47:18.007","Title":"Burninate the \"data\" tag?","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2169","PostTypeId":"2","ParentId":"2163","CreationDate":"2014-06-27T17:44:10.987","Score":"2","Body":"<p>Please vote for the synonym I created if you feel this will help prevent a generic store tag from resurfacing after this clean up effort.</p>\n\n<p><a href=\"https://apple.stackexchange.com/tags/apple-store/synonyms\">https://apple.stackexchange.com/tags/apple-store/synonyms</a></p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-06-27T17:44:10.987","CommentCount":"3"},{"Id":"2170","PostTypeId":"2","ParentId":"2167","CreationDate":"2014-06-27T17:47:19.460","Score":"3","Body":"<p>Done - this was an easy merge / synonym to convert them all to <a href=\"https://apple.stackexchange.com/questions/tagged/cellular-data\" class=\"post-tag\" title=\"show questions tagged &#39;cellular-data&#39;\" rel=\"tag\">cellular-data</a> with any further cleanup by retagging questions that were erroneously tagged as either 3g tag.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-06-27T17:47:19.460","CommentCount":"0"},{"Id":"2171","PostTypeId":"2","ParentId":"2168","CreationDate":"2014-06-28T11:47:18.007","Score":"3","Body":"<p>The questions in case also have <a href=\"https://apple.stackexchange.com/questions/tagged/data-recovery\" class=\"post-tag\" title=\"show questions tagged &#39;data-recovery&#39;\" rel=\"tag\">data-recovery</a> or <a href=\"https://apple.stackexchange.com/questions/tagged/recovery\" class=\"post-tag\" title=\"show questions tagged &#39;recovery&#39;\" rel=\"tag\">recovery</a> tagged.\nIt's  used in these questions as <strong>reference to files</strong> aka <a href=\"https://apple.stackexchange.com/questions/tagged/data-transfer\" class=\"post-tag\" title=\"show questions tagged &#39;data-transfer&#39;\" rel=\"tag\">data-transfer</a> or <a href=\"https://apple.stackexchange.com/questions/tagged/data-recovery\" class=\"post-tag\" title=\"show questions tagged &#39;data-recovery&#39;\" rel=\"tag\">data-recovery</a>.</p>\n\n<p>The best option would be to remove this tag as there are more detailed replacements for them already.</p>\n","OwnerUserId":"34561","LastActivityDate":"2014-06-28T11:47:18.007","CommentCount":"0"},{"Id":"2172","PostTypeId":"2","ParentId":"1247","CreationDate":"2014-07-04T01:31:54.987","Score":"4","Body":"<p>I was also thinking that allowing x-man-page links would be convenient, but then I realized there is a major caveat that nobody has considered; if you're using any other operating system then these links become completely useless.</p>\n\n<p>I'm often browsing stackexchange from iOS, or Linux. Without some type of user agent detection to redirect x-man-page links for non OS X users the cons quickly outweigh the pros. Even then the issue becomes needing to provide online man page links in addition to those native to OS X. I love having the ability to use x-man-pages, however, using OS X is not always an option even while I'm on askdifferent.com.</p>\n","OwnerUserId":"10139","LastActivityDate":"2014-07-04T01:31:54.987","CommentCount":"0"},{"Id":"2173","PostTypeId":"2","ParentId":"1247","CreationDate":"2014-07-04T08:40:38.910","Score":"1","Body":"<p>Linking between globally available web pages is better in the long term. Avoid the exclusive use of <code>x-man-page</code> links.</p>\n\n<h2>Unofficial Scheme</h2>\n\n<p>There are risks associated with any <code>x-</code> prefixed scheme. <code>x-</code> is non-standard and no browser vendor has any long term reason to continue support. If Apple decide that manual pages are deemed too complex for their customers, they can remove support for the <code>x-man-page</code> scheme without consequence. Remember how <code>feed</code> support was removed in OS X 10.9.</p>\n\n<h2>Hyperlinking</h2>\n\n<p>Linking to web pages reinforces the web and the notion of hyperlinked content. Linking between local and hosted content will break the easy crawling and indexing of Ask Different's content.</p>\n\n<p>Linking locally assumes the reader is using a Mac running a specific version of OS X. What happens to those researching answers for others? They may be presented with outdated or too modern manual pages, as easily as we might link to an incorrect version today.</p>\n\n<h2>Versioned Manual Pages</h2>\n\n<p>Apple once hosted versioned manual pages. These pages have since been replaced by copies of only the latest edition of each page.</p>\n\n<p>Is there is a stable host of versioned Mac OS X manual pages that we could link to?</p>\n\n<p>This would address the versioning problem and remove the requirement to be browsing on a Mac with <code>x-man-page</code> scheme support.</p>\n","OwnerUserId":"1860","LastEditorUserId":"1860","LastEditDate":"2014-07-04T09:14:20.770","LastActivityDate":"2014-07-04T09:14:20.770","CommentCount":"0"},{"Id":"2174","PostTypeId":"1","AcceptedAnswerId":"2175","CreationDate":"2014-07-04T16:42:31.327","Score":"3","ViewCount":"54","Body":"<p>The FAQ states:</p>\n\n<blockquote>\n  <ul>\n  <li>Do protect questions that are attracting a lot of non-answers or very poor answers (spam, etc.) from new users.</li>\n  </ul>\n</blockquote>\n\n<p>…but Community♦ would protect the question anyway if this occurred. (3 by &lt;10 rep deleted?)</p>\n\n<p>Therefore, when should <em>I</em> be protecting questions rather than leaving it to Community♦?</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2014-07-11T18:36:16.047","LastActivityDate":"2014-07-11T18:36:16.047","Title":"When should I protect questions before Community♦?","Tags":"<support><questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"2175","PostTypeId":"2","ParentId":"2174","CreationDate":"2014-07-07T14:55:19.690","Score":"2","Body":"<p>Tough one :-) In generell Community is doing a good job in protecting automatically and protecting \"helps\" against new users without any reputation anyway. Situations where I (sometimes) protect manually include</p>\n\n<ul>\n<li>a spam-like answer to one of the many \"video conversion\" questions which isn't protect yet (because just having one of these questions bumped up on the main page seems to attract follow-up spam)</li>\n<li>a low-quality answer or question-posted-as-answer on an older topic which already has a bunch of of good answers which cover the whole topic</li>\n</ul>\n","OwnerUserId":"9058","LastActivityDate":"2014-07-07T14:55:19.690","CommentCount":"0"},{"Id":"2176","PostTypeId":"1","AcceptedAnswerId":"2177","CreationDate":"2014-07-21T15:01:50.253","Score":"1","ViewCount":"20","Body":"<p>I lately seen a lot of clash of clans and other games topics here. Should they be related to our topic of apple? I see the games as universal across all platforms (like android) and should not be related purely to apple and they should use another site. </p>\n","OwnerUserId":"85458","LastActivityDate":"2014-07-21T15:14:27.107","Title":"Should clash of clans and/or other games be valid?","Tags":"<discussion><ios>","AnswerCount":"1","CommentCount":"0"},{"Id":"2177","PostTypeId":"2","ParentId":"2176","CreationDate":"2014-07-21T15:14:27.107","Score":"3","Body":"<p>According to the <a href=\"https://apple.stackexchange.com/help/on-topic\">help center</a> </p>\n\n<blockquote>\n  <p>Ask Different is for users of Apple products. If you have a question about ...</p>\n  \n  <ul>\n  <li>[...]</li>\n  <li>third-party hardware, services and software when associated for use with Apple products.</li>\n  </ul>\n  \n  <p>... then you're in the right place to ask your question!</p>\n</blockquote>\n\n<p>so problems related to software running on Apple hardware are on-topic. Also a lot of these questions are related to the interaction between the game and Game Center which clearly is an Apple-related issues.</p>\n\n<p>OTOH questions purely focusing on in-game issues are off-topic (but I haven't seen many of these here).</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-07-21T15:14:27.107","CommentCount":"0"},{"Id":"2178","PostTypeId":"1","CreationDate":"2014-07-23T16:56:01.723","Score":"0","ViewCount":"70","Body":"<p>I resent you closed this issue <a href=\"https://apple.stackexchange.com/questions/135415/finder-windows-wont-show-after-reinstlling-mavericks-ower-yosemite\">Finder windows won&#39;t show after reinstlling Mavericks ower Yosemite</a></p>\n\n<p>How are we supposed to solve our Maverick related issues if we don't get to feedback on this env? </p>\n","OwnerDisplayName":"user85750","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-07-24T20:21:23.423","Title":"Shouldn't this Mavericks question have remained open?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2179","PostTypeId":"2","ParentId":"2178","CreationDate":"2014-07-23T18:36:03.687","Score":"5","Body":"<p>We have chosen for several years now to not be a place to host answers about beta and pre-release OS from Apple. </p>\n\n<p>Until such time as consensus\nchanges, you should find support on Yosemite issues from the vendor or on another site. </p>\n\n<p>See the FAQ for Yosemite in specific: <a href=\"https://appleseed.apple.com/sp/betaprogram/faq\" rel=\"nofollow\">https://appleseed.apple.com/sp/betaprogram/faq</a></p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2014-07-24T20:21:23.423","LastActivityDate":"2014-07-24T20:21:23.423","CommentCount":"4"},{"Id":"2180","PostTypeId":"1","AcceptedAnswerId":"2181","CreationDate":"2014-07-24T16:49:49.303","Score":"23","ViewCount":"756","Body":"<p>I am looking for software advice and don't want to ask a question like:</p>\n\n<p>\"What is the best racing game for iOS?\"</p>\n\n<p>\"What is the best free alternative to Photoshop?\"</p>\n\n<p>Those sort of questions get down votes, all sorts of wrong answers and are likely to be closed unless there is some critical information in the body of the questions to make them useful and answerable.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2014-09-30T13:41:53.947","LastActivityDate":"2016-08-27T18:30:16.963","Title":"How should I ask about getting a software recommendation?","Tags":"<support><faq><asking-questions>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"6"},{"Id":"2181","PostTypeId":"2","ParentId":"2180","CreationDate":"2014-07-24T16:49:49.303","Score":"23","Body":"<p>Although there is a <a href=\"http://softwarerecs.stackexchange.com\">new site that exclusively handles software recommendations</a>, we have been hosting good software recommendation questions since the beginning of Ask Different in August 2010.</p>\n\n<p>Here is an <a href=\"https://softwarerecs.meta.stackexchange.com/questions/197/\">adaptation of an excellent thread</a> from the Software Recommendation site on how to ask a high-quality question here. </p>\n\n<ul>\n<li>Software recommendation questions are best when narrowly scoped</li>\n<li>Try not to ask a \"wikipedia\" of everything that could possibly do X </li>\n<li>Try to focus on clearly documenting the specific tasks you need to accomplish along with your constraints <em>(be they time or money or OS version related)</em></li>\n</ul>\n\n<hr>\n\n<h1>1. Straight to the point, succinct title</h1>\n\n<p>Don't use words like 'best' or 'good' - just tell us what you want. We're not going to recommend the worst, or bad software. For example, a great title could be<br>\n  <strong><em>What [editor/utility/program/plugin] does [task] in [manner]?</em></strong></p>\n\n<h1>2. Describe your task</h1>\n\n<p>This is mandatory - Tell us in clear words what you're doing, or intend to do with what we recommend. If you're bulk re-sizing a bunch of pictures while converting them to another format, or looking for a game to waste time in chunks of 15 minutes - let us know with as several specific and relevant details.</p>\n\n<h1>3. Describe what you have, if anything, and what you don't like about it</h1>\n\n<p>This can sometimes be optional, but let us know what you've got or what you've tried and didn't like, and why. Let us know if you looked at something and decided it wasn't for you. Note - this allows for great answers that may recommend something you dismissed by explaining a feature you overlooked.</p>\n\n<h1>4. Give us an enumerated list of constraints, in order of importance</h1>\n\n<p>Every recommendation question probably needs this list. Tell us the features or operating constraints a good fit would meet, ordered from must-have to nice-to-have. An example:</p>\n\n<ol>\n<li>Must run on MacBook Pro (Mid 2013) with 10.8 (and not 10.9)</li>\n<li>Must be available outside the Mac App Store</li>\n<li>Ideally takes less than 20MB of initial download</li>\n<li>Big plus if it does not offer / need in-app-purchase</li>\n</ol>\n\n<p>Note: Price is generally a bad requirement. Limiting the question to free or less than $x does two very bad things. First, it doesn't help others as everyone's budgets change based on how important the task is to them. Secondly, prices change (and your budget changes over time) and the cost at basecamp on mount everest doesn't match the price for London or Chicago. Thirdly, once we have collected good software that does X - everyone can easily price them out and select an answer that's best for them when they go to buy.</p>\n\n<h1>5. Wrap up your question, if it needs wrapping up.</h1>\n\n<p>You can probably skip this most of the time if you want, but this is a place to put anything supplemental. </p>\n\n<p>Your goal when writing is to narrow the scope enough so that realistically, 10 answers might directly answer it.</p>\n\n<hr>\n\n<p>That's everything someone needs in order to give you a great recommendation. We may not be able to meet all of your requirements, but since you've listed them in the order of importance, we'll be able to recommend something that gets the most important job done. By thinking about asking a great question, you will be helping many other people as well as the potential pool of people that will step up to make an answer to your question.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:52:39.157","LastActivityDate":"2016-08-27T18:30:16.963","CommentCount":"0"},{"Id":"2182","PostTypeId":"1","CreationDate":"2014-07-25T03:13:58.200","Score":"0","ViewCount":"228","Body":"<p>I know this question has already been asked, but with the public beta release everyone can access and get Yosemite. There will definitely be some bugs and glitches. Could we ask questions on Yosemite on the main site?</p>\n","OwnerUserId":"85458","LastEditorUserId":"37797","LastEditDate":"2014-07-28T10:16:24.603","LastActivityDate":"2014-10-20T14:50:00.547","Title":"Should questions about OS X Yosemite be allowed now it is in public beta?","Tags":"<discussion><questions><site-scope><yosemite>","AnswerCount":"1","CommentCount":"3"},{"Id":"2184","PostTypeId":"1","CreationDate":"2014-07-25T12:30:24.187","Score":"5","ViewCount":"46","Body":"<p>I noticed this morning that a new user, <a href=\"https://apple.stackexchange.com/users/85896/\">user85896</a>, which was created \"today\", has posted three answers that are obviously spam and one that I flagged as link-only, which should probably have been spam as well.</p>\n\n<p>I don't have the rep to do anything about this, but I'm posting it here so someone with a decent amount of rep can take the appropriate action, if it is warranted.</p>\n","OwnerUserId":"2313","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-07-25T16:55:13.773","Title":"What to do about a particular Spam Only user","Tags":"<discussion><spam><new-users>","AnswerCount":"1","CommentCount":"0"},{"Id":"2185","PostTypeId":"2","ParentId":"2184","CreationDate":"2014-07-25T14:39:31.767","Score":"2","Body":"<p>Status: Completed. Thanks for the heads up.</p>\n","OwnerUserId":"3","LastActivityDate":"2014-07-25T14:39:31.767","CommentCount":"4"},{"Id":"2186","PostTypeId":"1","CreationDate":"2014-07-25T21:53:28.780","Score":"7","ViewCount":"46","Body":"<p>I encountered this question via an organic search result in Google. Can a mod please unlock it so that I can upvote it? </p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/16759/how-can-i-make-safari-show-the-url-when-i-hover-over-a-link\">How can I make Safari show the URL when I hover over a link?</a></p>\n\n<p>The question has been locked for <strong>7 months</strong>, and the system doesn't trust me that my upvote would be not genuine. A user's combined reputation should be a good indicator that they're not messing around.</p>\n\n<p>This leads to a <strong>feature request</strong>: provide the mods an option to expire the lock after <em>n</em> days.</p>\n\n<p><img src=\"https://i.stack.imgur.com/eH964.png\" alt=\"enter image description here\"></p>\n","OwnerUserId":"9257","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2014-07-26T00:05:44.057","Title":"Unlock this question, please. Perhaps allow locks to timeout","Tags":"<support><feature-request><questions>","AnswerCount":"1","CommentCount":"1"},{"Id":"2187","PostTypeId":"2","ParentId":"2186","CreationDate":"2014-07-25T23:31:30.530","Score":"5","Body":"<p>You can flag a post for unlocking as well as post on the meta as you did. Thanks for showing up and helping to up vote good content.</p>\n\n<p>There is a feature to lock posts for a time period and then unlock them, however this post had answers that were continually vandalized by a bot performing anonymous edits. It devalued the review queue so I locked the post.</p>\n\n<p>If the bot comes back, we will have to lock it - the good news is there are enough votes for this post to rise to the top of just about any search.</p>\n","OwnerUserId":"5472","LastActivityDate":"2014-07-25T23:31:30.530","CommentCount":"0"},{"Id":"2189","PostTypeId":"1","AcceptedAnswerId":"2190","CreationDate":"2014-08-09T16:40:47.937","Score":"12","ViewCount":"117","Body":"<p>I posted my first 2 questions on Ask Different today and both got down voted (with no comment) within 15 mins of posting. That doesn't feel very welcoming!</p>\n\n<p>What is wrong with these questions?</p>\n\n<ul>\n<li><p><a href=\"https://apple.stackexchange.com/questions/141460/is-it-possible-to-move-menu-bar-to-applications\">Is it Possible To Move Menu Bar To Applications</a></p></li>\n<li><p><a href=\"https://apple.stackexchange.com/questions/141464/how-do-i-change-the-colour-of-the-apple-icon-in-the-menu-bar\">How Do I Change The Colour Of The Apple Icon In The Menu Bar</a></p></li>\n</ul>\n\n<p>The first seems like a legitimate question that lots of people coming from MS Windows would want the answer to. The second seems like a reasonable question about customizing the OS.</p>\n\n<p>Can you see any reason why these would be down voted?</p>\n","OwnerUserId":"87265","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-08-10T21:47:33.520","Title":"What is wrong with my questions to warrant being downvoted?","Tags":"<discussion><questions><voting>","AnswerCount":"1","CommentCount":"0"},{"Id":"2190","PostTypeId":"2","ParentId":"2189","CreationDate":"2014-08-09T16:58:43.460","Score":"15","Body":"<p>The direct answer is that they were down voted because someone wth sufficient reputation decided to do so; beyond that, because voting is anonymous, and voters do not need to justify their votes, we really can't say why someone decided to do so. There are currently 5085 people who are eligible to cast a down vote. For each of your posts, one of them chose to do so. If the person(s) who voted on your posts choose to weigh in here, your question has a more direct answer; otherwise, we can just speculate.</p>\n\n<p>So, entering the realm of speculation, someone might not like the questions because they're not \"the Mac way\". The screen-top menu bar has been a core part of the design of Mac interfaces since its inception, and changing it would not be a minor hack, but rather a fundamental modification to the system. Someone might have thought your question should show more research: I tried this and this but they didn't work, so what else can you suggest.  Or someone might just be having a bad day and took it out on your post. Someone might have been trying to hit the up vote button and clicked or tapped in the wrong place.</p>\n\n<p>You seem to be trying to learn from the votes, which is commendable, and the lack of comments makes it much harder to do that, but the fact is, one out of 5085 people didn't like each of your questions, and it's hard to say much more than that.</p>\n","OwnerUserId":"9388","LastEditorUserId":"9388","LastEditDate":"2014-08-09T18:56:26.857","LastActivityDate":"2014-08-09T18:56:26.857","CommentCount":"0"},{"Id":"2191","PostTypeId":"1","CreationDate":"2014-08-21T07:59:05.777","Score":"1","ViewCount":"43","Body":"<p>Rare occasion. I actually have two questions about Apple products and it complains<img src=\"https://i.stack.imgur.com/PhZrz.png\" alt=\"Error message: you can only post once every 20 minutes.\"></p>\n\n<p>What gives?</p>\n\n<p>I don't quite understand the rationale whichever way I think about it. Even if this is something to deter spammers, am I expected to turn into a spammer on an individual SE site suddenly, although having gained rep on several others already?</p>\n\n<p>To add insult to injury I was handed a CAPTCHA on the last attempt. Perhaps because I kept retrying to post the question? Although, I kept retrying because there is no indication of when the 20 minutes are through?! ;)</p>\n","OwnerUserId":"65841","LastEditorUserId":"37797","LastEditDate":"2014-08-22T18:35:34.283","LastActivityDate":"2014-08-22T18:35:34.283","Title":"\"You can only post once every 20 minutes.\"?","Tags":"<support><asking-questions>","AnswerCount":"1","CommentCount":"3"},{"Id":"2192","PostTypeId":"2","ParentId":"2191","CreationDate":"2014-08-21T08:44:09.173","Score":"5","Body":"<p>It's considered to be a feature, see <a href=\"https://meta.stackexchange.com/search?q=20+minutes\">https://meta.stackexchange.com/search?q=20+minutes</a> for quite a lot of information about this. </p>\n\n<p>The error message should have explained that this limitation is lifted for users with reputation above 125. If that notice wasn't provided, please indicate that and we'll turn this into a bug report.</p>\n\n<p>This behavior is documented at:</p>\n\n<p><a href=\"https://meta.stackexchange.com/questions/65423/why-are-low-rep-users-rate-limited-when-posting-questions\">Why are low-rep users rate-limited when posting questions?</a></p>\n\n<p>The rational for implementing this feature is covered in this blog post. I think SE is a bit proud that most people don't see the crap that gets posted (or wants to be posted by spammers / scammers / disruptive people) on the sites. </p>\n\n<p><a href=\"http://blog.stackoverflow.com/2009/02/new-question-answer-rate-limits/\">http://blog.stackoverflow.com/2009/02/new-question-answer-rate-limits/</a></p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-08-21T15:19:51.143","CommentCount":"2"},{"Id":"2193","PostTypeId":"1","AcceptedAnswerId":"2194","CreationDate":"2014-08-26T11:28:45.613","Score":"4","ViewCount":"48","Body":"<p>So I come to see my answer was edited in the way it absolutely changed original meaning.\nThere were three reviews of that edit with two accepted and one rejected it. So the edit now accepted. But it is wrong.</p>\n\n<p><a href=\"https://apple.stackexchange.com/posts/55385/revisions\">https://apple.stackexchange.com/posts/55385/revisions</a></p>\n","OwnerUserId":"11297","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-08-28T22:08:38.430","Title":"What to do about mindless acceptance of inappropriate edits?","Tags":"<support><editing>","AnswerCount":"1","CommentCount":"0"},{"Id":"2194","PostTypeId":"2","ParentId":"2193","CreationDate":"2014-08-26T11:37:31.887","Score":"4","Body":"<p>You should have the option to rollback any edits done to your posts in the revision history (the link you've included above). In your case, just click on the \"rollback\" label on version 2.</p>\n\n<p>If you're not comfortable or sure how to engage the people you wish to discuss things with, flag the post and ask for moderator assistance in knowing what to do and/or help in facilitating a conversation with another user.</p>\n","OwnerUserId":"9058","LastEditorUserId":"5472","LastEditDate":"2014-08-28T22:08:38.430","LastActivityDate":"2014-08-28T22:08:38.430","CommentCount":"5"},{"Id":"2195","PostTypeId":"1","AcceptedAnswerId":"2196","CreationDate":"2014-08-28T21:09:31.347","Score":"-3","ViewCount":"44","Body":"<p>I'm thinking along the lines of <a href=\"http://www.quora.com/Thanks-Quora-feature\" rel=\"nofollow noreferrer\">what Quora does.</a></p>\n\n<p><img src=\"https://i.stack.imgur.com/bMVb9.png\" alt=\"enter image description here\"></p>\n\n<p>For two reasons:</p>\n\n<ol>\n<li>Out of common decency. If someone edits the content of my post so that it substantively improves my answer, I'd like to just say thanks. </li>\n<li>So those who do so can be recognized somehow for providing excellent edits. </li>\n</ol>\n\n<hr>\n\n<p><strong>Notes:</strong> </p>\n\n<p>Since editing badges just reflect volume of edits, I'm not sure (2) is satisfied to the same extent as an explicit thank you. </p>\n\n<p>With that said <strong><em>(1) is my primary focus in this request</em></strong>. - it's not a \"why edit?\" question - what I'm asking, simple and trivial as it may be, boils down to: <em>\"why can't I thank you for doing so?\"</em></p>\n","OwnerUserId":"62132","LastEditorUserId":"62132","LastEditDate":"2014-08-29T09:29:38.007","LastActivityDate":"2014-08-29T09:29:38.007","Title":"Why not incorporate a \"thank you\" button for helpful edits to your post?","Tags":"<feature-request>","AnswerCount":"1","CommentCount":"2"},{"Id":"2196","PostTypeId":"2","ParentId":"2195","CreationDate":"2014-08-28T21:52:58.117","Score":"4","Body":"<p>For sub-2000 rep users I'll argue that the \"thank you\" comes by way of the edit being approved.</p>\n\n<p>You have to remember that, under the terms and conditions of the site, you assign ownership of the answer to the community when you submit. It's not really \"your answer\" any more, it's the community's answer, so you personally thanking someone for the edit is not really important to the idea that is StackExchange.</p>\n\n<p>In the case of <a href=\"https://apple.stackexchange.com/help/privileges/edit\">+2k rep members who don't require approval for edits</a>, I'd hope that they understand the way the whole Stack Exchange model works well enough to not seek \"thank you\" notices for their edits.</p>\n\n<p><strong>You edit because it makes the world a better place, not because someone will thank you for that edit.</strong></p>\n\n<p>Your second request is covered by the Editor, Strunk &amp; White and Copy Editor badges. Approved edits are counted and used to earn those badges. Badges represent excellence in editing (to some degree).</p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-08-28T21:52:58.117","CommentCount":"2"},{"Id":"2197","PostTypeId":"1","CreationDate":"2014-08-29T14:38:24.040","Score":"7","ViewCount":"263","Body":"<p>How to format reserved words within:</p>\n\n<ul>\n<li>question title,</li>\n<li>question body,</li>\n<li>comments?</li>\n</ul>\n\n<p>By 'reserved words' I mean words which aren't <code>code</code> and which\ndon't require to be <em>emphasised</em> but to be identified clearly as <strong>non</strong> common names. Here are a few examples of such words:</p>\n\n<ul>\n<li><p>application names:</p>\n\n<p>Grab, Keynote, Numbers, Pages, Preview, Terminal…</p></li>\n<li><p>reserved directory:</p>\n\n<p>Applications, Library, System…</p></li>\n<li><p>menu entries:</p>\n\n<p>File > Save…</p></li>\n<li><p>OS names:</p>\n\n<p>Lion, Mavericks, Ubuntu…</p></li>\n</ul>\n\n<hr>\n\n<p>My personnal choice I tested for many months is to use <code>backticks</code> which are reserved for code.</p>\n\n<p>Is this an acceptable practice?</p>\n\n<p>Is it worth pursuing a feature request to introduce another <code>mark</code> to <em>markup</em> these reserved words?</p>\n","OwnerUserId":"22003","LastEditorUserId":"22003","LastEditDate":"2014-08-29T15:18:11.200","LastActivityDate":"2015-02-24T16:36:15.000","Title":"Markup of reserved words?","Tags":"<discussion><best-practices>","AnswerCount":"2","CommentCount":"7","FavoriteCount":"4"},{"Id":"2198","PostTypeId":"2","ParentId":"2197","CreationDate":"2014-08-29T22:25:51.843","Score":"1","Body":"<p>I think using back ticks for every thing makes things less readable they are for code. (There are several meta.stackoverflow/exchange threads. e.g. <a href=\"https://meta.stackexchange.com/questions/137755/reject-an-already-approved-suggested-edit-when-rolling-it-back\">this</a>)</p>\n\n<p>In your list OS names are definitely not code so Lion Mavericks are OK, similarly application names are plain text.</p>\n\n<p>I prefer menu entries as text.</p>\n\n<p>The only ones I might use back ticks for are a directory and only if it is text to be entered into Terminal or a dialog box.</p>\n\n<p>This is one of I know what seems correct when I see it issues but I think the rule I use is if you can say it in speech it is not in back ticks but only if you need to get the exact text to get it into a computer system.</p>\n\n<p>Due to the version of markup here XML/HTML even if partial e.g. an element name has to be in backticks. Also URLs which should not be clicked on e.g. one reputing for spam etc in meta or if it is an example <code>http://www.example.com</code> or something else you should not click on.</p>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2014-09-25T14:11:00.243","CommentCount":"0"},{"Id":"2199","PostTypeId":"2","ParentId":"2197","CreationDate":"2014-08-30T08:42:32.177","Score":"8","Body":"<p><code>Code formatting</code> for things <code>that</code> are not <code>code</code> is incorrect <code>use of formatting</code> and I <code>edit</code> posts to <code>remove</code> it regularly. <code>Code formatting</code> is <a href=\"https://meta.stackexchange.com/questions/135112/inline-code-spans-should-not-be-used-for-emphasis-right\">never <code>a</code> form of <code>emphasis</code></a>. Using <code>code formatting</code> for things <code>that are</code> not code…</p>\n\n<ul>\n<li><code>makes</code> the <code>text</code> very <code>hard</code> to <code>read</code> (<a href=\"https://meta.stackexchange.com/questions/137755/reject-an-already-approved-suggested-edit-when-rolling-it-back\">\"My eyes hate you now, well done —Tim Stone\"</a>)</li>\n<li>means that web readers for the visually impaired read it l-e-t-t-e-r b-y l-e-t-t-e-r</li>\n</ul>\n\n<p>Inline code formatting should be used for short snippets of actual code, including but not limited to AppleScript and shell scripting. Short shell commands such as <code>ls ~</code> should also be formatted as code, but referring to shell commands such as 'defaults' doesn't need formatting (although some may disagree with this and I'm unlikely to edit to the contrary).</p>\n\n<p>Inline code formatting should not be used in any of the cases listed in your question:</p>\n\n<ul>\n<li><p>Application names are not code and should be read normally, so they should not be formatted as code.</p></li>\n<li><p>Directory names, regardless of whether they are system directories, also should not be formatted as code.</p>\n\n<p>However paths may use code formatting; I usually don't for simple paths such as /Applications, but do for longer paths, especially <a href=\"https://apple.stackexchange.com/a/140226\">those containing globbing</a> such as <code>/Sy*/L*/Priv*/Apple8*/V*/C*/R*/airport</code>, although I may even use block code formatting in cases like this (prepending with four spaces):</p>\n\n<pre><code>/Sy*/L*/Priv*/Apple8*/V*/C*/R*/airport\n</code></pre></li>\n<li><p>Menu entries are not code, although in some cases extra formatting may help here. I <em>sometimes</em> write longer menu entry paths with bold formatting such as <strong>File</strong> → <strong>Import From</strong> → <strong>Bookmarks HTML File…</strong> as the path then stands out more from the actual text, usually just write it normally as File → Save.</p></li>\n<li><p>OS names are like application names—never code. The OS build may be formatted as code depending on its context as these are longer and read character by character.</p></li>\n</ul>\n\n<p>Also, I've seen code formatting used in other cases, and would like to address that here too:</p>\n\n<ul>\n<li>Web URLs that shouldn't be clicked <em>can</em> use code formatting, but it's not really code and I prefer simply rendering the URL as un-clickable either using a zero width joiner http://​example.com or HTML comment http://example.com (check the source of this post to see how the aforementioned examples are done).</li>\n</ul>\n\n<p>All of this applies to question bodies and comments. Titles do not have code formatting and therefore any Markdown is superfluous.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-02-24T16:36:15.000","CommentCount":"0"},{"Id":"2200","PostTypeId":"1","AcceptedAnswerId":"2211","CreationDate":"2014-08-31T07:18:23.627","Score":"2","ViewCount":"40","Body":"<p>My first post on Meta &amp; I didn't find anything similar by searching...<br>\nI see this a lot, on various question/answers - the last line of a code section hidden behind the scroll-bar...</p>\n\n<p><img src=\"https://i.stack.imgur.com/9acCk.png\" alt=\"enter image description here\"></p>\n\n<p>If I check Edit, there is no fault with the user's formatting, they have added lines underneath [&amp; incidentally if I then Cancel the formatting 'fixes' itself]</p>\n\n<p>Is there a 'higher-up' who could have a look at this &amp; fix it?</p>\n\n<p>My System - Early 08 Mac Pro; 10.9.4, 26GB RAM, SSD, Safari 7.0.5</p>\n\n<p>Link to this specific example - <a href=\"https://apple.stackexchange.com/questions/143649/services-menu-shows-the-incorrect-name\">Services menu shows the incorrect name</a></p>\n\n<p>Further testing - Chrome shows it just fine, Safari does if I refresh the page, but consistently fails on first opening of that link. I really have no special kind of setup in Safari, it's pretty much fresh out the box in terms of how I have it configured.</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2014-09-19T12:36:51.257","Title":"Incorrect formatting appearance - fixable?","Tags":"<bug><formatting>","AnswerCount":"1","CommentCount":"9"},{"Id":"2202","PostTypeId":"1","AcceptedAnswerId":"2203","CreationDate":"2014-09-07T14:36:25.310","Score":"4","ViewCount":"51","Body":"<p>Some questions just aren't questions, usually meant to be an answer on a question or similar, but there's no NARQ close reason any more.</p>\n\n<p>What should I vote to close such questions as?</p>\n\n<p><sup>This is the question that prompted me to ask this: <a href=\"https://apple.stackexchange.com/questions/144450/transparent-backed-ios7-status-bar-enjoy\">https://apple.stackexchange.com/questions/144450/transparent-backed-ios7-status-bar-enjoy</a></sup></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-09-07T18:04:32.600","Title":"What should I use instead of NARQ?","Tags":"<discussion><support><questions><close-reasons>","AnswerCount":"1","CommentCount":"5"},{"Id":"2203","PostTypeId":"2","ParentId":"2202","CreationDate":"2014-09-07T18:04:32.600","Score":"4","Body":"<p>We had \"Not a real question\" as a close reason in the past, but some people might see it as offensive (because usually the OP did think it was a question). Voting to close such posts as \"Unclear what you are asking\" seems a reasonable alternative (and already hints at the fact that the question needs to be improved).</p>\n","OwnerUserId":"9058","LastActivityDate":"2014-09-07T18:04:32.600","CommentCount":"2"},{"Id":"2204","PostTypeId":"1","AcceptedAnswerId":"2205","CreationDate":"2014-09-07T20:28:34.890","Score":"2","ViewCount":"26","Body":"<p>This as reference... <a href=\"https://apple.stackexchange.com/questions/144477/can-only-run-applescript-from-automator/\">Can only run AppleScript from Automator</a><br>\nSomeone may come along &amp; give an authoritative answer, but until &amp; unless that happens, is 'educated guesswork' acceptable, in case it actually helps the OP to a solution?</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2014-09-07T23:10:23.677","Title":"Are we allowed to troubleshoot rather than give authoritative answers?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2205","PostTypeId":"2","ParentId":"2204","CreationDate":"2014-09-07T22:02:34.067","Score":"1","Body":"<p>This is a very hard thing to give a definitive answer to -- it's largely a judgement call on a case-by-base basis.</p>\n\n<p>But if pressed...</p>\n\n<p>Generally I think the answer is no. \"Conversations\" as answers and subsequent comments should be had in <a href=\"http://chat.stackexchange.com/\">question-specific chat rooms</a> with the resulting resolution being posted as the answer. You want to keep the Q&amp;A format succinct so the information is easily digestible long in to the future. A rambling conversation on an answer destroys that nice property of the SE Q&amp;A format.</p>\n\n<p>Sometimes, though, the answer is yes. In particular, if the question is asking for something specific but you realize it's not possible but there are alternatives that address the spirit of what's being asked though not necessarily the letter. And, of course, sometimes the question is literally \"how do I work through this?\" in which case a general answer that aids in debugging and doesn't give a specific resolution to a specific problem is a-okay.</p>\n\n<p>In any case though, if you happen to answer with something the community deems isn't really an answer and fit for the site, it should get flagged and reviewed. Intuition and peer review is, ultimately, the best way to decide these things rather than a set of hard and fast rules.</p>\n","OwnerUserId":"292","LastEditorUserId":"292","LastEditDate":"2014-09-07T23:10:23.677","LastActivityDate":"2014-09-07T23:10:23.677","CommentCount":"1"},{"Id":"2206","PostTypeId":"1","AcceptedAnswerId":"2207","CreationDate":"2014-09-12T18:49:23.480","Score":"11","ViewCount":"182","Body":"<p>This site has a longstanding policy to close pre-release software questions as off topic.</p>\n\n<p>Is there clear consensus to expand this to include:</p>\n\n<ul>\n<li>\"pre-release software and hardware\"</li>\n<li>\"pre-release products and services\"</li>\n</ul>\n\n<p>We can edit the existing default close reason to be either of the above, but I would like to see if there are any downsides to either of these suggestions.</p>\n\n<p>The current default close reason just refers to software</p>\n\n<blockquote>\n  <p>Questions about pre-release software are off-topic. For more information, see Are iOS 8 and OS X Yosemite questions OK? and Can I ask about not-yet-publicly released OS?.</p>\n</blockquote>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2014-09-17T15:25:59.037","LastActivityDate":"2014-09-30T02:47:37.480","Title":"Is there support to widen the pre-release prohibition?","Tags":"<discussion><faq><close-reasons>","AnswerCount":"3","CommentCount":"9","FavoriteCount":"1"},{"Id":"2207","PostTypeId":"2","ParentId":"2206","CreationDate":"2014-09-12T21:41:59.397","Score":"10","Body":"<p>Yes it makes sense to increase the scope from just software to include hardware, products and services. </p>\n\n<p>The important thing is that the answer should be able to quote some actual measurement or definitive statement that can be verified</p>\n","OwnerUserId":"237","LastEditorUserId":"237","LastEditDate":"2014-09-12T23:39:26.017","LastActivityDate":"2014-09-12T23:39:26.017","CommentCount":"1"},{"Id":"2208","PostTypeId":"1","AcceptedAnswerId":"2209","CreationDate":"2014-09-13T19:26:30.230","Score":"0","ViewCount":"41","Body":"<p>Is there some prescribed response to \"I put a beta on my machine, with no backup at all &amp; now I broke it\" ... other than giggling, of course.</p>\n","OwnerUserId":"85275","LastEditorUserId":"37797","LastEditDate":"2014-09-14T15:14:53.423","LastActivityDate":"2014-09-14T15:14:53.423","Title":"Yosemite... & lack of backup","Tags":"<discussion><yosemite><fun>","AnswerCount":"1","CommentCount":"1"},{"Id":"2209","PostTypeId":"2","ParentId":"2208","CreationDate":"2014-09-13T20:21:49.190","Score":"3","Body":"<p>The prescribed response is to flag it for closure for being about pre-release software and/or hardware.</p>\n\n<p>And you can point them to: <a href=\"https://apple.stackexchange.com/questions/135677/can-i-downgrade-to-mavericks-after-installing-yosemite\">Can I downgrade to Mavericks after installing Yosemite (beta/developer preview)?</a></p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2014-09-13T22:58:08.260","CommentCount":"0"}]