[{"Id":"2642","PostTypeId":"1","CreationDate":"2015-10-10T06:23:03.553","Score":"3","ViewCount":"30","Body":"<p>I had a question to an Apple-specific problem and found the answer on Super User. I think the answer should be on this site and is general enough to be useful to lots of people.</p>\n\n<p>What is the best way to \"migrate\" <a href=\"https://superuser.com/questions/177574/how-to-add-custom-keyboard-shortcut-for-a-nested-menu-item\">this question</a> to make it available to the apple.SE community?</p>\n","OwnerUserId":"45769","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:04:26.767","LastActivityDate":"2015-10-10T18:42:41.147","Title":"Migrate a Q&A from another Stack Exchange site (eg. Super User)","Tags":"<support><migration>","AnswerCount":"1","CommentCount":"0"},{"Id":"2643","PostTypeId":"2","ParentId":"2642","CreationDate":"2015-10-10T06:30:46.893","Score":"4","Body":"<p>The topic covered by the question you mention is on-topic on both SU and AD. It doesn't really matter on which SE site they are, as long as they can be found via the search engine of your choice.</p>\n\n<p>Usually only questions which</p>\n\n<ul>\n<li>are off-topic on the site they are originally posted</li>\n<li>don't get an answer in a few days and are on-topic on several sites</li>\n</ul>\n\n<p>are candidates for migration. To trigger migration in these cases, it's usually enough to flag them for moderator attention.</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-10-10T06:30:46.893","CommentCount":"0"},{"Id":"2644","PostTypeId":"1","CreationDate":"2015-10-10T08:39:42.827","Score":"5","ViewCount":"125","Body":"<p><a href=\"https://apple.stackexchange.com/questions/208746/applescript-wont-invoke-shortcut-command\">Applescript Won&#39;t Invoke Shortcut Command</a></p>\n\n<p>This entire QA, including all 3 answers &amp; a myriad comments, is more of an online troubleshooting conversation than a true QA. </p>\n\n<p>The final answer I feel was worth the journey, even if the OP didn't actually help a great deal in the process - most of the replies were along the lines of \"it no werky\"</p>\n\n<p>Serves me right, I suppose, but sometimes tenacity pays off - even if the OP has now wandered off &amp; the final answer will probably never be marked as correct.</p>\n\n<p>I think we now have a nice answer to the reworded title, how to look for a checkmark on a menu item &amp; only perform an action if true/false<br>\nIt's certainly something I didn't know how to do until now &amp; it is likely to be something I'm going to recycle in future.</p>\n\n<p>Anyone have any suggestions - or even a burning desire to edit it into shape?<br>\nI'm not really sure what should stay or go - for instance, my entire first answer ends up not being what the OP wanted because of the, at that time, uncertainty of the initial toggle state.</p>\n\n<p>Alternatively, should I abandon this to the mists of time &amp; just make a new QA that simply asks &amp; answers the underlying question of how to check &amp; act on a menu toggle?<br>\nI reverted the title in anticipation of this alternative solution.</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-10-10T08:39:42.827","Title":"How to rescue this QA","Tags":"<discussion><editing>","AnswerCount":"0","CommentCount":"1"},{"Id":"2645","PostTypeId":"1","CreationDate":"2015-10-10T16:51:44.127","Score":"6","ViewCount":"41","Body":"<p>I've noticed that plenty of really old questions get bumped to the top of the page by answers of \"I have this problem too. Please help!\" or \"That answer worked. Thanks!\", and even when the mods delete those answers, the questions stay bumped. We tell people that such remarks should be reserved for the comments, but the people writing the answers are new users with only 1 reputation.</p>\n\n<p>Wouldn't letting anyone comment anywhere give new users a non-answer way to give input on posts? Granted, we'd have to seriously monitor flagged comments, but I think it'd still be better than filling up the homepage with resurrected old questions.</p>\n","OwnerUserId":"85884","LastActivityDate":"2015-10-18T19:42:56.513","Title":"Would removing the reputation limit on commenting eliminate the \"bumping old questions\" problem?","Tags":"<feature-request><reputation><comments><late-answers>","AnswerCount":"3","CommentCount":"0"},{"Id":"2646","PostTypeId":"2","ParentId":"2645","CreationDate":"2015-10-10T17:02:13.117","Score":"7","Body":"<p>This is a fair question and one worth asking from time to time. </p>\n\n<p>Being someone who gets to see many of the bad comments and many of the bad answers as well as many of the bad questions  I would say that the site would be worse off by implementing your suggestion. </p>\n\n<p>When someone goes to answer a question, especially a new user, the site actively discourages them from posting by offering help. The comments interface does not offer this discouragement.  I think we would have a bigger problem since new users are struggling with following basic directions as opposed to finding the comment button and wielding it properly. </p>\n\n<p><a href=\"https://i.stack.imgur.com/Klqp9.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/Klqp9.png\" alt=\"enter image description here\"></a></p>\n\n<p>If we were a discussion site, like <a href=\"http://discourse.org/\" rel=\"nofollow noreferrer\">discourse</a>, then making comments easier would be a good thing. Since we want to be a highly focused, highly regimented, specific place to ask and answer -  The reputation system and the graduation process to certain privileges helps reinforce that notion that we want anybody to be able to ask or answer and that you earn your moderation/review/commenting privileges as you receive votes from the community. </p>\n\n<p>However, I could be wrong so if enough people would like to vote to try this, I'd be willing to undergo that experiment if the developers would change the limits for us to try this out. </p>\n","OwnerUserId":"5472","LastActivityDate":"2015-10-10T17:02:13.117","CommentCount":"0"},{"Id":"2647","PostTypeId":"1","AcceptedAnswerId":"2648","CreationDate":"2015-10-13T20:49:27.827","Score":"8","ViewCount":"128","Body":"<p>I've been encountering a few items in the first posts queue which I'm not sure what to do with.</p>\n\n<p>They generally take the form of \"to add on to (someone else)'s answer... etc\".</p>\n\n<p>I've been just marking these as No Action Needed since they <em>sort of</em> answer the stated question, yet would be unable to stand on their own without the existence of another answer.</p>\n\n<p>Part of me thinks that these should be flagged no answer as it's something that would be better for a comment - hence the question:</p>\n\n<h2>Do answers need to be able to stand on their own, or is building on another answer acceptable?</h2>\n","OwnerUserId":"50295","LastActivityDate":"2015-10-19T08:05:00.827","Title":"What to do with answers that clarify another answer","Tags":"<discussion>","AnswerCount":"2","CommentCount":"1"},{"Id":"2648","PostTypeId":"2","ParentId":"2647","CreationDate":"2015-10-13T22:00:02.660","Score":"3","Body":"<p>Ideally, every post stands alone.</p>\n\n<p>In practice, other answers can get deleted, so even when you review it - consider encouraging newcomers, editing to improve a first post and otherwise being willing to skip the review a post you know needs help, but you don't have the time or energy or experience now to take that action.</p>\n\n<p>When flagging or voting to delete a post, I always try to not destroy anything that is useful - so even if the answer starts with \"I have the same issue and ...\" and blathers on a bit and then has one clear answer / one clear tidbit or troubleshooting or something redeeming, it's far better to vote up/down based on how it relates to the <em>other</em> answers.</p>\n\n<p>If other answers are worse than this attempt to help out and contribute, I'll often up vote an otherwise poor answer. If it's way worse than an existing answer, down vote and comment.</p>\n\n<p>Only when it's totally un-editable would I delete it. Remember - even wrong answers are useful. By commenting and down voting, it shows others how an answer is wrong and helps them make their own progress on the same issue.</p>\n\n<p>So TLDR - it's complicated, it's relative and it's often a matter of encouraging people to do better as opposed to judging an answer to some absolute standard without considering the entire post and the site's long term goals of amassing useful information that is open sourced, creative commons and collaboratively edited and curated and voted.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-10-13T22:00:02.660","CommentCount":"0"},{"Id":"2649","PostTypeId":"2","ParentId":"2645","CreationDate":"2015-10-14T07:51:56.820","Score":"1","Body":"<p>As far as I'm aware, there's no legal way to fix 'stupid'  ;)</p>\n\n<p>Rather than allow people who didn't make the slightest effort to read the large yellow 'Your Answer' section before posting their \"Me too!!\" access to comments earlier [where they are far less likely to receive any guidance], I'd be more inclined to ask the devs to structure it so that once a non-answer has been deleted, the post drops back to its original position in the timeline.</p>\n\n<p>I have no clue as to whether that would actually be practicable.</p>\n","OwnerUserId":"85275","LastActivityDate":"2015-10-14T07:51:56.820","CommentCount":"0"},{"Id":"2650","PostTypeId":"1","CreationDate":"2015-10-15T22:35:24.127","Score":"3","ViewCount":"83","Body":"<p>In <a href=\"https://apple.stackexchange.com/q/73320/25135\">How to open time machine progress bar window</a> I asked a question regarding the version of OS X I had installed at that time, namely Lion. I got an answer matching that version, indicating that what I wanted was not possible. I accepted that answer, ticking the check mark.</p>\n\n<p>Recently (or perhaps not <em>that</em> recently) there have been some answers indicating that what I wanted is possible these days. But I'm pretty confident that all those recent reports are for a newer version of OS X. And since I'm not running Lion myself any more, I cannot verify whether those answers do in fact apply to Lion.</p>\n\n<p>So my question is this: should I change the accepted answer in order to keep the page up to date? If I do, should I remove the version tag as well? Or is it enough that the other answers are there (a bit down the page) for those who search, and leave tag and check mark where they are as an indication of the history of this question and its answers? I tend to do the latter, but the more new answers come in, the more I doubt whether ignoring them because they ignore the version tag is really the right choice.</p>\n","OwnerUserId":"25135","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2017-03-12T18:39:37.477","Title":"Recent answers to version-tagged questions","Tags":"<discussion><tags><accepted-answer>","AnswerCount":"2","CommentCount":"0"},{"Id":"2651","PostTypeId":"1","AcceptedAnswerId":"2652","CreationDate":"2015-10-16T03:10:30.223","Score":"3","ViewCount":"36","Body":"<p><a href=\"https://apple.stackexchange.com/q/210561\">iTunes music sync: &quot;Albums&quot; sub-window too tall for main window</a></p>\n\n<p>I also posted this on the Apple Community forum for iTunes, and received a reply from a high-rank user (turingtest2). His suggestion was to file a bug report via Apple Developer Connection, which I have done.  I also self-answered the AskDifferent post to that effect.</p>\n\n<p>Does the original question (and answer) have any value in AskDifferent, or should I delete the question?</p>\n","OwnerUserId":"1941","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-10-16T11:16:10.253","Title":"Close bug-report type question or leave answer?","Tags":"<discussion><questions>","AnswerCount":"1","CommentCount":"1"},{"Id":"2652","PostTypeId":"2","ParentId":"2651","CreationDate":"2015-10-16T11:16:10.253","Score":"4","Body":"<p>It's still a worthwhile question. Many bugs have workarounds which make for good answers to such questions. I'd recommend leaving the question up and updating the answer if it is fixed or providing another answer if a workaround is found.</p>\n","OwnerUserId":"37797","LastActivityDate":"2015-10-16T11:16:10.253","CommentCount":"2"},{"Id":"2653","PostTypeId":"2","ParentId":"2650","CreationDate":"2015-10-17T17:49:09.690","Score":"-2","Body":"<p>I'd remove the tag. I'd also accept one of the other answers relating to System Preferences, since most people will have a newer OS that has that feature (not sure if it's on lion or earlier)</p>\n","OwnerUserId":"143445","LastActivityDate":"2015-10-17T17:49:09.690","CommentCount":"0"},{"Id":"2654","PostTypeId":"2","ParentId":"2645","CreationDate":"2015-10-18T19:42:56.513","Score":"1","Body":"<p>Resurrected old questions also have their good aspects sometimes, especially if the resurrection brings attention to a topic which is still unresolved/unanswered. So at least for the \"me too\" kind of non-answers it increases the chances of the question actually getting answered (which in a way helps the user posting the \"me too\" as well).</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-10-18T19:42:56.513","CommentCount":"0"},{"Id":"2655","PostTypeId":"2","ParentId":"2647","CreationDate":"2015-10-19T08:05:00.827","Score":"0","Body":"<p>An alternative might be to try tying up all the loose ends &amp; comments into a new, complete answer - though that might depend on how far down the pile that may put it initially.</p>\n\n<p>I had a bit of a go at a similar thing today - <a href=\"https://apple.stackexchange.com/questions/205574/copy-text-from-quick-look-in-el-capitan/211625#211625\">Copy text from quick look in El Capitan or Sierra?</a></p>\n\n<p>Just really pulling comments, a partial answer, some Googling &amp; some folk-lore meme all into one place, though it does seem the ultimate answer was still 'can't be done'.</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-10-19T08:05:00.827","CommentCount":"0"},{"Id":"2656","PostTypeId":"2","ParentId":"2650","CreationDate":"2015-10-19T10:10:03.307","Score":"1","Body":"<p>I would ask another question referring to the original for Lion but in the new question state what OS you need it for (in this case cheat and ask for the first one you know it works on)</p>\n\n<p>The questions and answers are still useful as there are still people on Lion and Snow Leopard so the answers are not wrong. We would now be helping more people.</p>\n\n<p>On some mailing lists I see people still asking about Tiger and Leopard I think they are using PPC) so even answers for this are useful</p>\n","OwnerUserId":"237","LastActivityDate":"2015-10-19T10:10:03.307","CommentCount":"2"},{"Id":"2657","PostTypeId":"1","CreationDate":"2015-10-20T03:07:02.727","Score":"0","ViewCount":"28","Body":"<p>I'm too low of a reputation to create tags on this StackExchange, yet; and <em>way</em> too low to create synonyms … so would someone perhaps like to create the ‘text-replacement’ tag for iOS (and perhaps synonym ‘text-substitution’, the OS X term for the same thing, to it)?</p>\n\n<p>(If you search for <code>NSUserDictionaryReplacementItems</code>, you'll see that there's plenty of posts on the topic already!)</p>\n","OwnerUserId":"15184","LastActivityDate":"2015-10-20T03:07:02.727","Title":"text-substitution and text-replacement tags","Tags":"<discussion><tags><synonym>","AnswerCount":"0","CommentCount":"2"},{"Id":"2658","PostTypeId":"1","CreationDate":"2015-10-21T06:03:28.630","Score":"3","ViewCount":"44","Body":"<p>The following 2 questions are essentially duplicates, along the lines of<br>\n'Cannot sign out of iCloud because of an old email address'</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/210728/unable-to-sign-out-of-icloud-linked-to-old-email-that-no-longer-exists?lq=1\">Unable to sign out of iCloud; linked to old email that no longer exists</a><br>\n<a href=\"https://apple.stackexchange.com/questions/211906/icloud-catch-22-cannot-sign-out-of-old-dead-apple-id-on-ipads\">iCloud Catch 22 - Cannot sign out of old dead Apple ID on iPads</a></p>\n\n<p>For the first, the solution was 'this is a bug that needs fixing'<br>\nFor the second, it's 'there now <em>is</em> a solution since iOS 9.0.2'</p>\n\n<p>So, the first did all the work, yet the second found the fix.</p>\n\n<p>imho, both are worthy in &amp; of themselves, but as a pair they show not only the solution, but also some back history to the problem &amp; research done in trying to fix it.</p>\n\n<p>I've already added a comment to the first to point to the newly-available solution.<br>\nThey each show as 'Linked' in the right margin - though I'm not sure how many people actually use that to follow a trail of bread crumbs.</p>\n\n<p>How do we better link them without 'penalising' either by marking it as a dupe? Especially as it's the newer question that has a working fix, so the 'this has  already been asked &amp; has an answer' message would give off all the wrong signals.  </p>\n\n<p>Add a Link in an answer - edit the original or post a new one?</p>\n\n<p>Add a Link to the top of the original question \"Since iOS 9.0.2 there is now a solution to this issue 'here'\" ?</p>\n\n<p>Any other possibility?</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-10-22T07:08:36.190","Title":"Linking questions without 'penalising' one as a duplicate","Tags":"<discussion><exact-duplicates>","AnswerCount":"1","CommentCount":"1"},{"Id":"2659","PostTypeId":"2","ParentId":"2658","CreationDate":"2015-10-22T07:08:36.190","Score":"1","Body":"<p><em>I didn't look into the dupe-worthiness of the two questions mentioned, the following is rather a general answer.</em></p>\n\n<p>Avoiding redundancy by closing duplicate questions is actually a good thing. There is no such thing as a penalty if a question gets marked as a duplicate. Any reputation gained by upvotes on either the duplicate question or one of its answers remain. Also, there is no <em>ownership</em> on posts (see <a href=\"https://apple.stackexchange.com/help/editing\">https://apple.stackexchange.com/help/editing</a>), so if anybody gets an ego problem from having a question closed as a duplicate, he/she better deals with this off-site.</p>\n\n<p>If you run into potential duplicates, by all means either propose to close, comment or flag them. In cases where it make sense, the mods also have the option to physically merge all the answers from both questions into one (which may keep things a bit more tidy especially if the newer question got the better answers).</p>\n\n<p>PS: Oh, and whatever you do: <strong>DO NOT</strong> edit the question to include the answer (or a link to an answer). It heavily confuses people and the search functionality. Either flag as a duplicate, add a question comment with the link or post an answer pointing to the actual answer (which is one of the very few occasions where a link-only answer is ok IMHO).</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-10-22T07:08:36.190","CommentCount":"1"},{"Id":"2662","PostTypeId":"1","CreationDate":"2015-10-26T15:12:04.533","Score":"1","ViewCount":"37","Body":"<p>Today I stumbled upon <a href=\"https://apple.stackexchange.com/q/212792/81404\">this question</a>. Code -36 is a file permissions error on OS X, and resolution is really dependent on what type of file is attempting to be opened. </p>\n\n<p>If it's an app, there's a <a href=\"https://superuser.com/questions/898124/the-application-someapp-app-can-t-be-opened\">Super User post</a>, there's a command-line utility for <a href=\"http://osxdaily.com/2015/02/21/fix-error-code-36-finder-mac-os-x/\" rel=\"nofollow noreferrer\">dot file conflicts</a>, and even an entire <a href=\"http://www.cnet.com/news/tutorial-what-to-do-when-a-mac-os-x-application-will-not-launch/\" rel=\"nofollow noreferrer\">CNET</a> article on the subject. </p>\n\n<p>Should one master question be asked an answered, should the questions be addresses when asked, or what?</p>\n","OwnerUserId":"81404","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-10-26T15:22:12.463","Title":"What to do with \"Code -36\" questions","Tags":"<discussion><site-scope>","AnswerCount":"1","CommentCount":"0"},{"Id":"2663","PostTypeId":"2","ParentId":"2662","CreationDate":"2015-10-26T15:22:12.463","Score":"1","Body":"<p>Posting an answer listing everything you've found and the circumstances the findings apply seems to be a good way to proceed in this case (and definitively better than a lot of back and forth in the comments to nail down the cause).</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-10-26T15:22:12.463","CommentCount":"0"},{"Id":"2664","PostTypeId":"1","AcceptedAnswerId":"2665","CreationDate":"2015-10-29T22:54:11.637","Score":"5","ViewCount":"98","Body":"<p>Are the following types of questions considered out-of-topic at Ask Different?<br>\n <em>- Will my iPhone X be able to run iOS X without lagging<br>\n - Anyone tried to install iOS X on iPad X, what's your experience?</em>  </p>\n\n<p>How could a user ask about upgrading an old iDevice that according to Apple support the new iOS version but want to know if the device do handle it well?  </p>\n\n<p>Is it possible to ask about this topic without getting the question closed for generating discussion or opinion based answers?</p>\n","OwnerUserId":"116161","LastActivityDate":"2015-10-29T23:31:19.730","Title":"Are questions about the effect of upgrading iOS out-of-topic","Tags":"<discussion><questions><asking-questions><ios>","AnswerCount":"1","CommentCount":"0"},{"Id":"2665","PostTypeId":"2","ParentId":"2664","CreationDate":"2015-10-29T23:31:19.730","Score":"10","Body":"<p>Generally those get closed due to practicality issues. What one person sees as acceptable, another wouldn't put up with. Also, since you can't really ever downgrade an iOS - you're stuck so that makes the questions alluring, yet people can't do A/B testing very well to get good answers.</p>\n\n<p>Without some research, it's generally not something that is objective. Measuring performance is something that people generally don't or can't do so if you have specific performance benchmarks and can back them up with data - I'd be willing to entertain the question. </p>\n\n<p>Basically, it attracts all sorts of opinions so finding a place on chat or discourse to discuss things works better than asking on the main site.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-10-29T23:31:19.730","CommentCount":"0"},{"Id":"2666","PostTypeId":"1","AcceptedAnswerId":"2667","CreationDate":"2015-11-03T00:03:19.063","Score":"-5","ViewCount":"58","Body":"<p>Is it because Tim Cook is gay or LGBT awareness month? Or is it for the old Apple logo.\n<a href=\"https://i.stack.imgur.com/Pxhns.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/Pxhns.png\" alt=\"Rainbow Header\"></a></p>\n","OwnerUserId":"69571","LastActivityDate":"2015-11-03T14:54:34.523","Title":"Why is the top edge rainbowed?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"2667","PostTypeId":"2","ParentId":"2666","CreationDate":"2015-11-03T03:45:29.453","Score":"8","Body":"<p>I'm not the designer (and certainly won't speak for them), but it could be many reasons starting with Apple's logo from 1977. I actually hope it's many reasons - but does it even matter why?</p>\n\n<p><a href=\"https://i.stack.imgur.com/cad8s.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/cad8s.png\" alt=\"enter image description here\"></a></p>\n\n<p><a href=\"https://en.wikipedia.org/wiki/Apple_Inc.#Logo\" rel=\"nofollow noreferrer\">https://en.wikipedia.org/wiki/Apple_Inc.#Logo</a></p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2015-11-03T14:54:34.523","LastActivityDate":"2015-11-03T14:54:34.523","CommentCount":"3"},{"Id":"2668","PostTypeId":"1","CreationDate":"2015-11-05T09:19:03.910","Score":"3","ViewCount":"72","Body":"<p>On the large Stack Exchange sites there is frequent discussion about the importance of explaining down-votes (e.g. <a href=\"https://meta.stackoverflow.com/q/250177/575530\">this question on Stack Overflow meta</a> or <a href=\"https://meta.stackexchange.com/q/135/178985\">this Meta Stack Exchange question</a>).</p>\n\n<p>What is the tone here?</p>\n\n<p>I was really surprised to find that <a href=\"https://apple.stackexchange.com/q/214340/142445\">this first question</a> by a user new to the entire Stack Exchange network was down-voted twice with no explanation.</p>\n","OwnerUserId":"142445","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-01-04T20:30:02.340","Title":"What is the Ask Different etiquette for down-voting new users?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2669","PostTypeId":"2","ParentId":"2668","CreationDate":"2015-11-05T16:01:47.390","Score":"6","Body":"<p>As on any other SE site, comments to explain down votes are not mandatory. And the two discussions you've linked (as well as several others on various meta sites) list both the pros and cons of enforcing, encouraging or nudging users to comment in case of down votes. That's why users with rep below 2k get displayed a nudge/short note when down voting (which still doesn't make it mandatory though).</p>\n\n<p>OTOH I agree that users would benefit from having down votes explained (in a fashion helping them to improve their posts). But that's up to the individual applying the down vote.</p>\n\n<p>Also - remember that votes are designed to be issued against posts and without regard to the user - so if you can focus on the content of the post and improve it or be kind - that works best for the site and especially so when the poster is a new user.</p>\n","OwnerUserId":"9058","LastEditorUserId":"5472","LastEditDate":"2016-01-04T20:30:02.340","LastActivityDate":"2016-01-04T20:30:02.340","CommentCount":"1"},{"Id":"2670","PostTypeId":"1","CreationDate":"2015-11-12T20:52:04.680","Score":"0","ViewCount":"19","Body":"<p>I marked this question: <a href=\"https://apple.stackexchange.com/questions/215279/mac-app-store-apps-damaged\">Mac App Store apps damaged?</a> as a duplicate of a newer question <a href=\"https://apple.stackexchange.com/questions/215332/many-os-x-app-store-apps-are-listed-as-app-is-damaged-and-cant-be-opened\">Many OS X app store apps are listed as \"app\" is damaged and can't be opened</a>.</p>\n\n<p>The reason to do it this way was that the newer question had a more general approach and presented one or more general answer(s) instead of a workaround.</p>\n\n<p>Should I (always) mark the newer question as a duplicate of an older question though the older question is only a special case of the newer one?</p>\n","OwnerUserId":"93229","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-11-13T00:28:33.310","Title":"How to handle duplicates if the older question (or the answer) is a \"subset\" of a newer question?","Tags":"<discussion><exact-duplicates><best-practices>","AnswerCount":"1","CommentCount":"0"},{"Id":"2671","PostTypeId":"2","ParentId":"2670","CreationDate":"2015-11-13T00:28:33.310","Score":"2","Body":"<p>The StackExchange developers view and voted up view is if the new question is better then close the old one as the duplicate from this <a href=\"https://meta.stackexchange.com/questions/147643/should-i-vote-to-close-a-duplicate-question-even-though-its-much-newer-and-ha\">MetaStackExchange question</a> (and that makes sense to me) Note this is not exactly your question but the other questions that match yours are closed as dups of this :(</p>\n\n<p>In this case the new question and answer rather obviously are more general and detailed and would be the one that you want to read in the future. </p>\n\n<p>The end result we want is the best question and answer.</p>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-11-13T00:28:33.310","CommentCount":"0"},{"Id":"2672","PostTypeId":"1","CreationDate":"2015-11-13T17:48:12.223","Score":"0","ViewCount":"21","Body":"<p>The title has it all...</p>\n\n<h1>My Reason</h1>\n\n<p><em>My reason is slightly silly but if anyone agrees please edit with maybe a better reason however this is it:</em></p>\n\n<p>Well there is a 'garageband' tag so for people who need help with logic pro X why shouldn't there be a tag for that </p>\n","OwnerUserId":"142865","LastActivityDate":"2015-11-13T19:45:26.677","Title":"Should there be a tag 'logic-pro-x'?","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2673","PostTypeId":"2","ParentId":"2672","CreationDate":"2015-11-13T19:45:26.677","Score":"3","Body":"<p>I would say no and that the existing <a href=\"https://apple.stackexchange.com/questions/tagged/logic\" class=\"post-tag\" title=\"show questions tagged &#39;logic&#39;\" rel=\"tag\">logic</a> serves to identify questions that someone might want to follow and recognize expertise across the versions and editions of logic.</p>\n\n<p>Is there a specific use case you are looking to assist with?</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-11-13T19:45:26.677","CommentCount":"0"},{"Id":"2674","PostTypeId":"1","CreationDate":"2015-11-17T13:43:55.770","Score":"1","ViewCount":"41","Body":"<p>Does answers to questions that was asked by deleted users ever get accepted?</p>\n\n<p>An example to this is in this question, were the user seems to have be deleted: <a href=\"https://apple.stackexchange.com/questions/1956/how-can-i-watch-an-avi-file-on-my-iphone\">How can I watch an AVI file on my iPhone?</a></p>\n\n<p>Many good answers, including my own (of course), but non has been accepted.</p>\n","OwnerUserId":"150754","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-11-19T20:27:46.270","Title":"How does answers to questions that was asked by a deleted user get accepted?","Tags":"<support><accepted-answer><user-accounts>","AnswerCount":"2","CommentCount":"0"},{"Id":"2675","PostTypeId":"2","ParentId":"2674","CreationDate":"2015-11-17T14:11:57.403","Score":"3","Body":"<p>Only the user asking the question can accept one of the answers. Once the user decided to delete his/her account, there is no other way to answer acceptance. The same actually happens if the asker just looses interest and never comes back to the site. See <a href=\"https://meta.stackexchange.com/questions/18312/moderators-accepting-answers-on-users-behalf-after-a-certain-time-period\">Moderators accepting answers on user&#39;s behalf after a certain time period</a> to understand why even moderators can't (and shouldn't) accept answers in such cases.</p>\n\n<p>This doesn't prevent other users from up (and down) voting the answers given, so even with the original asker gone missing good answers should get upvoted over time.</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2015-11-17T14:11:57.403","CommentCount":"2"},{"Id":"2676","PostTypeId":"2","ParentId":"2674","CreationDate":"2015-11-17T15:05:22.827","Score":"1","Body":"<p>Ideally, two things happen to abandoned questions. Abandonment happens when the user never comes back or in a more permanent manner when the user account becomes deleted. At that point, the text still belongs to the community - so there's nothing preventing someone from re-asking the same question and explaining why having a check mark is important to the community. We have the power to address this, but it seems overkill for the \"reward\" in most cases. Without any user action, the design for abandoned questions is:</p>\n\n<ol>\n<li>If they are poor quality, they get edited or down voted - all by user action and user-moderation.</li>\n<li>Answers that are good in the sense that someone searches for the question or answer, finds it and votes it up.</li>\n</ol>\n\n<p>The price of entry to allowing anyone to ask a question is that a regular community member isn't going to ask the majority of the questions. Hopefully, site search is designed to counter act this natural tendency. Your actions of editing the question and adding an answer speak to how abandoned questions can still be cared for.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-11-17T15:05:22.827","CommentCount":"1"},{"Id":"2677","PostTypeId":"1","AcceptedAnswerId":"2678","CreationDate":"2015-11-17T16:31:27.310","Score":"2","ViewCount":"93","Body":"<p>I don't know if this is a bug or some loading/cloudflare configuration issue, but I've been having sporadic slowness on the site the past 4 hours (Tue Nov 17 16:25:40 UTC 2015) on Safari Version 9.0.2 (11601.3.9).</p>\n\n<p>Specifically, when looking at questions (not the main site pages), page rendering is blocked by query.min.js not being cached and taking more than 15 seconds to load (most of the time when it takes that long, it will never end up loading)</p>\n\n<p>The rest of the network times look fine, and I do use ghostly extension - but disabling that doesn't seem to affect this issue.</p>\n\n<p><a href=\"https://i.stack.imgur.com/y7FJI.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/y7FJI.png\" alt=\"enter image description here\"></a></p>\n\n<p>Is this a bug or a user level / configuration issue?</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2015-11-17T16:38:51.677","LastActivityDate":"2017-06-10T23:57:48.257","Title":"I'm seeing some pages not load where jquery.min.js is not being cached","Tags":"<bug>","AnswerCount":"1","CommentCount":"2"},{"Id":"2678","PostTypeId":"2","ParentId":"2677","CreationDate":"2015-11-18T14:52:16.397","Score":"0","Body":"<p>I cannot reproduce this so I'll blame the network provider up stream of me rather than the site or the infrastructure that's common to the SE network.</p>\n","OwnerUserId":"5472","LastActivityDate":"2015-11-18T14:52:16.397","CommentCount":"0"},{"Id":"2679","PostTypeId":"1","CreationDate":"2015-11-24T13:01:56.227","Score":"7","ViewCount":"78","Body":"<p>I've encountered a weird situation where a user wants to edit a question to (essentially) suit his answer.</p>\n\n<p>The original question is here:</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/94282/how-to-block-internet-traffic-of-an-application-not-using-little-snitch/193179\">Which free alternatives to Little Snitch can I use to block internet traffic per applications?</a></p>\n\n<p>The original question was merely titled \"<strong>How to block internet traffic of an application</strong>\", but the body of the question stated: <em>\"Little Snitch can block internet traffic of a particular app. Can I do something similar without (paying) Little Snitch?\"</em></p>\n\n<p>So, in short, it was asking for a free alternative to the well known Little Snitch app.</p>\n\n<p>The answer in question is here: <a href=\"https://apple.stackexchange.com/a/193179/22563\">https://apple.stackexchange.com/a/193179/22563</a></p>\n\n<p>The answer simply recommends using Little Snitch, ignoring the asker's awareness of it, and request for an alternative.</p>\n\n<p>I downvoted the answer and let the answerer know why. </p>\n\n<p>He's now suggesting the question be changed so that it \"removes any references to a particular software\" so that a reader \"can then simply ignore the answer that already mentions the option that [they] do not care about\".</p>\n\n<p>I can see validity in this, however I wonder if it's changing the original question too much? Is it like changing a question like \"What is a free alternative to Photoshop\" to \"Give me a list of photo manipulation software (paid or unpaid)?\"</p>\n\n<p>How much should we change original questions?</p>\n\n<p>Edit: It's worth noting that a knock-on effect of changing the question in the way suggested would mean that the following question would no longer be a duplicate: <a href=\"https://apple.stackexchange.com/questions/128835/free-firewall-and-network-monitor-application-like-the-littlesnitch?lq=1\">Free firewall and network monitor Application like the LittleSnitch?</a></p>\n","OwnerUserId":"22563","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2015-11-25T11:04:42.927","Title":"Broadening the scope of a question","Tags":"<discussion>","AnswerCount":"2","CommentCount":"1"},{"Id":"2680","PostTypeId":"2","ParentId":"2679","CreationDate":"2015-11-24T13:54:02.397","Score":"3","Body":"<p>In this specific case, <strong>the question was actually not broadened by the edit of the title</strong>. If you look at the edit history of the question, the requirement for a non-Little Snitch solution was part of the initial question already, the edit merely put it into the title. The wording is a bit unfortunate now, I would probably have used something like \"Which free alternatives to Little Snitch can I use to block internet traffic per applications\" (actually, I've just edited the question accordingly).</p>\n\n<p>Generally speaking, any edits should keep the original intention of the poster in mind. For edits which get placed in the edit queue, we even have a rejection reason if an edit conflicts with the intention of the OP. </p>\n","OwnerUserId":"9058","LastEditorUserId":"9058","LastEditDate":"2015-11-24T14:21:49.817","LastActivityDate":"2015-11-24T14:21:49.817","CommentCount":"2"},{"Id":"2681","PostTypeId":"2","ParentId":"2679","CreationDate":"2015-11-24T15:13:34.597","Score":"3","Body":"<p>In addition to what patrix mentioned - I like to keep in mind the purpose of a post:</p>\n\n<ul>\n<li>the site exists to draw the best answers, therefore questions exist to serve the answers </li>\n</ul>\n\n<p>So, add in some other facts:</p>\n\n<ul>\n<li>This question has many answers that are good</li>\n<li>This question is 3 years old now</li>\n</ul>\n\n<p>At that point in a question's life cycle, I'm heavily of the mind that locking the question and having it serve the community is the best choice in most of the cases. That allows a meta discussion to see if everyone can come to an agreement on the best way to handle this specific situation.</p>\n\n<p>If someone, even the OP wants to change things so that answers need to be changed, it's probably best to ask a new question at that point. </p>\n\n<p>The canonical question process is also something to think about where sometimes a post is locked and used to cover all the bases.</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/2418/where-is-the-list-of-canonical-questions-stored-for-ask-different\">Where is the list of canonical questions stored for Ask Different?</a></li>\n</ul>\n\n<p>In that case, the follow on effect you mention is worth considering, so looking at the role of the posts sometimes helps to make editing decisions and/or reply when one person has a vision for the question that others (answerers, reviewers, moderators) see a different vision of the scope or the wording.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-11-24T16:42:18.980","CommentCount":"1"},{"Id":"2682","PostTypeId":"1","CreationDate":"2015-11-29T01:50:51.353","Score":"12","ViewCount":"149","Body":"<p>Is the tag <a href=\"https://apple.stackexchange.com/questions/tagged/music\" class=\"post-tag\" title=\"show questions tagged &#39;music&#39;\" rel=\"tag\">music</a> any use when the tags <a href=\"https://apple.stackexchange.com/questions/tagged/itunes\" class=\"post-tag\" title=\"show questions tagged &#39;itunes&#39;\" rel=\"tag\">itunes</a>, <a href=\"https://apple.stackexchange.com/questions/tagged/music.app\" class=\"post-tag\" title=\"show questions tagged &#39;music.app&#39;\" rel=\"tag\">music.app</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/apple-music\" class=\"post-tag\" title=\"show questions tagged &#39;apple-music&#39;\" rel=\"tag\">apple-music</a> exist?</p>\n","OwnerUserId":"691","LastActivityDate":"2015-12-01T15:52:50.527","Title":"Time to face the [music]?","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"3"},{"Id":"2683","PostTypeId":"2","ParentId":"2682","CreationDate":"2015-12-01T15:52:50.527","Score":"6","Body":"<p>Just pushing this into an answer to get a vote going.</p>\n\n<p>It's time for it to face its final curtain.<br>\nNo encore, just a swan song.</p>\n\n<p>It's well-covered by the other tags.<br>\nIt <em>could</em> be useful for instance, perhaps for Garage Band or Logic questions, but a quick scroll down the top 50 questions under the tag reveals the other tags would pretty much have covered them all.</p>\n","OwnerUserId":"85275","LastActivityDate":"2015-12-01T15:52:50.527","CommentCount":"0"},{"Id":"2684","PostTypeId":"1","AcceptedAnswerId":"2685","CreationDate":"2015-12-03T20:44:21.823","Score":"9","ViewCount":"141","Body":"<p>The Stack Overflow developers have been working on a winter (for the northern hemisphere) bash that probably will include hats overlays for avatars and <a href=\"http://blog.stackoverflow.com/2013/09/five-years-ago-stack-overflow-launched-then-a-miracle-occurred/\">some non-competition for fake internet points</a> and badges this month. They have placed a teaser page up at the eventual home of this year's festivities:</p>\n\n<ul>\n<li><a href=\"http://winterbash2015.stackexchange.com\" rel=\"nofollow\">http://winterbash2015.stackexchange.com</a></li>\n</ul>\n\n<p>This is announced as site opt-out optional (users can always opt out of hats on the site). We need community consensus to form before the 10th of December if we are to act and opt out entirely as a site.</p>\n\n<p>Please answer if you feel the site should or should not opt out entirely.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2015-12-15T13:08:36.843","LastActivityDate":"2015-12-15T13:08:36.843","Title":"2015 northern hemisphere \"winter bash\"","Tags":"<discussion><site-promotion>","AnswerCount":"1","CommentCount":"5","FavoriteCount":"1"},{"Id":"2685","PostTypeId":"2","ParentId":"2684","CreationDate":"2015-12-03T20:54:33.893","Score":"17","Body":"<p><strong>YES</strong>, absolutely! Winter Bash for the win!</p>\n","OwnerUserId":"9058","LastActivityDate":"2015-12-03T20:54:33.893","CommentCount":"4"},{"Id":"2686","PostTypeId":"1","AcceptedAnswerId":"2687","CreationDate":"2015-12-04T14:44:34.497","Score":"1","ViewCount":"28","Body":"<p>I have an issue with my WiFi printer after upgrading my OS. I'm trying to understand/isolate (and ultimately resolve) the issue, however, I am not getting anywhere. The only question to post here that I can come up with, I myself would likely VtC as \"Too Broad\". But I am struggling with clarifying it.<br>\n<strong>Should I ask anyway, or consult a discussion forum instead?</strong></p>\n\n<p>Here's my situation:</p>\n\n<ul>\n<li>I use a Brother HL-2270DW printer which connects to the home WiFi.  </li>\n<li>Previous to upgrading to OS X El Capitan on my 2009 MacBook, I had no issues using the printer.  </li>\n<li>After upgrading the OS, the printer was gone from the list of available printers.  </li>\n<li>The only way to add it to the list was specifying the IP address of the printer. Only then was it detected and correctly identified.  </li>\n<li>But: I can only ever print once. On any subsequent job, the printer cannot be connected. I can delete it and add it again to the list and it will print - once.  </li>\n<li>Adding the printer by inputting the IP address for every single document is too tedious for me.  </li>\n</ul>\n\n<p>However, as stated above, I do not know how to tackle this. And asking for trouble-shooting advice appears \"too broad\". </p>\n","OwnerUserId":"44513","LastActivityDate":"2015-12-04T17:08:24.763","Title":"Trying to make question on El-Capitan and WiFi printer specific","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2687","PostTypeId":"2","ParentId":"2686","CreationDate":"2015-12-04T17:08:24.763","Score":"2","Body":"<p>The recipe for asking about troubleshooting is pretty easy once you've seen it work.</p>\n\n<p>Everything is in the help section on how to ask a good question.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/help/how-to-ask\">https://apple.stackexchange.com/help/how-to-ask</a></li>\n</ul>\n\n<p>Just show your exact search terms on what you looked for and be narrow about the issue. You want to focus people on asking how to determine if a printer supports bonjour or how to set up a printer so that you don't have to use an IP address.</p>\n\n<p>Using chat or a discussion forum might help you winnow down what you really are asking. Also, sometimes just \"how can tell if printer XYZ should be discoverable by OS X version ABC\" with you documenting what search you did on Apple and Brother's site makes it answerable.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2015-12-04T17:08:24.763","CommentCount":"2"},{"Id":"2688","PostTypeId":"1","AcceptedAnswerId":"2689","CreationDate":"2015-12-08T19:41:15.517","Score":"5","ViewCount":"31","Body":"<p>Recent OS X updates (SIP) have rendered some old solutions (especially scripts) broken. Should old answers be updated, or new questions answered in their own right?</p>\n","OwnerUserId":"81404","LastActivityDate":"2015-12-12T10:59:23.780","Title":"Should answers which are not forward compatible be edited for compatibility, or new answers created for new versions?","Tags":"<discussion><questions><editing>","AnswerCount":"2","CommentCount":"0"},{"Id":"2689","PostTypeId":"2","ParentId":"2688","CreationDate":"2015-12-08T22:12:18.330","Score":"2","Body":"<p>The old solutions are not broken; the new operating systems are :-)</p>\n\n<p>The posted solutions are still quite valid for computers running the operating systems for which the answers were written. I don't see any reason to break the answers for people running Panther or Tiger or Leopard or Snow Leopard or Lion or Mountain Lion or…</p>\n\n<p>If one wanted to edit <em>additional</em> information into the answers to make them compatible with these newfangled operating systems that aren't named after cats, I suppose one could do that, but don't break answers that work fine for the systems for which they were intended.</p>\n","OwnerUserId":"9388","LastActivityDate":"2015-12-08T22:12:18.330","CommentCount":"4"},{"Id":"2690","PostTypeId":"2","ParentId":"2688","CreationDate":"2015-12-12T10:59:23.780","Score":"0","Body":"<p>If there is a clearly-winning, correct answer which only changes at for instance El Capitan, my inclination would be to just add something along the lines of  </p>\n\n<p>\"<strong>Edit:</strong> after El Capitan you need to do this instead/as well\"   </p>\n\n<p>which preserves the original &amp; updates for newer systems <em>and also</em> keeps the right answer for all occasions at the top of the list.</p>\n\n<p>It also keeps the rep points accruing for the person who actually got the right answer in the first place; it wasn't their fault El Capitan broke their elegant solution.</p>\n","OwnerUserId":"85275","LastActivityDate":"2015-12-12T10:59:23.780","CommentCount":"0"},{"Id":"2691","PostTypeId":"1","CreationDate":"2015-12-12T11:12:39.887","Score":"7","ViewCount":"103","Body":"<p>As I was about to ask this question, I noticed this relevant question had just been bumped too - <a href=\"https://apple.meta.stackexchange.com/questions/2153/should-we-make-this-question-about-downgrading-ios-more-generic\">Should we make this question about downgrading iOS more generic?</a></p>\n\n<p>There was a Question recently involving a water-spill on a Macbook. We do see a lot of these &amp; linking them is not particularly easy as the symptoms tend to be different.</p>\n\n<p>This Question -<br>\n<a href=\"https://apple.stackexchange.com/questions/219053/no-sound-speakers-jack-microphones-dead-after-spilling-water\">No sound (speakers/jack) + microphone&#39;s dead after spilling water</a><br>\nhas a great answer, a little harsh, but really hitting the spot on \"what to do after a water spill\"</p>\n\n<p>I'm aware that to just leap right in &amp; completely change the OP's post wouldn't really be right, but this feels like one occasion where the answer is canonical enough that it's worth looking at.</p>\n\n<p>I'm not sure, even with consensus, it's one I'd like to tackle myself, but if a mod were to point it in the right direction that would feel more acceptable.</p>\n\n<p>Or am I on the wrong track?</p>\n\n<p>Opinions most welcome.</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-12-31T00:05:40.457","Title":"Genericising a Question which has a potentially canonical answer","Tags":"<discussion><canonical-questions>","AnswerCount":"1","CommentCount":"1"},{"Id":"2692","PostTypeId":"1","CreationDate":"2015-12-18T19:29:29.190","Score":"8","ViewCount":"43","Body":"<p>Currently the jobs url that's live on the site navigation (and meta) resolves as a 404:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/jobs\">https://apple.stackexchange.com/jobs</a></li>\n</ul>\n\n<p>Is this an expansion of the Stack Overflows careers or something different?</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2015-12-18T19:52:57.217","Title":"How does (or will) the Jobs tab on the Ask Different site work?","Tags":"<support><bug><status-completed>","AnswerCount":"1","CommentCount":"1"},{"Id":"2693","PostTypeId":"2","ParentId":"2692","CreationDate":"2015-12-18T19:48:45.180","Score":"7","Body":"<p>That was my fault.  I removed an if check that was very important.  It has been reverted.</p>\n","OwnerUserId":"7","LastActivityDate":"2015-12-18T19:48:45.180","CommentCount":"1"},{"Id":"2695","PostTypeId":"1","CreationDate":"2015-12-23T18:27:08.180","Score":"1","ViewCount":"39","Body":"<p>Is what I did <a href=\"https://apple.stackexchange.com/q/60084/128719\">here</a> appropriate? The question is somewhat old, but I came across it in Google results, and the accepted answer was just as wrong then as it is now. Since I got somewhat derailed by this I decided to add a better-quality answer after doing some research on the topic.</p>\n\n<p>I understand it's possible to edit other user's answers, and as I mentioned in mine there was another that got the kernel of the answer right but provided no explanation, and in any case that answer was not marked as correct. It seems a bit odd for me to provide my answer in the form of an edit to this one-line response when nearly all the content would be new research, am I off base in that?</p>\n\n<p>My intention here is just to have correct info out there for future googlers. Would it be better to create a new question? The system in question has not changed in several years so the answer would be no different then or now.</p>\n","OwnerUserId":"128719","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2015-12-30T18:00:51.670","Title":"Best practice for adding new answer to old, poorly-answered question","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2696","PostTypeId":"2","ParentId":"2695","CreationDate":"2015-12-23T21:05:06.033","Score":"1","Body":"<p>This looks like exactly the correct thing to do. (In this case I don't have a printer and I don't know what is correct)</p>\n\n<p>You definitely should not edit an answer you think is wrong as that changes the original intent (and it might be in other cases you have misunderstood) so adding a new answer and possibly down voting the other is correct.</p>\n\n<p>If there is an answer that you think is correct you can edit it to improve it. However in this case you have much more information and the other is just a short piece then adding a new answer is best practise. Also you did a very good thing in acknowledging the first correct answer and explaining why you were adding as a new answer.</p>\n\n<p>If this is the information you can give in an answer I look forward to seeing more of your answers.</p>\n","OwnerUserId":"237","LastEditorUserId":"237","LastEditDate":"2015-12-30T18:00:51.670","LastActivityDate":"2015-12-30T18:00:51.670","CommentCount":"3"},{"Id":"2697","PostTypeId":"1","AcceptedAnswerId":"2698","CreationDate":"2015-12-24T17:25:12.743","Score":"12","ViewCount":"190","Body":"<p>I have seen both <a href=\"https://apple.meta.stackexchange.com/questions/1318/why-is-this-site-called-ask-different\">this</a> and <a href=\"https://apple.meta.stackexchange.com/questions/286/ask-different-really-surely-ask-apple\">this</a>, and I am asking \"the other side of the coin\", in a way. What I was wondering is: why didn't we make the play on the Think Different campaign in the URL as well as in the site? It is strange to have a site called AskDifferent whose URL is apple.stackexchange.com… Why not askdifferent.com? After all, SO has stackoverflow.com, not .stackexchange.com, and same goes for AskUbuntu's askubuntu.com…</p>\n","OwnerUserId":"80177","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-12-30T02:15:36.927","Title":"Why is this site's URL not the same as its name?","Tags":"<discussion><site-name>","AnswerCount":"2","CommentCount":"0"},{"Id":"2698","PostTypeId":"2","ParentId":"2697","CreationDate":"2015-12-24T18:14:08.850","Score":"4","Body":"<p>I'll hazard some thought as I was around when this was discussed with the moderators at that moment in time. I have speculation and opinions, but they are just that other than links to other posts.</p>\n\n<hr>\n\n<p>The people that run the site registered <a href=\"http://askdifferent.com\">http://askdifferent.com</a> and point it to the name apple.stackexchange.com and the why is for them to answer. I think it had to do with not setting more precedent in making a custom name other than the original trilogy or a preference to market/brand things consistently for web market share numbers or appearances in building the reputation of the network. Having a custom domain necessarily weakens the link to the branding of the company and some process or some one made that call a while back.</p>\n\n<p>The community has voted pretty overwhelmingly to have things the other way around - have the site served out of a custom name and have requests from the apple.stackexchange.com resolve to the custom name, but those are just internet votes and not anyone that has actual authority to make any change.</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/9/domain-name-suggestions/24#24\">Domain name suggestions</a></li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2015-12-24T18:14:08.850","CommentCount":"0"},{"Id":"2699","PostTypeId":"1","CreationDate":"2015-12-25T20:57:17.263","Score":"4","ViewCount":"55","Body":"<p>Two seemingly identical tags:</p>\n\n<ul>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/contacts.app\" class=\"post-tag\" title=\"show questions tagged &#39;contacts.app&#39;\" rel=\"tag\">contacts.app</a></p>\n\n<p>Tag wiki:</p>\n\n<blockquote>\n  <p>Apple's address book client, renamed from Address Book in OS X 10.8</p>\n</blockquote></li>\n<li><p><a href=\"https://apple.stackexchange.com/questions/tagged/address-book\" class=\"post-tag\" title=\"show questions tagged &#39;address-book&#39;\" rel=\"tag\">address-book</a></p>\n\n<p>Tag wiki:</p>\n\n<blockquote>\n  <p>Apple's built-in contacts manager software for Mac OS X.</p>\n</blockquote>\n\n<p>As the <a href=\"https://apple.stackexchange.com/questions/tagged/contacts.app\" class=\"post-tag\" title=\"show questions tagged &#39;contacts.app&#39;\" rel=\"tag\">contacts.app</a> tag wiki clearly states, it is a simple rename of the same thing.</p></li>\n</ul>\n\n<p>Feature Request: Merge the two, and create a synonym for the other.</p>\n\n<hr>\n\n<p><strong>Edit</strong>:  I'm not saying these are the <em>only</em> tags that need it - go ahead and merge the others as well! :)</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/address-book\" class=\"post-tag\" title=\"show questions tagged &#39;address-book&#39;\" rel=\"tag\">address-book</a> → <a href=\"https://apple.stackexchange.com/questions/tagged/contacts.app\" class=\"post-tag\" title=\"show questions tagged &#39;contacts.app&#39;\" rel=\"tag\">contacts.app</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/ical\" class=\"post-tag\" title=\"show questions tagged &#39;ical&#39;\" rel=\"tag\">ical</a> → <a href=\"https://apple.stackexchange.com/questions/tagged/calender\" class=\"post-tag\" title=\"show questions tagged &#39;calender&#39;\" rel=\"tag\">calender</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/ichat\" class=\"post-tag\" title=\"show questions tagged &#39;ichat&#39;\" rel=\"tag\">ichat</a> → <a href=\"https://apple.stackexchange.com/questions/tagged/messages\" class=\"post-tag\" title=\"show questions tagged &#39;messages&#39;\" rel=\"tag\">messages</a></li>\n</ul>\n","OwnerUserId":"93721","LastEditorUserId":"93721","LastEditDate":"2015-12-29T17:52:41.690","LastActivityDate":"2016-01-29T07:13:45.647","Title":"Merge contacts.app and address-book tags","Tags":"<feature-request><tags>","AnswerCount":"2","CommentCount":"3","FavoriteCount":"1"},{"Id":"2700","PostTypeId":"2","ParentId":"2699","CreationDate":"2015-12-28T23:57:29.590","Score":"1","Body":"<p>My instinct is that this is a good thing, but I'm not convinced about what I feel about this, particularly if you're limiting this to the tags in your question.</p>\n\n<p>There's a few tags that exist like this, where the different tags refer to different versions of the software, delineated by its name change.</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/address-book\" class=\"post-tag\" title=\"show questions tagged &#39;address-book&#39;\" rel=\"tag\">address-book</a> → <a href=\"https://apple.stackexchange.com/questions/tagged/contacts.app\" class=\"post-tag\" title=\"show questions tagged &#39;contacts.app&#39;\" rel=\"tag\">contacts.app</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/ical\" class=\"post-tag\" title=\"show questions tagged &#39;ical&#39;\" rel=\"tag\">ical</a> → <a href=\"https://apple.stackexchange.com/questions/tagged/calendar\" class=\"post-tag\" title=\"show questions tagged &#39;calendar&#39;\" rel=\"tag\">calendar</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/ichat\" class=\"post-tag\" title=\"show questions tagged &#39;ichat&#39;\" rel=\"tag\">ichat</a> → <a href=\"https://apple.stackexchange.com/questions/tagged/messages\" class=\"post-tag\" title=\"show questions tagged &#39;messages&#39;\" rel=\"tag\">messages</a></li>\n</ul>\n\n<p>If you're going to synonym one pair, might as well synonym all the pairs?</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2015-12-29T14:26:30.587","LastActivityDate":"2015-12-29T14:26:30.587","CommentCount":"3"},{"Id":"2701","PostTypeId":"1","AcceptedAnswerId":"2702","CreationDate":"2015-12-29T00:45:37.640","Score":"-1","ViewCount":"22","Body":"<p>If you search <a href=\"https://apple.stackexchange.com/questions/tagged/jailbreak\" class=\"post-tag\" title=\"show questions tagged &#39;jailbreak&#39;\" rel=\"tag\">jailbreak</a>, you find 601 questions at time of writing related to jailbreaking one's device. The legality of this is debatable, but yet these questions are being answered. Should we close questions related to jailbreaking and any other illegal content?</p>\n","OwnerUserId":"158700","LastActivityDate":"2015-12-29T02:42:58.780","Title":"Are questions regarding topics whose legality is questionable allowed?","Tags":"<discussion><site-scope><closed-questions><close-reasons>","AnswerCount":"1","CommentCount":"2"},{"Id":"2702","PostTypeId":"2","ParentId":"2701","CreationDate":"2015-12-29T02:42:58.780","Score":"3","Body":"<p>That <a href=\"https://apple.stackexchange.com/questions/tagged/jailbreak\" class=\"post-tag\" title=\"show questions tagged &#39;jailbreak&#39;\" rel=\"tag\">jailbreak</a> exists should be a tip off to the acceptance of grey-area questions on the site. If they weren't allowed, the tag wouldn't exist, right?</p>\n\n<p>We are not the police and the laws are not uniformly the same from country to country.</p>\n\n<p>So, yes, we do allow some content that skirts in to areas that are legally grey. Jailbreaking being one of them. We'll usually close things that violate the EULA for Apple OSes, but not all questions get closed as some do have merit.</p>\n","OwnerUserId":"292","LastActivityDate":"2015-12-29T02:42:58.780","CommentCount":"0"},{"Id":"2703","PostTypeId":"2","ParentId":"2697","CreationDate":"2015-12-30T02:15:36.927","Score":"1","Body":"<p>This is covered (for all SE sites) in <a href=\"http://blog.stackoverflow.com/2010/10/domain-names-the-wrong-question/\">this blog post</a>.</p>\n\n<p>I believe SO, SU, AskUbuntu, and any others have those names purely for historical reasons. SO because it's SO; I <em>think</em> AU was independent before it joined SE; not sure about SU, maybe just because it's old enough to have slipped through.</p>\n","OwnerUserId":"74583","LastActivityDate":"2015-12-30T02:15:36.927","CommentCount":"1"},{"Id":"2704","PostTypeId":"2","ParentId":"2699","CreationDate":"2015-12-30T06:51:14.507","Score":"0","Body":"<p>I've submitted address-book as a tag synonym suggestion for the contacts tag. However, it still needs 4 votes by those that have 5 votes or more in the contacts tags in order to actually become a tag synonym. If it reaches a vote of -2 the suggestion will be deleted, though.</p>\n\n<p><a href=\"https://i.stack.imgur.com/JfYCm.jpg\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/JfYCm.jpg\" alt=\"\"></a></p>\n","OwnerUserId":"138476","LastActivityDate":"2015-12-30T06:51:14.507","CommentCount":"0"},{"Id":"2705","PostTypeId":"1","AcceptedAnswerId":"2706","CreationDate":"2016-01-02T07:55:25.297","Score":"1","ViewCount":"14","Body":"<p>On the iPhone app, when reading a question that does not have any comments from other users one is unable to add a comment.</p>\n\n<p>There is only the option to \"add an answer\".</p>\n\n<p>For example, on this question: <a href=\"https://apple.stackexchange.com/q/221633/162909\">Several items disabled on iPhone</a>, I am only able to see this:</p>\n\n<p><a href=\"https://i.stack.imgur.com/Pfw3b.jpg\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/Pfw3b.jpg\" alt=\"No &quot;comment button&quot;?\"></a></p>\n\n<p>However, occasionally, if there is a question that already has a comment on it, I am able to add a comment. I am unable to find an example at the moment.</p>\n\n<p>Is this due to an unknown site mechanic or due to a lack of sufficient rep?</p>\n\n<p><strong>EDIT:</strong> I found an example of the \"Add Comment\" button appearing:</p>\n\n<p><a href=\"https://i.stack.imgur.com/364xr.jpg\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/364xr.jpg\" alt=\"Here it is\"></a></p>\n\n<p>Strangely, it appeared on my question.</p>\n","OwnerUserId":"162909","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-01-02T09:01:00.670","Title":"Unable to comment on certain questions","Tags":"<discussion><support><design><reputation><comments>","AnswerCount":"1","CommentCount":"0"},{"Id":"2706","PostTypeId":"2","ParentId":"2705","CreationDate":"2016-01-02T09:01:00.670","Score":"2","Body":"<p>That's actually how the site works:</p>\n\n<ul>\n<li>You need a reputation of 50 (see <a href=\"https://apple.stackexchange.com/help/privileges\">https://apple.stackexchange.com/help/privileges</a>) to be able to comment on every post.</li>\n<li>You can always comment on your own posts</li>\n</ul>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-01-02T09:01:00.670","CommentCount":"1"},{"Id":"2707","PostTypeId":"1","AcceptedAnswerId":"2709","CreationDate":"2016-01-02T18:58:22.527","Score":"10","ViewCount":"304","Body":"<p>I'm sure… I think… there was a ban on beta release questions - but I can no longer find it in the Help section, only this link in Meta - <a href=\"https://apple.meta.stackexchange.com/questions/573/update-to-faq-regarding-beta-and-pre-release-software\">Update to FAQ regarding beta and pre-release software</a></p>\n\n<p>Do we have a current stance? Is it delineated at private vs public beta, or does it remain at <em>all betas</em></p>\n\n<p>This is my prompt - <a href=\"https://apple.stackexchange.com/questions/221899/time-capsule-backup-consistently-fails\">Time Capsule backup consistently fails</a></p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-08-07T16:49:12.617","Title":"What happened to the \"beta ban\"?","Tags":"<discussion>","AnswerCount":"2","CommentCount":"0","FavoriteCount":"2"},{"Id":"2708","PostTypeId":"2","ParentId":"2707","CreationDate":"2016-01-02T20:00:16.033","Score":"2","Body":"<p>The latest meta question on beta is <a href=\"https://apple.meta.stackexchange.com/questions/2537/should-beta-os-questions-be-on-topic-due-to-nda-changes-widening-distribution?lq=1\">here</a></p>\n\n<p>The most upvoted answer (although not very many votes) says</p>\n\n<blockquote>\n  <p>NDA is just one of several reasons why questions about non-public beta software don't work well on Ask Different, Can I ask about not-yet-publicly released OS? lists the others. So even with the NDA partially lifted, I still think that questions about iOS 9/OS X El Capitan need to wait until at least public betas are available.</p>\n</blockquote>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-01-03T17:57:46.707","CommentCount":"1"},{"Id":"2709","PostTypeId":"2","ParentId":"2707","CreationDate":"2016-01-02T20:56:36.343","Score":"13","Body":"<p>The general beta software ban was lifted in August of 2015 after discussing it in chat and on beta. The FAQ is up to date:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/help/on-topic\">https://apple.stackexchange.com/help/on-topic</a></li>\n</ul>\n\n<p><strong>Developer betas, seeding betas, other odd builds from Apple shouldn't be the only reason to close a post on Ask Different</strong>. Beta should no longer a reason to close any question on the site.</p>\n\n<p>See the blog post:</p>\n\n<ul>\n<li><a href=\"http://apple.blogoverflow.com/2015/08/beta-ios-9-and-el-capitan-questions-allowed/\" rel=\"nofollow noreferrer\">http://apple.blogoverflow.com/2015/08/beta-ios-9-and-el-capitan-questions-allowed/</a></li>\n</ul>\n\n<p>Meta has lots of answers and discussions, but in general we aren't closing anything due to beta status of hardware, software or services. We are asking for more details on beta releases. For instance - saying El Capitan wasn't enough when it was in beta - we asked for build versions and where you got the beta in the cases where it mattered if you were a seed participant or open beta participant or paid developer. Some things changed based on <em>how</em> you got the beta and were germane to the question meeting quality standards.</p>\n\n<p>Please note, this also doesn't mean any question about beta should remain open. Since it's beta, knowing the exact build version is imperative - we should be a little more strict about closing vague beta questions if they fail the other guidelines about being clear, practical, and have some research done on the problem to be solved.</p>\n\n<h1>We should vote to hold and close subjective, opinionated, excessively broad bad questions because of those specific flaws and not because they are running a beta build of an App or an OS.</h1>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-08-07T16:49:12.617","CommentCount":"4"},{"Id":"2710","PostTypeId":"1","CreationDate":"2016-01-03T06:30:58.953","Score":"2","ViewCount":"21","Body":"<p>Sorry, I couldn't think up of a burnination zinger.</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/tagged/photos\" class=\"post-tag\" title=\"show questions tagged &#39;photos&#39;\" rel=\"tag\">photos</a> is ambiguous, as people may think it refers to the photos OS X application.</p>\n\n<p>It should be renamed to <a href=\"https://apple.stackexchange.com/questions/tagged/photographs\" class=\"post-tag\" title=\"show questions tagged &#39;photographs&#39;\" rel=\"tag\">photographs</a> to avoid ambiguity.</p>\n\n<p>There was a previous request to change it as an answer by the OP of <a href=\"https://apple.meta.stackexchange.com/questions/2455/synonym-for-photos-app-to-photos\">Synonym for photos.app to photos</a> , but underneath that answer was a comment suggesting using the tag chat room (now frozen) or another question to discuss it.</p>\n","OwnerUserId":"691","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-01-03T06:30:58.953","Title":"Rename [photos] to [photographs]","Tags":"<discussion><tags>","AnswerCount":"0","CommentCount":"2"},{"Id":"2711","PostTypeId":"1","AcceptedAnswerId":"2712","CreationDate":"2016-01-08T13:45:11.890","Score":"0","ViewCount":"35","Body":"<p>In the past I earned the 100 reputation bonus from the Stack Overflow website. </p>\n\n<p>I am wondering if and when I can reach again the bonus from the Ask Different website of the community knowing that a I already have 364 points and so (364-100 = 264 earned in here). </p>\n","OwnerUserId":"152723","LastActivityDate":"2016-01-08T14:06:48.797","Title":"How can I earn 100 reputation bonus","Tags":"<support><reputation>","AnswerCount":"1","CommentCount":"0"},{"Id":"2712","PostTypeId":"2","ParentId":"2711","CreationDate":"2016-01-08T14:06:48.797","Score":"2","Body":"<p>If you are talking about the 100 rep association bonus: you only get that once per site, when you sign up for a site and already have at least 200 rep on another SE site. See <a href=\"https://apple.stackexchange.com/help/whats-reputation\">https://apple.stackexchange.com/help/whats-reputation</a> for the official documentation on this:</p>\n\n<blockquote>\n  <p>If you are an experienced Stack Exchange network user with 200 or more reputation on at least one site, you will receive a starting +100 reputation bonus to get you past basic new user restrictions. This will happen automatically on all current Stack Exchange sites where you have an account, and on any other Stack Exchange sites at the time you log in.</p>\n</blockquote>\n\n<p>There is also <a href=\"http://blog.stackoverflow.com/2009/07/cross-site-account-associations/\">http://blog.stackoverflow.com/2009/07/cross-site-account-associations/</a> but this probably was more important when cross site associations were introduced than today.</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2016-01-08T14:06:48.797","CommentCount":"2"},{"Id":"2713","PostTypeId":"1","CreationDate":"2016-01-10T01:37:47.590","Score":"2","ViewCount":"16","Body":"<p>Merge <a href=\"https://apple.stackexchange.com/questions/tagged/charge\" class=\"post-tag\" title=\"show questions tagged &#39;charge&#39;\" rel=\"tag\">charge</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/charger\" class=\"post-tag\" title=\"show questions tagged &#39;charger&#39;\" rel=\"tag\">charger</a> into <a href=\"https://apple.stackexchange.com/questions/tagged/charging\" class=\"post-tag\" title=\"show questions tagged &#39;charging&#39;\" rel=\"tag\">charging</a> (largest of the three)</p>\n\n<p>This seems like a straightforward merge, similar contents. Might even be worth merging into <a href=\"https://apple.stackexchange.com/questions/tagged/power\" class=\"post-tag\" title=\"show questions tagged &#39;power&#39;\" rel=\"tag\">power</a> unless <a href=\"https://apple.stackexchange.com/questions/tagged/charging\" class=\"post-tag\" title=\"show questions tagged &#39;charging&#39;\" rel=\"tag\">charging</a> is significantly different.</p>\n","OwnerUserId":"21351","LastActivityDate":"2016-01-10T01:37:47.590","Title":"Merge [charge] and [charger] into [charging]","Tags":"<discussion><tags>","AnswerCount":"0","CommentCount":"0"},{"Id":"2714","PostTypeId":"1","AcceptedAnswerId":"2715","CreationDate":"2016-01-11T16:40:54.893","Score":"7","ViewCount":"138","Body":"<p>The question in question is <a href=\"https://apple.stackexchange.com/questions/222642/extracting-latency-value-from-output-of-ping\">Extracting latency value from output of ping</a>.</p>\n\n<p>Should questions like this be considered off-topic? Aren't there other SE sites dedicated to these types of questions?</p>\n","OwnerUserId":"18387","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-01-22T04:05:38.033","Title":"Should questions about non OS X specific command-line tools be allowed?","Tags":"<discussion><site-scope>","AnswerCount":"4","CommentCount":"0"},{"Id":"2715","PostTypeId":"2","ParentId":"2714","CreationDate":"2016-01-11T16:54:14.303","Score":"14","Body":"<p>From <a href=\"https://apple.stackexchange.com/help/on-topic\">https://apple.stackexchange.com/help/on-topic</a>:</p>\n\n<blockquote>\n  <p>We do encourage AppleScript, Automator, and UNIX shell scripting questions as well as how to use tools like Xcode for non-language specific tasks</p>\n</blockquote>\n\n<p>So yes these kind of questions are absolutely on topic here. </p>\n\n<p>Now, if the question is: Should we allow them in the future? Opinions may differ, but from my point of view it's often rather difficult to differentiate between scripting questions around specific OS X features (e.g. how can I list all connected USB devices) and questions which are generic enough to belong to another site (most probably Unix &amp; Linux). Also, if the question does require a very detailed Unix knowhow not available on AD, we still can migrate it over if it doesn't get answered in due time. In other words: I don't see a pressing need to change the policy here.</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-01-11T16:54:14.303","CommentCount":"2"},{"Id":"2716","PostTypeId":"2","ParentId":"2714","CreationDate":"2016-01-11T20:09:33.013","Score":"6","Body":"<p>Just because command line tools such as these are also used in other OS, often for much longer than they have been in OS X, doesn't mean they are not a part of OS X, provided, supported, licensed and documented from Apple directly.</p>\n\n<p>A lot of the time where this sort of thing could be applicable to many SE sites, it comes down to where the OP feels most comfortable asking. If someone has a question on <code>ping</code> or similar, but they happen to be using a Mac, then I'd feel bad pointing them at SuperUser where they might get savaged (for want of X better phrase)</p>\n","OwnerUserId":"9495","LastActivityDate":"2016-01-11T20:09:33.013","CommentCount":"2"},{"Id":"2717","PostTypeId":"1","CreationDate":"2016-01-15T03:17:51.643","Score":"10","ViewCount":"341","Body":"<p>It's 2016 now, and we've <a href=\"https://meta.stackexchange.com/questions/272563/were-standardizing-the-sidebar-width-at-300px-on-all-sites\">made some changes to the sidebar size</a>. As such, we can now restart the Community Promotion Ads for 2016!</p>\n\n<p>Keep in mind, we have updated some of the guidelines compared to previously - the changes are marked in bold in the Image Requirements section.</p>\n\n<h3>What are Community Promotion Ads?</h3>\n\n<p>Community Promotion Ads are community-vetted advertisements that will show up on the main site, in the right sidebar. The purpose of this question is the vetting process. Images of the advertisements are provided, and community voting will enable the advertisements to be shown.</p>\n\n<h3>Why do we have Community Promotion Ads?</h3>\n\n<p>This is a method for the community to control what gets promoted to visitors on the site. For example, you might promote the following things:</p>\n\n<ul>\n<li>interesting apple related open source apps</li>\n<li>the site's twitter account</li>\n<li>script packs or power tools</li>\n<li>cool events or conferences</li>\n<li>anything else your community would genuinely be interested in</li>\n</ul>\n\n<p>The goal is for future visitors to find out about <em>the stuff your community deems important</em>. This also serves as a way to promote information and resources that are <em>relevant to your own community's interests</em>, both for those already in the community and those yet to join. </p>\n\n<h3>Why do we reset the ads every year?</h3>\n\n<p>Some services will maintain usefulness over the years, while other things will wane to allow for new faces to show up. Resetting the ads every year helps accommodate this, and allows old ads that have served their purpose to be cycled out for fresher ads for newer things. This helps keep the material in the ads relevant to not just the subject matter of the community, but to the current status of the community. We reset the ads once a year, every December.</p>\n\n<p>The community promotion ads have no restrictions against reposting an ad from a previous cycle. If a particular service or ad is very valuable to the community and will continue to be so, it is a good idea to repost it. It may be helpful to give it a new face in the process, so as to prevent the imagery of the ad from getting stale after a year of exposure.</p>\n\n<h3>How does it work?</h3>\n\n<p>The answers you post to this question <em>must</em> conform to the following rules, or they will be ignored. </p>\n\n<ol>\n<li><p>All answers should be in the exact form of:</p>\n\n<pre><code>[![Tagline to show on mouseover][1]][2]\n\n   [1]: http://image-url\n   [2]: http://clickthrough-url \n</code></pre>\n\n<p>Please <strong>do not add anything else to the body of the post</strong>. If you want to discuss something, do it in the comments.</p></li>\n<li><p>The question must always be tagged with the magic <a href=\"/questions/tagged/community-ads\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;community-ads&#39;\" rel=\"tag\">community-ads</a> tag. In addition to enabling the functionality of the advertisements, this tag also pre-fills the answer form with the above required form.</p></li>\n</ol>\n\n<h3>Image requirements</h3>\n\n<ul>\n<li>The image that you create must be <strong>300 x 250 pixels</strong>, or double that if high DPI.</li>\n<li>Must be hosted through our standard image uploader (imgur)</li>\n<li>Must be GIF or PNG</li>\n<li>No animated GIFs</li>\n<li>Absolute limit on file size of <strong>150 KB</strong></li>\n<li><strong>If the background of the image is white or partially white, there must be a 1px border (2px if high DPI) surrounding it.</strong></li>\n</ul>\n\n<h3>Score Threshold</h3>\n\n<p>There is a <strong>minimum score threshold</strong> an answer must meet (currently <strong>6</strong>) before it will be shown on the main site.</p>\n\n<p>You can check out the ads that have met the threshold with basic click stats <a href=\"https://apple.meta.stackexchange.com/ads/display/2717\">here</a>.</p>\n","OwnerUserId":"8994","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2016-02-26T18:21:57.407","Title":"Community Promotion Ads - 2016","Tags":"<discussion><community-ads>","AnswerCount":"2","CommentCount":"1"},{"Id":"2718","PostTypeId":"2","ParentId":"2717","CreationDate":"2016-01-15T03:17:51.643","Score":"0","Body":"<p><a href=\"http://twitter.com/askdifferent\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/0hCGV.png\" alt=\"Follow us on Twitter\"></a></p>\n","OwnerUserId":"8994","LastActivityDate":"2016-01-15T03:17:51.643","CommentCount":"2"},{"Id":"2719","PostTypeId":"2","ParentId":"2717","CreationDate":"2016-01-15T14:46:39.547","Score":"8","Body":"<p><a href=\"https://apple.stackexchange.com/?tab=featured\">Current Ask Different bounties http://stack-exchange-dynamic-ads.herokuapp.com/apple.stackexchange.com/bounty.png</a></p>\n","OwnerUserId":"8380","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-01-15T14:46:39.547","CommentCount":"6"},{"Id":"2721","PostTypeId":"1","CreationDate":"2016-01-17T15:29:39.243","Score":"1","ViewCount":"47","Body":"<p>There is this <a href=\"https://apple.stackexchange.com/a/223795/237\">answer</a> that is only a link. patrix has left a standard comment </p>\n\n<blockquote>\n  <p>Answers on Ask Different need to be more than just a link. It's okay to include a link, but please summarize or excerpt it in the answer. The idea is to make the answer stand alone</p>\n</blockquote>\n\n<p>If this was on a low quality queue I could vote to delete.</p>\n\n<p>However the wording for low quality flag is </p>\n\n<blockquote>\n  <p>This answer has severe formatting or content problems. This answer is unlikely to be salvageable through editing, and might need to be removed.</p>\n</blockquote>\n\n<p>Well these link only questions are obviously fixable by editing the information in so this is not a valid flag</p>\n\n<p>The not an answer flag says</p>\n\n<blockquote>\n  <p>This was posted as an answer, but it does not attempt to answer the question. It should possibly be an edit, a comment, another question, or deleted altogether.</p>\n</blockquote>\n\n<p>These links are surely delete altogether. So  this is the obvious flag to use. but as in this question these flags are rejected.</p>\n\n<p>How do I get the answer deleted as link only - I know this is the thing that is needed,</p>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2016-01-17T18:09:48.640","Title":"How do I delete an answer which is link only?","Tags":"<discussion><hyperlinks>","AnswerCount":"1","CommentCount":"1"},{"Id":"2722","PostTypeId":"2","ParentId":"2721","CreationDate":"2016-01-17T15:51:31.960","Score":"1","Body":"<p>I've declined the flag with \"flags should not be used to indicate technical inaccuracies, or an altogether wrong answer\". May be a borderline case, but usually I try to refrain from deleting an answer even if it doesn't directly answer the question. In this case the key issue is that it is link-only, the linked project most probably seems to offer an alternative to the tool the asker is using to run WhatsApp. Which, in my eyes, makes it an answer with quality issues, but not necessarily something I would want to delete.</p>\n\n<p>Let's look at the two flags which could be applied here:</p>\n\n<blockquote>\n  <p>This answer has severe formatting or content problems. This answer is unlikely to be salvageable through editing, and might need to be removed.</p>\n</blockquote>\n\n<p>While I agree that it has severe problems in its current form, the question seems salvageable through editing (basically by just summarizing the README.me found on Github).</p>\n\n<blockquote>\n  <p>This was posted as an answer, but it does not attempt to answer the question. It should possibly be an edit, a comment, another question, or deleted altogether.</p>\n</blockquote>\n\n<p>It definitively is an attempt to answer the question (or in this case rather the question behind the question), even it doesn't directly address the problem described.</p>\n","OwnerUserId":"9058","LastEditorUserId":"9058","LastEditDate":"2016-01-17T18:09:48.640","LastActivityDate":"2016-01-17T18:09:48.640","CommentCount":"6"},{"Id":"2724","PostTypeId":"1","CreationDate":"2016-01-20T08:46:07.603","Score":"0","ViewCount":"43","Body":"<p>According to <a href=\"https://apple.stackexchange.com/help/on-topic\">Help</a> we should refrain from asking questions about “Pre-release hardware or asking how/why Apple does <em>&lt;some thing XYZ></em>” <a href=\"https://apple.stackexchange.com/help/dont-ask\">and</a> we should avoid “asking an open-ended, hypothetical question: “What if ______ happened?””</p>\n\n<p>It’s been rumored for a while now that Apple has some kind of automotive project dubbed “Titan” which goes beyond mere <a href=\"https://www.apple.com/ios/carplay/\" rel=\"nofollow noreferrer\">“Car Play”</a> integration with third party products. As usual with non-announced, non-released products, we know nothing for sure, but there is <a href=\"http://www.macrumors.com/roundup/apple-car/\" rel=\"nofollow noreferrer\">concrete information</a> to base speculation upon. (If nothing else that’s a bit more than could be said about an Apple TV set.)</p>\n\n<p>What kind of question about this general topic would be okay on Ask Different?</p>\n\n<p>Examples:</p>\n\n<ul>\n<li>What is Apple doing differently than car manufacturers?<br>\nHow would that likely affect an “Apple Car”?</li>\n<li>What parts of a current car dashboard would not agree with Apple’s human interface guidelines?</li>\n<li>Which features of Apple hardware have not yet been adapted to mainstream automobiles?</li>\n<li>If Apple offered a car, would they limit the configuration options to a minimum, like they do with their current computing, entertainment and communication hardware?</li>\n</ul>\n","OwnerUserId":"67264","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2016-01-20T09:45:30.077","Title":"Are questions about the Apple Car acceptable (already)?","Tags":"<discussion><site-scope>","AnswerCount":"1","CommentCount":"0"},{"Id":"2725","PostTypeId":"2","ParentId":"2724","CreationDate":"2016-01-20T09:39:08.667","Score":"8","Body":"<p>As with any other unreleased and unannounced Apple product, questions about an Apple Car, an Apple Mission to the Moon or an Apple Submarine are as off-topic on Ask Different as are questions about the next MacPro model or the future direction of OSX.</p>\n\n<p>The goal of AD (and any other StackExchange site) is to provide fact-based answers to specific problems. There are other sites which are better suited for discussions and speculations (Slashdot, Reddit to just name two).</p>\n\n<p>To look at your examples:</p>\n\n<ul>\n<li><p><em>What is Apple doing differently than car manufactures?</em></p>\n\n<p>Apple is probably doing a lot of things differently, but which problem is to solve here? Also, how can you differentiate a correct answer from an incorrect one?</p></li>\n<li><p><em>What parts of a current car dashboard would not agree with Apple’s human interface guidelines?</em></p>\n\n<p>Interesting question for sure (and something I could absolutely see as a good exam question in an UX/UI course). But even the part that the guidelines would apply to anything car related built by Apple is already speculation.</p></li>\n<li><p><em>Which features of Apple hardware have not yet been adapted to mainstream automobiles</em></p>\n\n<p>Ignoring for the moment what a feature is in this context: which real-world problem does this solve?</p></li>\n<li><p><em>If Apple offered a car, would they limit the configuration options to a minimum, like they do with their current computing, entertainment and communication hardware?</em></p>\n\n<p>How can anybody outside Apple know? And I like the \"If\" here :-)</p></li>\n</ul>\n","OwnerUserId":"9058","LastEditorUserId":"9058","LastEditDate":"2016-01-20T09:45:30.077","LastActivityDate":"2016-01-20T09:45:30.077","CommentCount":"4"},{"Id":"2726","PostTypeId":"2","ParentId":"2714","CreationDate":"2016-01-21T02:06:00.967","Score":"5","Body":"<p>As a Mac user who mostly \"lives\" on <a href=\"https://unix.stackexchange.com/\">Unix &amp; Linux stackexchange</a>, I thought I'd provide my viewpoint on this.</p>\n\n<p>Questions about command line tools (that aren't Apple-specific) are perfectly on-topic both here and on Unix &amp; Linux.  Most such questions are also on-topic for superuser.com.  The main difference is the type of answers you're likely to receive.</p>\n\n<p>Realize that a huge percentage of Unix &amp; Linux questions relate to the command line, and frequently active users include many professional sysadmins, not to mention several people who actually <em>write</em> shells.  This means that a well-written question about a command line tool may get a <em>much</em> more in-depth answer than you're likely to find on any other site.</p>\n\n<p>Now, some people (most computer users, actually) aren't interested in really <em>learning</em> the command line; they primarily use a GUI and if they ask a question about the command line at all, what they would actually prefer is a simple command that they can paste into their terminal, which will do what they want, and let them get back to using the GUI.  (This is fine, of course; not everyone needs to learn the command line.  We have those people at Unix &amp; Linux also.)  This isn't the sort of answer that's considered \"good\" on U&amp;L.  It's probably not considered \"good\" here, either!  But in-depth answers about the command line are really the <em>norm</em> on U&amp;L.  So if you have a tricky, highly technical command line question, U&amp;L is (in my opinion) the best place possible to ask.</p>\n\n<p>However what goes along with this is <em>possibly</em> less lenience for newbie questions.  It's really hard to describe this, though, because no one is <em>rude</em> about it...I've rewritten this paragraph five times and I still can't quite nail it.</p>\n\n<p>I suppose the closest I could come is to say: imagine the response of a bunch of (polite) doctors who were sitting and chatting if you came in and asked, \"I forget, is it the ears or the eyes that are the 'sight' organs?\"  They'd answer you, of course, but they would undoubtedly be amused and might even chuckle at your naiveté.  :)</p>\n\n<p>So really, ask where you feel comfortable asking, and where you think you will get the best answer.  Either way it's on topic.</p>\n","OwnerUserId":"151730","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:37:07.007","LastActivityDate":"2016-01-21T02:06:00.967","CommentCount":"0"},{"Id":"2727","PostTypeId":"2","ParentId":"2714","CreationDate":"2016-01-22T04:05:38.033","Score":"1","Body":"<p>My two cents on this, <a href=\"https://stackoverflow.com/questions/3446231/how-close-are-mac-os-x-and-bsd-related\">since Mac OS/X is based on BSD</a> there is enough subtle difference between how commands work in a OS/X Terminal vs. a Linux-derived terminal. Because of this I would recommend allowing general purpose OS/X Terminal command questions here.</p>\n\n<p>Having said that, when I worked for Applecare, first-tier support advisors are NOT allowed to freelance on the command-line, they are only allowed to use terminal commands if they come from an official Apple support doc, and that's rare!</p>\n\n<p>Once I graduated to tier 2 (\"Senior Advisor\") I thought, woohoo I can solve problems a lot faster! Well there was more freedom (and depends on your manager) but there was still a strong emphasis on solutions the customers could understand that used GUI tools. True, customers get ahead of support agents and can do some damage when they \"know enough to be dangerous,\" so keeping them away from the command line was generally the right thing to do ... until I talked to a customer who I knew was smarter than me :)</p>\n\n<p>Well I only rehash that (no longer work there) to point out <strong>that Apple culture is, as noted in other answers, generally to stay away from the command line.</strong></p>\n\n<p>But having said all that my original point stands, <a href=\"https://askubuntu.com/questions/484982/what-is-the-difference-between-standard-syntax-and-bsd-syntax\">and there is enough difference between BSD and Linux</a> that the content can be reasonably dissimilar. I come from SunOS and still type ps -auxww, thankfully in Linux that still works. <a href=\"https://unix.stackexchange.com/questions/70762/ping-timeout-differences-between-os-x-and-linux-other-oss\">There are whole articles written about the differences in how ping works</a> ... on other SE sites :)</p>\n\n<p>(<a href=\"https://www.freebsd.org/doc/en/articles/explaining-bsd/comparing-bsd-and-linux.html\" rel=\"nofollow noreferrer\">another interesting BSD link here</a>)</p>\n","OwnerUserId":"166523","LastEditorUserId":"-1","LastEditDate":"2017-05-23T12:40:12.040","LastActivityDate":"2016-01-22T04:05:38.033","CommentCount":"0"},{"Id":"2728","PostTypeId":"1","CreationDate":"2016-02-18T18:11:23.100","Score":"1","ViewCount":"27","Body":"<p>I asked a question on this site that has been answered.</p>\n\n<p><a href=\"https://apple.stackexchange.com/questions/223495/how-do-i-create-an-automator-to-forward-mail\">How do I create an automator to forward mail?</a></p>\n\n<p>I didn't actually have the problem I asked about. Should I delete it?</p>\n","OwnerDisplayName":"user160377","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2016-02-18T19:45:49.853","Title":"Should I delete my question?","Tags":"<discussion><questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"2729","PostTypeId":"2","ParentId":"2728","CreationDate":"2016-02-18T19:44:43.530","Score":"4","Body":"<p>You should leave the question. It's a good objective question which has been received well and has good answers which may help other users in the future. Removing it would be viewed negatively by those users who contributed their time and effort into answering the question, especially as those answers were viewed as useful by other users too (indicated by upvotes).</p>\n\n<p>Also, you can't delete the question as it has an upvoted answer, so the question is moot, but that's beside the point. Also, deleting a question pushes you ever closer to a question ban should other questions you ask not be well-received (read: downvoted lots).</p>\n","OwnerUserId":"37797","LastActivityDate":"2016-02-18T19:44:43.530","CommentCount":"0"},{"Id":"2730","PostTypeId":"2","ParentId":"1941","CreationDate":"2016-02-19T19:41:47.387","Score":"1","Body":"<p><a href=\"/questions/tagged/status-completed\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;status-completed&#39;\" rel=\"tag\">status-completed</a> as tags are not animated anywhere any more, to my moderate disappointment.</p>\n","OwnerUserId":"37797","LastActivityDate":"2016-02-19T19:41:47.387","CommentCount":"0"},{"Id":"2731","PostTypeId":"1","AcceptedAnswerId":"2732","CreationDate":"2016-02-22T09:13:13.217","Score":"4","ViewCount":"40","Body":"<p>Say I've asked a question which hasn't gotten much attention despite being out for about a week (low view count, no comments or answers etc).</p>\n\n<p>How should I attract attention (besides offering a bounty) to my question, for example, bumping it?</p>\n\n<p>Is there a way to \"bump\" my quesyion to bring it back to attention? If yes, should I?</p>\n\n<p><em>edit: the question in question is here: <a href=\"https://apple.stackexchange.com/q/227875/162909\">Network Intermittency with Time Machine causes a &#39;Completed Verification&#39; dialog</a></em></p>\n","OwnerUserId":"162909","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2016-02-23T07:32:14.977","Title":"Can, and if yes, should posts be bumped?","Tags":"<support><questions><editing>","AnswerCount":"1","CommentCount":"3","FavoriteCount":"0"},{"Id":"2732","PostTypeId":"2","ParentId":"2731","CreationDate":"2016-02-22T16:18:31.913","Score":"5","Body":"<p>You should never bump with a trivial edit or comment. You can always make a substantial edit to improve the post:</p>\n\n<ul>\n<li>do some research and document how that didn't solve the issue.</li>\n<li>add version details to explain the range of OS or apps with the issue.</li>\n<li>edit out irrelevant / extraneous details in the question - shorter posts with a single clear request are far more likely to get new answers</li>\n<li>vote up answers that are trying to help even if they don't solve the issue</li>\n</ul>\n\n<p>Community automatically and randomly (fairly) bumps older unanswered questions (questions with zero answers or questions with no answers with a score >1).</p>\n\n<p>If you're adding more useful information or detail to your question by editing it, this is encouraged. This is conjointly associated with Community's bumping mechanism as if the question has an upvoted answer then it is necessary to make your question clearer through editing — subsequent bumps would be counter-productive and this is why Community does not bump such questions (not forgetting they may be answered correctly).</p>\n\n<p>Of course, bounties are the designed method to attract more attention to your question and this far exceeds the promotion from being on the front page for an hour or so depending on traffic.</p>\n","OwnerUserId":"37797","LastEditorUserId":"5472","LastEditDate":"2016-02-22T20:56:57.647","LastActivityDate":"2016-02-22T20:56:57.647","CommentCount":"1"},{"Id":"2733","PostTypeId":"1","AcceptedAnswerId":"2741","CreationDate":"2016-02-26T23:07:33.980","Score":"4","ViewCount":"104","Body":"<p>The app to count bounties might need to be resized to fit the new boundaries. Since <a href=\"https://apple.meta.stackexchange.com/questions/2717/community-promotion-ads-2016/2719#2719\">the answer was deleted by staff</a> - I wanted to put it here in case someone wants to step forward or re-implement this as their skill set and time allow. </p>\n\n<ul>\n<li>The current app runs on heroku at <a href=\"http://stack-exchange-dynamic-ads.herokuapp.com/apple.stackexchange.com/bounty.png\" rel=\"nofollow noreferrer\">http://stack-exchange-dynamic-ads.herokuapp.com/apple.stackexchange.com/bounty.png</a></li>\n<li>The current code is available at <a href=\"https://github.com/51cards/Stack-Exchange-Bounty-Ad\" rel=\"nofollow noreferrer\">https://github.com/51cards/Stack-Exchange-Bounty-Ad</a></li>\n</ul>\n\n<p><a href=\"https://apple.stackexchange.com/?tab=featured\">Current Ask Different bounties http://stack-exchange-dynamic-ads.herokuapp.com/apple.stackexchange.com/bounty.png</a></p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-03-02T19:27:27.743","Title":"Does anyone want to take over or suggest a fix to the bounty counting ad?","Tags":"<discussion><site-promotion>","AnswerCount":"1","CommentCount":"1"},{"Id":"2734","PostTypeId":"1","CreationDate":"2016-03-01T01:09:02.280","Score":"12","ViewCount":"185","Body":"<p>In a similar vein to <a href=\"https://apple.meta.stackexchange.com/questions/2688/should-answers-which-are-not-forward-compatible-be-edited-for-compatibility-or\">this question about editing other users answers to provide compatibility with newer OS X versions</a>, is there any way to mark answers as obsolete besides adding a comment that it doesn't work as of <code>OS X 10.whatever</code>?</p>\n\n<p>Specifically, El Capitan and SIP stop many old solutions to problems from working, and it is frustrating for users to read through answers and then have a long comment chain outlining all the changes to the answer that are necessary to adapt the answer to the latest Mac OS.  This makes the actual answer unclear unless you read through the comment chain and have some background knowledge on what the breaking changes were or why something may not work on a new OS X.</p>\n","OwnerUserId":"156681","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-03-14T22:11:14.403","Title":"Is there a way to mark answers as obsolete?","Tags":"<discussion><feature-request>","AnswerCount":"2","CommentCount":"0"},{"Id":"2735","PostTypeId":"2","ParentId":"2734","CreationDate":"2016-03-01T08:20:18.853","Score":"20","Body":"<p>There's two things you can do: comment or edit. There's nothing built-in to Stack Exchange specifically for outdated answer handling. They are still answers and shouldn't be removed, but commenting or editing helps readers by pointing out problems that a user using a newer operating system may face.</p>\n\n<p>With editing, don't put a huge message at the beginning of the answer. This distracts from the content. Instead, inline the new information into the answer, such as changing an answer which begins ‘You can…’ into</p>\n\n<blockquote>\n  <p>In Yosemite and earlier, you can…</p>\n</blockquote>\n\n<p>On a previous answer of mine, I edited my accepted answer to explain which versions of OS X my answer worked for, and as an updated answer had already been provided by another user, I linked to that answer too with an <em>extremely</em> brief summary of what was different (in this case, a single string).</p>\n\n<blockquote>\n  <p>This answer is for Mavericks and earlier.<br>\n  <a href=\"https://apple.stackexchange.com/questions/123833/replace-text-edit-as-the-default-text-editor/220496#220496\">For Yosemite and later, use com.apple.LaunchServices/com.apple.launchservices.secure.</a></p>\n</blockquote>\n\n<p><sup>Source: <a href=\"https://apple.stackexchange.com/a/123834/37797\">Replace Text Edit as the default text editor</a></sup></p>\n\n<p>This way, the answer can standalone if the other answer is removed for any reason (always a good idea for any external content required for the comprehension of an answer) but should a less-experienced user or a user who simply prefers more detailed instructions on the difference, they can check the linked answer.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-03-14T22:11:14.403","CommentCount":"2"},{"Id":"2736","PostTypeId":"1","CreationDate":"2016-03-01T13:42:18.450","Score":"1","ViewCount":"29","Body":"<p>We see many of these questions on Ask Different…<br>\n<a href=\"https://apple.stackexchange.com/questions/229349/iphone-4s-stuck-on-control-center\">iPhone 4s stuck on Control Center</a></p>\n\n<p>Essentially, the answer to a lot of them is just \"take it to a shop &amp; get it fixed.\"</p>\n\n<p>They're the equivalent of the old joke about taking the car to the mechanic to fix the horn because the brakes don't work.</p>\n\n<p>Should we just close as \"Basic customer support\" with a comment to get the damn thing fixed?</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2016-03-01T14:31:26.540","Title":"It's broken - then get it fixed!","Tags":"<discussion><close-reasons>","AnswerCount":"1","CommentCount":"0"},{"Id":"2737","PostTypeId":"2","ParentId":"2736","CreationDate":"2016-03-01T14:31:26.540","Score":"2","Body":"<p>It will be a case by case basis but I don't think the example you gave should be closed.</p>\n\n<p>It is a reasonable question and others will search for this issue as well. The problem for Ask Different is that there is no reasonable answer but this isn't necessarily known at time of asking. </p>\n\n<p>Not everyone (most people I suspect) don't have easy and low cost access to a Apple store so some things might be fixable.</p>\n\n<p>As for your analogy don't we cover power users and there are a lot of people who fix cars for a hobby.</p>\n\n<p>In this case I would say the best thing is to answer there is no user fix and have to see a professional.</p>\n","OwnerUserId":"237","LastActivityDate":"2016-03-01T14:31:26.540","CommentCount":"0"},{"Id":"2738","PostTypeId":"1","AcceptedAnswerId":"2740","CreationDate":"2016-03-02T14:34:43.230","Score":"5","ViewCount":"50","Body":"<p>When someone post a question with an image on it that is really huge (most of the time an iPhone screenshot), is there a way to reduce the size of the image with an edit in order to make the question more readable?</p>\n\n<p>I'm referring at questions like this one: <a href=\"https://apple.stackexchange.com/questions/229497/the-storage-used-does-not-add-up\">The Storage &quot;Used&quot; does not add up</a></p>\n","OwnerUserId":"152723","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2016-03-02T18:28:15.283","Title":"How can we reduce the size of a image, while editing?","Tags":"<support><editing><images>","AnswerCount":"2","CommentCount":"0"},{"Id":"2739","PostTypeId":"2","ParentId":"2738","CreationDate":"2016-03-02T14:42:12.157","Score":"0","Body":"<p>I'm not aware of any way to edit images within the site. What you can do though:</p>\n\n<ul>\n<li>Download image to your computer</li>\n<li>Use the editing tool of your choice to reduze the image size</li>\n<li>Edit the original post and replace the image with your reduced-size version</li>\n</ul>\n","OwnerUserId":"9058","LastActivityDate":"2016-03-02T14:42:12.157","CommentCount":"3"},{"Id":"2740","PostTypeId":"2","ParentId":"2738","CreationDate":"2016-03-02T16:31:34.043","Score":"6","Body":"<p>Use img tags with a custom width attribute. In the example you linked to, I've edited it to do just that. Check the revision history to see what I've done.</p>\n\n<pre><code>&lt;img src=\"http://i.stack.imgur.com/1vIgO.png\" width=\"375\"&gt;\n</code></pre>\n\n<ul>\n<li>iPhone 4–5s: 320</li>\n<li>iPhone 6–6s: 375</li>\n<li>iPhone 6+–6s+: 540</li>\n</ul>\n\n<p>If you resize an image and re-upload it as a suggested edit, I'm likely to ‘reject and edit’ it and use the above instead on the original image. Resizing the image loses detail.</p>\n\n<p>Feel free to use even smaller numbers for side-by-side images (e.g. 300) and add <code>[]()</code> or <code>[][]</code> link formatting around the img element to link  to the full-size image.</p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2016-03-02T18:28:15.283","LastActivityDate":"2016-03-02T18:28:15.283","CommentCount":"1"},{"Id":"2741","PostTypeId":"2","ParentId":"2733","CreationDate":"2016-03-02T19:27:27.743","Score":"2","Body":"<p>I've submitted a pull request to the GitHub repo. This pull request deals with resizing the ad to the necessary size and adding a border (required by guidelines).</p>\n\n<ul>\n<li><a href=\"https://github.com/51cards/Stack-Exchange-Bounty-Ad/pull/7\" rel=\"nofollow\">https://github.com/51cards/Stack-Exchange-Bounty-Ad/pull/7</a></li>\n</ul>\n","OwnerUserId":"37797","LastActivityDate":"2016-03-02T19:27:27.743","CommentCount":"2"},{"Id":"2742","PostTypeId":"1","AcceptedAnswerId":"2744","CreationDate":"2016-03-04T15:30:28.630","Score":"1","ViewCount":"42","Body":"<p>A few weeks ago, I suggested a new tag related to 4K. The suggestion had been accepted but right now I don't see the tag anymore. </p>\n\n<p>Is this normal? There is some regulation related to the evolution of the tags?</p>\n","OwnerUserId":"152723","LastActivityDate":"2016-03-04T17:11:28.813","Title":"Tag not longer presents","Tags":"<support><tags>","AnswerCount":"2","CommentCount":"6"},{"Id":"2743","PostTypeId":"2","ParentId":"2742","CreationDate":"2016-03-04T16:25:25.433","Score":"1","Body":"<p>If I remember correctly, <a href=\"https://apple.stackexchange.com/review/suggested-edits/151924\">this</a> and <a href=\"https://apple.stackexchange.com/review/suggested-edits/151923\">this</a> originally have been the edits for <a href=\"https://apple.stackexchange.com/questions/tagged/4k\" class=\"post-tag\" title=\"show questions tagged &#39;4k&#39;\" rel=\"tag\">4k</a>. I've rejected both because the tag description was incorrect and incomplete.</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2016-03-04T17:11:28.813","CommentCount":"0"},{"Id":"2744","PostTypeId":"2","ParentId":"2742","CreationDate":"2016-03-04T16:26:05.830","Score":"1","Body":"<p>The <a href=\"https://apple.stackexchange.com/review/suggested-edits/151881\">suggested edit 151881</a> shows that <a href=\"https://apple.stackexchange.com/questions/tagged/4k\" class=\"post-tag\" title=\"show questions tagged &#39;4k&#39;\" rel=\"tag\">4k</a> was the tag that was suggested to be added, but the <a href=\"https://apple.stackexchange.com/posts/228423/revisions\">post revisions</a> shows that <a href=\"https://apple.stackexchange.com/questions/tagged/retina-display\" class=\"post-tag\" title=\"show questions tagged &#39;retina-display&#39;\" rel=\"tag\">retina-display</a> was added. <a href=\"https://apple.stackexchange.com/questions/tagged/4k\" class=\"post-tag\" title=\"show questions tagged &#39;4k&#39;\" rel=\"tag\">4k</a> was merged with <a href=\"https://apple.stackexchange.com/questions/tagged/retina-display\" class=\"post-tag\" title=\"show questions tagged &#39;retina-display&#39;\" rel=\"tag\">retina-display</a>, but <a href=\"https://apple.stackexchange.com/questions/tagged/retina-display\" class=\"post-tag\" title=\"show questions tagged &#39;retina-display&#39;\" rel=\"tag\">retina-display</a> is a synonym of <a href=\"https://apple.stackexchange.com/questions/tagged/display\" class=\"post-tag\" title=\"show questions tagged &#39;display&#39;\" rel=\"tag\">display</a>, and as such <a href=\"https://apple.stackexchange.com/tags/retina-display/synonyms\">/tags/retina-display/synonyms</a> redirects to <a href=\"https://apple.stackexchange.com/tags/display/synonyms\">/tags/display/synonyms</a> which doesn't show <a href=\"https://apple.stackexchange.com/questions/tagged/4k\" class=\"post-tag\" title=\"show questions tagged &#39;4k&#39;\" rel=\"tag\">4k</a> as a synonym, because it isn't. The <a href=\"/questions/tagged/bug\" class=\"post-tag required-tag\" title=\"show questions tagged &#39;bug&#39;\" rel=\"tag\">bug</a> here is that the question shouldn't be able to be tagged with <a href=\"https://apple.stackexchange.com/questions/tagged/retina-display\" class=\"post-tag\" title=\"show questions tagged &#39;retina-display&#39;\" rel=\"tag\">retina-display</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/display\" class=\"post-tag\" title=\"show questions tagged &#39;display&#39;\" rel=\"tag\">display</a> at the same time, as the former is a synonym of the latter.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2016-03-04T16:26:05.830","CommentCount":"4"},{"Id":"2745","PostTypeId":"1","AcceptedAnswerId":"2747","CreationDate":"2016-03-07T09:43:16.490","Score":"0","ViewCount":"26","Body":"<p>Earlier today, I posted the answer <a href=\"https://apple.stackexchange.com/a/230066/162909\">https://apple.stackexchange.com/a/230066/162909</a> which turned out to be a misleading answer due to my misbelief that isopropanol was suitable for use as a screen-cleaning agent. </p>\n\n<p><a href=\"https://apple.stackexchange.com/users/85275/tetsujin\">@Tetsujin</a> promptly corrected my misbelief, which has me now concerned that someone else might accidentally take my answer as a viable method of cleaning one's screen when this is <em>seriously not advisable</em>.</p>\n\n<p>I had a small discussion with <a href=\"https://apple.stackexchange.com/users/85275/tetsujin\">Tetsujin</a> in the comments about what I should do with the answer, and, on his advice, decided to leave it there that it may be a lesson to others to <em>not</em> do what my answer suggested.</p>\n\n<p>However, if this situation were to arise again (not just for myself), how should I deal with a misleading answer, answered wrongly due to my own misbelief?</p>\n","OwnerUserId":"162909","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2016-03-07T14:06:01.650","Title":"How should I deal with a misleading answer?","Tags":"<discussion><answers>","AnswerCount":"2","CommentCount":"0"},{"Id":"2746","PostTypeId":"2","ParentId":"2745","CreationDate":"2016-03-07T10:26:01.130","Score":"0","Body":"<p>Deleting an answer is always an option. If you don't see see a <em>delete</em> link at the bottom of your answer (next to the <em>edit</em> link), just flag it for moderator attention and add a note.</p>\n","OwnerUserId":"9058","LastActivityDate":"2016-03-07T10:26:01.130","CommentCount":"3"},{"Id":"2747","PostTypeId":"2","ParentId":"2745","CreationDate":"2016-03-07T14:06:01.650","Score":"0","Body":"<p>In order of preference - these tools can help to improve a question that has problems:</p>\n\n<ol>\n<li>Edit it to explain / caution / correct facts or assertions with references and clarity.</li>\n<li>Comment and vote if the core idea is a problem instead of some portion of the post.</li>\n<li>When there's nothing redeemable (perhaps by editing the good content into another post) - deletion is an option.</li>\n</ol>\n\n<p>Keep in mind - we don't delete answers because they are wrong. In fact, a wrong answer can be very very helpful to explain / dispel the notion that an option wasn't considered. Widely held yet wrong ideas do the best when they are voted appropriately and commented with constructive criticism as to the application of that post to the question at hand.</p>\n","OwnerUserId":"5472","LastActivityDate":"2016-03-07T14:06:01.650","CommentCount":"0"},{"Id":"2748","PostTypeId":"1","CreationDate":"2016-03-11T03:09:37.797","Score":"3","ViewCount":"62","Body":"<p>I typed in <code>meta.apple</code> into chrome, and rather than googling for Ask Different Meta, it tried to load <code>http://meta.apple</code> and failed.</p>\n\n<p>Should we claim <code>http://meta.apple</code> and have it redirect to <code>http://meta.apple.stackexchange.com/</code>?</p>\n","OwnerUserId":"691","LastActivityDate":"2016-03-11T08:19:47.557","Title":"Should we claim http://meta.apple?","Tags":"<discussion><meta>","AnswerCount":"1","CommentCount":"2"},{"Id":"2749","PostTypeId":"2","ParentId":"2748","CreationDate":"2016-03-11T08:19:47.557","Score":"6","Body":"<p>I'm not sure how this would be possible. Apple owns .apple and I doubt they're going to give us a subdomain. Also, I'd presume the main site is more worthwhile for a .apple subdomain than just the meta site.</p>\n","OwnerUserId":"37797","LastActivityDate":"2016-03-11T08:19:47.557","CommentCount":"0"},{"Id":"2750","PostTypeId":"2","ParentId":"2734","CreationDate":"2016-03-13T16:59:28.253","Score":"0","Body":"<p>The answers are not obsolete; they are great answers for great operating systems. Questions really need to specify for what operating system they seek a solution. If the same solution works for multiple versions, that's awesome. If Apple introduces a disruptive change, the answer doesnt become obsolete, but the adopters of the new system have new questions about how to do what we already have established to do in the earlier versions.</p>\n\n<p>But my eMac running Panther works great. Answers about how to search for files in Panther before Spotlight was introduced aren't obsolete; they just don't apply to people who choose to use those newfangled gizmos.</p>\n","OwnerUserId":"9388","LastActivityDate":"2016-03-13T16:59:28.253","CommentCount":"2"},{"Id":"2751","PostTypeId":"1","AcceptedAnswerId":"2752","CreationDate":"2016-03-14T19:29:57.347","Score":"3","ViewCount":"98","Body":"<p>The <a href=\"https://apple.stackexchange.com/questions/tagged/hackintosh\" class=\"post-tag\" title=\"show questions tagged &#39;hackintosh&#39;\" rel=\"tag\">hackintosh</a> tag refers to using Apple operating systems on non-Apple hardware.  Since this is explicitly off-topic on Ask Different, I would like to propose that <a href=\"https://apple.stackexchange.com/questions/tagged/hackintosh\" class=\"post-tag\" title=\"show questions tagged &#39;hackintosh&#39;\" rel=\"tag\">hackintosh</a> be burninated.</p>\n","OwnerUserId":"171366","LastEditorUserId":"5472","LastEditDate":"2016-03-14T19:32:24.187","LastActivityDate":"2016-05-11T17:15:07.437","Title":"Burninate [hackintosh]?","Tags":"<discussion><tags>","AnswerCount":"3","CommentCount":"2"},{"Id":"2752","PostTypeId":"2","ParentId":"2751","CreationDate":"2016-03-14T22:08:42.640","Score":"0","Body":"<p><a href=\"https://apple.stackexchange.com/questions/tagged/hackintosh\" class=\"post-tag\" title=\"show questions tagged &#39;hackintosh&#39;\" rel=\"tag\">hackintosh</a> is gone, <a href=\"/questions/tagged/status-completed\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;status-completed&#39;\" rel=\"tag\">status-completed</a>!</p>\n","OwnerUserId":"37797","LastActivityDate":"2016-03-14T22:08:42.640","CommentCount":"3"},{"Id":"2753","PostTypeId":"2","ParentId":"2751","CreationDate":"2016-03-16T17:56:12.470","Score":"2","Body":"<p>I'm usually the one arguing for tags to go away, but in this case, I'd rather see the hackintosh tag stay.</p>\n\n<ul>\n<li><p>if all posts on the topic are indeed off-topic, the tag will only appear on off-topic posts. If such posts persist in the site, seeng they all have a common theme can help people know what is and is not off-topic</p></li>\n<li><p>if off-topic posts are naturally deleted over time, the tag will die on its own when no surviving posts remain</p></li>\n<li><p>our definition of on- and off-topic can change over time, and if posts are tagged as hackintosh, if the site later decides it wants to answer these, the tag marks them as a candidate for potential reopening.</p></li>\n</ul>\n\n<p>Manually removing the tag from posts on which it belongs strikes me as a bad idea.</p>\n","OwnerUserId":"9388","LastActivityDate":"2016-03-16T17:56:12.470","CommentCount":"2"},{"Id":"2754","PostTypeId":"1","AcceptedAnswerId":"2755","CreationDate":"2016-03-20T04:10:53.240","Score":"3","ViewCount":"28","Body":"<p>Is what I did in <a href=\"https://apple.stackexchange.com/questions/231594/how-do-i-block-a-website-on-my-iphone-5/231595\">this question</a> appropriate? Instead of editing the existing link-only answer, I made my own new answer with an explanation of the steps contained in the link. Is this fine? Or should I have just edited the other answer?</p>\n","OwnerUserId":"18387","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-03-20T10:11:35.667","Title":"Is it appropriate to add a new answer vs editing an existing link-only answer?","Tags":"<discussion><editing><answers>","AnswerCount":"1","CommentCount":"1"},{"Id":"2755","PostTypeId":"2","ParentId":"2754","CreationDate":"2016-03-20T10:11:35.667","Score":"3","Body":"<p>As you haven't added any more information to your answer beyond what was obtained from the link, I would have edited the existing answer rather than adding a new one, but what you did is not wrong either.</p>\n\n<p>If there had been other content in the existing answer then I would have added another answer as you did, but as it was just the link I would have added a quote or other derived content from the source to the existing answer. Additionally, if your answer had been longer and contained information from elsewhere including but not limited to personal experience, a new answer is definitely warranted.</p>\n","OwnerUserId":"37797","LastActivityDate":"2016-03-20T10:11:35.667","CommentCount":"0"},{"Id":"2756","PostTypeId":"1","CreationDate":"2016-03-21T12:26:49.563","Score":"1","ViewCount":"102","Body":"<p>Apple's 10 a.m. PDT event will be streamed to a handful of OS/browser combinations. Is there anyplace on Ask Different where people will discuss things both live and after the event?</p>\n\n<ul>\n<li><a href=\"http://www.apple.com/apple-events/march-2016/\" rel=\"nofollow\">http://www.apple.com/apple-events/march-2016/</a></li>\n</ul>\n","OwnerUserId":"5472","LastActivityDate":"2017-07-14T21:35:35.483","Title":"Where will discussion on the Spring 2016 Apple Event be hosted?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2757","PostTypeId":"2","ParentId":"2756","CreationDate":"2016-03-21T12:28:41.453","Score":"1","Body":"<p>The primary place to discuss things will be in the main chat room:</p>\n\n<ul>\n<li><a href=\"http://chat.stackexchange.com/rooms/38/ask-different-chat\">http://chat.stackexchange.com/rooms/38/ask-different-chat</a></li>\n</ul>\n\n<p>If people would like to add feeds of other coverage below or in a different answer, edits and posts are most welcome!</p>\n\n<p>Apple's stream is hosted at <a href=\"http://www.apple.com/apple-events/march-2016/\" rel=\"nofollow\">http://www.apple.com/apple-events/march-2016/</a> and requires an Apple TV app or specific browser:</p>\n\n<ul>\n<li>Safari on iOS 7.0 or later, a Mac with Safari 6.0.5 or later on OS X v10.8.5 or later</li>\n<li>a PC with Microsoft Edge on Windows 10</li>\n<li>Apple TV (2nd or 3rd generation) with software 6.2 or later or an Apple TV (4th generation)</li>\n</ul>\n\n<p>Press live coverage is announced at:</p>\n\n<ul>\n<li><a href=\"http://live.arstechnica.com/apples-march-2016-event/\" rel=\"nofollow\">http://live.arstechnica.com/apples-march-2016-event/</a></li>\n<li><a href=\"https://www.macstories.net/tag/march-21/\" rel=\"nofollow\">https://www.macstories.net/tag/march-21/</a></li>\n</ul>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2016-03-21T13:04:30.890","LastActivityDate":"2016-03-21T13:04:30.890","CommentCount":"0"},{"Id":"2758","PostTypeId":"1","AcceptedAnswerId":"2759","CreationDate":"2016-03-21T23:16:04.080","Score":"-2","ViewCount":"41","Body":"<p>Sorry if the title is not so clear. </p>\n\n<p>Should we remove the questions that are made for the purpose of earn only reputation points? I'm referring to question like these two: <a href=\"https://apple.stackexchange.com/questions/231835/what-are-the-differences-between-the-iphone-se-6s-and-6s-plus?noredirect=1#comment283184_231835\">1</a>, <a href=\"https://apple.stackexchange.com/questions/231833/what-are-the-differences-between-the-9-7-and-12-9-ipad-pros\">2</a>.</p>\n\n<p>I mean, are those really necessary for the community? They look like spam to me. Especially because the answer arrive from the person who made the question in only 6 minutes. </p>\n\n<p>Some of you expert can provide me some explanation in order to keep questions like that?</p>\n","OwnerUserId":"152723","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2016-03-21T23:33:16.220","Title":"What are the meaning of question to earn reputation?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"2759","PostTypeId":"2","ParentId":"2758","CreationDate":"2016-03-21T23:33:16.220","Score":"3","Body":"<p>If you disagree with a question you can always flag it for closing. The flags will be reviewed by the moderators and the community users. If enough people agree a question should be closed the system will take care of it; no humans need intervene.</p>\n\n<p>That being said, over time, we've gotten pretty good as a community at recognizing the common questions that occur post-Apple announcement of new products and heading off those questions from very low-rep users with existing self-answered questions.</p>\n\n<p>This is an accepted practice here on Ask Different.</p>\n\n<p>You've provided to examples but they're both slightly different.</p>\n\n<p>In the case of <a href=\"https://apple.stackexchange.com/questions/231835/what-are-the-differences-between-the-iphone-se-6s-and-6s-plus\">What are the differences between the iPhone SE, 6s, and 6s plus?</a> -- the user asked a pretty straight-forward question and self-answered. Nothing wrong with that and it's something that's done post-Apple announcement with some frequency here. There's good prior art for this sort of thing on the site.</p>\n\n<p>And a slight diversion here: answering your own questions is not only okay, it's <em>encouraged</em> by the Stack Exchange system. You have an \"answer your own question\" box right below the \"ask your question\" box when you're creating a new question. Stack Exchange exists to capture questions and answers with as few rules as possible. Sometimes people know the question <em>and</em> the answer and why wouldn't we want them to share this knowledge with the world?</p>\n\n<p>However, for the second question you linked to, <a href=\"https://apple.stackexchange.com/questions/231833/what-are-the-differences-between-the-9-7-and-12-9-ipad-pros\">What are the differences between the 9.7“ and 12.9” iPad Pros?</a> -- the asker did not provide an answer. It needs an answer. And it's a legit question. We will see people asking what the differences are between the two models.</p>\n\n<p>The simplicity of a question or the ease with which an answer can be obtained aren't good measures for whether a question should be asked here or not. We certainly don't mind simple or easy-to-answer questions!</p>\n\n<p>I will say that your answer on the \"What are the differences between the 9.7“ and 12.9” iPad Pros?\" is not a good answer. We strongly discourage \"read the text behind a link\" answers here. Links rot, which means the text behind them gets lots. Pull the relevant details in to your answer in addition to providing the link would make it a stronger answer. As written, it will attract down votes.</p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2016-03-21T23:33:16.220","CommentCount":"3"},{"Id":"2760","PostTypeId":"1","CreationDate":"2016-03-23T08:23:08.660","Score":"4","ViewCount":"56","Body":"<p>I was going to use a slightly less-polite term, but I thought better of it.</p>\n\n<p>How do we deal with such as this<br>\n<a href=\"https://apple.stackexchange.com/questions/49381/dont-want-my-email-contacts-in-my-contact-list\">Don&#39;t want my email contacts in my contact list</a><br>\nwhere there are 25 answers, almost all pretty low quality, that are essentially all the same answer in varyingly-intelligible forms?</p>\n\n<p>Go down them hitting -1 on the worst &amp; hope they eventually reach -3 &amp; vanish to low rep users?</p>\n\n<p>Or...?</p>\n","OwnerUserId":"85275","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-03-23T13:26:01.013","Title":"What to do with 'answer plague'?","Tags":"<discussion>","AnswerCount":"2","CommentCount":"1"},{"Id":"2761","PostTypeId":"2","ParentId":"2760","CreationDate":"2016-03-23T09:56:56.610","Score":"4","Body":"<p>Protecting the question (as you did) or flagging it for moderator attention (for people with less reputation points) are probably the best way of action here. Downvoting also helps, but I would still recommend to look at each answer on its own and only downvote those which you would either also downvote if they were the only answer or if the answer really is a duplicate of an existing one (see also <a href=\"https://apple.meta.stackexchange.com/questions/990/what-shall-we-do-with-duplicate-answers?rq=1\">What shall we do with duplicate answers?</a> on this).</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-03-23T09:56:56.610","CommentCount":"0"},{"Id":"2762","PostTypeId":"2","ParentId":"2760","CreationDate":"2016-03-23T13:26:01.013","Score":"2","Body":"<p>I wonder if we would do better by assembling a list of 10 or so example questions and then deciding if the problem is actually not closing the source of the \"plague\" - It's harder to balance the \"not everything needs fixing/let's change everything\" value judgement with the \"we're open for anyone to participate\" in single cases.</p>\n\n<p>That question itself has some serious problems with either incomplete information or wrong information and has aged poorly.</p>\n\n<ol>\n<li>Which contact app is being used?</li>\n<li>How many contact sync options are engaged (you could sync over iTunes to Mac, iTunes to PC, cloud to a handful of custom or standard services).</li>\n<li>What version of iOS?</li>\n</ol>\n\n<p>I would say - if you wanted to help out that problem - explaining why it needs to be closed in a comment or working up consensus here or in chat to get a few people to agree it's actively harming the site and/or see if it can be linked to a better canonical question.</p>\n\n<p>All that being said - that question has likely helped a lot of people even with the tons of answers (that's a signal that the problem isn't a simple as it seems) and none have risen to the top indicating that the thread in question isn't a good resource for getting a problem documented or solved.</p>\n","OwnerUserId":"5472","LastActivityDate":"2016-03-23T13:26:01.013","CommentCount":"0"},{"Id":"2763","PostTypeId":"1","CreationDate":"2016-03-24T10:24:12.277","Score":"2","ViewCount":"32","Body":"<p>I just tried to retag a question as <a href=\"https://apple.stackexchange.com/questions/tagged/linux\" class=\"post-tag\" title=\"show questions tagged &#39;linux&#39;\" rel=\"tag\">linux</a> which was based on not finding a Ubuntu boot disk</p>\n\n<p>However I see Linux is a synonym of Unix which surely is wrong for this group as the differences matter a lot here. Can we have this synonym broken?</p>\n","OwnerUserId":"237","LastEditorUserId":"37797","LastEditDate":"2016-03-24T14:05:29.260","LastActivityDate":"2016-03-24T14:05:29.260","Title":"Linux tag = Unix","Tags":"<discussion><tags>","AnswerCount":"0","CommentCount":"6"},{"Id":"2764","PostTypeId":"1","AcceptedAnswerId":"2766","CreationDate":"2016-03-28T01:49:15.790","Score":"6","ViewCount":"96","Body":"<p>Here's a question I asked:\n<a href=\"https://apple.stackexchange.com/questions/232549/old-ipod-ipod-mini-sales-figures\">https://apple.stackexchange.com/questions/232549/old-ipod-ipod-mini-sales-figures</a></p>\n\n<p>It was put On Hold, with this reason chosen:</p>\n\n<blockquote>\n  <p>\"Basic Customer Support or questions asking to recommend or find off-site resources (Mac/book/software/tutorial) are off-topic for Ask Different as they tend to attract opinionated answers and spam. Instead, edit to clearly describe your problem and the research done so far to solve it.\"</p>\n</blockquote>\n\n<p>The key part, I assume, is \"questions asking to [...] find off-site resources [...] are off-topic for Ask Different as they tend to attract opinionated answers and spam.\"</p>\n\n<p>There's nothing opinionated about the answer to my question. It's a simple factual question. I tried finding the answer and could not, so I asked.</p>\n\n<p>So far I've only explained why the chosen reason to close is incorrect. I suppose I aught to actually argue that my question does belong. From the Help Center:</p>\n\n<blockquote>\n  <p>Ask Different is for users of Apple products. If you have a question about ...</p>\n  \n  <ul>\n  <li>Apple hardware</li>\n  <li>[...]</li>\n  </ul>\n  \n  <p>... then you're in the right place to ask your question!</p>\n</blockquote>\n\n<p>The iPod is Apple hardware, so my question is on-topic.</p>\n","OwnerUserId":"104232","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2016-03-28T14:26:06.823","Title":"Sales Figures are Off Topic?","Tags":"<discussion><questions><site-scope><closed-questions><close-reasons>","AnswerCount":"2","CommentCount":"1"},{"Id":"2765","PostTypeId":"2","ParentId":"2764","CreationDate":"2016-03-28T11:03:18.953","Score":"1","Body":"<p>Off-Topic was probably the wrong reason, but it deserves to be closed (put \"On Hold\") because Apple has never provided specific sales figures, and also not broken down by iPod type.</p>\n\n<p>It may be on topic, but it's factually unanswerable.</p>\n","OwnerUserId":"1346","LastActivityDate":"2016-03-28T11:03:18.953","CommentCount":"3"},{"Id":"2766","PostTypeId":"2","ParentId":"2764","CreationDate":"2016-03-28T14:21:03.933","Score":"3","Body":"<p>I thought I voted to put a hold on this - but others beat me to the punch. My initial thinking combines two reasons we close questions:</p>\n\n<ol>\n<li><p>Asking about how Apple does it's business isn't the core function for the site. We want to be a place to learn <em>how</em> to use Apple's products. If there were a site on how to read financial disclosures or how to find the best paid estimates of sales figures that simply don't get released - perhaps your question would be an awesome one for that site. Boiling down your question - it's not really about using iPod or any other product that Apple sells. It's more meta than that.</p></li>\n<li><p>It's also primarily opinion based. You could ask a yes/no question. <strong>Does Apple report sales volume for iPod products?</strong> Some would answer yes, some would answer no. There's not much value to a question like that IMO - but it at least would have some answers people could vote on and you could select one.</p></li>\n</ol>\n\n<p>I would also have chosen the former close reason since it asks you explicitly to show some research. Maybe you're a developer looking to do market analysis. Maybe you're asking about X since you think it will answer a related question Y that might be a better fit for the site.</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2016-03-28T14:26:06.823","LastActivityDate":"2016-03-28T14:26:06.823","CommentCount":"0"},{"Id":"2767","PostTypeId":"1","AcceptedAnswerId":"2768","CreationDate":"2016-03-29T14:51:03.667","Score":"0","ViewCount":"33","Body":"<p>I think it doesn't make any sense, if there are question that have already been answered but I'm not fully satisfied I would like to post a comment to receive further explaining, but I can't. I think it's ridicolous</p>\n","OwnerUserId":"174984","LastActivityDate":"2016-03-29T15:10:47.890","Title":"Why do I need 50 rep to post a comment?","Tags":"<discussion><reputation><comments>","AnswerCount":"1","CommentCount":"0"},{"Id":"2768","PostTypeId":"2","ParentId":"2767","CreationDate":"2016-03-29T15:10:47.890","Score":"5","Body":"<p>The reputation system works to balance the moderation load with allowing new people to learn the ropes by performing the easier tasks of asking and answering as they start to use the sites.</p>\n\n<p>There have been many requests to change this limit. Some have asked for it to be made more restrictive. I'm guessing you would like it to be less restrictive. This is the place to make a concrete proposal if you wish once people weigh in on discussion of the current implementation.</p>\n\n<hr>\n\n<p>As I see it - the restriction is working perfectly. If you are not satisfied with a current answer, the best course of action is to ask a new question - linking to the existing answer and elaborating specifically why your problem isn't solved.</p>\n\n<p>If you asked for clarification in the comments or need further explaining - doing that in comments is generally a poor way to request details. It can work on occasion - but generally runs into issues and back and forth and leaves the comments noisy with side discussion.</p>\n","OwnerUserId":"5472","LastActivityDate":"2016-03-29T15:10:47.890","CommentCount":"0"},{"Id":"2769","PostTypeId":"1","AcceptedAnswerId":"2770","CreationDate":"2016-04-02T05:39:24.593","Score":"0","ViewCount":"19","Body":"<p>As seen in this screenshot:</p>\n\n<p><a href=\"https://i.stack.imgur.com/o8USA.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/o8USA.png\" alt=\"\"></a></p>\n\n<p>I have more \"change\" than I have \"total reputation\". What is this \"change\", and why is it so much higher than my total reputation?</p>\n","OwnerUserId":"162909","LastEditorUserId":"162909","LastEditDate":"2016-04-02T05:44:36.180","LastActivityDate":"2016-04-02T17:19:38.307","Title":"What exactly is \"change\" in the rep leagues?","Tags":"<support><reputation>","AnswerCount":"1","CommentCount":"0"},{"Id":"2770","PostTypeId":"2","ParentId":"2769","CreationDate":"2016-04-02T06:22:42.943","Score":"2","Body":"<p>This is your change in rank, not in reputation. </p>\n\n<p>You can confirm this by changing the Sort Order to by Rank Change and seeing that number is the one in order.</p>\n","OwnerUserId":"9058","LastEditorUserId":"237","LastEditDate":"2016-04-02T17:19:38.307","LastActivityDate":"2016-04-02T17:19:38.307","CommentCount":"0"},{"Id":"2771","PostTypeId":"2","ParentId":"286","CreationDate":"2016-04-02T20:50:50.247","Score":"8","Body":"<p>I found this site in the SE community list. I had to visit the site because the name wasn't descriptive enough to tell me what it was about, and when I did, I was half expecting to end up on a site about alternative lifestyles. </p>\n\n<p>The argument from SeniorShizzle that \"90% of Apple's users over the age of 18 would recognize [the <em>Think Different</em>] slogan immediately\" is dubious at best, and at worst it excludes entire geographic regions where the ad was not campaigned, new users, users of Apple products that were not advertised with the \"think different\" slogan, and generations of users to come. I'd argue that the name is esoteric. And while there are problems with the name \"Ask Apple\" as discussed in the comments, that doesn't mean there is not a problem with the name \"Ask Different\".</p>\n\n<p>That being said, I'm not here to support a name change, I'm just offering my two cents on this topic. And while I haven't been a member for very long, I have a different theory as to why the name might have stuck (and why it might be a good match), according to something I remember being told by an old business professor I once had.</p>\n\n<p>According to him, Apple's success has always been fueled by those evangelist users who embrace the fact that Apple is not Microsoft, and historically has never been \"mainstream\". These users want to be different and feel like they're exercising their right to choose. Perhaps they perceive themselves as the crazy ones. The misfits. The rebels. The troublemakers. The round pegs in the square holes.</p>\n\n<p>And that's why \"Ask Different\" is arguably a pretty good name choice for the community here.</p>\n\n<p>But alas, I'm just a passerby.</p>\n","OwnerUserId":"178121","LastActivityDate":"2016-04-02T20:50:50.247","CommentCount":"1"},{"Id":"2772","PostTypeId":"1","CreationDate":"2016-04-07T09:46:52.173","Score":"1","ViewCount":"33","Body":"<p>The question <a href=\"https://apple.stackexchange.com/questions/127840/apple-a1277-usb-ethernet-adapter-not-working-on-macbook-air\">Apple A1277 USB ethernet adapter not working on MacBook Air</a> requires a reputation of 10 to post an answer. My account has a reputation of 106, through (mostly) the magic cross-site Stack Exchange bonus, but I can't post an answer.</p>\n\n<p>Any ideas why?</p>\n","OwnerUserId":"53239","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-04-07T10:45:59.257","Title":"Can't answer a protected question despite having sufficient reputation","Tags":"<bug><answers><protected-questions>","AnswerCount":"1","CommentCount":"0","ClosedDate":"2016-04-07T13:00:10.863"},{"Id":"2773","PostTypeId":"2","ParentId":"2772","CreationDate":"2016-04-07T10:45:23.220","Score":"3","Body":"<p>Protected questions require 10 reputation to have been <strong>earned on the site itself</strong>, thus this is <a href=\"/questions/tagged/status-bydesign\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;status-bydesign&#39;\" rel=\"tag\">status-bydesign</a>.</p>\n\n<p>The 100 reputation association bonus is purposefully removed from the calculation used to determine if you have sufficient reputation to answer a protected question, and as such you have 6 reputation which is below the 10 threshold.</p>\n\n<p>If you found the protected question notice confusing, feel free to upvote this Meta.SE feature request to <a href=\"https://meta.stackexchange.com/questions/210481/improve-protected-question-message-with-regard-to-rep-gained-through-associati\">change the phrasing of the protected question post notice</a>.</p>\n\n<p>I went to upvote your question so you'd have enough reputation, but I've already done that!</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2016-04-07T10:45:23.220","CommentCount":"0"},{"Id":"2774","PostTypeId":"1","AcceptedAnswerId":"2775","CreationDate":"2016-04-09T14:58:10.237","Score":"3","ViewCount":"29","Body":"<p>As seen in the screenshot of <a href=\"https://apple.stackexchange.com/tags/osx/topusers\">tag osx's top users</a> (in this case bmike):</p>\n\n<p><img src=\"https://i.stack.imgur.com/O1VSW.png\" alt=\"2.6k 983 bmike\"></p>\n\n<p>There are two numbers, <code>2.6k</code> and <code>983</code> before his avatar and various details. There are no headers detailing what these two numbers are.</p>\n\n<p>What are these two numbers?</p>\n","OwnerUserId":"162909","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-04-09T19:14:23.197","Title":"In the \"Top Users\" tag section, what are these numbers?","Tags":"<support><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2775","PostTypeId":"2","ParentId":"2774","CreationDate":"2016-04-09T16:49:54.833","Score":"3","Body":"<p>The left number is the sum of the scores of answers to questions tagged with the tag in question or questions with that tag (there are two separate sections of top users). Upvotes increment the number and downvotes decrement.</p>\n\n<p>The right number is the number of posts (again, answers or questions depending on section) associated with that tag. One answer or question increments the number by one. Clicking this number opens a search page filtered to the type of post by that user with that tag.</p>\n\n<p>Stack Exchange loves tooltips. Almost everything which might be open to interpretation on the site has a tooltip which can be helpful if you don't know what a control does or what a value represents. In this case, the tooltips are brief, but they are there. If your device has a mouse, hover it over the numbers to expose the tips.</p>\n\n<p>                                         <img src=\"https://i.stack.imgur.com/8ohSG.png\" width=\"298\"></p>\n","OwnerUserId":"37797","LastEditorUserId":"37797","LastEditDate":"2016-04-09T19:14:23.197","LastActivityDate":"2016-04-09T19:14:23.197","CommentCount":"0"},{"Id":"2776","PostTypeId":"1","AcceptedAnswerId":"2777","CreationDate":"2016-04-23T07:41:06.810","Score":"1","ViewCount":"23","Body":"<p>rEFInd is a free custom bootloader for Mac, capable of booting from disks such as NTFS, ext4 and others. rEFInd is not officially supported by Apple. Is it allowed to post questions about it on AskDifferent?</p>\n","OwnerUserId":"145472","LastEditorUserId":"37797","LastEditDate":"2016-04-29T18:17:01.397","LastActivityDate":"2016-04-29T18:17:01.397","Title":"Is it okay to ask questions about rEFInd?","Tags":"<discussion><site-scope>","AnswerCount":"1","CommentCount":"0"},{"Id":"2777","PostTypeId":"2","ParentId":"2776","CreationDate":"2016-04-23T09:04:08.837","Score":"3","Body":"<p>There are already quite a lot of questions about rEFInd, so yes, of course, go ahead.</p>\n\n<p>PS: Please check whether your question has come before though.</p>\n","OwnerUserId":"9058","LastActivityDate":"2016-04-23T09:04:08.837","CommentCount":"2"},{"Id":"2778","PostTypeId":"1","AcceptedAnswerId":"2779","CreationDate":"2016-04-28T20:25:12.653","Score":"3","ViewCount":"26","Body":"<p>If you had a question about a 3rd-party app for iOS, would you ask it here?</p>\n\n<p>Here are some examples of iOS apps:</p>\n\n<ul>\n<li>Momento</li>\n<li>Twitter for iOS</li>\n<li>Day One Journal</li>\n</ul>\n","OwnerUserId":"154794","LastEditorUserId":"5472","LastEditDate":"2016-04-29T01:37:34.003","LastActivityDate":"2016-04-29T01:37:34.003","Title":"Would you ask about 3rd-party iOS apps here?","Tags":"<discussion><site-scope><close-reasons><ios>","AnswerCount":"1","CommentCount":"0"},{"Id":"2779","PostTypeId":"2","ParentId":"2778","CreationDate":"2016-04-29T01:37:09.643","Score":"3","Body":"<p>Yes - using iOS makes questions on topic for any use of that device. Whether it's a third party or first party device, it's still about a user of an Apple product.</p>\n\n<p>Now - questions covering \"on topic\" subjects are closed for lots of reasons that make them low quality questions. If yours is too vague, too broad, lacks any sort of basic troubleshooting, it will be closed in short order in most cases.</p>\n\n<p>For example - How do I set up Twitter for iOS will likely be lacking any research on how to use iOS settings or twitter app settings and a candidate for closing. If someone asked that \"I followed this article explaining how to set up my twitter account and got error XYZ?\" - that would be a great question and one I wouldn't expect to see closed.</p>\n","OwnerUserId":"5472","LastActivityDate":"2016-04-29T01:37:09.643","CommentCount":"0"},{"Id":"2780","PostTypeId":"1","AcceptedAnswerId":"2781","CreationDate":"2016-05-01T07:02:45.273","Score":"5","ViewCount":"42","Body":"<p><em>NB: This is probably not the first time a question of this nature has been asked, but I could not find anything similar.</em></p>\n\n<p>While scrolling through the front page/review today, I noticed a trend that seems to be increasing in frequency: \"please help me write this script\"-type of questions. Today alone, there were questions <a href=\"https://apple.stackexchange.com/questions/236772/can-someone-help-me-to-translate-this-automator-workflow-to-applescript\">1</a>, <a href=\"https://apple.stackexchange.com/questions/236770/automate-creation-of-twice-encrypted-backups-copy-to-amazon-cloud-drive\">2</a> and <a href=\"https://apple.stackexchange.com/questions/236724/unlock-external-locked-encrypted-disk-with-applescript-command-by-filling-dialog\">3</a> all requesting some form of script <em>be written for them</em> (although the third example has other problems with the improbability of the brute-forcing a locked disk).</p>\n\n<p>These questions usually do not show any evidence of the (most often, new) users trying to solve this script problem themselves, and treat the site like a \"single-use, quick-answer-that-works, copy-paste\" platform.</p>\n\n<p>This trend, unfortunately, also plagues other sites like <a href=\"http://stackoverflow.com\">Stack Overflow</a> and <a href=\"http://unix.stackexchange.com\">Unix &amp; Linux</a>.</p>\n\n<p>What would be an appropriate response to questions like these? Should we write scripts (which risks more questions like these) or flag/hold/off-topic/leave unanswered these questions (risks making people unhappy)?</p>\n","OwnerUserId":"162909","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-05-01T12:42:28.657","Title":"When did we become a scriptwriting service?","Tags":"<discussion><site-scope><asking-questions><new-users>","AnswerCount":"2","CommentCount":"0"},{"Id":"2781","PostTypeId":"2","ParentId":"2780","CreationDate":"2016-05-01T08:09:51.970","Score":"2","Body":"<p>Basically, questions about scripting solutions based on Bash, AppleScript, Automator etc. (aka everything included in OSX by default) are on-topic. But we also expect askers to show some kind of research and at least an attempt to solve the problem on their own (to avoid \"do my homework for me\" questions). From a first look, not all of the questions you've listed qualify on that angle.</p>\n\n<p>OTOH, I neither see these questions as a plague nor as a problem. If somehow (maybe just for the fun of it) provides an answer, great, the value of the site just increased. If nobody bothers (because the problem is too obscure, the boundaries not defined very well or the OP doesn't respond to comments asking for clarification), the question will slowly sliver into oblivion which is fine as well.</p>\n\n<p>So basically, IMHO we should treat them like any other question and</p>\n\n<ul>\n<li>ask for clarification if the question is unclear</li>\n<li>flag as whatever if necessary</li>\n<li>answer if we can</li>\n</ul>\n","OwnerUserId":"9058","LastActivityDate":"2016-05-01T08:09:51.970","CommentCount":"2"},{"Id":"2782","PostTypeId":"2","ParentId":"2780","CreationDate":"2016-05-01T12:42:12.297","Score":"3","Body":"<p>If there's clearly no research taken place and the question is asking specifically for a script to be written for them, I usually comment or (custom) vote to close with the following, tailored if necessary.</p>\n\n<blockquote>\n  <p>Questions asking for code must demonstrate a minimal understanding of the problem being solved. Include attempted solutions, why they didn't work, and the expected results.</p>\n</blockquote>\n\n<p>This is different to if someone is looking for where to start in writing a script, I'll try to answer to point them in the right direction. A quote from the AppleScript dictionary or similar usually helps people who can't find or don't know the existence of a feature, for example.</p>\n","OwnerUserId":"37797","LastActivityDate":"2016-05-01T12:42:12.297","CommentCount":"0"},{"Id":"2783","PostTypeId":"1","CreationDate":"2016-05-04T21:15:47.570","Score":"6","ViewCount":"110","Body":"<p>I'm new to Stack Exchange and still learning the rules and conventions. Is it ever appropriate to comment on a great answer to add to what was already written? Is it appropriate to say things like, \"I was thinking the same thing,\" or \"wow, great answer,\" or are comments of this nature discouraged?</p>\n","OwnerUserId":"181868","LastEditorUserId":"37797","LastEditDate":"2016-05-05T07:34:53.353","LastActivityDate":"2016-05-05T07:34:53.353","Title":"Clarification on appropriate comments","Tags":"<discussion><comments>","AnswerCount":"1","CommentCount":"0"},{"Id":"2784","PostTypeId":"2","ParentId":"2783","CreationDate":"2016-05-05T07:34:06.020","Score":"10","Body":"<p>Comments are designed to be used to ask for clarification or to suggest changes to be made to an answer, or provide transient meta-information.</p>\n\n<p>Transient is key here; comments are ephemeral as comments asking for clarification usually means the answer should be edited to better explain something, and comments suggesting changes are either integrated into the answer or removed if incorrect.</p>\n\n<p>You should never comment with \"good answer\" or equivalent (without qualification) — that's what upvotes are for and they are likely to be removed.</p>\n\n<p>For more information about comments, see <a href=\"https://meta.stackexchange.com/questions/19756/how-do-comments-work\">How do comments work?</a>.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2016-05-05T07:34:06.020","CommentCount":"0"},{"Id":"2785","PostTypeId":"1","AcceptedAnswerId":"2786","CreationDate":"2016-05-09T14:45:13.443","Score":"3","ViewCount":"14","Body":"<p>It was a case of the tap-too-quick, and I selected the wrong flag for a particular question. How should I handle this matter?</p>\n","OwnerUserId":"162909","LastActivityDate":"2016-05-09T15:07:26.113","Title":"What should we do if we misflag a post?","Tags":"<support><flagging>","AnswerCount":"1","CommentCount":"0"},{"Id":"2786","PostTypeId":"2","ParentId":"2785","CreationDate":"2016-05-09T15:07:26.113","Score":"3","Body":"<p>I didn't see any flags by you which seemed odd/wrong, so it probably got handled already. Also, there isn't a big difference between the flag types as far as moderator notification is concerned: we get notified, look at flag <em>and</em> post and try to resolve whatever problem the post may have (at least that's the idea, we all make mistakes now and then).</p>\n\n<p>The answer in <a href=\"https://apple.meta.stackexchange.com/questions/2369/what-to-do-if-i-mark-the-wrong-flag?rq=1\">What to do if I mark the wrong flag?</a> still applies though: If in doubt, post to Meta (as you did).</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-05-09T15:07:26.113","CommentCount":"0"},{"Id":"2787","PostTypeId":"1","CreationDate":"2016-05-09T20:09:36.217","Score":"9","ViewCount":"74","Body":"<p>The current CSS design for Ask Different puts Arial first.</p>\n\n<p>I think we should change this CSS to put San Francisco first, without having to license anything or anything like that. Here is my CSS code:</p>\n\n<pre><code>body { font-family: -apple-system, Helvetica Neue, Arial; }\n</code></pre>\n\n<p>The only problem with this is that <code>-apple-system</code> is only supported on Apple devices and Safari. However, it can default back to Helvetica Neue.</p>\n\n<p><a href=\"https://github.com/Usernamer/AskDifferent-SanFrancisco/blob/master/script.user.js\" rel=\"nofollow\"><em>I also created a TamperMonkey script with this same behavior</em></a></p>\n","OwnerUserId":"154794","LastEditorUserId":"37797","LastEditDate":"2016-05-10T07:09:27.080","LastActivityDate":"2016-05-10T07:09:27.080","Title":"Use San Francisco, Helvetica Neue fonts over Arial","Tags":"<feature-request><design>","AnswerCount":"0","CommentCount":"1"},{"Id":"2788","PostTypeId":"1","AcceptedAnswerId":"2789","CreationDate":"2016-05-09T21:36:35.550","Score":"3","ViewCount":"41","Body":"<p>Is there a point when a question gets too old to answer it? Before today, there was no easy way to tell if your iOS device is currently jailbroken, but an iOS security analyst has developed an application you can install that will run all the technical checks it needs to determine if you are jailbroken. There is a very old question about telling if your device is jailbroken here: <a href=\"https://apple.stackexchange.com/questions/70809/how-can-i-find-out-if-my-iphone-is-jailbroken\">How can I tell if my iOS device is currently jailbroken?</a></p>\n\n<p>That question has been answered already and has an accepted answer basically saying that you just check to see if Skype works or not (a very old method to check for jailbreaks that hasn't worked for years).</p>\n\n<p>Should I answer this existing question or ask my own? Are there any general guidelines on this sort of thing?</p>\n","OwnerUserId":"18387","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-05-11T02:38:16.913","Title":"Should I answer an existing old question or ask/answer my own new question?","Tags":"<discussion><answers><asking-questions>","AnswerCount":"1","CommentCount":"1"},{"Id":"2789","PostTypeId":"2","ParentId":"2788","CreationDate":"2016-05-09T22:29:48.033","Score":"2","Body":"<p>The <a href=\"https://meta.stackexchange.com/questions/202900/answering-a-duplicate-question-with-a-more-current-answer?\">best answer I could find comes from Meta.SE</a>. It basically says that I should post my answer to the older question since it's been around longer and has attention already.</p>\n","OwnerUserId":"18387","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2016-05-09T22:29:48.033","CommentCount":"2"},{"Id":"2790","PostTypeId":"2","ParentId":"2751","CreationDate":"2016-05-11T17:15:07.437","Score":"1","Body":"<p>I think this is a big enough topic and different enough to include things that may be considered off-topic in AskDifferent, that it warrants it's own StackExchange.</p>\n\n<p>And so, I present my proposal  <a href=\"http://area51.stackexchange.com/proposals/98549/hackintosh\">Hackintosh Exchange</a> (name pending)</p>\n\n<p>Please come, vote, and contribute to the discussion.</p>\n","OwnerUserId":"58743","LastActivityDate":"2016-05-11T17:15:07.437","CommentCount":"0"},{"Id":"2791","PostTypeId":"2","ParentId":"2","CreationDate":"2016-05-11T18:32:28.207","Score":"3","Body":"<p>If anyone is interested, I've proposed a Hackintosh SE site.</p>\n\n<p> <a href=\"http://area51.stackexchange.com/proposals/98549/hackintosh\">Hackintosh Exchange</a> (name pending)</p>\n\n<p>Please come, vote, and contribute to the discussion</p>\n","OwnerUserId":"58743","LastActivityDate":"2016-05-11T18:32:28.207","CommentCount":"0"},{"Id":"2792","PostTypeId":"1","AcceptedAnswerId":"2793","CreationDate":"2016-05-19T13:20:16.360","Score":"0","ViewCount":"19","Body":"<p>I not able to post an answer to <a href=\"https://apple.stackexchange.com/questions/123570/create-a-bootable-windows-usb-from-a-os-x-to-work-on-a-pc\">Create a Bootable Windows USB from a OS X to work on a PC</a>? It states \"posting an answer now requires 10 reputation,\" but I have a reputation of 101.</p>\n","OwnerUserId":"45485","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2016-05-19T14:05:57.607","Title":"Why can't I answer a question that requires a reputation level less than mine?","Tags":"<support><bug>","AnswerCount":"1","CommentCount":"1"},{"Id":"2793","PostTypeId":"2","ParentId":"2792","CreationDate":"2016-05-19T14:05:57.607","Score":"3","Body":"<p>The rep you earned linking your SE account doesn't count, unfortunately. You need to earn 10 rep points <em>on Ask Different organically</em> to be able to answer that question. You can get those points through voting, answering non-protected questions, asking questions, editing posts, etc.</p>\n","OwnerUserId":"292","LastActivityDate":"2016-05-19T14:05:57.607","CommentCount":"2"},{"Id":"2794","PostTypeId":"1","CreationDate":"2016-05-20T20:41:28.057","Score":"0","ViewCount":"55","Body":"<p>Sometimes when I make edits to a question or an answer, it is rejected for being \"superfluous.\" Why is that?</p>\n","OwnerUserId":"183458","LastActivityDate":"2016-05-21T16:26:01.543","Title":"Why are my edits rejected for being superfluous?","Tags":"<support><editing>","AnswerCount":"1","CommentCount":"3"},{"Id":"2795","PostTypeId":"2","ParentId":"2794","CreationDate":"2016-05-21T12:00:04.037","Score":"2","Body":"<p>The reason for rejection is pretty clear. Don't just focus on the word ‘superfluous’.</p>\n\n<blockquote>\n  <p>This edit does not make the post even a little bit easier to read, easier to find, more accurate or more accessible. Changes are either completely superfluous or actively harm readability.</p>\n</blockquote>\n\n<p>Edits, especially suggested edits, should <strong>significantly</strong> improve a post's readability or equivalent, and definitely shouldn't be making a post worse.</p>\n\n<p>I've just had a look at every one of your suggested edits, and there's only a couple there that I'd approve. Almost every single one either doesn't help the post in any way or makes the post worse.</p>\n\n<p>Here's a few randomly selected examples from your recent suggestions that illustrate my point:</p>\n\n<ul>\n<li><p><a href=\"https://apple.stackexchange.com/review/suggested-edits/161967\">https://apple.stackexchange.com/review/suggested-edits/161967</a></p>\n\n<p>You've literally added 6 characters and changed 1 character. That's only just over the required amount to submit the edit. Besides, it hasn't helped anyone — it's not in a title or a critical component of a question or answer which would help search users.</p></li>\n<li><p><a href=\"https://apple.stackexchange.com/review/suggested-edits/161966\">https://apple.stackexchange.com/review/suggested-edits/161966</a></p>\n\n<p><strike>I am extremely close to reverting this edit.</strike> I've reverted this edit. If I could superping, I'd be bringing this up with the users who approved the edit.</p>\n\n<ul>\n<li>The first sentence is no improvement, just a change in style.</li>\n<li>The edit to the code is poor (‘killall’ is <strong>not equivalent</strong> to ‘osascript quit’ and I don't understand why you changed it) and you should not be making changes to code in this way without support in comments or elsewhere.</li>\n<li>You added nothing to the third sentence but expanding what was already there, just in more words, which don't improve comprehension and actually make it more confusing as to what's being referred to.</li>\n</ul></li>\n<li><p><a href=\"https://apple.stackexchange.com/review/suggested-edits/161268\">https://apple.stackexchange.com/review/suggested-edits/161268</a></p>\n\n<p>All you've done is add line breaks. Don't do this — it's <em>worse</em> to read.</p></li>\n<li><p><a href=\"https://apple.stackexchange.com/review/suggested-edits/161489\">https://apple.stackexchange.com/review/suggested-edits/161489</a></p>\n\n<p>You should not be leaving valedictions on posts, let alone making them bold.</p></li>\n<li><p><a href=\"https://apple.stackexchange.com/review/suggested-edits/161495\">https://apple.stackexchange.com/review/suggested-edits/161495</a></p>\n\n<p>What exactly is being improved here? All you've done is change some words to some synonyms, replace ‘the’ with ‘Spotlight’, and incorrectly change one of the questions to something completely different which wasn't what the OP was asking.</p></li>\n</ul>\n\n<p>I think I've made my point, but if there's any other edits you want discussing specifically, link them. I'm sorry to say I would have edit-banned you a long time ago and brought this up then, but the past month or so I haven't been keeping up with others’ reviews as much as I'd have liked. I strongly suggest reading the <a href=\"https://apple.stackexchange.com/help/editing\">editing guide</a> if you haven't already.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2016-05-21T16:26:01.543","CommentCount":"3"},{"Id":"2796","PostTypeId":"1","CreationDate":"2016-05-23T00:17:24.903","Score":"0","ViewCount":"41","Body":"<p>Some questions on Ask Different have a tag like <a href=\"https://apple.stackexchange.com/questions/tagged/iphone\" class=\"post-tag\" title=\"show questions tagged &#39;iphone&#39;\" rel=\"tag\">iphone</a>, when they are talking about the software used on it, <a href=\"https://apple.stackexchange.com/questions/tagged/ios\" class=\"post-tag\" title=\"show questions tagged &#39;ios&#39;\" rel=\"tag\">ios</a>.</p>\n\n<p>Should we comment to tell users about this, or just edit it?</p>\n\n<p>Here are some more examples of having both hardware and software tags:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/ipad\" class=\"post-tag\" title=\"show questions tagged &#39;ipad&#39;\" rel=\"tag\">ipad</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/ios\" class=\"post-tag\" title=\"show questions tagged &#39;ios&#39;\" rel=\"tag\">ios</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/ipod-touch\" class=\"post-tag\" title=\"show questions tagged &#39;ipod-touch&#39;\" rel=\"tag\">ipod-touch</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/ios\" class=\"post-tag\" title=\"show questions tagged &#39;ios&#39;\" rel=\"tag\">ios</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/apple-watch\" class=\"post-tag\" title=\"show questions tagged &#39;apple-watch&#39;\" rel=\"tag\">apple-watch</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/watchos\" class=\"post-tag\" title=\"show questions tagged &#39;watchos&#39;\" rel=\"tag\">watchos</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/appletv\" class=\"post-tag\" title=\"show questions tagged &#39;appletv&#39;\" rel=\"tag\">appletv</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/tvos\" class=\"post-tag\" title=\"show questions tagged &#39;tvos&#39;\" rel=\"tag\">tvos</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/tagged/macbook\" class=\"post-tag\" title=\"show questions tagged &#39;macbook&#39;\" rel=\"tag\">macbook</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/os-x\" class=\"post-tag\" title=\"show questions tagged &#39;os-x&#39;\" rel=\"tag\">os-x</a></li>\n</ul>\n","OwnerUserId":"154794","LastActivityDate":"2016-06-22T06:31:33.043","Title":"Software tag vs. hardware tag","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2797","PostTypeId":"1","AcceptedAnswerId":"2800","CreationDate":"2016-05-23T00:24:39.517","Score":"2","ViewCount":"27","Body":"<p>Should a product name using \"Apple\" (ex. Apple Watch, Apple Music, Apple TV) have a dash between the word \"Apple\" and the other word?</p>\n\n<p>I have noticed a difference between the tags <a href=\"https://apple.stackexchange.com/questions/tagged/apple-watch\" class=\"post-tag\" title=\"show questions tagged &#39;apple-watch&#39;\" rel=\"tag\">apple-watch</a> and <a href=\"https://apple.stackexchange.com/questions/tagged/appletv\" class=\"post-tag\" title=\"show questions tagged &#39;appletv&#39;\" rel=\"tag\">appletv</a>.</p>\n\n<p>Should we rename <a href=\"https://apple.stackexchange.com/questions/tagged/apple-watch\" class=\"post-tag\" title=\"show questions tagged &#39;apple-watch&#39;\" rel=\"tag\">apple-watch</a> to <a href=\"https://apple.stackexchange.com/questions/tagged/applewatch\" class=\"post-tag\" title=\"show questions tagged &#39;applewatch&#39;\" rel=\"tag\">applewatch</a> to fit <a href=\"https://apple.stackexchange.com/questions/tagged/appletv\" class=\"post-tag\" title=\"show questions tagged &#39;appletv&#39;\" rel=\"tag\">appletv</a> or should we rename <a href=\"https://apple.stackexchange.com/questions/tagged/appletv\" class=\"post-tag\" title=\"show questions tagged &#39;appletv&#39;\" rel=\"tag\">appletv</a> to <a href=\"https://apple.stackexchange.com/questions/tagged/apple-tv\" class=\"post-tag\" title=\"show questions tagged &#39;apple-tv&#39;\" rel=\"tag\">apple-tv</a> to fit <a href=\"https://apple.stackexchange.com/questions/tagged/apple-watch\" class=\"post-tag\" title=\"show questions tagged &#39;apple-watch&#39;\" rel=\"tag\">apple-watch</a>?</p>\n","OwnerUserId":"154794","LastActivityDate":"2016-06-05T12:39:55.457","Title":"Should products with \"Apple\" in their name have a dash?","Tags":"<discussion><tags>","AnswerCount":"1","CommentCount":"0"},{"Id":"2798","PostTypeId":"1","CreationDate":"2016-05-23T00:29:12.767","Score":"1","ViewCount":"26","Body":"<p>As said in the title, there is a major difference between the logos in the two links:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/\">Ask Different</a></li>\n<li><a href=\"http://apple.blogoverflow.com\" rel=\"nofollow noreferrer\">Ask Different blog</a></li>\n</ul>\n\n<p>Can we update the Ask Different blog's logo to match the Ask Different logo?</p>\n","OwnerUserId":"154794","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2016-05-23T00:29:12.767","Title":"The logo for Ask Different is different from the Ask Different blog","Tags":"<bug><blog>","AnswerCount":"0","CommentCount":"1"},{"Id":"2799","PostTypeId":"2","ParentId":"2796","CreationDate":"2016-05-23T06:05:46.750","Score":"1","Body":"<p>The main issues here are that</p>\n\n<ul>\n<li>the tag descriptions don't give enough guidance (if any at all) on how a tag should be used</li>\n<li>most users don't really make a difference between the device (hardware) and the OS (software) (\"I have a problem with my iPhone, not with iOS\")</li>\n</ul>\n\n<p>Unless you want to update all the relevant tag descriptions, update hundreds of questions and <em>keep monitoring the site to ensure that new users use the proper tag</em> I don't see how this is going to change. To be honest, I also don't see why this would be necessary as the current use of the tags more or less reflects what people are talking about if they have problems with their devices.</p>\n\n<p>Also, from the tag description of <a href=\"https://apple.stackexchange.com/questions/tagged/iphone\" class=\"post-tag\" title=\"show questions tagged &#39;iphone&#39;\" rel=\"tag\">iphone</a>:</p>\n\n<blockquote>\n  <p>iPhone is Apple's smartphone line. This tag can include questions about hardware, software and accessories.</p>\n</blockquote>\n\n<p>so at least in this case, using <a href=\"https://apple.stackexchange.com/questions/tagged/iphone\" class=\"post-tag\" title=\"show questions tagged &#39;iphone&#39;\" rel=\"tag\">iphone</a> for software problems is ok. </p>\n","OwnerUserId":"9058","LastActivityDate":"2016-05-23T06:05:46.750","CommentCount":"1"},{"Id":"2800","PostTypeId":"2","ParentId":"2797","CreationDate":"2016-06-05T12:39:55.457","Score":"0","Body":"<p>Throughout the site, spaces in official product names are represented by ‘-’ in tag names, therefore <a href=\"https://apple.stackexchange.com/questions/tagged/appletv\" class=\"post-tag\" title=\"show questions tagged &#39;appletv&#39;\" rel=\"tag\">appletv</a> should be <a href=\"https://apple.stackexchange.com/questions/tagged/apple-tv\" class=\"post-tag\" title=\"show questions tagged &#39;apple-tv&#39;\" rel=\"tag\">apple-tv</a>, leaving <a href=\"https://apple.stackexchange.com/questions/tagged/apple-watch\" class=\"post-tag\" title=\"show questions tagged &#39;apple-watch&#39;\" rel=\"tag\">apple-watch</a>/etc as they currently are.</p>\n","OwnerUserId":"37797","LastActivityDate":"2016-06-05T12:39:55.457","CommentCount":"0"},{"Id":"2801","PostTypeId":"1","CreationDate":"2016-06-07T10:18:03.753","Score":"1","ViewCount":"44","Body":"<p>I flagged an <a href=\"https://apple.stackexchange.com/revisions/241791/1\">original version</a> of a link-only answer as \"not an answer\" as I have done for hundreds of similar posts on other SE sites. My flag was declined. Then I explained my reasoning and asked about moderator's. This was their response:</p>\n\n<blockquote>\n  <p>In this case, no flag at all :-) It clearly is an answer, and salvageable by editing, so what would you expect a mod to do here which you can't do yourself?</p>\n</blockquote>\n\n<p><sup>The first part is debatable. It was discussed in numerous meta posts on other sites and the consensus seems to be on the side of \"do flag link-only answers as a non-answers\" with this nice <a href=\"https://meta.stackexchange.com/q/225370/305121\">infographic</a> as an example.</sup></p>\n\n<p>I am puzzled with the latter part of the response:</p>\n\n<p>So far I thought moderators' attention is required when flagging a post <em>for moderator's attention</em>, as <em>a spam</em>, or as <em>rude-or-offensive</em> (with the latter two flags causing deletion also by majority of votes).</p>\n\n<p>However I had an impression that flagging as <em>low quality</em> or flagging as a <em>non-answer</em> directed such posts to the Low Quality Posts review queue where >2000 rep. users could vote for deletion and publish an automatic comment explaining the rules. On all sites on which I have access to these queues, there is an explicit option \"this is a link-only answer and not spam\" which is not available when flagging.</p>\n\n<p>I thought that by flagging an answer as <em>non-answer</em> or <em>low-quality</em>, I am bringing it to the attention of the community (which gives opportunity to post predefined suggestions, give author time and put an answer subject to democratic voting) not moderators (at least not in the first place).</p>\n\n<p>Is it different on Ask Different?</p>\n\n<p>Why a moderator here suggests that by flagging this post I might have had any expectations of them (\"<em>what would you expect a mod to do here</em>\")?</p>\n","OwnerUserId":"145449","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2016-06-07T12:44:36.593","Title":"Should we flag different on Ask Different?","Tags":"<discussion><flagging>","AnswerCount":"1","CommentCount":"6"},{"Id":"2802","PostTypeId":"2","ParentId":"2801","CreationDate":"2016-06-07T12:44:36.593","Score":"1","Body":"<p>I can't speak for how other sites handle link only flags - but the post you mentioned doesn't seem to meet our standards for general flagging.</p>\n\n<p>If you read <a href=\"https://apple.stackexchange.com/help/flagging\">https://apple.stackexchange.com/help/flagging</a> it explains that the primary reason to flag is when you see something bad.</p>\n\n<p>I see no guidance on the site help here where link only answers are prohibited - just as we don't prohibit wrong answers. Those sort of things are designed to be handled through two processes:</p>\n\n<ol>\n<li>Reputation limits make people participate in ways that others will vote and comment when their initial efforts are outside the site norms or objectively not useful. </li>\n<li>Closure and voting and peer moderation handle almost all the cases of people figuring out how to contribute when they don't read the help center on how to make a good question or how to show research. Answers live and die by votes and good questions usually have a handful of thoughtful, useful answers to rise above the rest.</li>\n</ol>\n\n<p>Specifically on Ask Different, we've tried to explain how NAA flags are moderated in this thread:</p>\n\n<ul>\n<li><a href=\"https://apple.meta.stackexchange.com/questions/1629/why-was-my-flag-for-not-an-answer-declined\">Why was my flag for &quot;not an answer&quot; declined?</a>?</li>\n</ul>\n\n<p>Going over that, I would expect the moderator looked a the question (if needed) - it looks decent enough to me. The initial text of the answer is certainly not link only. It also appears to be helpful and relevant to the issue at hand. Best of all, it was a new user that got constructive feedback, took that to heart and there's a pretty decent answer now.</p>\n\n<p>Hopefully this makes sense to your question here. </p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-06-07T12:44:36.593","CommentCount":"2"},{"Id":"2803","PostTypeId":"1","CreationDate":"2016-06-07T14:52:39.277","Score":"1","ViewCount":"26","Body":"<p>On Ask Ubuntu, we were asked <a href=\"https://askubuntu.com/questions/783993/ubuntu-on-meizu-pro-5-is-sold-out\">Ubuntu on Meizu Pro 5 is sold out, will it be available again?</a></p>\n\n<p>This is a new product, and I'm interested how Ask Different handles this vein of questions - e.g. \"When will the next X be released\", \"How can I pre-order\" etc.</p>\n","OwnerUserId":"101825","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:22:53.033","LastActivityDate":"2016-06-07T19:44:35.313","Title":"How do you handle questions about release dates?","Tags":"<discussion><site-scope>","AnswerCount":"1","CommentCount":"0"},{"Id":"2804","PostTypeId":"2","ParentId":"2803","CreationDate":"2016-06-07T15:43:05.153","Score":"3","Body":"<p>Those kinds of questions get closed as primarily opinion based. None of us here officially know release dates before the day of release, and speculation is not something that's good on a Q&amp;A site.</p>\n\n<p>This is formally documented in the help guide:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/help/on-topic\">https://apple.stackexchange.com/help/on-topic</a></li>\n</ul>\n\n<blockquote>\n  <p>Please refrain from asking about the following topics as questions with these core subjects are generally closed or deleted:</p>\n  \n  <ul>\n  <li>Pre-release hardware or asking how/why Apple does  &lt; some thing XYZ ></li>\n  </ul>\n</blockquote>\n\n<p>The only grey area where some questions may be not closed is when Apple publicly pre-announces something as that usually can be conclusively answered with a link to the Apple Website with details.</p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-06-07T19:44:35.313","CommentCount":"0"},{"Id":"2805","PostTypeId":"1","AcceptedAnswerId":"2806","CreationDate":"2016-06-09T14:13:02.883","Score":"0","ViewCount":"28","Body":"<p>Before we get started, I do not care that I lost the reputation. I'm trying to figure out why the reputation was taken away.</p>\n\n<p>The answer that I downvoted did not answer the OP's question, hence the downvote. An answer should answer the question, which it simply did not do. So why exactly did I lose reputation for taking part in the community?</p>\n\n<p>Picture for reference:</p>\n\n<p><a href=\"https://i.stack.imgur.com/sKiTh.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/sKiTh.png\" alt=\"picture of losing reputation\"></a></p>\n\n<p>The answer I downvoted is <a href=\"https://apple.stackexchange.com/questions/218844/how-can-i-mount-microsoft-onedrive-as-a-network-drive-in-osx/237669#237669\">How can I mount Microsoft OneDrive as a network drive in OSX?</a></p>\n","OwnerUserId":"120988","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-06-12T15:05:24.927","Title":"Why did I lose one reputation for downvoting an answer?","Tags":"<support><voting>","AnswerCount":"1","CommentCount":"0"},{"Id":"2806","PostTypeId":"2","ParentId":"2805","CreationDate":"2016-06-09T14:23:25.590","Score":"5","Body":"<p>As documented in <a href=\"https://apple.stackexchange.com/help/whats-reputation\">https://apple.stackexchange.com/help/whats-reputation</a>:</p>\n\n<blockquote>\n  <p>You lose reputation when:</p>\n  \n  <ul>\n  <li>your question is voted down: −2</li>\n  <li>your answer is voted down: −2</li>\n  <li>you vote down an answer: −1</li>\n  <li>you place a bounty on a question: − full bounty amount</li>\n  <li>one of your posts receives 6 spam or offensive flags: −100</li>\n  </ul>\n</blockquote>\n\n<p>The reason downvotes impacts your reputuation is to prevent revenge or mass dowvotes against others. In addition it also emphasis the goal of AD (and SE sites in general) of getting <em>good</em> answers (which for instance means that instead of downvoting a bad answer it might be better both for you and for others to <em>up</em>vote good answers).</p>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-06-09T14:23:25.590","CommentCount":"3"},{"Id":"2807","PostTypeId":"1","AcceptedAnswerId":"2808","CreationDate":"2016-06-10T13:07:49.197","Score":"1","ViewCount":"25","Body":"<p>I asked a <a href=\"https://apple.stackexchange.com/q/242173/153510\">question</a> which has received two downvotes and one upvote.</p>\n\n<p>Initially a user left a comment explaining their downvote. I responded to his feedback in another comment, where I also linked to <a href=\"https://apple.meta.stackexchange.com/q/2/153510\">a meta question</a>. Both the user's comment and my own are now deleted. This seems to have been done by @patrix.</p>\n\n<p>I know that comments are fleeting on SE, but users are also <a href=\"https://meta.stackexchange.com/questions/135/encouraging-people-to-explain-downvotes\">encouraged to explain their downvotes</a>. So, shouldn't this explanation stay in the comments as long as the downvote is there? That way it can be easier for future visitors to see why it was downvoted. Also, it can give those who disagree a chance to comment as well. I know many comments can be deleted without issue, but shouldn't comments that explain downvotes be allowed to stay?</p>\n\n<p>Patrix also added some information elicited from the comments to OP, and that is helpful. If that was the only function of the comments, there would obviously be no problem with removing them. But in this case the comments also had another function, namely explaining the downvotes.</p>\n\n<p>Can anyone give me some input regarding this issue?</p>\n","OwnerUserId":"153510","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-06-10T13:28:34.200","Title":"Removal of comments explaining downvotes","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0"},{"Id":"2808","PostTypeId":"2","ParentId":"2807","CreationDate":"2016-06-10T13:28:34.200","Score":"5","Body":"<p>Downvotes don't need to be explained and most often aren't. </p>\n\n<p>The comments below your question addressed an unclarity in the question itself (namely whether the underlying OS is Windows or OS X). I've edited your clarification into the question and removed the comments because the issue discussed in the comments has been resolved. </p>\n","OwnerUserId":"9058","LastActivityDate":"2016-06-10T13:28:34.200","CommentCount":"3"},{"Id":"2809","PostTypeId":"1","AcceptedAnswerId":"2810","CreationDate":"2016-06-13T15:34:09.387","Score":"1","ViewCount":"68","Body":"<p>With the <a href=\"https://developer.apple.com/wwdc/schedule/#/\" rel=\"nofollow\">annual developer conference WWDC</a> starting today for 2016 - Apple is announcing new things. </p>\n\n<p>Where can we ask / talk / learn more about the live stream of WWDC 2016 on Ask Different?</p>\n","OwnerUserId":"5472","LastEditorUserId":"5472","LastEditDate":"2016-06-16T12:42:55.430","LastActivityDate":"2016-06-16T12:43:50.857","Title":"What things from WWDC can we ask about here?","Tags":"<discussion>","AnswerCount":"2","CommentCount":"2","FavoriteCount":"1"},{"Id":"2810","PostTypeId":"2","ParentId":"2809","CreationDate":"2016-06-13T17:15:57.133","Score":"2","Body":"<p>Anything that isn't covered by the NDA, that's public knowledge, can be asked about on Ask Different.</p>\n\n<p><a href=\"http://chat.stackexchange.com/rooms/38/ask-different-chat\">Ask Different Chat</a> is available for things that don't work as practical questions. Chat is also the best place to discuss the live stream since that part of community doesn't work well as practical Q/A on the main site.</p>\n","OwnerUserId":"292","LastEditorUserId":"5472","LastEditDate":"2016-06-16T12:43:50.857","LastActivityDate":"2016-06-16T12:43:50.857","CommentCount":"1"},{"Id":"2811","PostTypeId":"2","ParentId":"2809","CreationDate":"2016-06-14T12:31:25.787","Score":"0","Body":"<p>However is it worth answering anything here. In general we don't know at it is liable to change. </p>\n\n<p>It would be much easier to simply say we don't know and close it.</p>\n\n<p>e.g this <a href=\"https://apple.stackexchange.com/questions/242601/cannot-use-icloud-photo-library-wrong-disk-format\">question</a> and we get comments that are based on partial information</p>\n\n<p>It is just wasting time to read let alone answer.</p>\n\n<p>Also in a beta expect to have to reformat your disk. If you have to ask how to get data back you should not run a beta. So really any more questions on this is lack of research which is a reason to down vote</p>\n","OwnerUserId":"237","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.843","LastActivityDate":"2016-06-14T12:36:28.407","CommentCount":"0"},{"Id":"2812","PostTypeId":"1","AcceptedAnswerId":"2887","CreationDate":"2016-06-14T20:47:03.030","Score":"26","ViewCount":"359","Body":"<p>With the rename from OS X to macOS, should the tag be renamed too?</p>\n","OwnerUserId":"37797","LastActivityDate":"2016-10-20T12:19:35.547","Title":"Should the [osx] tag be renamed to [macos]?","Tags":"<discussion><tags>","AnswerCount":"3","CommentCount":"0","FavoriteCount":"3"},{"Id":"2814","PostTypeId":"2","ParentId":"2812","CreationDate":"2016-06-15T05:26:57.490","Score":"29","Body":"<p>Only the newer versions will be called <strong>macOS</strong>, the older ones will still be called <strong>OS X Cat-of-choice</strong>. I would propose to go with a synonom instead of a renaming.</p>\n\n<p>Today (June 2016), the synonym points <a href=\"https://apple.stackexchange.com/questions/tagged/macos\" class=\"post-tag\" title=\"show questions tagged &#39;macos&#39;\" rel=\"tag\">macos</a> -> <a href=\"https://apple.stackexchange.com/questions/tagged/osx\" class=\"post-tag\" title=\"show questions tagged &#39;osx&#39;\" rel=\"tag\">osx</a> so that we can decide at a later date to flip things around. If there is an answer that makes a strong argument for never merging the two, we might want to undo the synonym so that the <a href=\"https://apple.stackexchange.com/questions/tagged/macos\" class=\"post-tag\" title=\"show questions tagged &#39;macos&#39;\" rel=\"tag\">macos</a> questions are distinct.</p>\n","OwnerUserId":"9058","LastEditorUserId":"5472","LastEditDate":"2016-06-15T14:01:21.767","LastActivityDate":"2016-06-15T14:01:21.767","CommentCount":"11"},{"Id":"2817","PostTypeId":"1","AcceptedAnswerId":"2818","CreationDate":"2016-06-18T16:24:35.350","Score":"3","ViewCount":"50","Body":"<p>Not finding a solution, I posted <a href=\"https://apple.stackexchange.com/q/243092/19937\">this question</a> but now see it is covered by <a href=\"https://apple.stackexchange.com/q/179150/19937\">this one with an answer</a>.</p>\n\n<p>Should I just delete it, or is it better to close as a duplicate?</p>\n","OwnerUserId":"19937","OwnerDisplayName":"WilliamKF","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-06-18T16:41:49.653","Title":"Should I delete my question or keep it?","Tags":"<discussion><close-reasons><deleted-questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"2818","PostTypeId":"2","ParentId":"2817","CreationDate":"2016-06-18T16:41:49.653","Score":"1","Body":"<p>Thanks for bringing this up on meta so quickly. As already remarked by <a href=\"https://apple.stackexchange.com/users/85275/tetsujin\">@Tetsujin</a> in the comments:</p>\n\n<blockquote>\n  <p>We can keep it &amp; link it as a duplicate - which gives Google a greater chance of finding the answer in future. I'll vote to close as a dupe; it doesn't reflect on the quality of the question, merely links it to an existing one with a highly-voted answer.</p>\n</blockquote>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:26.537","LastActivityDate":"2016-06-18T16:41:49.653","CommentCount":"1"},{"Id":"2819","PostTypeId":"2","ParentId":"2812","CreationDate":"2016-06-18T18:26:04.447","Score":"2","Body":"<p>I think that <a href=\"https://apple.stackexchange.com/questions/tagged/osx\" class=\"post-tag\" title=\"show questions tagged &#39;osx&#39;\" rel=\"tag\">osx</a> is a decent tag for the most part. <a href=\"https://apple.stackexchange.com/questions/tagged/osx\" class=\"post-tag\" title=\"show questions tagged &#39;osx&#39;\" rel=\"tag\">osx</a> refers to the modern version(s) of Apple's Operating System, which is titled as OS X. Earlier versions, before the 'OS X' line started (named after the big cats), were simply named Mac OS &lt;insert version name and number here> - 'X' was added after Mac OS version 9. As such, I would think that the tag, <a href=\"https://apple.stackexchange.com/questions/tagged/macos\" class=\"post-tag\" title=\"show questions tagged &#39;macos&#39;\" rel=\"tag\">macos</a> would refer to legacy Apple Computer software, instead of newer software. Nonetheless, I would welcome the new tag! :)</p>\n","OwnerUserId":"160494","LastEditorUserId":"37797","LastEditDate":"2016-06-18T18:33:28.333","LastActivityDate":"2016-06-18T18:33:28.333","CommentCount":"5"},{"Id":"2820","PostTypeId":"1","AcceptedAnswerId":"2821","CreationDate":"2016-06-19T17:10:34.503","Score":"1","ViewCount":"23","Body":"<p>I mistakenly <a href=\"https://apple.meta.stackexchange.com/q/2817/19937\">posted a question on meta.superuser instead of here</a>, it was migrated here, but for some reason, it is not linked to my account and I cannot accept the answer.</p>\n\n<p>Can someone fix this please?</p>\n","OwnerUserId":"19937","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-06-19T17:49:32.160","Title":"Why is my migrated question not linking to my account?","Tags":"<support>","AnswerCount":"1","CommentCount":"0"},{"Id":"2821","PostTypeId":"2","ParentId":"2820","CreationDate":"2016-06-19T17:49:23.977","Score":"2","Body":"<p>Merging accounts is self service. Use the contact us link at the bottom of any page - link to the two (or more) accounts and indicate which is to be the master account. Linking to the question that's not linked can also help sometimes reinforce which accounts the stack exchange employees will merge.</p>\n","OwnerUserId":"5472","LastActivityDate":"2016-06-19T17:49:23.977","CommentCount":"0"},{"Id":"2822","PostTypeId":"1","CreationDate":"2016-07-07T20:24:28.850","Score":"0","ViewCount":"27","Body":"<p>I made a small goof.</p>\n\n<p>I asked two hardware questions about Keyboards and Mice.  The questions are very similar and, accidentally, I typed in the same title for both (referencing keyboards.)</p>\n\n<p>These questions managed to get put on hold and flagged as duplicates.  I've updated the questions and fixed my errors.  Could I have them re-opened?</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/245126/best-keyboard-for-a-windows-developer-who-uses-os-xparallels\">https://apple.stackexchange.com/questions/245126/best-keyboard-for-a-windows-developer-who-uses-os-xparallels</a></li>\n<li><a href=\"https://apple.stackexchange.com/questions/245127/best-mouse-for-a-windows-developer-who-uses-os-xparallels\">Best mouse for a Windows Developer who uses OS X+Parallels</a></li>\n</ul>\n","OwnerUserId":"11890","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-07-08T11:49:31.073","Title":"Could my question(s) be reopened?","Tags":"<support><questions><closed-questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"2823","PostTypeId":"2","ParentId":"2822","CreationDate":"2016-07-07T20:33:34.993","Score":"4","Body":"<p>These questions will, unfortunately, remain closed, for two reasons:</p>\n\n<ol>\n<li>Both are shopping questions and <a href=\"https://apple.stackexchange.com/help/on-topic\">shopping questions are off topic for Ask Different</a>. You're asking for a purchase recommendation in both questions. Shopping or buying recommendations. Questions that are mainly about price/time/supply constraints are considered \"shopping\" questions.</li>\n<li>Both are asking for \"best\" options. While you do give some criteria for filtering purchase options, \"best\" is ultimately <em>very</em> subjective in these cases and as such there's no, real, canonical answer that can be given and that's not what Stack Exchange is about when it comes to Q&amp;A.</li>\n</ol>\n\n<p>Ultimately these questions are better suited for a traditional discussion forum format. You can find something akin to this in <a href=\"http://chat.stackexchange.com/rooms/38/ask-different-chat\">our chat room</a> or take advantage of an existing forum like <a href=\"https://www.reddit.com/r/apple\" rel=\"nofollow noreferrer\">https://www.reddit.com/r/apple</a>.</p>\n","OwnerUserId":"292","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-07-07T20:33:34.993","CommentCount":"2"},{"Id":"2824","PostTypeId":"1","AcceptedAnswerId":"2825","CreationDate":"2016-07-11T11:08:27.733","Score":"1","ViewCount":"56","Body":"<p>I found <a href=\"https://apple.stackexchange.com/a/245575/9058\">an answer</a> like this</p>\n\n<blockquote>\n  <p>Apple has a support page for this: <a href=\"https://support.apple.com/en-us/HT201269\" rel=\"nofollow noreferrer\">https://support.apple.com/en-us/HT201269</a></p>\n</blockquote>\n\n<p>I think you should at least give a small description of the link?</p>\n","OwnerUserId":"191144","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-07-16T13:50:46.617","Title":"Is this type of answer okay?","Tags":"<discussion><answers>","AnswerCount":"1","CommentCount":"1","FavoriteCount":"0"},{"Id":"2825","PostTypeId":"2","ParentId":"2824","CreationDate":"2016-07-11T20:36:00.830","Score":"4","Body":"<p>This answer is referred to as a low quality answer. The answer (in its original revision) provides no additional detail than a link. If this link were removed, the answer would not be an answer to the question, therefore it is a very low quality answer.</p>\n\n<p>Also, there is value to showing the actual URL - so when you edit a post with a link or insufficient explanation - keeping the URL plain so that someone sees that it points to Apple instead of a scam site has benefit to everyone.</p>\n\n<p>It is preferable to edit the answer to include a summary of the contents of the link, such that if the destination of the link be removed, the answer still makes sense. You are always able to suggest edits at any reputation and this should be your primary resolution.</p>\n\n<p>If you are not able to fix the answer, you should flag as very low quality. This puts the answer in the <a href=\"https://apple.stackexchange.com/review/low-quality-posts\">low quality posts review queue</a>, available to <a href=\"https://apple.stackexchange.com/help/privileges/edit\">higher reputation users who can recommend deletion</a> or <a href=\"https://apple.stackexchange.com/help/privileges/trusted-user\">vote to delete</a>.</p>\n\n<p><a href=\"https://i.stack.imgur.com/b2b4y.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/b2b4y.png\" alt=\"\"></a></p>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-07-16T13:50:46.617","CommentCount":"4"},{"Id":"2826","PostTypeId":"1","CreationDate":"2016-07-12T17:26:14.933","Score":"3","ViewCount":"46","Body":"<p>I found out that the question <a href=\"https://apple.stackexchange.com/q/159833/20338\">Equivalent of Dragon NaturallySpeaking&#39;s HeardWord function in Dragon Dictate 4</a> got closed two months ago (since no comment was left, I didn't receive any notification).</p>\n\n<p>The question is clearly about Apple software, was upvoted 9 times, starred twice and had 300 views.</p>\n\n<p>The mentioned reason is vague:</p>\n\n<blockquote>\n  <p>\"Basic Customer Support or questions asking to recommend or find off-site resources (Mac/book/software/tutorial) are off-topic for Ask Different as they tend to attract opinionated answers and spam. Instead, edit to clearly describe your problem and the research done so far to solve it.\" – patrix</p>\n</blockquote>\n\n<p>The question is clearly not about basic customer support (see number of upvotes and number of answers), and it is not asking for a recommendation.</p>\n\n<p>So why was this question closed?</p>\n\n<hr>\n\n<p>Here was a copy of the question:</p>\n\n<blockquote>\n  <p>Title: Equivalent of Dragon NaturallySpeaking's HeardWord function in\n  Dragon Dictate 4</p>\n  \n  <p>In Dragon NaturallySpeaking's Advanced Scripting Command on Windows,\n  <a href=\"http://nuance.custhelp.com/app/answers/detail/a_id/6141/~/using-the-heardword-function-in-advanced-scripting-commands\" rel=\"nofollow noreferrer\">HeardWord</a>\n  is a function that enables Dragon NaturallySpeaking to behave as if\n  the specified word, word sequence, or voice command was received by\n  the recognizer. HeardWord can be used to create a command that\n  executes a series of other commands, or that has the same function as\n  an existing command but a different name.</p>\n  \n  <p>Here is an example to type a closing remark, in bold type, at the end\n  of a document.</p>\n\n<pre><code>HeardWord \"go\", \"to\", \"bottom\"\nHeardWord \"set\", \"font\", \"bold\"\nWait 1\nSendDragonKeys \"{Enter 2}\" + \"This document was dictated using Dragon NaturallySpeaking.\"\n</code></pre>\n  \n  <p>In <a href=\"http://www.nuance.com/for-individuals/by-product/dragon-for-mac/dragon-dictate/index.htm\" rel=\"nofollow noreferrer\">Dragon Dictate\n  4</a>,\n  is there any way to write a voice command that calls other voice\n  commands (e.g. a voice command that would call the built-in command\n  \"Cap\")?</p>\n</blockquote>\n\n<p><a href=\"https://i.stack.imgur.com/RiAgc.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/RiAgc.png\" alt=\"enter image description here\"></a></p>\n","OwnerUserId":"20338","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-07-13T13:17:41.063","Title":"Why was this question with 9 upvotes closed as \"\"Basic Customer Support or questions asking to recommendation\"?","Tags":"<discussion><closed-questions>","AnswerCount":"2","CommentCount":"0"},{"Id":"2827","PostTypeId":"2","ParentId":"2826","CreationDate":"2016-07-12T18:36:40.237","Score":"-3","Body":"<p>Given Dragon is multi-platform and the question is about the software I think the question would be better suited for SuperUser.com -- there doesn't appear to be anything Apple-specific about the question.</p>\n\n<p>I can migrate it if you'd like.</p>\n","OwnerUserId":"292","LastActivityDate":"2016-07-12T18:36:40.237","CommentCount":"1"},{"Id":"2828","PostTypeId":"2","ParentId":"2826","CreationDate":"2016-07-13T13:17:41.063","Score":"-1","Body":"<p>I put the question on hold because it basically covers a topic which can (and IMHO) should be addressed to Dragon's support team (or forum) first.</p>\n\n<p>From <a href=\"https://apple.meta.stackexchange.com/a/2509/9058\">this answer</a> to <a href=\"https://apple.meta.stackexchange.com/questions/2508/why-were-not-customer-support-for-company-x-or-product-y?rq=1\">Why we&#39;re not customer support for [company X or product Y]</a>:</p>\n\n<blockquote>\n  <p><strong>We're not here to act as customer support on any company's behalf.</strong></p>\n  \n  <p>That's not our mission. We're here to help you learn how to interpret vague or conflicting behaviors once you've <strong>exhausted the normal support channels</strong> and <strong><em>documented that effort in your question</em></strong>. Your post here will live here for years - useful posts will drown amongst thousands of \"help me please\" posts with no detail and no effort to troubleshoot documented in them.</p>\n</blockquote>\n","OwnerUserId":"9058","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.967","LastActivityDate":"2016-07-13T13:17:41.063","CommentCount":"4"},{"Id":"2829","PostTypeId":"1","CreationDate":"2016-07-14T10:53:21.633","Score":"3","ViewCount":"44","Body":"<p>I asked a question some time ago about dismissing multiple notifications on OS X. I still have the issue, but my question appears to have been deleted.</p>\n\n<p>It's not showing on my recently deleted questions list - I guess it was probably deleted some time ago as well.</p>\n\n<p>Does it still exist somewhere? Can anyone tell if/why it was deleted? I know I did get a couple of \"random\" downvotes at one point, so it may have been at -1 - would that, combined with low activity, have been sufficient for it to have been automatically deleted at some point?</p>\n\n<p>EDIT: Here's what I see when I follow <a href=\"https://apple.meta.stackexchange.com/a/2830/51900\">@bmike's</a> link</p>\n\n<p><a href=\"https://i.stack.imgur.com/TKgzd.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/TKgzd.png\" alt=\"enter image description here\"></a></p>\n\n<p>and if I follow the \"deleted recent questions\" I get</p>\n\n<p><a href=\"https://i.stack.imgur.com/z5sv7.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/z5sv7.png\" alt=\"enter image description here\"></a></p>\n","OwnerUserId":"51900","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-07-16T13:00:28.783","Title":"Was my question deleted?","Tags":"<support><deleted-questions>","AnswerCount":"1","CommentCount":"3"},{"Id":"2830","PostTypeId":"2","ParentId":"2829","CreationDate":"2016-07-14T11:16:25.770","Score":"2","Body":"<p>Your questions should all be listed at <a href=\"https://apple.stackexchange.com/users/51900/cupawntae?tab=questions&amp;sort=newest\">https://apple.stackexchange.com/users/51900/cupawntae?tab=questions&amp;sort=newest</a></p>\n\n<p>Only two are deleted. Is it one of those? </p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/questions/170642/target-display-imac-steals-thunderbolt-when-i-unplug-and-wont-give-it-back\">Target Display iMac steals Thunderbolt when I unplug and won't give it back</a>, deletion reason was <code>RemoveDeadQuestions</code></li>\n<li><a href=\"https://apple.stackexchange.com/questions/154436/is-it-possible-to-close-all-notification-alerts\">Is it possible to close all notification alerts?</a>, deletion reason was <code>RemoveAbandonedQuestions</code></li>\n</ul>\n\n<p>See <a href=\"https://apple.stackexchange.com/help/roomba\">The Community user deleted my question! What gives?</a> for the definition of the deletion reasons.</p>\n\n<hr>\n\n<p>Also, see <a href=\"https://meta.stackexchange.com/questions/2645/show-all-of-my-question-answers-to-me-even-if-they-are-deleted\">Show all of my question/answers to me even if they are deleted</a> and the related questions on the Linked column at the right of it for a lot of discussions, opinions and decisions on this topic. To keep it short: It is intentional. </p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-07-16T13:00:28.783","CommentCount":"14"},{"Id":"2831","PostTypeId":"1","AcceptedAnswerId":"2832","CreationDate":"2016-07-14T19:28:16.197","Score":"2","ViewCount":"32","Body":"<p>I answered a question, namely <a href=\"https://apple.stackexchange.com/a/33185/14601\">What are some useful ways to use Automator?</a>, but I have not received any reputation points for the 4 up-votes that it received. Am I misunderstanding some portion of the process or the rules?</p>\n","OwnerUserId":"14601","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-07-14T21:30:11.053","Title":"Why haven't I received reputation points for some of the upvotes that one of my answers received?","Tags":"<support><reputation><answers><voting>","AnswerCount":"1","CommentCount":"0"},{"Id":"2832","PostTypeId":"2","ParentId":"2831","CreationDate":"2016-07-14T21:29:12.063","Score":"3","Body":"<p>Your linked answer is a community wiki post. One of the effects of this is that  you receive no reputation for the post, positive or negative. This is indicated by the different style of author link at the bottom of the post.</p>\n\n<p>                                                             <img src=\"https://i.stack.imgur.com/db7wQ.png\" width=\"131\"></p>\n\n<p>Answers can be made community wiki specifically using the <a href=\"https://apple.stackexchange.com/help/privileges/community-wiki\">community wiki checkbox under the answer once you reach 10 reputation</a>, however in this case the answer was automatically converted to community wiki as the question is community wiki. There are extremely few community wiki questions on the site (0.12% of questions are community wiki at the moment).</p>\n\n<p>There is no bug, this is <a href=\"/questions/tagged/status-bydesign\" class=\"post-tag moderator-tag\" title=\"show questions tagged &#39;status-bydesign&#39;\" rel=\"tag\">status-bydesign</a>. For more information about community wiki, see:</p>\n\n<ul>\n<li><a href=\"https://meta.stackexchange.com/q/11740\">What are &quot;Community Wiki&quot; posts?</a></li>\n</ul>\n","OwnerUserId":"37797","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-07-14T21:29:12.063","CommentCount":"2"},{"Id":"2833","PostTypeId":"1","AcceptedAnswerId":"2834","CreationDate":"2016-07-23T21:23:08.227","Score":"2","ViewCount":"29","Body":"<p>I have a reputation of 11 at the moment, but I have found a couple a very useful questions and answers, things I would like to up vote. If I do so now, it does not show up, but I believe it is stored. Does the person who posted the question/answer received reputation once my reputation is high enough for an up vote to count? Or, do I need to remember where I placed these votes and revisit them once my reputation is high enough and vote again?</p>\n","OwnerUserId":"193271","LastActivityDate":"2016-07-23T21:43:40.893","Title":"Do my up votes count once I have enough reputation?","Tags":"<discussion><reputation><voting>","AnswerCount":"1","CommentCount":"0"},{"Id":"2834","PostTypeId":"2","ParentId":"2833","CreationDate":"2016-07-23T21:43:40.893","Score":"2","Body":"<p>Neither.</p>\n\n<p>Anonymous feedback (positive and negative) is in a different bin and affects things like placement on the home page, search results, etc.. but it doesn't grant direct reputation.</p>\n\n<p>You can look at this <a href=\"https://apple.stackexchange.com/help/whats-reputation\">help section</a> to see how reputation works in specific.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-07-23T21:43:40.893","CommentCount":"3"},{"Id":"2835","PostTypeId":"1","AcceptedAnswerId":"2836","CreationDate":"2016-07-24T12:09:22.753","Score":"8","ViewCount":"75","Body":"<p>On Ask Different, we occasionally get posts in a language other than English. Take the second answer on <a href=\"https://apple.stackexchange.com/questions/18490/iphoto-does-not-open-a-window-after-lion-upgrade/35911#35911\">this question</a> as an example.</p>\n\n<p>Part of it is in English, the other in Spanish. I don't see the value in having the Spanish there, as the question was asked in English, and this site is based in English.</p>\n\n<p>So what do we do with these posts, and with posts that are <em>entirely</em> in another language? Do we translate them? Delete them?</p>\n","OwnerUserId":"152792","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-07-24T12:28:22.177","Title":"How to deal with posts in different languages?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"0","FavoriteCount":"1"},{"Id":"2836","PostTypeId":"2","ParentId":"2835","CreationDate":"2016-07-24T12:28:22.177","Score":"8","Body":"<p>There are an increasing number of sites on Stack Exchange for other languages. Ask Different is an English site and as such all posts should be in English.</p>\n\n<ul>\n<li>When a post is solely in a different language, it should be translated to English. The post should then be dealt with as usual.</li>\n<li>When a translation to a different language is given such as that in the linked answer, the different language should be edited out.</li>\n</ul>\n","OwnerUserId":"37797","LastActivityDate":"2016-07-24T12:28:22.177","CommentCount":"0"},{"Id":"2837","PostTypeId":"1","AcceptedAnswerId":"2838","CreationDate":"2016-07-25T01:36:03.393","Score":"4","ViewCount":"45","Body":"<p>I can not yet leave comments nor can I edit an answer; however, I would like to add a sentence or two of detail to a correct answer. Is adding a second, slightly more detailed, yet functionally repetitive answer acceptable?</p>\n\n<p>If I should gain enough reputation to comment, it that the best way to add details to an answer?</p>\n","OwnerUserId":"193271","LastActivityDate":"2016-07-25T05:11:18.840","Title":"Is adding a more detailed, yet repetitive answer acceptable?","Tags":"<discussion><comments>","AnswerCount":"1","CommentCount":"0"},{"Id":"2838","PostTypeId":"2","ParentId":"2837","CreationDate":"2016-07-25T05:11:18.840","Score":"7","Body":"<p>In general it's better to improve existing answers than to add slightly different new ones. Everybody can edit answers, even anonymous users, so if you want to add some helpful details to an existing answer, please go ahead and do so. Your edit will then be put into a review queue accessible to higher-rep users and peer-reviewed.</p>\n","OwnerUserId":"9058","LastActivityDate":"2016-07-25T05:11:18.840","CommentCount":"0"},{"Id":"2839","PostTypeId":"1","AcceptedAnswerId":"2840","CreationDate":"2016-07-28T00:34:32.333","Score":"3","ViewCount":"64","Body":"<p>I have a question I would like to ask and in typing it out I realize that the same post could end with three, closely related, yet different questions.</p>\n\n<p>What is the consensus on multiple part questions? Should I make one ask with 3 question or 3 asks with one question each (and maybe link them)?</p>\n","OwnerUserId":"193271","LastActivityDate":"2016-07-28T10:56:29.997","Title":"Multiple Part Questions","Tags":"<discussion><asking-questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"2840","PostTypeId":"2","ParentId":"2839","CreationDate":"2016-07-28T01:22:21.697","Score":"4","Body":"<p>Three part questions almost always get closed - so that's the worst thing to do.</p>\n\n<p>Look at the first version of this post:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/q/247506/5472\">https://apple.stackexchange.com/q/247506/5472</a></li>\n</ul>\n\n<p>Three questions, boom, boom, boom. If there is specificity and research, none is shown. It shows an attempt to reason through an issue, but needs to be distilled and honed and work done to identify one thing that's answerable.</p>\n\n<p>Now - just splitting it up into three questions is still going to have them closed - but at least each closure will be specific and easier for the asker to remedy. (or for everyone to realize that it shouldn't have been asked like \"is this a common problem\" since it's not the type of practical question the site is designed to host.</p>\n\n<p>Unless you can be sure you have enough detail to get at each question alone, try to ask the first and most basic question and then wait to get an answer or answers. Then you can build / refine the next part of the issue. </p>\n\n<p>I've rarely seen three related questions work - but most of the time, asking three very close questions also results in closure / holds.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-07-28T10:56:29.997","CommentCount":"3"},{"Id":"2841","PostTypeId":"1","CreationDate":"2016-07-31T20:10:16.307","Score":"0","ViewCount":"34","Body":"<p>I'm wondering whether there is a place on AskDifferent to post helpful links for Apple-releated topics (e.g. I stumpled across <a href=\"https://hey-siri.io/\" rel=\"nofollow\">https://hey-siri.io/</a> recently which lists possibly everything Siri can do for you). Is there a way to post these without breaking the rules?</p>\n","OwnerUserId":"35244","LastEditorUserId":"9058","LastEditDate":"2016-08-01T09:48:48.500","LastActivityDate":"2016-08-05T21:18:51.730","Title":"Is there a place on AskDifferent to post helpful links for Apple-related topics?","Tags":"<discussion>","AnswerCount":"1","CommentCount":"1"},{"Id":"2843","PostTypeId":"2","ParentId":"2841","CreationDate":"2016-08-05T21:18:51.730","Score":"1","Body":"<p>Not really as this is out of scope for really any Stack Exchange site.</p>\n\n<p>SE basic aim is to have the information on this site as from experience we have seen many links change and the information is lost.</p>\n\n<p>In fact I think on many sites a reason to close a questions is if it asks for off site information which really is the only question your information could be provided as an answer to.</p>\n\n<p>Also on one of the review queues an option is to delete a question for being link only.</p>\n","OwnerUserId":"237","LastActivityDate":"2016-08-05T21:18:51.730","CommentCount":"0"},{"Id":"2844","PostTypeId":"1","AcceptedAnswerId":"2845","CreationDate":"2016-08-05T21:27:44.433","Score":"1","ViewCount":"23","Body":"<p>These accounts from this <a href=\"https://apple.stackexchange.com/q/156921/22781\">thread</a> looks like needs merging:</p>\n\n<ul>\n<li><a href=\"https://apple.stackexchange.com/users/101161/concernedmacuser\">ConcernedMacUser</a></li>\n<li><a href=\"https://apple.stackexchange.com/users/101201/happymacuser\">HappyMacUser</a></li>\n</ul>\n\n<p>Is it possible to merge unregistered accounts?</p>\n","OwnerUserId":"22781","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.673","LastActivityDate":"2016-08-06T00:13:02.437","Title":"HappyMacUser and ConcernedMacUser","Tags":"<support><users><user-accounts>","AnswerCount":"1","CommentCount":"0"},{"Id":"2845","PostTypeId":"2","ParentId":"2844","CreationDate":"2016-08-06T00:13:02.437","Score":"1","Body":"<p>Technically - anyone can request a merge - use the contact us link at the bottom of any page and link the details you have here.</p>\n\n<p>In specific, moderators can sometimes tell if accounts should be merged and can ask. Most of the time, moderators can't tell and have to rely on the user themselves to indicate a merge is needed.</p>\n\n<p>It's not at all wrong to have many accounts - only when multiple accounts collude to vote or otherwise evade controls or abuse the system is merging and / or corrective actions warranted. Simply having two accounts isn't reason enough to request a merge in most cases.</p>\n\n<p>In this case, it seems intentional and humorous and likely the same person. I'm not going to ask for a merge since the accounts are old and the OP / OP's aren't struggling to use the site.</p>\n","OwnerUserId":"5472","LastActivityDate":"2016-08-06T00:13:02.437","CommentCount":"0"},{"Id":"2846","PostTypeId":"1","CreationDate":"2016-08-09T00:38:46.957","Score":"1","ViewCount":"29","Body":"<p>The answer to my question may be along the lines of:</p>\n\n<blockquote>\n  <p>It really ends up being the preference of the asker as to where they want to receive an answer.</p>\n</blockquote>\n\n<p>Source: <a href=\"https://apple.meta.stackexchange.com/a/2589/184907\">Are JavaScript for Automation questions better suited to Stack Overflow?</a></p>\n\n<p>But given the fact that <em>AppleScript</em> is a scripting language created by Apple Inc. and built into OS X, does that tip the scale in favor of asking these questions on Ask Different?</p>\n","OwnerUserId":"184907","LastEditorUserId":"-1","LastEditDate":"2017-03-16T15:45:18.873","LastActivityDate":"2016-08-09T01:05:39.317","Title":"Is the preferred SE site for AppleScript questions Ask Different (as opposed to Stack Overflow)?","Tags":"<discussion><questions>","AnswerCount":"1","CommentCount":"0"},{"Id":"2847","PostTypeId":"2","ParentId":"2846","CreationDate":"2016-08-09T01:05:39.317","Score":"2","Body":"<p>I wouldn't want to choose a best site or speak for a different set of moderators and pool of people that could answer AppleScript questions (a.k.a. Stack Overflow). Clearly, Apple designed the language to be accessible to people without an engineering degree or needing training in programming, but it's also clearly a powerful language with objective c bridges and can be used inside Xcode to make native apps. </p>\n\n<p>I can unequivocally state that AppleScript questions are most welcome here. </p>\n","OwnerUserId":"5472","LastActivityDate":"2016-08-09T01:05:39.317","CommentCount":"0"},{"Id":"2848","PostTypeId":"1","CreationDate":"2016-08-09T02:37:38.260","Score":"2","ViewCount":"27","Body":"<p>How can I limit the responses to only the questions that I have asked.  I find everyones answers on different questions interesting but I cant go 20 or more emails per day to find what I'm interested in</p>\n","OwnerUserId":"192780","OwnerDisplayName":"Ntrack","LastActivityDate":"2016-08-09T09:29:53.120","Title":"How can I limit the responses to only the questions that I have asked?","Tags":"<discussion>","AnswerCount":"0","CommentCount":"2"},{"Id":"2849","PostTypeId":"1","AcceptedAnswerId":"2850","CreationDate":"2016-08-19T23:47:27.397","Score":"19","ViewCount":"331","Body":"<p>I flagged <a href=\"https://apple.stackexchange.com/questions/221565/siri-can-not-activate-some-alarms-on-iphone-6s-plus-with-ios-9-2/249610#249610\">this answer</a> (now deleted, <a href=\"https://metasmoke.erwaysoftware.com/post/37412\" rel=\"nofollow noreferrer\">metasmoke link for &lt;10kers</a>) as \"rude or abusive\". It was declined with a comment:</p>\n\n<blockquote>\n  <p>Please use other. Abusive is to track intentional malice towards people and not simple vandalism,</p>\n</blockquote>\n\n<p>But <a href=\"https://meta.stackexchange.com/questions/58032/what-are-the-spam-and-rude-or-abusive-offensive-flags-and-how-do-they-wor/58035#58035\">FAQ answer on What are the “spam” and “rude or abusive” (offensive) flags, and how do they work?</a> says that posts that contains only gibberish should be flagged as \"rude or abusive\".</p>\n","OwnerUserId":"184917","LastEditorUserId":"-1","LastEditDate":"2017-04-13T12:45:27.043","LastActivityDate":"2016-08-20T01:40:19.977","Title":"Why was my \"rude or abusive\" flag on a gibberish answer declined?","Tags":"<discussion><support><flagging>","AnswerCount":"1","CommentCount":"2","FavoriteCount":"1"},{"Id":"2850","PostTypeId":"2","ParentId":"2849","CreationDate":"2016-08-20T00:40:59.730","Score":"23","Body":"<p>I have had a look at your links and you clearly flagged that post correctly. I handled the flag incorrectly - for that I apologize.</p>\n\n<p>Worse, I had dismissed some other similar flags to yours - I'm not sure when/how I got the idea that rude and abusive needed a personal aspect, but it's pretty clear that <a href=\"https://meta.stackexchange.com/questions/58032/what-are-the-spam-and-rude-or-abusive-offensive-flags-and-how-do-they-wor/58035#58035\">gibberish should be flagged as abuse</a>.</p>\n\n<p>Thanks for pointing out my error so I don't keep making it.</p>\n","OwnerUserId":"5472","LastEditorUserId":"-1","LastEditDate":"2017-03-20T10:29:37.673","LastActivityDate":"2016-08-20T01:40:19.977","CommentCount":"0"}]